{
    "threshold": 0.8,
    "seed": [
        " i used to scare for darkness",
        "Last year a tree fell on my house while my family was at home. The tree broke through the ceiling just a few feet away from my daughter. The experience was terrifying.",
        "Two years ago, i was admitted in hospital. I was not well. I felt afraid whether i would be alive. But fortunately, i am live",
        "I am concerned about the financial situation of my employer.",
        "I thought my company was going to have a lay off. it was a tough few weeks.",
        "I was lost in a neighborhood I didn't know, when some guy came up to me and quietly asked if I needed a ride.",
        "I went to the optometrist, and my prescription got strong. She warned me about being at risk for losing my vision.",
        "I got pulled over and almost got a ticket.",
        "I once saw a snake in the woods and got very scared.",
        "There was once a mouse in my  kitchen. I almost died.",
        "I think my job will lay us off. ",
        "Our lights went out last week during a storm. Its was only for 15 minutes but I was so scared.",
        "when my daughter choked on a piece of food ",
        "When I was little, I was afraid of the dark.",
        "I am afraid of clowns.",
        "When I lost my job. ",
        "I am scared of how I will die.",
        "When I was driving home from my first job it was snowing. I accidentally hit a curb and spun into the other lane and almost into a ditch, I was very scared",
        "It's been so dry in my area lately , I'm afraid there might be some forest fires. I live near a mountain. ",
        "When I was a child I was chased by a pitbull and I was very afraid. Dogs had always scared me at that age",
        "Last night, I dreamt that I was riding around the road on a motorcycle, and at one point almost fell of making a quick sharp turn. ",
        "I am afraid of the upcoming economic crisis in the USA",
        "I was once was very nervous and scared when I thought my girlfriend was pregnant. Waiting to find out was what got me so scared. I found out that she wasn't and everything was okay. ",
        "I am old.  I am seperated from my wife.  I live far from my children.  For pragmatoic reasons I am the one that can file for divorce.  I do not want to die alone.",
        "I am very scared of the ocean.",
        "I was scared when I was on a vacation to Mexico, after hearing about the crime there.",
        "Our home was broken in to 2 months after we purchased it.",
        "Our youngest daughter fell down our back stairs and hit her head on the bottom step.  She started throwing up about an hour later and we went to the ER.  ",
        "I haven't heard from my friend in 3 days. His family doesn't know where he is.",
        "I had to investigate a noise coming from my  backyard at night.",
        "One time I was robbed at gun point.  ",
        "One time I drank way too much and was so wasted that I thought I was gonna die. I threw up and then felt much better.",
        "when i was going for an interview i was so afraid as i could not tell the end results",
        "One time me and my friends went to the movies and one of them ate some edibles (weed) and started to panic. I got really worried that something might be wrong but he was just too high and we just waited until he was more sober after we left the movie early.",
        "One time i got stuck in a storm and was scared i might get swept away",
        "I was alwals terrified about the unknown",
        "I was in a neighbors house when they weren't there (I had a key) which was not uncommon. I heard voices and felt like there was a ghost in the house, ",
        "One night, I was just done reading some really scary stories and my door suddenly opened on its own. Upon closer inspection it was my cat opening it since it wasn't completely closed.",
        "once upon a time i am go for the market at that time one man for very hungry because some food for provide the man .",
        "i get this situation in midnight",
        "I was terrified last njght",
        "Some movies can be terrifying",
        "The other day I was walking in the bushes alone and I was scared when I heard noise behind some bushes.",
        "I felt scared when I had to go to the doctor to have a lump checked out on my side. I thought it was going to be for the worse.",
        " I had a dear friend end up the hospital after getting into a bicycling accident. It was a scary time.",
        "When I was a child I was in a tornado.",
        "While working at a restaurant I was robbed",
        "I have been watch thing new stephen king series on hulu. It is frighteneing.",
        "I went to the circus once, and the clowns were there. I am terrified of clowns.",
        "I do not like the dark.",
        "I was deep in sleep last night and I heard this loud bang on the side of my house and woke right up wondering what was going on.",
        "I went to a haunted house.",
        "Earlier a guy cut me off on the road, he was driving a box truck and I saw my life flash before my eyes.",
        "I was home alone and someone was in the carport looking in a window",
        "I saw a shark in the water last week.",
        "I was driving through flood waters and my car stalled out.",
        "I am afraid of who will move in next door to me.",
        "scared that my daughter will grow up and be bad ",
        "I saw a spider and i got scared.",
        "One time when i was younger i saw a spooky face in my room. i never knew what it was after that night i am still kind of scared even today.",
        "I was passenger in a bad car crash and the car rolled! I thought I was going to die!",
        "There's been noise at my door every night at the same time. I check and there isn't anything.",
        "My friend hasnt been feeling well lately.",
        "Yesterday, I was crossing the street and the person in front of me was hit by car which didn't stop at the red light",
        "I live in a bad neighborhood and sometimes walking is dangerous- The other night when I was walking someone was following me",
        "I was afraid the other night when gunshots went off",
        "There was some weird bumping noises in my house last night.",
        "I finally saw the movie with that scary Japanese girl with white skin. I now believe I can't sleep without the lights on lol.",
        "I was really scared once when I thought I would be homeless",
        "I used to be afraid of the dark. I had a nightlight until i was 13",
        "I was afraid when my dad used to scare me and  my brothers",
        "Wasn't able to register for one of the classes I need to be on track to graduate in my last year of college. Have to contact the school and see if they'll be able to make an exception and squeeze me into a full class, or I don't know what I'll do.",
        "afraid that my daughter will be bullied ",
        "My friend's eyes keep hurting at night. She's been to the doctor, but they can't find anything wrong with her.",
        "I keep hearing things in my kitchen. I think the mouse is back.",
        "of getting older. getting sick! ",
        "I would like to try skydiving.",
        "I am so scared.  I just heard a really crazy sounding animal coming from my lake out back of my house.",
        "I was wondering around a abandon building once. I started to hear banging and crawling in the walls. I couldn't move a inch.",
        "My son came home on his birthday really drunk. I thought he was going to go to jail. He kept trying to walk down the street and fight my other kids. We had to call the police to calm him down. He went to sleep after that.",
        "I had to get my foot checked out at the doctor, always makes me scared going there.",
        "I am so scared.  I think I just heard a ghost in the other room.",
        "Just finished watching a murder mystery series. I'm afraid of walking outside in the dark now.",
        "I haven't watched a horror in so long, but my friend wants to watch one.",
        "My husband is out of town and my friends talked me into going to a scary movie with them. I have not been able to sleep since then. I cannot wait until my husband gets back.",
        "My brother is in the hospital and is very sick. I am very scared",
        "I think my husband is cheating. I'm afraid to find out though.",
        "When I was a child I was in a destructive tornado. ",
        "I was afraid when my kids were out of town without me",
        "I do not like being around bats.",
        "I really do no like worms.",
        "I was really scared when I walked to my car after the movie",
        "I don't think I'm going to do so well this semester.",
        "I think a mouse is in my kitchen again.",
        "I just saw this horror movie.  It was so scary.",
        "I heard a knock on my door at 2 am in the morning ",
        "When a tornado warning came on the screen, I was scared. I thought it was coming for us",
        "I used to be scared of sparring in the ring because guys 3 times my size would usually kick the crap out of me.",
        "of dying ",
        "i'm scared of people who speed",
        "I had to live in a haunted house for a month",
        "Though I'm confident in my mental and physical resources I fear the worst for most people in my generation sometimes...especially in a hypothetical World War 3 scenario, or some type of global calamity occurring...every soft little punk wussy Millenial would just go to pieces",
        "I used to be terrified of approaching attractive women, let alone get their numbers...but I found out the easiest way to overcome that irrational fear is to level with them like a friend, instead of a prize to be won / objectified.",
        "when my job fired me during maternity leave",
        "I took a flight last week and there was awful turbulence. It was super scary!",
        "I have a meeting at work tomorrow that I'm suppose to give a speech at and I'm a bit nervous.",
        "I ma very anxious about the country these days.",
        "when i was going for an interview i had a crazy feeling",
        "I had to go to the doctor recently to get my foot looked at, always makes me scared going there.",
        "I invested in cryptocurrency last year but the market is looking pretty bad.",
        "My fiance found a snake in our yard the other day! It was terrifying!",
        "I overdrafted my bank account.",
        "My friends took me to a club for the first time a few nights ago. I've never been, obviously, so it made me nervous and scared",
        "I am so scary that my manager doesn't keep his promise for my promotion.",
        "I think my new neighbor is creepy. I want to move.",
        "when someone was pounding on my door hard",
        "I felt afraid when I was in a car accident. I was rear ended and my car was totaled.",
        "There is a wasp nest in my hallway outside of my apartment. I have to use the back door now.",
        "I heard a buzzing in my apartment this morning. I swear to god, it was the biggest wasp I had ever seen in my life. I was so frightened!",
        "I was pretty shaken up when my son didn't get home on time and I couldn't reach him",
        "my friend was speeding down the road because he wanted to show off the new car he had just bought",
        "Driving always scares me. I've seen some pretty bad car accidents with fatal injuries on the internet and it always crosses my mind while driving.",
        "I have to have suregery soon. I am scared",
        "I am starting a new job next week. I am so nervous.",
        "I used to be afraid of the dark but now I am not so much, I had a nightlight for a long time",
        " I used to be afraid of the dark but now I am not so much, I had a nightlight for a long time",
        "I was watching going down youtube rabbit-hole last week when I stumbled on this dark web stuff. There was a video about how you could contact hitmen. Eventually it lead to the guy who made the video meeting a supposed real hitman and it was a weird experience. The guy was very sketchy to say the least. I wouldn't be surprised if it was fake, but the possibility of people out there like kept me up that night.",
        "  I used to be afraid of the dark but now I am not so much, I had a nightlight for a long time",
        "My friend's dog started vomiting a lot. He's at the vet right now.",
        "I think I'm getting new neighbors. I'm scared they will be jerk like the last ones",
        "I am afraid today that my neighbor is starving his dogs. I don't know how to go about it!",
        "I am scared of the police.",
        "I watched a horror movie last night.  I was so scared, I nearly cried.",
        "I try to always stay inside when it's dark out.",
        "I used to get terrible nightmares, it made me have trouble sleeping.",
        "My friends and I watched a horror movie and I kept trying to hide my face away from the screen because it was too scary!",
        "My girlfriend showed me the scariest YouTube video last night and it freaked me out.",
        "Afraid of my dog dying",
        "I am worried I won't have money for rent. I am scrambling to try.",
        "One time I saw a ghost in my living room.  I was absolutely terrified. ",
        "A robber held me at gun point ",
        "I went to the movies recently and saw the most scary movie ever. I couldn't sleep!",
        "My car broke down yesterday and they say it might be the transmission. If so, I'd need a new car and that's hard to do right now",
        "My friend was getting married a few weeks ago but I was forced to work rather than attend his wedding. I'm really worried about if he'll still be my friend after that.",
        "I am scared that I might not have enough money for food next month",
        "Our dog started barking a lot in the middle of the night. I was looking out the windows trying to see if someone was out there. It was too dark to see anything.",
        "Just watched season 2 of Luther last night on Netflix.  Keeps you on the edge of your seat.",
        "I've been hearing some strange sounds around the house at night lately.",
        "Something is under my bed!",
        "when i heard someone fighting out of my apartment at night ",
        "I am a bit afraid to call AC on my neighbor as I don't want him to retaliate. But I have too for the dogs sake.",
        "My friends want me to scuba diving with them. I really don't want to because I worry about sharks and other creatures. ",
        "I had real fear when a tornado was close to my home. I thought we might die",
        "I was nervous when it was raining real bad last night. I hate storms",
        "I am going to my first haunted house this October!  I don't know why I feel so scarred!",
        "Alone while family was at a party when someone rammed a quad into the garage.",
        "My husband wants to go parasailing together when we go to Mexico next month.",
        "A giant wasp tried to attack me on my balcony. Another reason why I don't like to go on my balcony!",
        "My ex is coming over to talk. I'm scared that he wants to make up. I don't",
        "When my house burned down in the 8th grade",
        "A group of students at the university are extorting money from me. I am too afraid to go back to the university.",
        "I am going to try my grandmas recipe for dressing today. I am scaerd I won't do it justice.",
        "I think I'm going to get evicted.",
        "My car started to make loud noises coming out of engine. It happens while accelerating",
        "I have a secret.  I hate being in the dark.  It terrifies me",
        "I heard a banging on my window at 3AM last night. I was terrified on what it was but it turned out to be a tree branch.",
        "I am sometime to afraid to speak in public, for example, during meeting at work.",
        "I have pain in my stomach for about a week now. By reading what is on the internet, I am very worried.",
        "I am really worried that I will miss my flight tomorrow.",
        "I am home alone this weekend. I do not like that. It gets too quiet.",
        "I'm taking the drivers test for my license monday. I am so nervous.",
        "I was scared when i had t go home alone the other day",
        "I was afraid when i went home alone the other day",
        "When i was a kid i was alone at night during a huge thunderstorm.",
        "I was in a car wreck on the way home from church. ",
        "I was pretty terrified when a tornado watch was issued. I was real worried",
        "When I got home tonight my outdoor window was broken- To my cat room. I do not know who broke it or how. I am in a bad neighborhood so it was very frightening. ",
        "My sister has been begging me to go to a new haunted museum with her. I am not really into that kind of stuff. It really freaks me out and will give me bad dreams.",
        " My son has been having stomach pain for months now and the doctors can't figure out what it is. They basically say he has to get worse for them to find a diagnosis if some new problem comes up. I'm so scared.",
        "MY daughter keeps begging me to watch IT. I am going to tomorrow, with all of the lights on.",
        "My father and brother are in a serious conflict with each other right now, as my father has complained about the way my brother raises his son. Obviously it's a really stressful, tenuous situation and I have no idea who's side to take, and I'm worried it will lead to them not wanting to keep in touch anymore.",
        "I saw a scary movie last night.  I was so frightened by it!",
        "I am worried my cancer may return.",
        "I am scared these days.",
        "We were under a significant storm warning. The sky turned dark and the wind began to blow harder.",
        "Being alone in a foreign country.",
        "My wife and I have been quite scared lately.  There has been a rash of burglaries and robberies in our neighborhood lately and some have involved violence against the home owners!",
        "i want to move to new york , buy its all new to me there",
        "I hate wasps so much. They always seem to get into my apartment somehow and I turned into a little girl!",
        "I hate bugs and insects so much. I've called pest control but I still have them everywhere in my house. I'm so scared of them crawling around all the time...",
        "Once, I was walking home from work and it was late. My street was unusally quiet and there was a man walking quickly behind me. I was very scared. He ended up passing me but he whispered a nasty word as he walked past. ",
        "I am scared of Trump right now.",
        "I saw the biggest spider in my life near my bed this morning. I've been scared of seeing another one all day...",
        "Sooo scary!  I was in the basement today and I swear to you I saw a ghost.",
        "I am feeling all creeped out.  Been watching crime shows all afternoon.",
        "I owe some guys some money after playing a poker game. They know where I live and I see them driving by late at night.",
        "The other day I found an iguana in my backyard. I hate iguanas!",
        "I do not like to be in the woods at night. The coyotes make scary noises!",
        "i was exposed to lice at work",
        "I have kids aged from 14-21. I am always worrying that something bad will happen to them. I couldn't live with myself if something did. I love them so much!",
        "I was out walking late last night and seen someone following me. They looked like they were carrying a weapon. ",
        "I am scared I won't like my new neighbors. That's how it usualy goes around here",
        "I saw a neighborhood report that someone is breaking into houses and watching people sleep.  Creepy!  I want to buy a million locks.",
        "I was scared last week when it stormed. I hate rain and thunder",
        "i was scared to walk home the other day",
        "I think that I was abducted by aliens. I'm afried I have alien spawn inside me. ",
        "I was just diagnosed with breast cancer, just at its first stage, and I don't even know how to feel or what to do.  Its terrifying.",
        "I was home alone and heard what sounded like scratching underneath the floor. I was worried an animal was under the house, and that it might be able to get into the house, and that it might be something dangerous.",
        "I was in a situation where I was standing outside with a group of friends. Out of nowhere, gang members showed up and pointed a gun at us. This was alarming to say the least.",
        "One time I had to fly to Oklahoma for work. I don't like flying anyway but to top things off we had trouble landing.",
        "I am scared to ask my landlord for an extension on the rent this month. She isnt tht nice.",
        "I have to have an important medical test.",
        "I am afraid of growing up, I am just now an \"adult\" but not ready to fend for myself yet",
        "I am just in from finishing my college exam. I am hoping that I passed.",
        "I went to a haunted house and just couldnt bring myself to step inside",
        "I hated waiting each day to see if a college acceptance letter came in",
        "A couple months ago I got a text message saying that my sister was in a motorcycle accident!  I was really scared she might have been seriously injured!",
        "OMG I was so scared.  There was a ghost in my bedroom.",
        "Anytime I see a earthworm, I run away. I am so scared of them.",
        "I was out in the woods naked.",
        "Roller coasters next weekend",
        "Afraid to drive my car to florida",
        "I feel a bit scared sometimes living alone in a rough neighborhood. I have dogs..but I don't have a weapond.",
        "I heard noises coming out of my attic the other day. It sounded like someone was pacing around. I am too scared to go look.",
        "A group of pigeons was stalking me the other day.  I was terrified of it.",
        "I have been watching a new show. I am afraid to watch the new episode",
        "I got stuck in an elevator recently.  I was so scared that I would die in there.",
        "Once I studied really hard for a physics quiz and then I tried to set an alarm to wake up for it. Instead I slept through it and thought I was gonna get a zero on the quiz.",
        "I always have this feeling that someone or something is always behind me.",
        "I saw this scary movie the other day, and it completely freaked me out!",
        "birth of my first child",
        "I am a unhappy that  there is nothing I could do to help",
        "I am too scared to go to the Halloween party. I might freak out at some of the costumes.",
        "i fell and heard a snap in my leg.",
        "I was on a trip and fell asleep while driving. When I woke up there was an 18 wheeler stopped in front of me.",
        "The way interest rates are these days, i'm so scared to go get a car loan",
        "I woke up and I swear I heard footsteps in my house",
        "Tomorrow, I have surgery. I am so afraid of it.",
        "I am sort of scared of growing up, it can be daunting",
        "I am a bit scared of moving to a new place, I do not like change very much",
        "My frien with back with her ex. I think its going to end badly.",
        "i hate when my friend speeds down the interstate for no reason whatsoever",
        "There were 3 HUGE spiders in my house yesterday! I had to kill the first one, and then my husband killed the second and then when he was spraying (because I made him) he found a third!",
        "I'm terrified that I'm too late with something important.",
        "On Halloween I was nervous to go out at night. I was scared people were going to kidnap me",
        "I was terrified to walk home from the bar one night. There were gunshots nearby",
        "When my car caught on fire while driving ",
        "when my daughter was born ",
        "I've been worried about money a lot lately.",
        "living out in the country when it gets dark it's really hard to see what's going on around you at nite",
        "My neighbors dog dug a hole under my fence and chased me back into my house!",
        "I woke up in the night smelling something burning",
        "I was almost ran off the interstate",
        "I have a nevus that has change shape. I am little bit afraid of it could be. I will see the doctor tomorrow.",
        "1",
        "Our home was broken into shortly after we moved in. I am still scared about what happened.",
        "My family is gone on vaction without me and I don't like sleeping without anyone else in the house.",
        "I am really not liking Mondays.",
        "I have a presentation to do at work tomorrow and I'm not prepared. I hope I don't mess up.",
        "Our home was broken into shortly after we moved in. We are still cautious today.",
        "I was pretty scared when it stormed last night. I do not like storms",
        "when a dog was running at me in the dark",
        "the first time i got on the rattler ",
        "I am home alone and I just heard a noise upstairs.  This is scary.",
        "When I was younger, I went on a trip to my cousins ski home in New York. I am from Florida and didn't know any better and stuck my tongue to a frozen pole when one of my cousins dared me to. I dont recommend it. ",
        "i was scared walking home yesterday",
        "Scary movies.",
        "When our home was broken into, right after we moved in.",
        "A car was following me as I was walking home.  I was so scared.",
        "I haven't seen a horror movie in so long. I don't know if I can take watching one this weekend with my friends.",
        "I'm afraid of what the future has in store with overpopulation and unemployment.",
        "I never drink milk anymore because it made me sick once.",
        "I hate to sleep with the lights off. It is too scary for me.",
        "A man punched me on the subway last week, now I'm terrified to leave my house.",
        "I was always afraid to go to sleep when I was a kid. Thought monsters were under the bed.",
        "I live in Florida and was quite scared when the hurricane came over us!  I really didn't know what would happen.",
        "when my mother in law fell on ice ",
        "I'm scared because both of my parents will not be with me too much longer.",
        "when it was dark in my house and something made a noise in the kitchen ",
        "I am sitting in my house right now. The power just went out because of this big storm!",
        "When I was a child I was terrified of the basement. It is dark, black and cold",
        "I was fishing in a lake when an alligator swam right under my boat.",
        "I was camping last weekend in a tent and I heard some animal walking outside our night one night. When I woke up we seen these large footprints that were nothing like any animal we've seen before.",
        "I don't think I' going to like this semester. I didnt get any of the classes I want",
        "This is going to sound silly, but yesterday I realized when I went to change a diaper that I could not find a single baby wipe in the house. I didn't know what to do and did not have a car until my fiance gets home from work later that night. I was scared I wouldn't have a way to like.. change diapers!",
        "I am cooking dinner for my boyfriend tomorrow for the first time",
        "I went out to get the mail and there was a snake right up against the house. I was freaked out.",
        "I was out on a walk tonight and I thought I saw an alligator in the grass by me.  I thought i was going to get eaten",
        "After been beaten by a mosquito last night, I am very scared of sleeping in my room",
        "I stole some candy from Party City when I was a kid. I was so scared that the cops were going to nab me.",
        "I was so scared but I went skydiving! It was a great experience and I'm so glad I was able to overcome my fears.",
        "I'm going to be across the ocean from my girlfriend for school.",
        "I was so afraid to go to sleep when I was a kid. I thought monsters were under the bed.",
        "I was so scared to sleep when I was a little kid. I thought there were monsters in the closet.",
        "My exam results are coming back tomorrow and I am scared to look at them.",
        "I was driving home from work late at night and noticed a car following me. They made every turn that I did. I was all alone and this was before cell phones.",
        "I worked one job where I was always the last person to leave the building. I hated going into the empty parking lot by myself.",
        "I do not like anything with wings.",
        "I am afraid that the Russians are going to take over the USA.",
        "I am worried I will not be able to go to my fathers birthday party.",
        "i thought someone was breaking i",
        "I had to walk through a shady part of town.",
        "I heard noises in the night. ",
        "I thought I saw a ghost last night.",
        "I awoke to a tapping a tthe window last night",
        "I thought I saw an intruder in my room last week.",
        "i thought someone was breaking in",
        "I kept hearing odd sounds at night... I think there is a racoon in the attic!",
        "A man was chasing after me because I did not give him money.  I was scared for my life.",
        "someone breaking in",
        "someone trying to harm me",
        "A pit bull was chasing me as I was walking home.  I was so scared I would die.",
        "I'm afraid to leave my current job (which I hate) because I might not be able to find work that I enjoy that pays well enough to live on.",
        "I rode on an airplane last week and there was so much turbulence! I was so on the edge!",
        "I found a brown recluse in my room this morning (a type of poisionous spider)",
        "There was a giant spider in my bathroom. I hate spiders!",
        "i was driving along a lonely street,however i've heard that some notorious hoodlums hang out there",
        "To this day I am still frightened to go near a cemetery. I just get a bad feeling about them",
        "Really afraid of flying next week, it's been a while since I've been on a plane!",
        "I was worried about driving home tonight. A lot of people were swerving",
        "This afternoon our neighbors dog got loose and he is very aggressive. The kids were outside playing in the yard. I didn't know what to do! My heart was racing..",
        "I am afraid of how the Nintendo Switch has been doing recently, a lot of games have been delayed or cancelled",
        "I was scared over the weekend. All it did was rain and storm",
        "I am scared Carson Wentz will never be the same after his injury, it was brutal",
        "Last week, when I was going to the office, I stopped by a cafe to get a coffee. There I saw a young man watching angrily at me. He even has a gun in his hands. I was very much frightened.",
        "Getting my roof replaced. It's so expensive.",
        "my health isn't good i'm scared to go see the doctor",
        "I damaged my car yesterday. I am so worried about how much it will cost to repair it.",
        "MY son likes to hit his head on things when he is upset. I think he might realy hurt himself",
        "I am a bit scared for the weekend to come. I don't know what will happen between me and another person and I hate the unknown.",
        "there have been many instances of attempted abduction in my area. i hate when my wife and son are out without me",
        "i was scared going home alone the other night",
        "I am so scared right now.  I just heard a crashing noise in my back room.",
        "I heard a noise downstairs in my kitchen.  I am home alone and i am scared to go see what it was",
        "I saw the scariest movie the other day.  I was so frightened. ",
        "I kept hearing odd sounds all night... it turned out to be a racoon in the attic",
        "I was always afraid to go to sleep as a kid. I always thought there were monsters in my closet!",
        "I am rewatching game of throne. I always get scared when there are white walkers",
        "3",
        "I do not like being in small spaces.",
        "I really have a fear of germs.",
        "I hate hate hate riding on trains!",
        "My friend wants to go to a horror film this weekend, but they usually freak me out.",
        "i was scared walking home alone",
        "A wasp was in my room this morning.",
        "I have a doctors appointment tomorrow. I am afraid of what they might say.",
        "I thought I saw a ghost in my house last night.",
        "I saw a strange man on the street.",
        "I have a big test next week and I am super nervous.",
        "I heard a noise outside my window last night that sounded like someone tapping on the window. I was terrified. It turned out to be a bird on a tree limb.",
        "I'm going to an amusement park tomorrow. I don",
        "A man approached me after I got out of my car in a shopping center parking lot.",
        "A while ago, I was riding in the car with my uncle at night to get some food. He had a few drinks earlier and we ended up getting pulled over.",
        "Each month I am scared to look at my bank account. I live paycheck to paycheck, sometimes its not enough",
        "I have some skin problems. I am scared.",
        "Tomorrow is the first day of college. I am not sure what to expect, I am scared.",
        "when the lightening hit near my house and we had a storm ",
        "I'm afraid I won't be able to afford my car payment this month.  Might have to borrow money.",
        "I was so scared.  I was at a graveyard at dark with my drunk boyfriend..",
        "Ok.. I was driving across S. Dakota last summer at night.  Its super dark and you can see all the stars.  Then my car broke down.",
        "They laid off 3 people at work yesterday. Still haven't mentioned it yet.",
        "I got new neighbors and I don't think they are too nice. I don't want to speak to them",
        "i was scared when i walked home last night",
        "I woke up the other day to REALLY loud knocking at my apartment door. I don't know who it was because I didn't answer the door.",
        " I hate scary movies, they scare me so much, especially jumpscares",
        "I have to go to the doctor on Monday. I hope everything is okay. I havent been feeling well.",
        "i was scared to walk home alone yesterday",
        "Riding coasters this weekend",
        "i was scared yesterday when i was home alone",
        "I get off work late at night. It's really scary walking home in the dark. ",
        "There's a hard bump on my arm. I don't know what it is.",
        "i dont really enjoy when my wife and son go out alone, too many crazy azz people in the world",
        "playing silent hill one ",
        "I just watched the exorcist for the first time and am home alone. I turned all the lights on in the house and am going to call my friend because I have goosebumps. ",
        "My husband was out of town all last month for work. After one night alone, I had to go stay at my mom's because I was too creeped out by every little sound",
        "Some guys cornered me outside a bar last weekend and told me to give them my wallet or they would beat me up. I didn't know what to do, I was so scared.",
        "the braves are really good. i just dont know if we have the pitching to make a run",
        "the braves are really good, i am hoping they dont blow it",
        "Our home was broken into when we moved in and I felt this way.",
        "My neighbor is a drug addict. I hear him talking alone and I see him having weird behavior.",
        "Roller coaster riding next week",
        "When my mom was in the ER",
        "Riding coasters next week :/",
        "I have not learned swimming in childhood, whenever i see water butterflies flies in my stomach. Now its difficult to learn",
        "There was a loud sound from the bedroom.",
        "It was really dark and rainy one time when we were driving. We also crashed and it scared the hell outta me.",
        "I finally saw the movie the Quiet Place.  I was disturbed and unsettled all night after word",
        "I changed my transmission fluid today. Hope I did the right thing",
        "i was scared walking home alone last week",
        "I just saw a brown recluse crawling on my desk.",
        "I was scared driving home last night. I felt like a car was following me",
        "i cant wait for monday!",
        "i was scared being home alone last night",
        "All the lights in my neighborhood has gone out except my home. People are looking at my home weird now.",
        "We had some storming last weekend. It was pretty scary",
        "When my house burned down in junior high. I had to rescue my parents.",
        "I went in a haunted house for halloween. Saw some weird ghosts.",
        "Honestly, I am, for the most part, scared of the dark.  I think it is from all the scary movies I watched when I was a kid.",
        "Halloween is coming and that means there will be haunted houses! I want to go but I don't want to get too scared.",
        "I saw where someone escaped the local jail and is on the loose. It has me on edge.",
        "I woke up in the middle of the night because I thought someone was trying to get in my window.",
        "I woke up scared in the night as I heard a noise at the window.",
        "there was a giant spider in my house the other day. I was terrified. ",
        "I sat on the worlds scariest rollercoaster. ",
        "During a storm in the middle of nowhere, my car broke down.  I didn't have cell reception and was stuck on the side of the road in a really bad storm by myself for a few hours",
        "I found a copperhead in my backyard.",
        "When I worked at a bank, a man came in to rob us.  He had on a mask and had a gun.  We thankfully had a security guard in the back who detained him",
        "I saw a mouse in my kitchen this morning.... scary little animal",
        "I finally got over my fear of heights! But before that, I had never been so scared in my life. I went sky-diving.",
        "The first time I saw the move \"The Ring\" I was afraid to go home to an empty apartment!",
        "I am going on a flight for the first time in a couple weeks.  I am really scared for some reason!",
        "I went to the doctors for my annual check-up, I always think they're going to find something wrong.",
        "Last night I kept hearing strange noises come from my basement. I haven't been down there since I got the house.",
        "I'm afraid I'm going to do badly in my advanced programming class this semester!",
        "Standing in front of the judge for the first time and him telling me i am going to prison for years. that is scary.",
        "I was driving through an allay ,dark and lonely,when suddenly my car broke down",
        "I was walking home alone from a friend's house, and it was really dark. When I get close to my home, I see a figure moving behind me. I freaked out, but it was just my shadow.",
        "I was in a car accident one time. I could see the other car coming at me before the impact.",
        "I told a friend I'd go bungee jumping with them a long time ago, and recently they've decided they'd like to take me up on that offer. But I'm really scared of heights.",
        "Last fall, I went to a haunted house.  The chainsaw guy chased me.  I was so scared",
        "I just finished cleaning out my a/c condensor.  But I'm worried I might have cut one of the electric linies",
        "My dog pooped on the rug today. I am so scared to pick it up.",
        "i felt scared walking home alone the other day.",
        "i was scared to walk home last night",
        "I was pretty lost when my dad died a few years ago. I just felt scared at the time",
        "i was scared walking home last night",
        "I didn't prepare for my exam yet.  I anxious about my tomorrow's exam.",
        "There's this tree outside of my apartment, and the way it's illuminated it looks like the silouette of a person, which startles me sometimes.",
        "I have to take a foreign language for college this semester. I'm not really looking forward to it because I feel like I'm going to embarrass myself trying to speak the language in front of everyone when we have to talk",
        "Have to do a long road trip tomorrow to visit an ailing family member, but the scary part is it's set to be thunderstorming for a big stretch of the drive. I've never done well driving in the rain",
        "I'm afraid of my new apartment complex, a lot of sketchy people out at all hours of the day.",
        "A couple months ago my 60 inch element LED HDTV randomly got white lines all over it while my fiance was at work. I didn't do anything to it at all, it just glitched up by itself and got worse as the night went on. I don't think it can be fixed and I dont want to be blamed for it because I was the only one home!",
        "i was scared walking home alone the other night",
        "I watched a scary movie with my boyfriend. Ever since then I have not been able to sleep.",
        "i was scared to walk home yesterday",
        "The power went off for a few minutes last night. The noise it made was pretty scary",
        "Our home was broken into right after we moved in and I felt this way.",
        "There have been a series of breakins in our neighborhood recently.  I'm keeping the shotgun by the front door.",
        "My friend got into accident last month. His leg might  be removed!!",
        "I have to go to court and I was didnt follow through with what I told the judge",
        "I get scared walking around my neighborhood. I dont unless I really have to",
        "I was so scared to go to sleep when I was a kid. I thought the monsters under the bed were going to nab me.",
        "I lost the money pouch for the deposit at my job the other day.",
        "I was walking my dog and a stray dog ran up to us and started barking. Next thing I know he was trying to fight with my dog. ",
        "I was so scared to go into my apartment building at night. So many roaches!",
        "I hit my head on the door corner and it left me with a wound. I feel it will scar",
        "I was always afraid of going to sleep as a kid. I was afraid that bigfoot was going to skin me alive.",
        "I'm afraid to move away from my home town, I've lived here for 26 years! I'll miss everyone!",
        "The moment I decided to drop out of University, I had no idea what to do. Thinking about calling my parents and telling them was the most fear enducing madness I'd ever had to endure. Everything felt cloudy and shaky. ",
        "I saw this scary shark movie the other day. I had to cover my eyes the whole time!",
        "My hamster got out of its cage and I haven't been able to find him. I hope he's ok and hasn't gotten hurt",
        "Yesterday I came across a huge snake in my back yard!",
        "when i had to hold a spider ",
        "when my hit her head ",
        "I was bungee jumping for the first time last weekend.  I am not good with heights",
        "When I was laying in my bed last night I heard some footsteps walking down the hall. I live alone and was very frightened.",
        "I was cleaning out my basement and a giant rat jumped out at me. I nearly jumped out of my skin. It ran away and now I can't find it anywhere!",
        "My daughter passed out one day last week.",
        "I forgot to make my student loan payment this month.  I'm scared it will affect my credit score.",
        "i was scared to walk home the other night",
        "It might storm tonight. I am a little scared to be honest",
        "i was scared walking home the other night",
        "i was scared walking home alone last night",
        "I don't know what that thing is, but it has way too many legs for my comfort.",
        "When I was younger I was scared of almost any new experience...but since I've been mugged, kicked out of the house, lived homeless, been beaten up, won some street fights and become fully self-employed there's really nothing that scares me anymore",
        "I just saw a bobcat outside my house.",
        "Anytime I see a bear, I run the other way.",
        "My crush keeps hanging out with a new guy classmate a lot lately.",
        "I was so scared to sleep at night when I was a kid. I thought there were monsters under the bed.",
        "I was cleaning the yard and uncovered a huge nest of black widow spiders!",
        "I was so scared to go to sleep at night. I thought monsters lived under my bed.",
        "I think my boyfriend is cheating on me",
        "I was so scared to go to sleep at night when I was a kid. Always thought monsters were under my bed.",
        "I REALLY THINK WE SHOULD BE THIS DEEP IN THE WOODS.",
        "I think i will lose my teeth and its shaking",
        "There's 2 escaped convicts loose in my town! They were last seen in my neighborhood!",
        "Due to recent debt that I have accumulated through credit cards, my credit score has seen a significant decline. I am very concerned it might impact my credit trustworthiness",
        "I really get nervous when I have to drive.",
        "I heard this strange crash noise in the garage. I thought it might have been an intruder, but it was a raccoon! ",
        "I really do not like water, I can't swim.",
        "I was expecting some doctor's results this week. I am really nervous about it.",
        "I'm going skydiving in a few days. I've never been before so I'm quite nervous about it",
        "My dog has to go stay at the doggie daycare for a couple of days so I can go to a wedding. Im scared that she will think I am leaving her there and never coming back and I dont want her to feel that way. ",
        "I missed my purse in bus. I'm not  sure how i will go home, its late at home",
        "In a way I'm scared to show love or get close in a relationship.  I mistook pity and infatuation for love and ended up being miserable.  Am I gonna let that happen again? Hell no",
        "It's really stormy right now. I keep glancing outside my window, hoping it doesn't get worse. I sure wouldn't like to see a tornado.",
        "We went to see The Meg yesterday.  Now I'm terrified of the ocean again.  Way to go LOL!",
        "When I was younger I used to be scared to go into the basement.  After I saw the home alone movies",
        "I was walking home one night and I saw some guy standing next to a wall, luckily he didn't have any bad intentions. I was freaked out",
        "I started bleeding when I poo.",
        "I was driving and this guy started following no matter which turn i took.  I was worried that he was going to follow me home",
        "I did not want to go on the rollercoaster",
        "I'm scared of the dark, but I have to walk home from work in the dark. It is really nerve wraking. ",
        "Before my final exam on of the semester. I needed a 90% to pass.",
        "When I got in to a car accident and injured my arm. The car was on fire.",
        "I was on vacation and I saw a ghost at a hotel.  I couldnt fall asleep the whole night.  It was so scary",
        "i have a doctor's appointment and i'm so scared",
        "i was scared walking home the other day",
        "i was scared the other night when i had to walk home alone",
        "Amusement park this weekend",
        "I'm really scared of going down to my basement. It's so dark down there. ",
        "I am scared of horror movies, I never could tolerate them",
        "I have a big job interview coming up. I am so nervous I almost dont want to go.",
        "Someone got shot near my house the other day.  I am terrified now and want to move.",
        "My cat was acting weird earlier. It was starting to scare me",
        "Going coaster riding this weekend :/",
        "When my house burned down in middle school. It was in the middle of the night.",
        "I'm scared I'll never get married and settle down",
        "At a haunted house we explored. It was very spooky.",
        "My husband went out of town for a few days for work.  Every sound I hear makes my hair stand up on end, I may not survive this trip.",
        "I was so scared to go to sleep when I was a kid. The dark was so creepy.",
        "I'm scared a tornado will come in and destroy my city",
        "I am going to rock climbing for the first time this weekend and I do not like heights",
        "I saw a creepy looking clown walking down the street. I was so scared. I went home and hid underneath my bed.",
        "I am not able to pay for my mortgage. I think i will loose my home",
        "I have to go rescue a dog from a violent household. This place has a bad history and the cops are always there. This might not end well, but I'll work for it to be fine for the dog's sake.",
        "We are relocating for my husband's work. I'm excited but scared",
        "I am terrified of clows",
        "I become terrified when i heard of ghost",
        "i am so scared i want to finish all the book today and i may not be able to finish it",
        "I remember back when I was younger my parents and I had rooms right next to each other. One year my parents decided to finish their basement and make it a master suite for themselves. I thought it would be great! I was so wrong. I was terrified for many months to sleep \"by myself\" and ended up sleeping on a couch in the basement.",
        "A dog chased after me while I was running with my baby in the stroller.",
        "My nephew was racing around our house, and fell head first into the corner of a bookcase.  There was a ton of blood and I had to take him to the ER.  Luckily, it was better than it looked and it wasn't a huge deal.",
        "I got lost when I 8 at the county gfair. I was looking  every where for my mom and could not find her I sated crying and didn't no what to do.",
        "I am afraid of flying cockroaches ",
        "I have an irrational fear of flying, yet I planned a trip which required me to travel 8 hours in a plane by myself",
        "my girlfriend has been saying some really threatening things lately, and I don't know what she's going to do",
        "I am scared of zombies",
        "I am afraid of spiders.",
        "I used to live in what other people called a \"haunted house.\" I would hear all sorts of sounds at night, and sometimes see shadowy figures in the dark.",
        "A man was following me home last night. I had to walk really fast to avoid him catching up.",
        "I saw a spider running across my desk and screamed",
        "I lost my wallet while out shopping. It took hours to find it.",
        "My stepmother just passed away and I am concerned about my dad",
        "I heard a noise im my garage and was concerned since it was late at night",
        "I'm not a big fan of water, like oceans, lakes, or rivers. Recently my husband's family invited us for a weekend at their cabin which is on a lake. They have a pontoon so I thought we'd just fish and hang out. My husband made me get in the water. I was so terrified something was going to eat me.",
        "I was waiting in front of a store one day when a man approached me and whispered something scary in my ear. I was not pleased.",
        "I watched a scary movie the other day while i was at home alone.",
        "I remember one time I went somewhere with a friend while they were driving. They were weaving in and out of traffic while texting on their cell phone and messing with the radio all at the same time. I wanted out of that car.",
        "it's monsoon season here where i live and I can hear the thunder rumbling, I hope we don't get flooded. I'm pretty scared.",
        "when i was lost in a big city with no cell battery",
        "I was scared when I saw a mountain lion at night right in front of me. I ran to my tent.",
        "A few weeks ago a tire on my car blew while i was driving it on the highway.",
        "I love to hear the rain falling but seeing the lighting and hearing the thunder makes me shudder.",
        "A person tried to break into a store I was working at to rob it. They didn't get in but it was highly stressful.",
        "I was at the movies the other day and this movie freaked me out.",
        "last night I heard a windows shatter in my house and i was home alone. ",
        "gotta go fast to the potty",
        "One time i heard someone outside my window. ",
        "There were really loud storms last night. I have never liked thunderstorms and I thought my windows would break.",
        "With all the climate change happening in the word, I don't know what's going to happen where I live, specially since i live near the coast",
        "When I was a kid, I got chased down the street by our neighbor's dog.  The school bus showed up just in time and the driver helped me.",
        "I have to go to court for a speeding ticket and i am worried and nervous over the whole ordeal.",
        "When my house burned down. I had to save my mother.",
        "Today when I was walking home from the park a pit bull was chasing me.  I was scared for my life.",
        "This past wednesday, I left my class very late and there weren't many people outside, and a random car pulled up to the curb where I was.",
        "I think the aliens landed in my backyard",
        "I went outside my house yesterday and there was a big snake in the driveway! ",
        "abilities what they can cause",
        "I have a test coming up soon",
        "i was robbed",
        "There was a lay off recently at my company. I am so scared that I could be part of the next one.",
        "I was so scared when my car spun out of control in the snow, I had never been in that situation before",
        "I had to work late the other night and had to walk out to my car alone. It was very dark outside.",
        "I was watching a horror movie all by myself one night. It was really scarey ",
        "We had a storm last night and lost power. I couldn't find a flashlight. It was so scary.",
        "I think someone was following me home last night. I took off running and didnt stop until I got home.",
        "My daughter screamed because there was a humongous spider on the kitchen floor. It turned out to be a pretty small one.",
        "We had a huge black snake in our backyard today and couldn't catch it.  Now I am looking all over the place whenever I go outside. Waiting for it to shock me.",
        "I have a phobia of water, and my boyfriend made me go out on his boat last weekend.",
        "While i was sleeping the other night, my house alarm off. it was scary",
        "I was at a scary maze and one of the people there actually scared me! It was super funny afterwords",
        "I was cleaning my garage and a huge spider crawled on to me!  I am super scared of spiders!",
        "There have been so many crimes near me lately. It is getting out of hand",
        "When I came home, the door was open and the lock broken. ",
        "I was so scared of my uncle. He is so mad at me for not graduating.",
        "I got a little scared last week on the way home. My car was driving odd",
        "I dont like uncertainty. I like to know what is going to happen.",
        "I saw a creepy looking clown peering at me through the window. I almost jumped out of my skin. I ran into my basement and hid in a closet.",
        "I was in bed and i heard a loud noise in my kitchen. but i was home alone!",
        "My house burned down and I had to rescue my family, It was a chilly night."
    ]
}