{
    "threshold": 0.8,
    "seed": [
        "My neighbors are still doing fireworks every night at midnight. I have dogs that are scared of the noise and won't sleep.",
        "When I found out that my ex-wife cheated on me",
        "Have you ever hit your toe on hit doorway? Talk about being furious!",
        "Wow, is always reduces my standard",
        "I was sad to see one of the cave rescuers died.",
        "I was furious when I got in my first car wreck ",
        "I just read an article online recently that said medical marijuana was now OK in the UK, it was so frustrating to read it because it had no valid reason being banned, and the way it got legalized was a child (epileptic) being denied it, and then having seizures every day. its mind blowingly frustrating",
        "I was at the grocery store today using self checkout. A man was checking out beside me and he took my receipt!",
        "I was late for the bus and missed it.",
        "Where I live it's forecasted to rain all week.",
        "Got a call from my cousin. Her husband took her and their 4 kids to a county fair. Ate about noon and headed home. They decided to stop at a cemetary to look around, lost track of time and now they are locked inside. It is 7pm and everyone is very hungry.",
        "I got a notification that I had a package delivered. I didn't see it on my porch and found it sitting in the middle of my driveway!",
        "I was walking home when a car drove through a huge puddle near the sidewalk.  I was completely drenched",
        "I called a pizza delivery today, and the guy that took my order, was so rude...",
        "Once I was waiting for a friend for an hour to go to dinner and she wouldn't answer her phone!",
        "I was waiting in a check out lane for quite some time. A new cashier came and she took the people at the back of the line.",
        "I was in shopping and came back to the carpark to my car only to find that someone had hit the back of it and must have just driven off! They did quite a bit of cosmetic damage but obviously didnt care less as they didnt even leave a note for me.",
        "My best friend missed my birth day",
        "I was very angry when I was fired from my job July 23rd.",
        "I can't take it when people are rude.",
        "I remember there was a TV show on called Hero's and it was awesome they had 2 seasons and I watched them religiously every week when new episodes came on and after season 2 they decided to cancel it and I never found out what happened to the characters that I was invested in and it made me so freaking mad ",
        "A car backed into me last week. They left a nasty dent in the front of my car.",
        "i was really pissed off when i found out my best friend slept with my girlfriend. i was shaking all over!",
        "Someone stole 20$ off my desk at work. My office is private.",
        "I felt furious when my brother got my new car into an accident last month, it was badly damaged",
        "I was so angry when my brother spoiled my favorite dress when we were kids. He cut animal shapes into it.",
        "someone eating my food",
        "My neighbor was having a party last night and wouldn't let me sleep.",
        "My kids spilled juice on my brand new white carpet.",
        "My neighbor would stay up all night playing LoL. He'd be yelling into his headset at 4am when I was trying to sleep, it was infuriating.",
        "My neighbor keeps letting her dog poo and pee all over our parking lot and I'm not sure how to get her to stop. It's really irritating.",
        "im so mad! I can't find my hair brush!",
        "I was so furious when my brother lit a firecracker after tying it on our dog's tail. I was red with anger.",
        "I am so upset! My phone was on top of my car and it fell off and shattered.",
        "One of my coworkers took credit for a job I had done last month. They told our boss it was their idea, when they didn't even work on the project.",
        "My coworker got the promotion that I was trying for. I feel like I deserved it more.",
        "Every single time I go in the office bathroom someone comes in and needs something. If I don't go to the bathroom no one comes in all day.",
        "My neighbor's dogs started barking early this morning. They woke me up, which I'm not happy about.",
        "All my cucumber plants died this week due to too much rain",
        "Last week, someone during the night drove off the road and destroyed a large section of my fence. It is going to be expensive to have it replaced.",
        "the police officer tried to harass me",
        "I can't really say that I get off balance that easy, but that guy really made me feel negative.",
        "I have not had any sleep for the past three days only to come back home and my neighbor is having a loud party.",
        "After being married to my first wife for 8 years, I found out she was having an affair behind my back. It was not a very good time for me.",
        "My roommate would leave his dogs poop bags inside the house at times.",
        "I broke my leg",
        "My girlfriends dog isnt getting potty training.  One week she will be great.  The next week the only place she doesnt go to the bathroom is outside.",
        "I don't know what makes me more upset a rude employee or the manager I had my food order messed up and Wendy's gave me so much attitude super rude. ",
        "So bitter when I discovered my woman went to church putting on black gown when I ask her to wear white.",
        "I came outside this morning and found my car had been broken into. I was very upset and frusterated",
        "I am so upset they man that hit my car was not ticketed! ",
        "I am so upset she hit my car and left before the police came!",
        "One of my roommates left without cleaning his room and the school charged me and the other two roommates 100$",
        "im mad at my neighbor today",
        "My older sister stole my younger brother's iPod touch to pawn. I was so furious, especially because he's the sweetest most innocent kid.",
        "Yesterday, at the grocery store I saw a lady spanking her child. The child only asked for a candy bar and was not being out of the norm for children.",
        "One time I saw someone's dog pooping in my lawn and they didn't pick it up!",
        "I dropped my dang coffee on the group and not only that but it splashed me as well.",
        "My upstairs neighbor moved out recently and left all her trash and furniture in our parking lot next to the garbage cans. No one has a place to park! I'm so mad.",
        "I'm so angry at my self. I was in my performance review today and I passed wind in front of my boss. OMG ",
        "I told my daughter she wasn't allowed to watch youtube. I caught her watching videos on her tablet",
        "I'm adhd when it comes to cleaning so when my family leaves the house a mess I get so furious.",
        "One time someone kicked my dog!",
        "While my car was parked outside my house, someone put a huge dent in it during the night. No insurance card, no nothing, just drove off.",
        "Last week during the night, someone came into my yard and stole my push mower. I had it chained to a steel pole, but they use bolt cutters to cut the chain.",
        "Someone keeps stealing my lunch from the fridge at work. They'd better hope that I don't find out who they are!",
        "My electricity is out again! I pay a lot for the service, and i can never count on it. It goes out when the wind blows!",
        "I got really mad at my dog the other day. There's a rabbit living under my shed, and when he saw it eating our grass, he chased it out of our yard.",
        "There was a bad accident this morning by my daughter's school because a careless driver wasn't going the speed limit in the school zone I was so mad because a child could have been hurt. ",
        "My dog keeps going into my garbage and throwing the contents onto the floor. I don't know how to get him to stop and it's frustrating as all heck.",
        "my friend stole my laptop as a prank and gave it back by the end of the day",
        "crashed my car today into a lamppost",
        "My husbands brother stole $500 from us let's talk about someone being beyond mad more like furious.",
        "I caught my boyfriend cheating on me last night. I was so mad!",
        "I was so mad when my friend forgot my birthday.",
        "One time I kept waiting for this person to respond to my texts. He never did",
        "i'm mad at my mother because she didn't call me",
        "my neighbor dog barks all day, I like to go over there and tell him where he can put that dog at,",
        "We're working on building a house, and keep running into delays.  The guy at the city is completely unhelpful!",
        "My son wouldnt go to sleep last night.  He kept yelling that he didnt want to sleep and wouldnt go into his room",
        "I get so upset when someone does not agree with what I am doing. I am a grown women and feel I can make good choices for myself.",
        "at my cat for pooping",
        "I feel so upset when other people tell such horrible lies about other people. Some people are just cruel and are only out for themselves.",
        "the neighbor's dog barked all night and kept me up, let's say I am not very happy right now"
    ]
}