{
    "threshold": 0.8,
    "seed": [
        "I went to a party and it was real bad. ",
        "I lied to the people I work out with. I told them I was out of town but I relaly just did not want to work out.",
        "I was mowing the lawn, and a rock flew and broke my neighbor's window.",
        "I am ashamed when I cheated on the test.",
        "I am ashamed I lied to the police.",
        "I was felt this way when I failed passing to the 10th grade.",
        "I cheated on my boyfriend one time. I highly regretted it.",
        "I snapped at a sales lady for not honoring the price of something that was not labeled correctly. She ended up being very nice and helpful. I was embarrassed with how I acted.",
        "I yelled at my Girlfriend once about not saving money. She cried and i shouldn't of bee so harsh on her. Made me feel real bad about it.",
        "I am embarrassed to be a Cleveland Browns fan.",
        "Sometimes I just eat because I know there is food in the kitchen. I feel bad.",
        "I can't believe I didn't listen to my child when they told me that someone is picking on them. I feel terrible now he doesn't want to go to school any more.",
        "Sometimes I wonder where my life would be if I decided to not go to college. I feel embarrassed to say my major did not work out for me...",
        "I felt so bad when I saw that I had accidentally run over my neighbor's rose bush. She worked so hard growing her flowers.",
        "A few years back, I drank some of my mother's rum and didn't ask her. She found out and scolded me for it and it made me feel bad.",
        "I regret my last boyfriend. I hate to even tell people we dated.",
        "I finished last in a race were there were 500 people even when I was younger than most of them.",
        "When I got in trouble with the law for the first time, it was a shameful experience. I was more sad that I let me dad down.",
        "A car hit me about 10 years. I awoke up in the morning naked and two womens wasking me for chirurgical operation. I felt so bad to be naked in front of people I don't know.",
        "I haven't made a home cooked meal in a while. We've been doing fast food every day.",
        "I tried to steal some tuna and crackers from a gas station. My boyfriend and I were broke and traveling on a Greyhound, and we were so hungry. I got caught by an officer and felt so stupid",
        "I feel horrible.  I cheated on my husband last night.",
        "I failed my final exam. Now I'll lose my scholarship.",
        "I failed my test last week, I am disappointed.",
        "I lied to my girlfriend about how much education I had",
        "My friend and I got into an awful fight, she won't forgive me.",
        "I was ashamed wehn I failed my first test in college, I thought I was doing well",
        "I think I sometimes enjoy it too much when my kids leave for the weekend.",
        "I was happy my sister was fired from her job. Thats bad.",
        "I once was caught making out with my girlfriend at a family dinner. I didn't think they would find us out.",
        "I can't believe I lied to my mother.",
        "I am ashamed that i used to be scared of the dark, I always had a nightlight",
        "My friend left her cactus under my care. It's been with her for 5 years. It's kinda dead now I think.",
        "I ate all the pizza rolls in the bag last night. I was so ashamed.",
        "I laughed at someone who fell over in the grocery store today.",
        "I thought I had study well enough to pass my exam.  However, I did poorly. The worst in class.",
        "I feel so guilty.  I cheated on my husband.",
        "I littered out my car window today, I am so remorseful...",
        "I ate a whole pizza yesterday. I should never tell anyone that.",
        "I have been unsuccessful at quitting smoking for years now.",
        "I failed my Introduction to Statistics class and was very nervous of having to retake it again",
        "I was at work and heard gossip about a coworker. I didn't say anything in their defense.",
        "I was early for an appointment and was told to go back ",
        "I felt really bad when I cheated on my Math test.",
        "I was dunk and forgot my girlfriends birthday once.",
        "That i quit my job ",
        "Yesterday at work, my boss recognized me for work that my coworker actually did.  I feel bad that I took credit for it.",
        "i stole my dads alcohol when i was younger",
        "I never finished school. I had problems with my mental health and just stopped showing up to class. It was very hard for me.",
        "I spilled my drink all over my lap right before having to go into work. Now it looks like I peed in my pants.",
        "I can't stop spending money.",
        "I ate all of the pizza that I bought for my friends last night. I didn't feel too great.",
        "I was almost hit by a car while I was walking in a crosswalk and I cursed the lady out.  Then I saw a little kid in the car and instantly regretted what I just said.",
        "I was caught taking something that was not mine I feel so bad about this",
        "I failed my Calculus class twice this year. I don't know what else to do",
        "My credit card debt is ridiculous. I'm so embarrassed.",
        "When I got arrested, it was just bad. I was embarrassed to tell my dad",
        "The other day I backed out of a parking spot and tapped a parked car.  It left a dent but I left without notifying the owner.  It was not an action I am proud of.",
        "My mother needed help moving out of her house and I ignored her call while at a party. I feel so bad because there is no way she and my dad would be able to move the giant furniture..",
        "My son started screaming in a grocery store.",
        "I am ashamed of how much money I make, I barely make a livable income",
        "I always tell my boyfriend I have no money no matter what I have in my pocket.",
        "I felt bad when my husband and I argued and I realized it really was my fault.",
        "I did not get the A grade in math class.",
        "I forgot my best friend's birthday this year. I've known him forever and am usually great about remebering and doing special thigns.",
        "I ate a box of donuts yesterday when I promised myself I wouldn't cheat on my diet. I am so let down on myself",
        "When I accidentally broke my moms vase and lied about it.",
        "I say every year I'm going to wear a two peice swimsuit. I never do.",
        "i burrowed money from my friend and forgot to pay him the money",
        "I cheated on my taxes last year.  I feel really guilty about it.",
        "I feel horrible.  I did something bad.  I put an empty envelope in the collection basket at church",
        "I saw someone drop $20 in the store. I picked it up and kept it.",
        "I can't believe I became one of those people who can't live without their phone.",
        "My friend loaned me his laptop and I spilled juice on it.",
        "I came in last in the race, I am not good at running.",
        "I'm making venison wellington and I totally forgot to put mustard on the backstrap before I wrapped it.",
        "I didn't get a chance to make dinner for my date, so I got her McDonalds.",
        "I bought snacks for the kids lunches and I have eaten half of them. Thats so bad",
        "I stole money from the church collection plate.  I feel so pathetic for doing it.",
        "I stole from my wife.",
        "I took a candy bar from a child yesterday.  I feel really guilty about it.",
        "One time I went to a grocery store and picked all my items.  However, when I went to buy my groceries, my card declined.  I was so ashamed that I had to leave my groceries and call my bank.",
        "Last week, at work, I didn't notice that my pant zipper was open",
        "I accidentally spilled my friend's secret to a mutual friend. It was a bad thing to do and it will probably cause some problems",
        "During a work meeting, I was presenting and then suddenly my pant dropped. I felt so bad.",
        "i felt bad when i couldnt get my daughter the gift she wanted",
        "I am so embarrassed that I ate all of those potato chips.",
        "I feel so bad because I took what was not mine",
        "When I was a kid I thought it was funny to spit off of the balcony. One time a lady was walking by and I spit off the balcony. I spit on her head by accident. I felt so bad about it.",
        "I got on my first roller coaster yesterday and I threw up everywhere!",
        "I needed to pay my rent and didn't have enough money. I took the money from the cash at work.",
        "i walked into a church in the middle of a private baptism ceremony. i was so ashamed",
        "I once peed my pants in school",
        "Someone asked me for some money to donate to their charity and I told them no. I feel so terrible but I have such a low income that I have to think about my family.",
        "I once ate an entire bag on m and ms, the day after i started my diet.",
        "I was supposed to be responsible for the powerpoint slides for our presentation, but I accidentally deleted it.",
        "I was in a store and really needed a sandwhich. I didn't have any money so I walked out with one sandwich without paying. ",
        "I felt pretty bad last week when I was got lying. I just felt like a rat",
        "I am a little fat. I feel ashame when I have to change clothes in the men locker room.",
        "I ate an entire pizza the other day. It was not a personal pan pizza",
        "My mom brought home some cheesecake for my little brother, because he did well on his test the other day. Cheesecake is my favorite. I snuck about half of the portion and ate it, and I feel bad. I couldn't resist...",
        "I failed to pass my examination. I feel guilty for that. Though I studied hard, I lost.",
        "when i lost my temper due to just having stress in my life. ",
        "I am ashamed of myself for being lazy and not going to the gym, I am not sure why I struggle with it",
        "i felt bad when i couldnt get the gift my daughter wanted for her birthday",
        "I never finished college.",
        "I am not proud of the fact that I ate my friends pizza.",
        "I sold dirty underwear as new.",
        "I broke up with my girlfriend because I was cheating on her.",
        "I eat while I am asleep and I can't control it.",
        "I can't believe that I stole food from the soup kitchen.",
        "My grandfather farted whille eatign",
        "I eat my dead skin cells",
        "I got caught stealing candy from a store.",
        "After I moved out of state I lost contact with a very good friend. When they tried to reconnect I felt bad about not staying in touch.",
        "I never stick to my diet. I am such a failure",
        "I lied to my wife",
        "when i lost my temper with my dad ",
        "My son's Vice Principal called me to say that he had pushed another kid and used inappropriate words in the lunch room.",
        "I shoplifted and got caught. I've never felt so bad in my life.",
        "I am always seeing these ASPCA and animal advocates commercials on TV and it makes me so sad. It is awful the way some humans can mistreat animals. Just horrible!",
        "i felt weird when i didnt have the money to pay for dinner",
        "I had to spank my two-year-old niece today. He wasn't listening and kept doing the same mistake over and over, defying me. I don't like to be physical, and I'm sure others would look down on it, but I didn't feel like I had a choice.",
        "I eat ice cream every time my kids take a nap. That way I don't have to share",
        "I felt bad when I lied to my friend. I was just not wanting to hang out",
        "I'm ashamed to be 28 and still really into gaming and watching other people play games.",
        "I'm ashamed that I don't have more in my savings then I currently do. I need to save more.",
        "After my mom spent hours making dinner for us, I didn't really like it.",
        "I ate my sisters food.",
        "Last weekend, I went to the swimming pool. I was getting out of the swimming pool when my swim short teared from behind. I felt so bad.",
        "I was ashamed that I failed my LSAT and couldn't get into law school so I had to rethink what I wanted to do. ",
        "I was walking along in the park recently. I slipped and fell on a icy spot on the walk and fell right down.",
        "I was unable to answer in the quiz competition. It's a very basic question. I feel guilty for it.",
        "I cheated on my girlfriend in high school. I felt so bad about it.",
        "While walking in the mall I tripped no a carpet and busted my nose on the floor.",
        "my partner and I at work submited a project and I just found out that a lot of his work was stolen.  I cant believe he would do that.  I feel betrayed and embarassed",
        "I'm saving up for a new car but I drive a pretty old and ugly truck around at the moment.",
        "I was walking down the street when a homeless man tried to stop me. He asked me for some money and even though I had plenty money I just ignored him. ",
        "I am ashamed of how much I have gone to the gym recently, I have been slacking since I have been working more",
        "I always eat all of the ice cream before my kids can have any.",
        "When I was at the gym someone got hurt and I laughed. When I found out how bad it was I realized I shouldn't have laughed.",
        "I should be helping chip in on a friend's birthday, but I only put in $5.",
        "I've been stealing internet from my neighbors since I moved in. Kinda feel bad about it.",
        "I ate so much I broke through my Lap Band.",
        "I know I should go to bed. I am too excited for tomorrow. I feel bad",
        "A box of honey buns doesnt last here.  All because of me",
        "My son scold me in public place. I feel shame about it.",
        "I am ashamed to say that I've just eaten a whole packet of cookies",
        "I am ashamed that I ate a whole pack of cookies",
        "cheating on my wife",
        "I stole a candy and was called out on it.",
        "selling a family item",
        "I'm supposed to be eating healthy but last night I ate way too many cookies",
        "hit on friend wife",
        "I broke my mothers vintage tea pot.",
        "I had a long paper due for school last week. I didn't have any time to work on it so I ended up copying someone else's old paper. I really hate myself for this.",
        "I felt ashamed after I huge fight with my best friend that was my fault",
        "At work, while standing up, my pants tear in back. I didn't know what to do.",
        "I have graduated high school this year. I've always been really smart in school however I am extremely lazy so last year I didn't do too well in maths. I retook maths in my final year and got the exact same result as the year before, which meant I didn't get into the university I wanted so I expected better from myself.",
        "I can't get my budget under control.",
        "I went to the store and took a small bunch of bananas without paying for them.  I feel really bad about it.",
        "I lied to a friend over the weekend. It made me feel like a rat",
        "I'm 30 years old, I'm still single, I'm living with my dad, and I have no major plans in life. I feel like crap.",
        "I was teaching my daughter to drive today.  In doing so, I got a speeding ticket.",
        "I have very bad teeth.",
        "I took $20 from my roomie to go on a date.",
        "I was taking a shower at the public pool. I took off my clothes and got in and then finished and realized someone stole my clothes!",
        "I cheated on my math test today. Felt so bad.",
        "A friend called my name at the store.  I went over and introduced them to my daughter but used the wrong name.",
        "I ate 5 pizzas all by myself yesterday. Never have felt so bad about myself.",
        "I cheated on my math test yesterday. Felt kinda bad about it.",
        "I was late to work two days in a row this week, I feel horrinle",
        "I drank all the beer in the house and woke up to my very angry wife.",
        "I am not proud that I cheated on my exam in school.",
        "I couldnt hide the chocolate on my mouth.",
        "I just ate a whole pack of cookies",
        "I got in a drunken rage.",
        "I ate a whole pack of cookies. In one sitting.",
        "I cheated on my math test today. Feels somewhat bad.",
        "I can't believe I ate a whole cake in two days. I feel terrible",
        "The time I broke my mothers favorite vase and blamed my cat instead. It was not good.",
        "I forgot to put gas in my car and I ran out of gas on the side of the road!",
        "I feel really bad.  I cheated on my husband.",
        "I was making a casserole and when I pulled it out of the oven, part of my oven mitt wasn't as insolated and I burned my hand, causing me to drop it on the glass door of the stove and shattering the door.",
        "One time I cheated in a math quiz",
        "The time I didn't make the hockey team I tried out for. I did my best but it was not enough.",
        "I am not happy with the way my kids behaved this summer. They were so lazy",
        "I was taking a bowl of ravioli down the 3 or 4 steps to my dining room and fell and spilled ravioli all over me",
        "I forgot to call the lawn mowers again this week. The grass is high now and I have received a warning notice from my residential administration ",
        "I am not proud of myself lately.",
        "There was a few times but the most memerable and tramatizing time was when i was just a teenager learning about sex and other naughty things a young girl is supposed to be curiouse about anyway i was going thru some of my dads stuff looking for condoms when i found a picture of my dad and another women who i did not know kissng! It was very hurtful.",
        "I can't believe I lied to my brother.",
        "I feel bad I didn't refill my mother's car with gas.",
        "I ate a whole pack of cookies.",
        "I ate a whole pack of cookies",
        "My dog bit a lady's dress and almost laft her naked in the middle of the street",
        "2",
        "I cut someone off in traffic today",
        "I was drunk out of my mind last night.",
        "I should be asleep right now! It's the weekend",
        "I texted a girl for a date. She sent the text to all my friends.",
        " I said the dumbest thing to my crush the other night.",
        "I cheated on a lot on my homework in high school. I flunked out of college just because of that",
        "I cursed in front of my grandmother the other day. I am not proud of my actions.",
        "Back in school, when I was playing soccer with my friends, I accidentally tackled my friend. He was very angry and I felt guilty.",
        "When I scored a low mark on my calculus test. I scored a 50%.",
        "When I got denied my dream school. I applied early too.",
        "I ate the last slice of pizza that my husband was saving. Oops!",
        "When I was running for the bus the other day, I felt a rip, then when I got on the bus, I noticed that my pants had ripped at the back.",
        "I couldnt believe myself, I promised I would quit smoking and here I am doing it again.",
        "Of the way the politics in our country is unfolding, i feel embarrassed. No professionalism and only insults toward each other",
        "I lied to a guy about my age and we have been datin for a while now. ",
        "I can't face my parents :(",
        "I jsut ate three donuts myself",
        "I should never of lied about my job.",
        "I just ate 4 donuts by myself",
        "I took money from my daughter's piggy bank.  I feel so guilty.",
        "I was in a party and I asked a girl for a date. She rejected me and told almost everyone in the party.",
        "I cheated on my best friend.",
        "I stole from my parents as a kid and got caught. I felt so bad afterwards. ",
        "I cheated on my partner. I feel so guilty. ",
        "I baked a delicious chocolate cake for my daughter's birthday. I couldn't wait for the party so took a little piece to make sure it was good. Next think I knew half the cake was gone!",
        "I can't believe I ate so much pizza last night. I forgot about my diet......",
        "I just got a new car and was trying to look cool in it the other day! I miss-judged the curb and totally scratched the rims up in front of people. It was quite embarrassing.",
        "I kicked a pigeon that was on sidewalk as I was walking by. I hate those thiings. ",
        "Today I found a dog that seemed to be lost, but instead of helping him find his owner I kept going because I was in a hurry.",
        "I stole candy from the store yesterday. Feel kinda bad about it.",
        "I cheated on a test once and everyone found out.  I was embarassed that everyone knew about it",
        "I lied to my boss",
        "The time I broke my dads favorite glass while playing. I ended up blaming my dog.",
        "I went to the store but couldn't afford the food that I wanted. I decided to go ahead and steal some things.",
        "I went to a buffet the other day and they kicked me out for eating too much.",
        "One time I cried at work because I was really stressed about a project",
        "I have social anxiety and today while paying for my groceries, I gave the wrong amount of money to the cashier multiple times in a row.",
        "The time I broke my mothers favorite vase while playing around it. I didn't mean too.",
        "I have been eating a lot of sugar free candy recently and it made my bowels loose if you know what I mean. ",
        "When I didn't make the hockey team. i worked so hard.",
        "I dropped the stromboli.",
        "My daughter went on a mission trip in an area that is really depressed.  She came home with lice.",
        "I ate 10 pizzas last night. Never felt so bad.",
        "I totally fell off my diet wagon this past weekend. I ate a whole ice cream sundae by myself and fried foods all weekend.",
        "I ate 12 pizzas all by myself today. I never felt so bad about myself.",
        "I ate 20 Big Macs today. I never felt so bad in my life.",
        "I ate all the brownies I made.  Let's just say I'm not too proud of my self control.",
        "I took 100 dollars from my bosses wallet.  I feel so guilty for doing that.",
        "I failed to pass my exam. It makes me feel bad.",
        "I didn't pay my rent this month because I have some financial problems. The landlord have put a paper on a wall of the building notifying my neighbors that I didn't pay my rent. ",
        "I steal food from my roommate. I always feel bad about it but he makes such good food. ",
        "This one time, we were visiting one of my dad's friends and I hate to admit but I ate the middles of their oreos and then hid the cookies underneath their bed mattresses and couch cushions.",
        "I stole a sandwich from one of my students.  I feel so guilty for doing that.",
        "I ate my son's birthday ice cream cake.  I feel so guilty for my behavior.",
        "I hate how it ended with my last girlfriend. I feel kind of bad when I think about it",
        "I ate all of the leftovers today. It was enough to feed three people.",
        "I went out to a bar with a guy that I have met in a party. This guy was so cheap that he was asking the barman if he can his bring his drinkings from home.",
        "I can't believe I ate so much pizza today... there goes my diet",
        "My friend and I had planned to go hiking last Sunday morning. I overslept and the whole plan blew out. So disappointed in myself",
        "I did all this hard work and my wife still left me.",
        "I ate an entire gallon tub of ice cream earlier.  I feel so guilty for my lack of self-control.",
        "I ate an entire cheesecake to myself.",
        "I tried my best to no do a backflip but i cracked my head open",
        "I can't believe I snapped at a customer today.. but they were being so rude",
        "I am so mad at myself, I made my team lose the softball game.",
        "I am embarrassed that I skipped school to go to the concert.",
        "One time I was at someone's place that I really didnt like. I took something from him and I felt really bad to be honest.",
        "I managed to lose a lot of money through leaving it on the train",
        "When I was in nursing school, I lost my patient's necklace before her surgery. I felt terrible!",
        "I went to church this past Sunday and the most horrible thing happened.  I called my pastor by the name of the old pastor!",
        "I work in a restaurant and I spit on a customers food for the first time. I feel a little bad about it",
        "I was caught having an affair ",
        "I destroyed the house in a drunken rage",
        "Didn't tip at the bar last weekend",
        "I feel bad that I don't like my boyfriends parents. They are just aweful but I don't know how to tell him.",
        "I stole a bottle of wine from the store.  I feel so guilty about it.",
        "I yelled at my dog to come inside. I feel so bad.",
        "I really am embarrassed I lied about my weight.",
        "I was walking on the road. I saw beggar and i did not help him",
        "I remember a time where I was asked to help out with a kids camp as a volunteer and it was about 2 months ahead of time, so I completely forgot about it and ended up not going.",
        "Last week I ate my husband's leftovers.  It was chicken fettuccini and so good.  I pretended I forgot it was his.",
        "I had to borrow money from my parents to pay the mortgage. I am having trouble making ends meet. ",
        "I ate a whole pint of ice cream by myself in one sitting.",
        "I got caught cheating on a math assignment",
        "I was working on a project with some coworkers. I decided to steal someone else's work and pass it off as my own. This made me feel very bad later on.",
        "My son got in big trouble at his school.  I felt so embarrassed when it happened.",
        "When I was a kid I threw a rock at a boy. It hit him on the forehead and made a big gash. I felt so bad about doing it.",
        "I was feeling really badly when my child heard me swear and curse out his father because I was mad he was late picking him up.  I didn't want him to hear me treat his father that way but I was really angry. ",
        "I was embarrased when my shoe peeled off on the way",
        "I felt ashamed when I quit my job due to depression and anxiety problems, a lot of stigma, especiall for men, when dealing with employment (or lack of) and mental health.",
        "i farted in a barnes and noble once and someone smelled it.",
        "I had to wear a scratched up pair of old glasses because I broke my other pair. ",
        "My brother had to go out of town with his family to a funeral lst month.He asked me to take care of his house plant for him and I said yes, but after he left I got so caught up in myself i forgot to water his plants and they all died.",
        "I mistakenly stepped on someone without saying sorry,  and she got furious , people attacked me,  I felt so bad",
        "I once was talking about a coworker behind his back.  It wasn't necessarily an awful conversation; but what I didn't know was that he was working in the next room with the door open.  He approached and asked what I had been saying.  I knew I was caught.  I was so disgusted with myself.  ",
        "I stole my money from my parents more than once and every time I did it because I needed the money badly, but I was too ashamed to ask my parents directly for the money. In the end, I couldn't look my parents or family in the eye knowing what I've done.",
        "I really wanted to go Christmas shopping, so I called in sick to work...",
        "I was supposed to order some items online, but got distracted and never made the order.",
        "I behaved immature during the fight lately and lied, later on I felt remorse.",
        " I felt embarrassed when I went into a boys' bathroom",
        "When I was younger, I went through sort of a rebellious phase. Wound up taking my mom's car for a joyride. ",
        "I dropped soda loudly in the library",
        "Two days ago would have been the 50th wedding anniversay of my first wife and I.  She dies twelve years ago.  Reflecting on my relationship with her I feel bad about the way I treated her on many occasions.  I could have been a more honorable man.",
        "I accidentally took my friend's food and felt very embarrassed after.",
        "I was ashamed when I decided to drop out of school",
        "Reflecting back on my youth, I remember all the times I'd steal candy bars from the convenience store on the way home from school",
        "I'm on a diet and things are going great! I'm trying to get fit for my wedding. One day I'm feeling a little blue, and decide it's a good idea to eat a full bar of chocolate, 3 packets of crisps and a 6 pack of beer. Definitely not helping my diet.",
        "The day my trouser zip spoilt while i was in front of the crowd performing a function",
        "I felt ashamed when I haven't made an effort on my appearance then head outside into the public",
        "My son gets really nervous whenever I have to buzz his hair. It doesn't hurt but he still acts like it's the worst thing ever. I felt bad because I got kind of upset with him when I had to buzz it last week.",
        "Lately I feel like I have let my family down. I have gotten myself into trouble. ",
        "I was eating at this really fancy restaurant, on a date with this guy I'd liked for months. And then my false tooth came out while I was biting into the bread.",
        "Once i argued for a long time over the title of the film with my brother, but then he showed me i was wrong.",
        "I lied to my girlfriend yesterday, and now I feel terrible",
        "I was shopping at the grocery store when I noticed my fly was undone. ",
        " I had to tell a friend recently that I could not go out to dinner and a movie with them because I didn't have enough money.",
        "My mother in law told me not to eat any of her chicken corn chowder before she got home. I tried to move it to get to a loaf of bread and I ended up spilling it all over the floor.",
        "I was once caught stealing from a shop I used to work in. Chocolate bars. I couldn't believe my own actions - I felt terrible.",
        "The first time I met the man who is now my husband I made the worst impression. I got way too intoxicated and ended up getting super sick. I was so upset with myself the next day that I'd made myself look so horrible. He must not have cared all that much!",
        "I was disappointed in myself when I got into a pointless argument with my brother. It wasn't even anything important.",
        "One time in school I had to ask for help on my homework.",
        "One time when I was in middle school, my friend was making fun of me. So, I pulled his pants down.",
        "i got my hair done today and it looks really bad, i was too embarrassed to go out the house. ",
        "My kids first day of school was last Tuesday. I couldn't buy them school supplies until Friday. ",
        "I am so ashamed I walked into my office late and in the middle of a important meeting",
        "when I am walking while texting I didnt see the sign in the street and and fall in the sewer. People seen me and just laugh at me. ",
        "I felt horrible when my football team lost the championship. We were close but ultimately lost the game.",
        "years ago i was stuck in a cycle of addiction and could not take care of my family and responsibilities. ",
        "Had to borrow money from family because of debt",
        "I was watching the Bachelor while eating snacks. Throughout the entire episode, I managed to eat an entire box of cookies.",
        "One time I went out with an old pant and it ripped when I was in downtown. I was very embarrased",
        "I had to attend a meeting on my job performance.",
        "I felt like denying him when I saw him",
        "Recently, I began working at a job location that I am uninterested in. I accepted the job in order to please my father, as well as for the money. I am fully aware that I am not interested in this career field at all.",
        "One time I embarrassed myself by getting a little too spirited and roughhousing with my friend. i ended up breaking my tailbon",
        "One time in elementary school I really needed to use the restroom. I held it in too long and unfortunately I could not make it to the restroom. I ended up peeing in the hallway and right then, my crush passed by me.",
        "I got fired from my job once. I had to ask my parents for help paying rent that month. It was a humiliating and shaming experience.",
        "I got into an argument with my brother. I said things I shouldn't have said.",
        "I made a girl pregnant without marrying her, I feel so terrible because I am a very religious person",
        "i said horrible things to my mother and i regret doing tat",
        "I got really busy last month and completely spaced on my friend's birthday party. She was super upset with me, I felt awful.",
        "I've left my car door open slightly ajar overnight and now my battery is dead. My wife had to take the other car into work, I hope she's not upset with me.",
        "I recently accidentally sneezed on my coworker at work. Her face was absolutely horrified and now she avoids me completely.",
        "I farted in a mall,  I got really embarrassed ",
        "i farted in a board meeting",
        "I was caught cheating on a math test",
        "I felt ashamed when I had finally broken up with a boyfriend of five years.  He was abusive physically and mentally. I was not ashamed that I broke up with him. I was ashamed that I had stayed in the relationship for that long.",
        "I felt bad I missed my grandfathers funeral a while ago",
        "I was ashamed once when I recieved a report card when I was young and I performed poorly. My parents trusted me to do well and I did not do well and slacked off.",
        "I tell my mother all of my secrets and I know she wouldn't tell anyone.",
        "Failing Algebra",
        "Today I was working and doing a little side Mturking. A Co-worker walked in and caught me on the website. I had to explain what it was and that I wasn't working at the moment...",
        "Being a parent I guess it's inevitable to feel shame at many points. I remember several times when I wanted to do something for my child and I just didn't have the money. Once we drove past a spring carnival in our town, which I didn't know was going on, and I had to drive by it quickly before he saw the rides because I simply couldn't afford to take him.",
        "A few months back I make serious mistake during an experiment.  Thankfully it didn't actually destroy the work.  I am still super embarrassed thinking about it.  ",
        "Sometimes in college I used to drink too much and made bad choices which led to regret.",
        "I didn't sleep well last night, and then my son was being extra demanding of attention.  I got upset with him, but realize he'd really done nothing wrong.",
        "when my mom started yelling at someone in the store for no reason.",
        "Two of my co-workers got into a huge fight in a meeting.  I was so ashamed by their abnormal behavior.",
        "My puppy was biting his leash for the umpteenth time and I lost my temper and slapped his snout. I am embarrassed because I'm a grown adult and I know that's not how to teach or train a puppy.",
        "I acted like I shouldnt have the other day.",
        "I farted in a elevator with another person",
        "I am super meticulous about how clean and nice my pool looks, but recently we have had some crazy weather. The last few days it had rained and ton and today I finally got to look at my pool. Im ashamed to say it was green and I couldnt see the bottom!",
        "Back in the school, I got zero in one of the important exam. Everyone expected that I would at least pass. I was embarrassed at that time",
        "When I was younger I used to steal from my dad's wallet. I feel so bad about that now.",
        "i lied to my friend but she found out the truth ",
        "I spilled red wine on my friend's carpet and just moved the rug to hide it.",
        "I was walking on the road and I fell",
        "Once before it was a very hot day out and I had to drive to the store in my car with no A/C and I sweat so much that a had sweat stains on my butt and other embarrassing places.",
        "I ate the rest of my husband's cheesecake. I feel so bad. ",
        "I felt bad this one time because I lied to my buddy. He'd been wanting to see a certain movie with me for forever and I ended up bouncing on him to see it with a cute girl. ",
        "This morning when I met my friend, I had indigestion. I passed gas and it smelled terrible.",
        "I got cought stealing underwear.",
        "I snuck out of the house when I was a teenager and was out untill 4 am. My mom was worried sick.",
        "Oh my gosh, I got home from the store and realized I forgot to pay for my dog food!!",
        "I have a pile of laundry that I have been neglecting. I really need to get busy.",
        "I thought a boy like me once. He later came to me and said he was in love with my best friend",
        "Someone told me something at work that was inappropriate of them. I went behind them and told the manager what was said as I was concerned . Turns out the person was lying about even doing it and was fired for it.",
        "I was talking to my mom and she told me my step dad has been having some heart troubles. I went to their house and finished their garden for them. ",
        "Ever since I was a pre teen I've had the desire to dress as a woman. Unfortunately this has continued on into adult hood and is currently affecting things with my current relationship. ",
        "Well last summer while I was staying with a friend I went to the store to get some food.  I got the wrong change back and kept the extra $20 cause I didn't have a job yet.",
        "when i seen my friends for the first time in 5 years",
        "I pulled out of my driveway during a rainstorm and ran over my neighbors cat on accident",
        "My father died and I was so angry at him. And I felt great shame at feeling that way about the whole situation.",
        "My mom yelled at a cashier and i felt like i should have left her there.",
        "I was supposed to go into work on my day off. I ended up getting sick and had to tell my boss I wouldn't be able to help. I couldn't look him in the eye for a week. ",
        "I stole $20 from my friend recently. I keep meaning to slyly pay them back, but I keep backing out.",
        "I felt guilty when I ate the last two cookies in the jar. I probably should have saved one for somebody else.",
        "Today I had to pick my children up from school. I got in the wrong line for their grade. I was so ashamed. The school made me turn around and come back. I thought i was ahead of the line. Than when i pulled off i ran on the curve and almost got stuck. Everyone was looking!",
        "When the police stop me I felt very bad",
        "I really needed to study for my college math exam but I decided it would be more fun to go out with my friends. I knew I wasn't very good at math and it takes a lot of effort for me. I ended up failing my exam. I felt really bad about myself.",
        "I am on a diet but I am having a hard time sticking to it.",
        "When I ate a small pizza to myself while on a diet! ",
        "I took money from my brother's wallet to buy beer.  I feel really guilty about it.",
        "I had been talking to another coworker when someone else overheard my call the boss fat and ugly.",
        "I had to take a test for work and didnt have time to study so i snuck notes in so i could get a high score. ",
        "I pretended not to hear a friend of mine when she was calling to me from down the road.",
        "Last weekend at walmart the cashier gave me back too much change and i kept it.",
        "I got caught drunk driving.",
        "I went to work today and noticed that my coworkers would laugh every so often. I had no idea why until I returned home and noticed that I had a giant candy stuck in the back of my hair all day!",
        "I got caught taking office supplies from work by my supervisor.",
        "I feel so bad about breaking my moms picture display, it was very elaborate and nice",
        "Yesterday I was not patient with my little brother at all. He didn't understand something and I yelled at him.",
        "I broke my mothers favorite vase and blamed it on my cat. I was only 10 years old.",
        "We had a group meeting at work and there was some leftover pizza. While everyone was getting ready to leave and they weren't looking, I snuck the rest of the leftover pizza in my purse and slid out!",
        "My son wants to join soccer, but I just don't want to have to take him to practices and I am a bit ashamed about that.",
        "I accidentally broke a vase at my moms house on sunday.",
        "I failed my math exam. I am an idiot.",
        "I drank despite promising sobriety to my wife.",
        "I forgot to tip my bar waitress when I was drunk",
        "I ate the last of my roommate's ice cream while drunk.",
        "i have been cheating on my spouse",
        "My 3 yr old daughter was a very vocal child.  She told the cashier at the grocery store, who was a man, that boys don't wear earrings when she saw his earring.",
        "I once cheated on my taxes and i feel bad about it.",
        "of myself for not listening to my fiance",
        "I failed my science test that I had studied hard on. I don't know what to do.",
        "I was spending a night over with my girlfriend at her mom's house. While she was sleeping I ended up having sex with her mom.",
        "took something without paying",
        "I rushed through a school crosswalk yesterday in quite an unsafe manner.  I am fairly embarrased about it.",
        "Once upon a time, I had to write a paper for an English assignment. I decided to procrastinate on the assignment and did not read the literature I was supposed to. I decided to use the internet to help me write my paper and my paper was flagged for plagiarism. I felt so bad for not taking the time out to read my assignment.",
        "I blamed my oldest son for losing my headphones, but it turns out it was my fault.",
        "I ordered take out every day this week. I havent made a home cooked meal in a while. Its kind of bad.",
        "I ate my brother's last piece of birthday cake, knowing he really wanted it. It made me feel bad",
        "I told my crush that I was into her and wanted to take her out.",
        "I was in a taxi and a farted loudly. i did not mean to but i had been sick",
        "Yesterday was my sister's birthday and I totally forgot to call her until today.",
        "When I was a little kid I almost drowned in front of 100 people.  I was more embarrassed than scared to be honest",
        "It was my last cash and I went into subway bought a sandwich came out and it fell.",
        "I can't believe I spent all of my paycheck shopping. I know better",
        "I have a small party at my house last night and didn't invite my best friend.  Now I feel bad about it.",
        "I accidentally told my best friend's secret to a mutual friend. I feel so bad about it because I know it was wrong!",
        "i sometimes feel badly for the way our clothes and home look",
        "When i was younger i forgot to pay for a candy bar before leaving the store",
        "i felt that i had to let it go because my son did a stupid thing ",
        "The other day i ate my wifes leftovers. While she was asleep.",
        "One time I lied about being sick so could skip work.",
        "My husband was asleep and i ate his leftovers",
        "I clogged the toilet at work yesterday. I had to take a huge dump and there was nothing to do about it. The toilet couldn't handle it. I couldn't fix it, either. So, I just quietly whisked away. I feel bad for the janitor that has to deal with it.",
        "Last week I stole a donut from my boyfriend's desk",
        "I am upset with how I acted at work the other day, I lashed out when I should not have",
        "I ate my wife's leftovers while she took a nap.",
        "I ruined my friends wedding because of my drunken behavior ",
        "My friend called me out for being noisy and rude. ",
        "I failed my drivers license exam because I didnt pay attention to oncoming traffic. I was so mad.",
        "My friend i brought to a show and he made a fool of himself.",
        "I felt so embarrassed yesterday. I walked out of the bathroom with some toilet paper stuck to my shoe.",
        "When I was at gym, my pants has torn from behind. I felt bad about it."
    ]
}