{
    "threshold": 0.8,
    "seed": [
        "I can not believe I forgot my Anniversary.",
        "I was on date last weekend and got bad gas.",
        "I slipped on a puddle and landed on my back in the middle of the mall once. All I could do is pretend that I was hurt to avoid embarrassment..",
        "I drank too much soda, so now my teeth look bad.",
        "I kind of felt ashamed today when I realized that others might think I'm stupid. I can sometime be loud and rowdy for no reason. Maybe just to prove a point.",
        "I cant believe I got a DUI this weekend, I let myself down.",
        "I am a stay at home mom and my son is always with me. Sometimes he uses language like I do, curse words.",
        "I can't really recall the last time I felt any kind of a remorse. And this makes me fell bad, or at least strange.",
        "Peed the bed",
        "I ruined my date with a beautiful woman.",
        "I felt really embarrassed when my grandma walked in on me and my girlfriend the other day.. Was so awkward!",
        "I was walking down the street in my lovely new flowing summer dress.  I thought I was just gorgeous.  Suddenly there was a gust of wind which blew my dress up round my ears and I succeeded in flashing my underwear to the whole street.  I was mortified!  So embarrassing.  I got a cheer fromm a group of lads while I had a big red face and tried desperately to pull my dress back down.  I then ran home.  I told my friends and was finally able to laugh about it and see the funny side but at the time I just wanted to run and hide forever!",
        "The other day I was riding my bike and totally wiped out when I was turning the corner. Admittedly, I had a couple beers before I decided to go for a ride. I felt like an absolute dork.",
        "I haven't drank beer in almost a year.",
        "i didn't ask my husband if i could buy something, now he is mad and i feel bad.",
        "I hurt my back and can't mow the grass so it's getting long and everyone elses lawn look so nice. It's embarrassing. ",
        "I made a big mistake on a project for work. Now I'm afraid that it will hurt my career.",
        "Going to the doctor for the first time since 2001 tomorrow. I'm dreading telling the doctor how long it has been since my last visit. ",
        "I spend all day in bed yesterday, I feel bad for that.",
        "I had to get it off my chest that I have been cheating on my wife. ",
        "I racked up a lot of money on my credit card shortly after paying it off.",
        "Humanity sickens me",
        "One time during kindergarten, I really needed to go to the restroom. The teacher did not let me so I soiled myself",
        "I slacked off at the end of college semester and flunked the class I'm so much better then that I feel so regretful about not giving my all. ",
        "THe other day I got into an argument with my 19 year old son.  I became so angry with his behavior that I called him names and said things i didnt mean.  I still feel badly about it.",
        "Thanksgiving was a huge embarrassment for me.",
        "I accidentally knocked a little kid over when I was coming out of the grocery store the other day. I shouldn't feel bad as it was a total accident but I do.",
        "I feel so bad, I cheated on my test today and got caught.",
        "I feel so bad for lying to my husband.",
        "Last time I got really drunk, I told my girlfriend that I thought her best friend was really attractive. I felt so embarrassed the next day, but she forgave me because she knows I'd never do anything wrong.  ",
        "I finally told my friend I was into him. I was so embarrassed to do it. He rejected me. ",
        "just now I ate a half a big bag of peanut M&Ms. I tried to resist, but could not",
        "I spent all of summer doing everything but studying for my final exam. I'm pretty sure I'm going to fail it and I feel awful about myself.",
        "One time when I was in Kindergarten, I needed to go to the restroom. The teacher did not let me, so I peed myself",
        "I haven't been following my healthy eating regiment as strictly as I should. Even though I don't need to lose any weight, I want to be healthy and cheating on this diet makes me feel bad.",
        "I walked into work very late and the clinic was very busy. I was so embarrassed. ",
        "I failed one of my classes' finals. I definitely did not feel good about it when I found out I failed.",
        "Someone twisted what I said earlier today to make it seem like I was saying something else. I felt really bad, even though they were lying. ",
        "I was supposed to go to a meeting today.  However, I skipped it.",
        "I was really drunk and messed myself",
        "When I was a teenager I used to borrow my big sisters clothes when she was out.  Then i would put them back before she came home and she would never know.  This one time she had bought a new dress.  She had saved all her wages for this dress.  That weekend I borrowed it and of course ripped it on a nail.  The next day when she found out she was so angry.  I felt terrible, so guilty.  Needless to say I never did borrow her clothes again!",
        "I remember one time when I wore a Halloween costume that I'd been looking forward to wearing.  But I spent the whole night covered up in a cape, because I was self conscious of how I looked in it.",
        "of my father",
        "what a joke i am",
        "I didn't start grad school after telling people that I was going to.",
        "Walking to a restaurant i didn't hold the door for an old lady coming in. I felt so bad afterwards, I hope she forgave me.",
        "I was disgusted when my dog tried to attack another dog.",
        "I felt bad that I lied to my friend and said I didn't care when I really did.",
        "I got into am argument with my husband and I realized later that he was right but I never apologized. ",
        "WHen I was a teenager I was extremely angry with my mother.   I often treated her with disrespect.",
        "One time I pooped my pants when I was trying to fart",
        "One time I stole something from the grocery store when I was little",
        "when I was younger I was ashamed that I went into a comic book store with a good friend of mine and tried to steal a lot of comic books but luckily I was caught ",
        "I got really drunk on my birthday and was horrible to one of my oldest friends, i felt awful ",
        "The officer yelled at the old lady",
        "Last week I missed class because I was hungover, I needed to attend that class to pass. I failed.",
        "I was outside a store in a super cute dress.  I didn't realize it would be windy and my dress BLEW up in front of everyone! Including kids! I've never felt so embarrassed and like a horrible person. I haven't worn a dress since.",
        "I felt a bit sad when i saw an elderly man drop his wallet and a kit picked the wallet up and didn't give it back to the man",
        "yesterday i ate a whole big bag of M&Ms, i don't feel proud of myself",
        "I bought something from the store and the lady gave me the wrong change. She gave me too much change actually. I did not realize until later after I left the store.",
        "i was upset at myself for sleeping in so late this morning",
        "i forgot to pay my credit card bill, I'm so disappointed with myself.",
        "When I was a little girl I would have to wear shoes with holes in it. Everyone made fun of me all the time. My family could not afford much.",
        "didn't submit my work on time",
        "I feel so bad that I forgot again to fill the gas tank up in the car again after I used it all. My friend is going to kill me!",
        "One night I came home a little drunk from the bar and stole my neighbor's package. I'm not even sure why I did it. I felt like an idiot when I had to give it to them the next day.",
        "I once drank 6 pints of beer in a night and ended up getting very sick. I felt so bad about my actions, but it hasn't stopped me from doing it again.",
        "I feel ashamed of all of the years of my life spent as a cigarette smoker",
        "I am in charge of scheduling meeting room use at my job. Once, I made a really big mistake and gave a group a room that they shouldn't have gotten. I was mortified because this was one of my main responsibilities and I managed to really mess it up!"
    ]
}