{
    "threshold": 0.8,
    "seed": [
        "I'm an introvert, so being faced with a new situation and new people puts me on edge.",
        "I was very anxious when my son had his tonsils taken out",
        "Fair rides make me nervous.",
        "I was about to check my result so I had an anxiety to checking it",
        "i will be having an exam next week",
        "I was so curious about being alone",
        "My son is starting kindergarten in a few weeks. I'm wondering how I will handle that as a stay at home mom.",
        "I was very nervous to fly on a plane.",
        "my cousin had a heart cath and the surgeon sent for me to come to the operating room.",
        "New superintendent has joined my school system.  Every superintendent has his/her own expectations, and you never know what type of impression you will make.  Today was my first lengthy meeting with him.",
        "Heading to Colorado next week to climb Elbert.",
        "I was recently waiting to hear back from my old apartment about my security deposit refund. I needed the money for some necessities for my new house, and wasn't sure if I'd get enough back.",
        "i felt anxious when i do ,my work in office",
        "I couldn't wait for my mom to get here from New Jersey.",
        "I'm pretty worried about what the future will hold. I hope it's bright!",
        "next week i will be presenting my project",
        "ive been feeling really nervous for the past few days and i cant quite tell why, Nothing is specifically going wrong but on the other hand it feels like something is going wrong ",
        "I was so tired when I went to change the bird food, the bird water bottle cracked on the ground",
        "i was nervous about my car overheating ",
        "im nervous about an interview next week",
        "I start back at work soon. The beginning of the school year always has me on edge.",
        "I felt really nervous when cops pulled me over last week. I thought i was in trouble",
        "I had to give a presentation at school.",
        "I went on a blind date.",
        "I had a job interview the other day. I was so nervous but excited at the same time!",
        "I was so worried about getting on the roller coaster at the fair but I couldn't let my family know it so I got on anyways. ",
        "I sent an email I shouldn't have sent, and for about a week I obsessed over it. Thankfully nothing came of it and all that worrying was for nothing.",
        "going to the dentist",
        "I couldn't get any sleep last night.  Something was scratching on my window.",
        "I have a job interview lined up for next week. i am feeling so nervous about it.",
        "im a little nervous about my court date tomorrow.",
        "I am really nervous about my upcoming job interview. I am concerned i might screw it up",
        "i am nervous for a meeting i have later",
        "im nervous about taking a test soon",
        "I've got a lot of bills that are overdue, and can't afford to pay them yet. I'm really worried about my financial future right now.",
        "A close friend said she was having problems with her knee.  I hope she goes to a doctor soon",
        "I'm running my first Marathon Sunday. I'm scared that maybe I did not train hard enough. ",
        "My car has been acting strangely lately.  I hope it doesn't break down on the road",
        "After having 4 interviews none of the employers had called me after 1 week which stressed me out. ",
        "I had a job interview and was anxious to get it over with.",
        "I had a job interview and wanted to just get it over with.",
        "I am nervous for my college test.",
        "I was excited to go to a concert tonight but couldn't get myself to go by myself at the last minute and so I bailed. I'll probably regret it.",
        "I had to explain how something works at my job in front of a bunch of people. I'm not a fan of talking in front of a crowd.",
        "My brother and sister are having a baby and today is the gender reveal. Our family cant wait to see what the gender is. ",
        "We have homeschooled our daughter for the past 3 years. This year, she has decided to return to public school.",
        "I am worried about take my finals this week.",
        "im nervous for the new week to begin",
        "I was planning on going to a concert last night but I didn't go because I ended up not wanting to go by myself. I feel like I'm going to regret not going.",
        "I have a dentist appointment tomorrow and it's starting to make me a bit nervous.  I have to get a filling replaced.",
        "I got laid off a few months back and was really worried about paying my bills. It was consuming me. But I ended up getting a new job the week my unemployment ran out!",
        "I'm going to job interview Thursday. I'm currently employed but I'm ready to move on.",
        "I have a Dr appointment tomorrow to make sure my cancer is still in remission.",
        "I have a meeting with my boss in a couple of hours. I have no idea what it's about, so I'm kind of nervous.",
        "I am nervous about my 5 year old starting kindergarten.",
        "I can't stop thinking about getting back my results from the cancer doctor. ",
        "I can't hardly wait to see if I really did win the lottery.",
        "The other day I wandered into a strange neighborhood, I couldn't wait to get away from there.",
        "I was nervous for my mom's surprise party",
        "I will be going to New York Next week. I cant wait!",
        "I have a very hard time taking tests. When I know I have an important exam coming up, I worry for weeks in advance. ",
        "A few months ago, a good friend of mine that I look up to attempted suicide. Thankfully he survived and is doing much better now, but I just felt so shaken up by the whole thing.",
        "One time I was so nervous to look at my grade for my final exam ",
        "being alive",
        "I have to talk to a large group at work tomorrow. I'm not looking forward to it.",
        "i have a tooth ache. I need to go to the dentist but do not want to.",
        "Today was a big deadline at work.  We have various support responsibilities, so I was worried that it may not go as well as planned.",
        "I was very nervous for my first day of freshman year in college.",
        "One time I went to the doctor and I was really anticipating my test results for cancer!",
        "i'm starting university in two days and i'm kind of stressed",
        "Waiting for the final grade report to come in for my classes. I was scared that i was going to fail my Organic chem class.",
        "My girlfriend is moving in.  I was pretty calm when we first started talking about it.  Now I'm excited but there is so much to pack up!",
        "My sister is having another baby! I can't wait to meet her! This will be her fourth child.",
        "I went to the dentist yesterday to have a cavity filled.  I was extremely nervous about going after being told that it was close to my nerve.",
        "Last summer when I took my drivers test, I was so nervous that I would fail.",
        "I cannot wait until the weekend is here! I am going skydiving for the first time!",
        "i have to give a presentation on Monday, I don't think I'm ready",
        "can i do it alone?",
        "i am moving out of this country soon and i'm worried about my university",
        "The other day I forgot to take my anti-anxiety medication. It didn't affect me too bad until the next morning.",
        "I sent an email to a family member I hadn't spoken to in a long time, I really didn't know what they'd say or how they handle it. Waiting for a response made me quite nervous.",
        "My son had to have surgery to remove his tonsils last month. I know it's a routine procedure, but I could not sit down for the entire time and I was so relieved when they said everything went just fine."
    ]
}