{
    "threshold": 0.8,
    "seed": [
        "I felt a bit terrified when i was hit by a drunk driver last year but i am very grateful to be alive to today",
        "I am not afraid to admit this: I am 32 and afraid of the dark. The other day, my electricity went out due to a storm. It was dark, I couldn't find my phone or a light, so I screamed for my girlfriend to wake up. Am I embarrassed to say that, not at all, lol",
        "A spider dropped down in from of me while driving once. I almost lost it.",
        "I have a solo trip coming up. I'm going to Colorado to clim Mt. Elbert Solo",
        "Lately, my two year old boy has been so much into wearing dresses and playing with babie dolls,i don't even want to think of it.",
        "I am worried about failing my exam",
        "I feel scared of the future because it's so uncertain. I feel like I always have a lot to lose.",
        "i dont like hospitals",
        "I was in a back room and heard a noise everyone else was in bed so I thought maybe someone was in the house. ",
        "When I was zip-lining in Thailand, a tree close by fell. A large piece of the branch hit the platform we were standing on. It was fine, but we were all eager to get to solid ground after that.",
        "I was so frightened when it was thundering last night the loud sounds seemed like my house was shaking.",
        "Last week there was a large spider on my wall.",
        "I felt scared on a plane ride. I was traveling by myself.",
        "Last week my dog got really sick.",
        "I was very scared when flying for the first time.",
        "I was scared of going into the caves",
        "Last week I got bit by a spider.",
        "one day for that time my sister marriage to vey afraid.",
        "Walking through a dark trail",
        "I was walking down the sidewalk at night.  I thought I saw the same car following me from a distance",
        "i was worried when I heard my friend was in the hospital",
        "Last year, someone was kicking on our front door late at night. I looked out the window apprehensively to see it was my cousin.  She was drunk and had knocked but we hadn't answered.",
        "I rode a roller coaster.",
        "im scared that we will go to war soon",
        "I've recently visited a 800 year old city, the architecture there is so beautiful.",
        "I was so scared when i went to watch the new conjuring movie in the theatres at night. The movie was terrifying.",
        "I was so scared when i went to watch the conjuring movie! The theatre was so silent other than the terrifying sounds coming from the screen",
        "recently i went for a wildlife safari ",
        "I was a little nervous to go to Walmart today with all the police that were there. ",
        "Riding a roller coaster",
        "i am concerned about my father",
        "One time I moved into this new apartment, it was a converted loft in an old warehouse. On my first night, my soap dispenser in the kitchen malfunctioned and started squirting soap everywhere, the sound spooked me so bad!",
        "Last week, I got pulled over for speeding. I was in a hurry to get to work.",
        "About 6 years ago I was diagnosed with cancer.",
        "I'm scared to move",
        "I was terrified when i went to watch the conjuring movie in the theatres. i went at night and alone as well.",
        "I am scared that I won't be able to get up tomorrow morning.",
        "I am frightened that i will lose my job.",
        "I keep hearing noises coming from the basement. I want to go check it out, but I'm somewhat afraid.",
        "I've got a pet hamster that hasn't been doing well. I'm scared that he might not live much longer.",
        "im scared of this big test tomorrow",
        "I just turned in my dissertation. I'm scared it will not pass and all my work toward my masters will be for nothing.",
        "I got an phone call from someone I used to know. It was threatening in nature, and I am scared.",
        "im worried about an upcoming test",
        "I was very worried the they told me I needed heart surgery. ",
        "my sister is going for surgery",
        "Recently a man tried to break into our house.  It was late at night, and he was kicking the door.  My entire family was scared as we waited for the police to show up.",
        "I left my room at night and a bat flew at me.",
        "Wow, a day I was trapped by court group and the gave me a knife to stab someone I don't kn.",
        "We went camping in the mountain. We did not know it was bear season. There were a lot of hunters and hunting dogs in the area. They were chasing the bears into one area.",
        "I am not sure I am brave enough to walk alone at night anymore.",
        "There is an abandoned school an hour drive from my house. It is said to be haunted. A group of friends and I decided it would be fun to go check it out. Once we arrived, I was so scared that I could not even get out of the car!",
        "I went to Cuba to visit some family members and met up with some friends to go to a bar. It was like 3 AM when we were walking back home and there were these guys hiding in the shadows looking at us. We ended up running very fast but they never followed thankfully.",
        "I accidentally dropped my phone and the screen started glitching out and the phone didn't want to turn on anymore.",
        "there was a time that I came home and my lights were on in the house and my door was unlocked and it had me really scared, I had my cell phone ready to dial 911 but noone was in my home and I never did figure it out",
        "My cat hasn't been feeling well this past week, I think there might be something really wrong.",
        "I am scared of another hurricane coming through Florida. I had a bad experience last year. ",
        "We moved into a very old house that was built 200 years ago. Every creek and crack is spooky.",
        "For the last three nights I've been hearing really creepy sounds just outside of my bedroom window. I'm not sure what it is but it's scaring me.",
        "One time I heard a large knock on my door while I was sleeping",
        "Me and my husband watched the new scary movie IT and I was kind of frightened.  ",
        "I don't like the dark. I am worried about something bad happening.",
        "My brother is getting out of jail next week. I'm afraid that he knows that I'm the one that turned him in...",
        "I was scared of the spider in my bathroom.",
        "I don't think I could ever go outside when it is dark ever again.",
        "This year has seen more tornadoes in my area that almost any year in history. We have spent many evenings in the basement waiting till storms have went past.",
        "I think I am going to have to serve on a jury and I am terrified.",
        "This year we have had a record number of tornadoes in our area. It really freaks my son out when we have to go into the basement while it storms outside.",
        "I was lucky enough to get an opportunity to volunteer for one of my favorite companies at a convention. I was so scared of doing something wrong or looking like a fool but eventually I gained confidence and did well.",
        "finance",
        "This weekend Im going to go sky diving with my best friend and I hate heights!",
        "My brother went on a low-calorie diet and began shaking everyday. I was a little scared for him, but I knew he'd be fine once he changed his diet to a proper one as the doctor recommended him to.",
        "afraid of not giving too much",
        "I changed my shift to overnight and I get so scared walking to my car since we have a huge parking lot. ",
        "When I went camping I ended up getting lost in the woods by myself for a while. It was not a pleasant experience.",
        "One time there was a homeless guy running towards my car",
        "I am scared of spiders!",
        "One time when I was little, I was scared of going to sleep without a night light",
        "Lately I hav been hearing some big monkeys howling up in the mountain. I hope they don't come down near my house.",
        "i have to go out of town, i am not looking forward to flying",
        "When my son was born, I was pretty worried.  We knew that something wasn't quite right, so we weren't sure what to expect.",
        "I was playing a VR game home alone.  It took a really creepy turn.",
        "I heard a really loud bang in the middle of the night. the next morning I found out that it was gun shots. OMG",
        "There might be a hurricane in my area soon. I am worried our house may flood and we may be without power for awhile.",
        "I am very fearful of dying. I know it will come one day, I just hope and pray it doesn't hurt so bad.",
        "my feelings might hurt me in the future",
        "i saw cat the other day, i got so scared",
        "i have to take a business trip next week, I 'm not looking forward to flying",
        "Yesterday I found a massive spider in my room. As much as I hate killing insects, I tried killing it and it ran away. I don't know where it went and I'm a little scared."
    ]
}