{
    "threshold": 0.8,
    "seed": [
        "I have a tendency to be praticular about my stuff, so it was culture shock when my girlfriend moved in with me. She started moving and rearranging my things. I was very apprehensive at first.",
        "I am always more cautious when driving at night, and when it's raining.",
        "a friend/customer cheated me out of a large sum of money. she works at the corner grocery where I shop often. I became very uneasy when I had to shop there.",
        "We need a new roof and it seems like so many roofers have good and bad reviews. Trying to find one we can trust has been hard. ",
        "I was pretty unsure of myself when learning to ride a bike at 15",
        "Doing a race with the wrong shoes.",
        "When I saw a snake and didn't know if it was poisonous. ",
        "I was scared to drive for the first time.",
        "My girlfriend invited me to meet her parents.",
        "I was going to fly alone. I felt a bit wary. ",
        "My mother in law asked to take my daughter to Colorado with her, but I wasn't so sure about it.",
        "My cousin invited me to go white water rafting with him.",
        "I was scared to go to school",
        "I have a work project that needs to be completed.  I'm worried I won't be able to finish it",
        "We were in a small fender bender the other day.  Now when I'm driving, I am scared that I will be in an even worse wreck.",
        "I was taking a stroll at night and saw a group of guys up ahead.  I ended up just turning around",
        "First time at a karaoke bar.",
        "Going to the dentist",
        "My friend invited me to a pool party, but I can't swim.",
        "i have a new job offer, but im not sure if i should take it.",
        "I was going on a trip and couldn't take my dog so I had to board him and I was so worried about it.",
        "I moved cross-country several years back. I was a bit scared to do it because I didn't know many people but I'm glad I took the risk.",
        "I saw a psychiatrist. ",
        "My daughter asked to borrow my car. I'm not sure it's a good idea.",
        "A few months ago I started a new job, and I was extremely nervous about it.",
        "my dad is going to get his heart checked tomorrow. i am so nervous about it.",
        "I would love to buy a travel trailer, but I'm not sure if it would be a good idea.",
        "I am feeling so nervous about my dad going to check his heart tomorrow. I really hope no bad news comes off it.",
        "I've been at my current job 5 years. I'm at the point I can go into upper management but I'm afraid. Maybe I'm just comfortable now. I don't know. ",
        "My car has been having problems.  I'm worried it won't make it in the future",
        "I'm going to my favorite restaurant tonight. I'm thinking about ordering something that I haven't eaten before, but I'm not sure if I should.",
        "I was really apprehensive when I went to university at the age of 30. I was scared that I wouldn't be able to connect with the younger students, and that I wouldn't be smart enough to do well. I was also unsure if it would advance my career.",
        "I started a new job last month I was very nervous on my first day. ",
        "I had to call the insurance company after a car accident and I was worried about all the questions they would ask. It made me very nervous",
        "I'm scared to go to the cottage",
        "My step-daughter turned 16, and I'm not confident in her driving abilities.  She gets too distracted by her phone.",
        "I decided to go back to school for a career change after working at my job for 12 years. I didn't know if I was making a good decision.",
        "I have never been to a haunted house, but this year I will be attending. I'm very worried about it.",
        "I am not sure I may see about chaning my son's teacher.",
        "My friends invited me camping, but I was scared to go; it was in the woods and I was afraid I might get a tick bite, seeing as ticks are on the rise.",
        "I started my first office job after college and didn't know what to expect.",
        "I am suppose to start a new job tomorrow.  I am not sure I am going to like it.",
        "I was getting ready to fly to Dallas for a meeting with a client when I heard there were bad storms on the flight path.  I ended up renting  a car because I hate flying so much.",
        "My ex took me to six flags and wanted me to ride a really high roller coaster. I hate heights so I really wasn't sure about it.",
        "going into a dark alleyway to get home from school",
        "I was driving at night in downtown and the GPS told me to make a right, which was a very dark and scary road. ",
        "I have been having a lot of anxiety lately. I made an appointment with a psychiatrist",
        "I had a septic tank issue and called a guy that I found a business card from and had him come out. He didn't have hardly any equipment with him and sounded like he didn't know what to do. ",
        "My friends wanted to bring me to laser quest for my birthday. I wasn't sure if I'd like it, but we ended up just staying at his place and had fun nonetheless.",
        "i have a impacted wisdom tooth. I need to go to the dentist but I am apprehensive about it.",
        "A few years ago, I was invited to Rockfest by my older brother and his friends. I love punk-rock bands but it was my first show and I was a little scared to go.",
        "My boss tells me I need to go to school to become a doctor instead of nurse, but I feel its alot of time and money to do so.",
        "When I started college I moved to a new state where I didn't know anyone.",
        "walking at night",
        "I have such a fear of heights.  So when my husband kindly bought me a skydiving voucher for my 30th birthday I was slightly anxious and uneasy.  I of course thought of the worst! I travelled up in the plane with the lovely instructors who of course tried everything in their power to reassure me but to no avail. I was so nervous and panicky.  However I am so glad I did it!  After the initial panic when we jumped, it was actually one of the most amazing experiences of my life!",
        "im scared and anxious about the future",
        "I was hesitant to go to the doctor for a cyst I found.",
        "I was driving on the highway in really thick rain, barely any visiblity. I had a bad feeling something bad was going to happen, and no more than 10 minutes i witness a car crash happen in front of me where a car flipped.",
        "I was nervous for my first day of college.",
        "I like to work with people who are fast on their feet and get things very fast.",
        "I need to go to the grocery store but it is storming outside. Not sure if I should go or not.",
        "The other night I had to walk home alone late from work, I was nervous.",
        "I was at Wal-Mart the other night and a man came up to ask me for gas money! I was a bit guarded because he exited a vehicle that had two other men in it staring.   It was weird.",
        "i have a presentation due this week, I am not looking forward to presenting it in front of others",
        "There was a random dog in my yard the other day.  I was a bit nervous to get too close to it even though it seemed friendly.",
        "I was driving the other day and my gas tank was super low. I thought I could make it to school in time but decided that running out of gas was the bigger problem.",
        "Several co-workers said they wouldn't be able to come to work.  I hope we don't have any major assignments to do",
        "tomorrow is my first university day and i'm very nervous",
        "upcoming events scare me to death",
        "I feel a little weird about looking at this house for sale. It looks haunted and I think something bad happened there, but not use",
        "I went biking on a new bike trail the other day. It was a lot of fun but I didn't know the route or the hills, so I was really reluctant to go too fast lest I wipe out on a curve.",
        "I never learned how to ride a bike. Last summer, my brother had a bike that he wanted me to try, but I was too scared to try riding it in fear of falling.",
        "I am starting school in 2 days."
    ]
}