{
    "threshold": 0.8,
    "seed": [
        "I was reversing the car in the roadside. I had bumped into the car which was parked behind. I had to wait for so long to speak to the car owner",
        "I heard a car outside that sounded like it wrecked yesterday. It sounded  awful.",
        "Today is my birthday. I can't wait to see who calls me. Or my gifts.",
        "I cant wait to relocate again. ",
        "in a hurry to go on vacation! ",
        "I can't wait for HAlloween. It is my favorite holifay. I love dressing up with the kids.",
        "I'm doing a drink a paint session this weekend. I can't wait. It's goin to be fun!",
        "I went on my first date ever only about a month ago. Even though I knew this girl really well beforehand, I was still really worried that it would be awkward and that I might mess it up.",
        "I have a job interview coming up next week. I'm a little nervous about it.",
        "I am stressed by my blood test results that I will receive tomorrow.",
        "Yesterday at the doctors I had to get a shot.  The worse part was the anticipation while waiting for what seemed like forever for them to come in and give it to me.  It was emotionally draining.",
        "I had to have some tests run due to an unclear mammogram.  It took days for the results to come back and thankfully they were all clear.",
        "Just injured my ankle. Now I can't work. ",
        "My daughter was thrown from her horse a few months back.  We took her to the hospital and it took hours to make sure she was ok.  Those were a long few hours.",
        "Having an existential crisis and realizing I'm going to die and there's no way to know what will happen when I do",
        "We made the decision to homeschool our girls.  It's a tremendous responsibility and I still don't think I've got it all together.",
        "The result of my final college exams was to be published the next day,I could hardly sleep due to expectations",
        "The night before a job interview I have a difficult time sleeping. I get too nervous about meeting them",
        "I was really nervous when starting a new job a few months ago..",
        "I am finding it hard to meet the project deadline. And this makes me anxious and stressed throughout the week",
        "I have applied for a job 4 months ago and I am having an interview with the company tomorrow. I do not know what i will see there as it is my first interview ever ",
        "I am so nervous.  I am going to the dentist to have a tooth pulled tomorrow.",
        "I am so nervous about my upcoming surgery. I have never had to have a surgery before. I just hope everything goes right!",
        "I am really nervous.  I have to take an important exam next week.",
        "I'm awaiting eagerly to meet my friend. She is coming to my home to meet after 5 years later.",
        "I once was in a car with my friend who was really high and I was pretty scared. I thought that he would drive really badly but he didn't, but it was still worrying.",
        "My girlfriend sent me a gift and it will get to me in 3 days. I cannot wait to see what she got for me",
        "I am so stress. Tomorrow, I will have my final exams.",
        "I am stressed. My wife is expecting a baby. I am happy but at the same time I feel littlle stress by the responsabillities.",
        "I am always cuios about the things i dont know",
        "I always feel anxious in a crowded room",
        "I just watched the testimony of Peter Strzok before congress today. It was quite a show, to see his behaviors unraveling, almost as a sociopath or psychopath would do.",
        "I have a test tommorow.",
        "A couple weeks ago, I was up for selection for a promotion at my job. I have been preparing for the promotion for the past couple of months. The days leading up to the promotion board were very high strung and I was very anxious.",
        "The first day of my new job, I was very anxious. I felt like it was just a completely different world.",
        "my daughter is going to order a pizza. I am so hungry.",
        "The kids are going bac to school next week. I can't wait!",
        "I had an exam to write that I was not well prepared for ",
        "I was unsure how I was going to argue a case in front of my boss.",
        "I can't wait for school to start back. A litlle quieter in the house.",
        "One time I had to take a trip away from home for three weeks, it made me very nervous.",
        "I feel very nervous during interviews",
        "My son will have his 18 months shots soon",
        "I haven't heard from my girlfriend in 2 weeks. Wonder what's going on?",
        "coped pulled me over for going 90 in a 65 and i thought i was going to lose my license and maybe get arrested.",
        "I had to wait in line for food at the mall but all the people sitting and eating made me nervous.",
        "i cant wait to hear if my house sells. i am so nervous ",
        "I was hit by a tornado in the middle of the night and now I can't stand big storms.",
        "ready for my house to sell ",
        "My dog got into some grapes the other day when my toddler had hid them in a toy and the dog found them. I know grapes are not good for dogs! It made me so nervous!",
        "I have to take a foreign language class for college, and I'm not sure how well I'll do",
        "I was anxious when I applied for grad schol, I did not know if I would get in",
        "I was anxious when I applied for graduate school",
        "Waiting to hear what the loan officer says on my home loan application",
        "to get hired at a new job ",
        "I was worried when my dad was in the hospital. It just made me nervous",
        "I cant wait for school to start. I am so excited",
        "I have an important job interview and i am nervous about it.",
        "Really don't want to start my new job in a week. It's at a fast food place and I don't know if I'll be able to keep up with demand.",
        "I am going to look for a job as soon as school starts. Im excited.",
        "Tomorrow I start my new job.",
        "I am so ready for the first Monday Night Football game.",
        " I am always anxious. One example at stores sometimes. or maybe about making enough money.",
        "I entered my name in a raffle at church. I cant wait to see who wins.",
        "I have a huge work presentation coming up Friday and I am very nervous.",
        "Back when I was in school, i studied really well for an important exam. But, still I was so much worried about my test test results.",
        "I have a toothache. It has been getting worse for the past month. I don't want to go to the dentist though. I hate going.",
        "I found a snake in the yard a few days ago.",
        "Work has been slow lately, making me stressed.",
        "I think it's funny how I got the lead role for \"The Selfish Giant\" in my elementary school play....I was the shyest kid in my class and was really nervous at first...but I nailed it twice and had parents and teachers crying when my character died, it was hilariously cool",
        "I had to go to the doctor recently to get something checked out, I was definitely nervous about the outcome.",
        "I always get nervous when I drive. The possibility of getting into a car accident is nerve wrecking.",
        "I had to get something checked out at the doctor recently, always makes me nervous.",
        "I really hate when I have to wake up early for an appointment. I fear I will sleep in and miss it!",
        "We submitted our proposal for the new project and hope we get it. It would be such a high profile project that would get us a lot of  new clients if successful.",
        "I have a court date next week and I don't know what's going to happen.",
        "I just took an English teacher certification test.  I can't wait for the results to come back.",
        "I hate storms so much. We are supposed to be getting bad storms tonight. I have a feeling I won't be getting any sleep.",
        "I have a math test tomorrow. My stomach won't stop churning.",
        "I am worried I won't wake up to my alarm",
        "i get anxious when my girlfriend says we need to talk and then it turns out it's nothing big",
        "I am so ready for September.",
        "I can't wait to get my paycheck. I'm going shopping.",
        "I presented a watch to my mom on her anniversary. She missed it in a month. I was angry on her and scolded her.",
        "I am so ready for Halloween this year. Its my favorite holiday",
        "I'm really nervous about a test I just took. I hope I passed.",
        "I feel anxious as I am unemployed. I need to find a job soon.",
        "I recently went to the doctor for some tests  He checked to see if I have a disease. I'm very nervous.",
        "The other week I was walking a friend's dog as a favour, but while out with the dog I lost it and could not find it for ages. It had run off into some trees, I was really getting anxious about it",
        "im so ready to see what the future holds ",
        "tonight... i really am bc my house is under contract ",
        "I have a dentist's appointment today.  I have always hated going to the dentist, so much pain.",
        "my wife is going overseas with our baby, i'm so freaking nervous",
        "right now i am anxious because I have a trip planned. It's a trip where we are relying on someone else for transportation so I am very insecure about putting that much trust on another person. We are going to santa fe for a wedding. ",
        "I am anxious about moving, I have lived in this house almost my whole life",
        "When I was younger scary movie characters used to pop in my head before I would go to sleep.  I would wake up in a cold sweat, nervous that the ghoul was under my bed or behind my door.",
        "I had to get my foot looked at by the doctor, always makes me nervous.",
        "for christmas to come ",
        "I recently flew for the first time on an airplane. My anxiety was through the roof!",
        "When I went back to work, I felt very uneasy about taking my infant to daycare.  I was so afraid something would happen to him, I quit my job after three weeks back to stay home with him full time",
        "I have been feeling very apprehensive these days.",
        "I am feeling fear these days.",
        "Tomorrow I have to give a big speech to my colleagues at work. I am very nervous.",
        "I have a huge test tomorrow and I am so nervous. I don't feel ready for it.",
        "I have to send an email to a company I really want to work for today and I don't want to mess it up. ",
        "When I was younger, I had social anxiety. Speeches would give me terrible anxiety.",
        "I was talking to my aunt on the phone but I felt awkward and nervous because I am not good at talking.",
        "Tomorrow I have my yearly review. I am nervous about it! ",
        "I've a bit nervous. I've got a blind date tomorrow.",
        "I have been posted to the middle east for work, i'm a little bit edgy about what the place will be like ",
        " I was super anxious when my power went out yesterday and I had no phone service! I had to go walking to get wifi.",
        "I can't wait until my daughter becomes an adult. She think its so easy.",
        "I felt really nervous when I took my driving test",
        "I felt nervous before I rode on an airplane for the first time3=",
        "I submitted a form to receive notifications for my banking app. I don't know why but the waiting got me feeling antsy..",
        "Public speeches always get me. It makes me very nervous and I just can't do them.",
        "School starts in a few days. I am too excited.",
        "I've been a bit uneasy about money lately.",
        "I'm so sleepy but have so much work to do.",
        "I haven't seen our cat for days now. I have to find out what happened.",
        "I am nervous because I am having surgery tomorrow",
        "My friend said she wanted to talk to me. No idea what it could be about.",
        "I can't find my phone anywhere. Everything is in it!",
        "I just can't wait until this weekend!  I am going on a trip to the Bahamas for a week!  I can't stop thinking about it!",
        "I am anticipating a really long day tomorrow and it makes me nervous",
        "Four more days and school is back in session. I could skip the entire weekend.",
        "Driving gets me so nervous sometimes. At any moment, I know I can be involved in a deadly crash...",
        "I am worried about how I'll pay rent on time.",
        "I had all my stuff moved from my old apartment to my new one, but the truck had a crash. I'm scared to find out if my furniture is ok",
        "When I order something online, I am so impatient to receive it",
        "Long trip to florida.  Don't like riding in cars.",
        "I have an exam tomorrow.",
        "I can't wait to know if my wife is going to have a boy or a girl child",
        "I have an important exam tomorrow.",
        "I am worried and concerned about the environment. There always seems to be bad news on TV.",
        "for my house to sell, and my wife to start her new job in 2 weeks. ",
        "One time in school, I was asked to give a speech in front of the class. I really don't like speeches and was nervous leading up to the speech.",
        "I love to travel, but I hate flying. Last time I took a flight, I was nervous and didn't want to go.",
        "I was nervous when I had to go to jury duty. I just did not want to go",
        "I had to get my foot checked out at the doctor recently, always makes me nervous.",
        "The other day I got a strange message from a distant relative. It said they needed surgery but couldn't afford to pay for a doctor. I was so worried.",
        "I am ready for the next McGregor fight.",
        "I can't wait for the last seans of game of thrones",
        "I am so nervous.  I have a blind date tomorrow night.",
        "Going on roller coasters makes me so nervous. I can't stand the feeling in my chest on the comedown.",
        "I can't wait for date nigiht this week. I bought my hubb an apple watch.",
        "I was so nervous taking my dog to the vet today.  I was scared something might be wrong.",
        "I am very anxious this weekend as someone I was trying to fix a relationship with is acting up again. I just get a lot of anxiety about what they will pull next because they usually do pull something.",
        "I am ready for my wedding.",
        "I am going on a roller coaster for the first time tomorrow.   I and so nervous!",
        "An old \"Friend\" that's a girl wants to go get drinks tonight.  Not sure if its a trap or not.",
        "I can't wait until I have grandkids. ",
        "I lost my medicine today, one that helps me focus my attention span. I needed it especially because I had a job interview that I wanted to be sharp for. I felt weird during the interview, and now I don't know how I did...",
        " I start a new job as a nurse next Monday and I'm so nervous. Nothing can prepare you for the real world of nursing compared to nursing school.",
        "I am feeling uneasy about going to court",
        "I am worried about my interview",
        "I am worried about not being ready for the party on Friday",
        "I have a hard time eating, I am allergic to so much! It gives me a lot of mixed feelings whenever I think about eating as I don't know what will happen with my digestions",
        "I came home and my outside window to my cat room was broken. It makes me feel scared as I am in a bad neighborhood and would like to know what happened when I wasn't home?",
        "I don't like to go shopping at big stores. Whenever I think of going to a big store like walmart oe Meijers, I start feeling panicked.",
        "I have a big job interview tomorrow and it has got me nervous.",
        "I am very nervous to be a father.",
        "once I felt totally out of place in a social setting, it was very hard for me.",
        "I have a big presentation tomorrow, and I'm not sure if I'm prepared enough. I think I need more time to refine my notes",
        "My a/c is going out and it is supposed to be real hot today.  I hope it doesn't break on me.",
        "My credit score has fallen by some 50 points in the last month. My debts are accumulating.",
        "Driving sometimes gets me very nervous. I don't like the thought of getting in a deadly car accident.",
        "The final exam for my Linear Algebra summer class is in a week and I do not feel prepared for it",
        "I start a new job on Monday!  I am excited but very nervous!",
        "I hate presenting a project in front of my class. It's so nerve-racking. ",
        "I felt anxious when I went to my interview the other day. Even though I was more than prepared, I was still overly nervous.",
        "I hate being in public by myself. It gets me super nervous and I turn bright red.",
        "I was raped. I have just gone for a test to know if I am pregnant or I caught a disease from the bad experience",
        "I drank all the coffee this morning and didn't share the whole pot with anyone. Now I feel very strange.",
        "When I first registered for university after having been out of school for 4 years. I wasn't sure if I was still going to be able to do the work.",
        "At my day job, we recently had a departmental meeting where we were discussing who our new department head should be.  I'm really uncomfortable with one person we're considering, so I felt anxious during and after this meeting.",
        "Every time I walk across a major street I am afraid I am going to be hit. I use the crosswalk and look both ways but I keep thinking someone will not stop. I wish I didn't worry so much.",
        "I am so prepared for this storm coming up. But I didn't buy any fun stuff..",
        "I waited for two weeks for my final grades. It was wful.",
        "I had to get my foot checked at the doctor recently.",
        "I really do not like doctors.  When they decided to do a c-section on my 1st child, I was quite upset and worried.  ",
        "I woke up yesterday and forgot I had a midterm exam later that same day. I had to quickly cram because I was worried that I wouldn't remember the material for the test.",
        "I have a big meeting tomorrow at work, and it makes me a little nervous.",
        "waiting for my favorite video game to come out",
        "I was nervous my first year of college. I just did not know anyone",
        "I was super nervous about the day today as a semi family member has been acting up and I didn't want them to ruin anyones day. They did unfortunately. I'll just never understand people who like to make everyone else miserable just because they are.",
        "I was so nervous starting my new job. I had no idea what to expect",
        "Getting on a flight in a couple of days. Kind of nervous because I've never flown before, and I just have a weird feeling about it. Like, I know it will be fine, but I'm worried about the safety of plans, I'm worried about getting lost, I'm worried about being far from home.. Just a little overwhelming.",
        "My girlfriend was feeling nauseous this morning and thinks she's pregnant. She went to get tested, and I am praying that she isn't. ",
        "I am feeling trepidatious about payday this week. I don't now if someone I know will act up and I am not looking forward to any drama.",
        "With President Trump threatening tariffs for importing foreign products, i am concerned that the prices will rise for everyday products",
        "I am scared about my upcoming job interview, I have not interviewed in years",
        "I am not looking forward to my job interview, I do not want to do poorly",
        "I am nervous about my upcoming job interview, it has been awhile",
        "I have a big interview Friday. I really want this job and I am very nervous.",
        "I am so nervous.  When I get nervous I smoke too much.  Ahhhh.",
        "I'm moving next week and i'm unsure about it.",
        "I don't want to go back to school.",
        "Big day for me tomorrow.  I start a new job.",
        "We have to fly across the country this coming weekend and I hate flying so much!  I feel dizzy just thinking about it.",
        "I am ready for Connor Mcgregors UFC fight in October.",
        "I am in the middle of a contract dispute and I don't know what is going to happen.",
        "Long car drive coming up",
        "I am ready for my birthday next week.",
        "The next day was Christmas and I couldn't wait to open my presents. I couldn't sleep at all that night.",
        "I am very nervous about my wife giving birth next month.",
        "I'm going to drive a truck. Never driven a car that big before.",
        "I have a big certification test coming up for my job. I studied so much but am still nervous I won't do good.",
        "I am literally watching old episodes of game of thrones right now. I can't wait until the final season",
        "I didn't know whether I was supposed to wear my uniform to a high-school band event, so I just didn't go, even though I was one of the best players.",
        "I am waiting on some test results. I went to the doctor last week.",
        "Being around a crowd gets me very anxious.",
        "Riding rollercoasters this weekend",
        "Uni is starting up soon and im nervous",
        "I have an exam and cant help but feel something bad will happen.",
        "I was getting ready to give a big presentation at work.  I was really prepared but I still felt super nervous about it.  ",
        "I am nervous thinking about going on a date.",
        "I was nervous when it storm last weekend. It rained hard",
        "when i was getting ready to move and take a drive across the usa",
        "I am scared about growing up, it is sort of unnerving",
        "I found out my sister was finally able to get pregnant last week.",
        "i have a huge bachelor party coming up, feeling nerouvs",
        "I have a big interview scheduled for Friday. I am scared that I will not do well.",
        "I start a new job tomorrrow. I'm a little nervous.",
        "I can't wait to be reunited with my familly",
        "I've been a bit uneasy lately and I'm not sure why.",
        "A couple years ago where I live we had Hurricane Matthew aiming directly towards us. I was so worried, I was glued to the TV until we lost power, then to the radio!",
        "I have a big test coming up for school. I have studied every day but am worried I will not do good.",
        "I have a doctors appointment next week. I might have some bad news, so I don't feel very good about it.",
        "My annual physical is coming up with my doctor. I am worried he will say I have not been taking care of my health.",
        "A game that i love comes out friday and i cant wait",
        "I am so worried about my dog. He doesn't want to move around very much any more.",
        "My brothers wife had our first girl into the family, the wait was intense",
        "when i don't know if i have a busy day coming up the next day the unknown drives me crazy",
        "The first day I started working out I was anxious about looking silly at the gym.",
        "Hurricane season is right around the corner and I'm a little worried about what it might produce.",
        "I get anxious whenever I'm waiting in line for a flight, and it's less than 30 minutes from take off.",
        "I was nervous going to the dmv. I hate going there",
        "I get so excited when I get to a seafood buffet. I just love crab and lobster",
        "My fiance works as a technician installing internet at peoples homes, and they are always tipping him. Often with food and it makes me nervous sometimes. ",
        "i cant wait to see if i got a raise on my next paycheck",
        "I have felt this way while waiting to get into grad school.",
        "I'm anxious for my upcoming job interview. I hope I do well and get the job.",
        "The site I have a subscription hasnt updated in 1 week with no news as to what's happening. I paid for 2 years.",
        "I am not sure about payday. It can be a stressful time and I really wish I didn't have to go through it this week.",
        "Meeting with my boss",
        "My daughter wants to get her cartilage pierced.  We have to go to a tattoo shop to have this done.  I'm not so sure about allowing her to do this.",
        "I was nervous driving this evening. There was so much traffi",
        "Going to the store today was a bit hard. I do not like big stores or being around people sometimes but I have too.",
        "Girlfriend found a lump in her throat. She has no idea what it could be. Has a doctor's appointment tomorrow. Not sure how forward I am looking to finding out the results, but I guess it's better than leaving it up to my imagination.",
        "I'm finally going to get to talk to a girl I contacted onine.",
        "I'm really worried I screwed up at work and said something I shouldn't have.  Now I can't stop thinking about it.",
        "I was pretty nervous driving home. It was raining too hard",
        "The movie starts in 30 minutes, but I'm still stuck at work. I hope I make it in time.",
        "I had a job interview today and im super nervous.  I think it went well but I won't find out about it until Friday",
        "everytime a pretty girls looks at me its like I forget how to function.",
        "I remember the first time I asked a girl out. My heart was beating out of my chest. She said no, but I learned that \"no\" isn't the end of the world.",
        "everytime i order something  i really want it makes my anxiety go through the roof",
        "to start my new job ",
        "My exam result is coming up next week. I have butterflies in my stomach now itself. This exam is so important to me",
        "Right now in my life, I feel like I don't have a clear destination, nor do I have a stable position to start from.",
        "i was in a competition,tomorrow is the elimination stage",
        "I just got my vacation approved. I leave next Friday. I am getting real antsy about leaving.",
        "I am expecting the reports from my doctor. I am not sure what is the matter with me and will find out.",
        "I am almost done with law school. I cannot wait to graduate and start working.",
        "I'm going on a date tonight.  I'm pretty nervous",
        "I am right now feeling aggravated by my daughter.",
        "I'm trying to join the Air Force. It's exciting to think of the future, but it's also scary thinking of it. I don't know what to expect from Basic and I don't know if I want to give up 4 years of my life.",
        "I can't wait to see the meg. It looks really good",
        "I am feeling this way while I am preparing for grad school.",
        "I have my math test tomorrow and didn't study. I don't feel very good about it.",
        "Ive been waiting for months for Madden to come out. Finally this friday i will be able to get it.",
        "When I was waiting for my certification exam results.",
        "I miss my dog. I wish I would've spent more time with her when she was alive.",
        "My dog has been acting kind of funny. I am worried that he has health issues. I hope he is OK.",
        "I am so jittery about my new job tomororw.",
        "Applied to another unit and got it.",
        "I am feeling uncomfortable in my body today. I am not sure why...but ever since my body changed so much in pregnancy..and I am having to work so hard to get it back to normal..somedays I am just uncomfortable and don't want to wear anything and I don't want to go out.",
        "I have my math final tomorrow. Never been so nervous.",
        "I start my new ob tomorrow. I am so nervous.",
        "I am so ready for this weekend. The kids are leaving and I get to do absolutely nothing",
        "I am worried about my cat. She is acting kind of strange. I hope she doesn't have an illness.",
        "I have to go to the doctor tomorrow. I hope I get a clean bill of health.",
        "I'm meeting a new guy for dinner tonight. I hope everything goes well.",
        "I was on my first blind date!",
        "I have a test next week",
        "waiting for a package to arrive",
        "I am ready for the Foreigner reunion concert.",
        "The company i work for, is currently undergoing down-sizing and there are multiple potential candidates that might leave",
        "I can not wait for my best friend to visit from Germany.",
        "taking kid to first day of school",
        "I am anxious as I just put my washign away and I have an odd sock left over.",
        "I just took an HIV test because I'm worried about my partner's fiedelity. I'm really nervous about the results.",
        "When I was a little kid I participated in a spelling bee.  I was nervous at first but ended up taking first place.",
        "I remember yesterday as a deadline for a project was approaching and i thought i wasn't going to be able to make it in time. ",
        "I was startled the other day by a snake.",
        "I'm looking forward to some Fall weather.",
        "I am receiving my work evaluation tomorrow. I am very nervous waiting for the results.",
        "There's a bad storm coming in tonight. I'm nervous about the damage it might do.",
        "when i don't know what's going to happen it gives me so much stress",
        "I was pretty nervous today going to the gym. There were a lot of people there",
        "i don't like the feeling of the unknown",
        "I was nervous this morning driving. It was raining hard",
        "I was a little nervous going to this job interview. I did not know what to expect",
        "I am anxious about this upcoming season for the Eagles, who knows what will happen",
        "I wish my surgery for my back was today not in a month.",
        "I am unsure of how my future is going to turn out.",
        "The rainy weather makes me nervous. I hate driving in it",
        "I was a little nervous going to the doctor this morning. I did not feel like going",
        "My thermostat is out of control. Feels like winter here.",
        "I can't wait until everyone is back in school. Including the neighbors kids. ITs too loud around here",
        "i cant wait to see if i got the promotion at work",
        "I go on vacation tomorrow.. I hope  I packed everything I need",
        "the new madden came out today, i was so amped for it",
        "I have my final exam tomorrow. I am so nervous!",
        "I took a medical test today.  I am so nervous to find out the results.",
        "I have my final physics exam tomorrow. I am so nervous.",
        "I went back to college as an adult.  It was surreal seeing all the  young kids around me.",
        "I am waiting for an important package.  I am worried if I will get it.",
        "My husband was up for a big promotion.  We waited a long time, but finally it came through.",
        "There was a wasp in my room this morning when I got up",
        "I have an interview tomorrow.",
        "Tehre was a wasp in my room this morning",
        "There was a wasp in my room this morning",
        "There was a wasp in my room this mornnig",
        "I took a test for my class last week. I didn't prepare for it at all. I'm so nervous waiting for the results to come back!",
        "My girlfriend just took a pregnancy test. She thinks she might be pregnant. We want a baby so bad. Waiting for the results was very nerve wracking.",
        "I am expecting a friend that I haven't seen in years to come over tomorrow. I'm a bit nervous about seeing him and how much may have changed since the last time.",
        "I have a court case coming up against someone who committed fraud against me. Even though I'm sure I have enough evidence, I'm nervous that things won't go my way.",
        "My lawn is getting overgrown and I don't know if I can afford a new mower. Mine is broken and hard to start. It's driving me crazy to have my lawn so high",
        "I'm turning 60 soon. Time flies by so fast.",
        "I am about to embark on a three month trip. I am having second thoughts about it.",
        "I am about to leave on a long trip. I hope I have everything I need. Im worried I forget something.",
        "I can't wait for school to start. Just a couple more days",
        "I am so excited for the fall. I am going to see two of my friends get married",
        "I'm getting anxious about visiting my girlfriend's parents this weekend, it'll be our first time meeting.",
        "I've been having to pee a lot lately. I know that's one of the symptoms of diabetes, and my dad has diabetes, too. Kind of worried to go to the doctor and get checked out.",
        "Big day next week and I can't wait.  My daughter will be in an Honors class her freshman year.",
        "Just before my final exam in calculus class. I need to score above a 70.",
        "I've got an employee review at work on monday.",
        "I'm going on a flight next week and I haven't been on a plane before. It makes me quite nervous and scared",
        "I hope my real estate lady comes by Monday. She said she's busy",
        "I'm really scare of heights. I can't go to the top of a building with out my knees getting a bit weak.",
        "I can't wait until I pay off this car. That will free up so much income.",
        "I was so ready for the black ops 4 beta today",
        "I am too excited about the upcoming school year",
        "Going to see mma fights",
        "Tonight I feel wound up a bit. I am tired of being sick. I have tried so many things, I am hoping the herbs I am getting tomorrow will help with my digestive problems, blood flow, fibro etc",
        "I have to go to the dentist next week and im so nervous. I hate going to the dentist",
        "im excited to go to a concert on sunday, it should be awesome",
        "i am going to a concert on sunday, i cant wait",
        "I have a big presentation at work coming up. This is my first one. I am really nervous.",
        "when im stuck in high traffic my anxiety goes through the roof",
        "I had to have a digital mammogram and ultrasound earlier this year.  It turned out it was all ok, but that was a very stressful week.",
        "I had to go in for an mri scan due to some headaches.  Fortunately the mri was clear, but my mother has MS and we were worried.",
        "I am expecting an express package tomorrow, but the tracking has not been updated correctly.",
        "I am really nervous for my swimming test next week.",
        "I met up with this girl from Tinder one time. She was really awkward and that made me awkward too.",
        "I am not looking forward to my surgery.",
        "I have a test in a month from now",
        "My final exam for Statistics summer class is in two days. I feel so stressed out about it",
        "I had no idea if I was gonna do well on my midterm. It made me so worried.",
        "There was a wasp in my rom when I woke up thsi morning",
        "There was a wasp in my room when I woke up",
        "I have a test due on Monday and I feel that I wont pass, even though I know all of the lessons",
        "I walked into my physics final knowing that I was gonna do awful. Despite that, I was still nervous walking in there.",
        "One time I walked into a final knowing damn well that I was gonna fail. Just the idea of knowing that I was gonna 100% fail was so  nerve wracking.",
        "I am meeting my blind date today.",
        "Big croud of people I had to find my friend in.",
        "My department is being closed.",
        "I went to the doctor recently for my annual check-up, I always think they're going to tell me something's wrong.",
        "I've been having some serious headaches lately. I don't know why.",
        "I start a new job on monday.",
        "I was on a plane last month and they had bad storms.  The plane was shaking and it was unnerving",
        "The traffic last night was pretty nerve wracking for me. A lot of traffic and aggressive driving",
        "I can't wait for summer to be over. I want the heat to be over.",
        "My mother had to have a medical test the other day and it took forever.  They should not make people wait like that when it's a serious test.",
        "I have a speech to prepare for and I'm not ready.",
        "I hope I do well on my test Monday. I studied hard but math is my worst subject.",
        "Yesterday when I woke up there was a wasp in my bedroom.",
        "I am counting down the days till my bachelor party.",
        "I had a job interview which I was worried about. I had to prepare a presentation and I was scared I would mess up",
        "I'm giving birth on wednesday.... I can't wait!",
        "I'm so excited to go out to dinner tonight! I feel butterflies in my stomach",
        "I have my birthday coming up and my co-workers are expecting me to throw a party. I am so stressed about it",
        "I've got some big medical tests coming up.  I wish they would have done them that day, but I have to wait now.",
        "The first day I went to the gym after years of being out , I was so anxious I was going to look stupid.",
        "I have a big test coming up for my psychology class. I'm not sure how I'm going to do.",
        "My cat was recently diagnosed with hyperthyroidism.  The meds don't seem to be making a difference, but he still seems happy.",
        "i can't wait, my wedding day is close and am going to wed my bride",
        "I am so worried about my math test coming up. I am afraid I will flunk it. I need to study more.",
        "I'm anxious to meet my wife's ex-husband.  Hopefully it will be civil and not awkward!",
        "I'm a bit nervous about a trip coming up.",
        "My dad had a stroke about a month ago and we've been waiting to see if he would recover 100%.  Thankfully he did, but the waiting was pretty intense.",
        "The other day I was driving somewhere unfamiliar and I got lost. The GPS on my phone stopped working and I felt panicked.",
        "I am so worried I will fail my Geometry test coming up. I just don't understand the concepts.",
        "My dog pooped on the rug today. I am not looking forward to cleaning it up.",
        "when im with my friends and they are texting and driving",
        "I'm so worried I will fail my Chemistry test. I just can't remember all the elements.",
        "I woke up to the sound of my phone ringing. I hate the sound of my phone going off, it stresses me out. It was bill collectors too, although for the wrong person.",
        "Dealing with a partner away at therapy is tough. Especially when they go through some hard things and you don't know how they will react and if they will take it out on you, leave etc.",
        "I have a presentation soon. I always get nervous talking in front of people.",
        "I let my health insurance coverage lapse and don't have any insurance right now. Figured I'd be okay since I'm young and haven't gotten sick or hurt in years. Just yesterday, someone smacked into me and my leg hurts a ton now.",
        "I was expecting a person to show up at my meeting. They are not very nice!",
        "My girlfriend lost a lot of weight.",
        "I have to go to jury duty later this week. I am pretty nervous about it",
        "Before my final math exam. I needed to score a 90%.",
        "I'm really stressed that I'll have enough money to cover the bills this month.  I might need a loan.",
        "waiting for my new car to arrive",
        "I'm moving to a new city and starting a new job in an industry I've never worked in. I'm both excited and nervous at the same time.",
        "My two youngest kids going to school for the first time tomorrow!",
        "I have so much to clean and get ready before summer ends! It's making me a bit nervous as there is so much to do and so little time!",
        "I'm always nervous about public speaking",
        "I had to go to the doctor's for my annual check-up, I always think they're going to find something wrong.",
        "I am going to have a quiet night alone tonight. I cant wait",
        "I have a health check coming up in a week and I'm a bit antsy about it.",
        "i have a doctor's appointment on thursday",
        "I cant wait for a new lego movie. I love watching them with my kids",
        "I have my performance appraisal tomorrow at work!  I am really nervous!",
        "I am already nervous about tomorrow. It might rain hard",
        "I think I'm losing my hearing almost entirely in my left ear and now in my right.  No one knows what's going on. ",
        "I am scared about my upcoming job interview, I get really nervous about this type of thing",
        "I am trying hard to get my business going before winter. It is really stressing me out as I am just not one that does so good under pressure.",
        "I am so nervous.. my stomach is in knots.",
        "My friends are in the process of adopting a child through DFACS.  It has been a long time coming and all of us are eager for this to go through, it's been pretty nerve wracking",
        "I cant wait to move",
        "I am anticipating an express package, but the tracking has been wrong. It is getting frustrating!",
        "I have my job interview tomorrow. I am so nervous.",
        "I have my job interview tomorrow. I never have been so nervous.",
        "I'm not really sure if I am going to be able to find a gift for my wife's birthday.",
        "I'm getting anxious thinking about moving in 2 weeks, I hope I like the city I'm moving to!",
        "I was going through some boxes in my moms storage unit looking for something the other day and came across a bunch of my great great grandmas momento boxes. We looked inside them and found some super weird stuff, like a ponytail full of my grandmas grandmas hair! I was so weirded out!",
        "I sent off a difficult email today and a bit worried about the response.",
        "I seriously can NOT wait to finish work so I can go to the beach. ",
        "I have to go into a new job today. My friend told me it wasn't any fun.",
        "I start my new job tomorrow. I am extremely nervous about it",
        "I just got a bunch of bills in. I am worried I wont have enough money to pay for them all",
        "I went to the store and had to buy presents for my family. I really didn't know what to buy.",
        "I have been studying all week for my Geometry test. I still feel unprepared. I am afraid I will fail it.",
        "Recently I had a shift at work cancelled. A lot of times that means more were going to be cancelled. I was very nervous that the whole weeks pay would be lost.",
        "I can't wait to see what my boyfriend has planned for my birthday. He says its a big surprise",
        "I had to give a speech in front of a few people I have never met. I was a little scared",
        "I am so worried I will not do good on the CPA exam. I studied so hard but am afraid I will draw blanks.",
        "I am having my first date with a woman that I meet at party. I am very nervous about it.",
        "i hope that i can see my family by the end of the year",
        "i have an appointment with the doctor on thursday and it has me so worried",
        "I had been waiting on the results of a test of my blood pressure. Thankfully it was fine but it made me nervous waiting.",
        "Tomorrow I have to give a presentation at work and I just found out that the Vice President of the company is going to be there.",
        "Sometimes I'm nervous who I'm going to talk to next.  I'm nervous because if it's someone who can't hold a conversation I get the feeling of wanting to strangle them on the other side of the computer.  And I'm really not that kind of guy",
        "my husband and i are trying to have a baby",
        "i am trying to save up some money but i'm having such a hard time making it happen",
        "i cant wait until next week",
        "I have been having nightmares every night. I am not looking forward to going to sleep tonight.",
        "I am starting a new job next week. I am really nervous and not sure if I will do well.",
        "I can't wait to get this baby out! I feel like I've been pregnant forever",
        "I'm going on a blind date this weekend. I've never even been on a date.",
        "waiting for my new car to be delivered",
        "I've got to get an MRI and I've been waiting for the appointment for almost 3 weeks now.  I guess it's good it's not an emergency, but it's sure nerve wracking not getting it over with.",
        "I didn't pay my taxes this year. I am nervous I may get audited.",
        "I've had a few panic attacks lately.  I'm supposed to go see the dr tomorrow about them, I hope they can give me something to help.",
        "I can't wait until Friday to know if i got the promotion... the wait is killing me",
        "i have a test this week and im scared",
        "I really hate going in front of crowds. Especially when I had to recite a poem in front of a whole crowd of people.",
        "waiting for my twins to be born",
        "I am so ready for the weekend, I get to drive a NASCAR.",
        "I have a date tomorrow night with a someone new I just met. I think I really like her so I am feeling some butterflies right now.",
        "I'm supposed to cook dinner tonight but have no idea what to cook.",
        "I drunk texted my boss last night and told him everything that is wrong with his management style, I'm afraid to go to work because I'll get fired.",
        "My partner is being a big fat jerk. I really don't think I can deal with his childish crap anymore and lies.",
        "I'm going on a work trip this weekend, but I hate flying. I'm really nervous about the flight.",
        "I get really nervous when I have to confront someone and be assertive.",
        "We're refinancing student loans, buying a house, and my wife is getting a new job.",
        "I have to get surgery tomorrow morning. I am getting my wisdom teeth taken out, and I am pretty nervous about it.",
        "I have a lot of nerves today! I am sick a lot in my health and I can't seem to figure out what sets off my fibro a lot, it gives me anxiety and depression and I am just so overwhelmed with it I don't know what to do anymore!",
        "I'm going to ride a jet ski for the first time this weekend.",
        "I had a really good job interview. It is so nerve racking waiting for the call to see if I got it or not. ",
        "I just dropped my son off at daycare for the first time.  It was the first time I've been away from him for more than a couple hours.",
        "I really nervous right now. I am waiting on a phone call to see if I got a job I interviewed for.",
        "I have to go to the dmv on friday. I am nervous about it",
        "My girlfriend is going to work overseas. We've never been apart for more than a couple of days.",
        "The year was 2016, and I was severely worried that Hilary might win the presidency",
        "I am worried about my test scores coming back",
        "I have my final biology exam tomorrow. I am so nervous about it.",
        "I have a big presentation to do about my progress on the project in front of the CEO of the company i work for. It is on Monday during team's weekly meeting and I am very nervous",
        "I would feel on my toes the whole time at the dentist office.",
        "I'm waiting on some test results from the dr and it's taking forever.  Don't they realize that all this waiting is worse than the actual test and result?",
        "I have my final math test tomorrow. I am so nervous.",
        "I'm not ready for the long 9 hour drive.  ",
        "I am so ready for Thursday.",
        "I've got to give a big speech at a wedding tomorrow and I'm getting shaky just thinking about it. I wish I could just get it over with.",
        "I have to go into get my tooth pulled soon. I don't do well at the dentist.",
        "My boss is coming for dinner tonight with his wife.  Many things could go wrong I hope they don't or I probably won't be getting a raise.",
        " I have to go to the dentist really soon. One of my teeth are very sensitive lately. I don't want to go.",
        "I am feeling anxious about my test tommorrow",
        "I've been having to deal with me and my wife's new business and it's been kind of sttressful.",
        "I have to teach an in-service class at work next week. I am feeling a bit uneasy about doing it.",
        "My husband took a 30 hour round trip road trip and will be home soon. He went to get our new puppy. I haven't slept well since he's been gone because I've been worried.",
        "I took a test to get into Mensa. I didn't know how I did and really wanted to get in. I was worried about it!",
        "My son's pediatrician advised me to have early intervention out because he's delayed in talking.  The appointment is set for next week and I don't really know to expect.",
        "I've going through a spell as of late when I've been pacing back and forth more and more and self doubt has crept in. I'm waiting on an acceptance into a program for video editing.",
        "My husband just had a job interview. We are waiting to hear back from the company. ",
        "I had to give a speech!",
        "I wasnt sure how I was going to pay my car insurance on time. If I didn't, it would get canceled.",
        "im waiting for bloodwork to come back",
        "I was waiting to find out some lab results. I wasn't sure if they would diagnose me with cancer. ",
        "I feel nervous most of the time but when my regional boss comes into town it gets pretty bad",
        "I had an interview for a hospital I want to volunteer at ",
        "I had an hectic interview ,I really don't know what to expect ,I'm curious to know what's next",
        "It was my first day ever teaching high school. I have only ever taught elemebtary school and I was so scared to make a fool of myself",
        "I had to go to the car dealer once to purchase a new vehicle. I always hate going there because I'm not good at haggling. I always feel like I'm going to get ripped off and it makes me nervous. ",
        "My best friend is coming to visit next week.  I am so excited to see her because it's been a long time.",
        "School starts back in 2 weeks.  I'm a bit nervous about the new students/class that I will have.",
        "My aunt was rushed to the hospital a few days ago. They are currently monitoring her condition.",
        "I have a business meeting coming up this Friday, and I really want to make a good impression.",
        "I had a wisdom tooth giving me some pain recently and had to go to the dentist. I waited as long as I could before i finally went. I hate the dentist.",
        "My daughter starts her first year of university in another city next week. I'll really miss her. ",
        "I have been waqiting to hear back about my second interview for a new job.",
        "My wife is pregnant with twins. I am really looking forward to the delivery.",
        "I took a test last week and I'm still waiting on the results to come in.",
        "I anticipated greatly going to see a car on Craigslist. It was a really good deal so I wanted to see it right away.",
        "when i was waiting on my baby to be born",
        "I was waiting to see if I got a job I interviewed for. I was nervous because I didn'",
        "I'm hosting thanksgiving for the very first time this year.  Some of my family is driving in from four hours away.  I really hope it goes well.",
        "I was driving on the road one day and I saw a man hit a dog.",
        "I felt nervous about a meeting at work where i had to do a presentation.",
        "I was having serious medical issues so I went to the doctor. They worried it was all these terrible things, so they had to run tests.",
        "I was in my car and got stuck in traffic. everyone was honking and it was kinda scary.",
        "I had 2 job interviews yesterday and my nerves are on edge today.",
        "We were driving to Colorado to visit my sister last month. The traffic in Denver was very scary to me. I felt panicky.",
        "waiting on a call",
        "I have a job interview coming up adn i am a little nervous about it.",
        "My college entrance exam is tomorrow.",
        "I'm having heart palpitations all the time and they are very concerning to me. ",
        "I've put in alot of work to get a huge job. i will know something shortly",
        "I remember when I was in 8th grade, I had to sing the national anthem at my middle school graduation in front of hundreds of students and parents",
        "I'm worried about my job interview tomorrow, I really want this job.  I hate this feeling!",
        "Just before driving for the first time. I wasn't sure how to streer the car.",
        "I am worried about a flight coming up.",
        "I work as a self-employed transcriptionist. I told my client I'd have work done this week, but my university classes also started this week... and things kind of got away from me, and they won't be done. I'm worried he's going to just tell me he'll have someone else do them, and I'll lose his business.",
        "I kept thinking I had left the front door unlocked whilst I was on vacation",
        "I have to go to a doctor's appointment on Monday.  Hospitals make me so nervous.",
        "I am scared of how work is going to go, it is the start of our busiest period of the year",
        "I have a dentist appointment this week. I always get so nervous.",
        "I'm going to be getting a waxing this week. I'm scared.",
        "i had to wait a day for test results last week",
        "so many emotions i feel distressed ",
        "finding out if baby is boy or girl",
        "I had to go to the ER when I cut my hand. I was very concerned about the course of the treatment while waiting to see the Doctor.",
        "I am waiting for my blood test results. I am very stressed about it.",
        "I shot a roll on 35mm film. I was very excited to see the results.",
        "I just finished the class to get my real estate license. I just hope I know enough to pass the state exam.",
        "I have to take my truck in to the mechanics next week. I'm not sure what the problem is, but it seems serious. ",
        "I am waiting on results for a big test I took last week. I am so nervous.",
        "I can't wait for this halloween. I have the cutest theme for my kids",
        "I am learning how to wake-board this weekend!  I am really nervous though!",
        "I used to be nervous getting in the pool when I was a little kid because it would remind me of when I almost drowned...but swimming lessons took care of that, I'm glad my parents pushed me and gave me confidence to be on the swim team",
        "I have a surgery coming up on Monday.",
        "I am waiting for some blood and other test I have to had last week, because I was not feeling well.  I hope everything is ok.",
        "I was waiting on some pregnancy test results from the doctor. My appointment is next week and my nerves are all over the place",
        "I was at the doctors office waiting for the results of a blood test and I was a little scared",
        "I have a big test in a few weeks and I am feeling a little worried about it.",
        "I've got a first date in about an hour.",
        "I am expecting a very big settlement. I can not wait",
        "I got a big exam coming up in my chemistry class. I am worried I will fail it. I just can't get my mind around the material.",
        "I have to make a birthday cake later tonight.  I am worried I might mess it up.",
        "I wanted to ask this girl out and planned on doing it soon.",
        "I am nervous about Monday. I have to go to the doctor again",
        "I'm a little nervous about the aliens in my backyard",
        "My dog is sick so i took him to the vet now we are waiting for the results of his bloodwork",
        "I am excited about going on vacation.",
        "I find myself with being over ran with anxiety that it is hard to concentrate and stay focused"
    ]
}