{
    "threshold": 0.8,
    "seed": [
        "I once lost my job and got mad.",
        "I am so upset and mad. I cant believe what has happened!",
        "I spent all weekend working on my truck to fix a miss in the engine. Despite spending over $200 in parts, it didn't do a thing to fix the miss.",
        "Recently my manager lied to us. He changed our money and took the bonus away. ",
        "My ex girlfriend cheated on me with one of my closest friends. It made me very angry at the both of them.",
        "when i moved into my apartment it was full of bugs! ",
        "Some left their garbage outside of the dumpster in my apartment complex. Now at night there are a bunch of raccoons outside.",
        "Lies",
        "MY ex didn't show up to court again. He is always wasting my time.",
        "When i was young i was pretty hyper. But when we had a connect four tournament at my school i back seated someones match. I didn't point anything out really but they gave them a lose and it got me really mad i threw a chair in class.",
        "I was angry when my brother ruined the result of a football game. I recorded it to watch later",
        "My boyfriend cheated on me while I was away visiting family.",
        "I broke my phone",
        "I get mad when I fail at school.",
        "I am so mad at my son.  I asked him three times to do his chores and he still hasn't done them.",
        "I am so angry at Donald Trump.",
        "I am upset that England lost in the World Cup.",
        "My mother in law always lies and exaggerates everything.  It's very frustrating and causes fights between us.",
        "When my brother got suspended from high school for something he did not do by a vindictive teach, it really made me angry",
        "One time I waited over an hour at the DPS office to get my drivers license renewed. Just as it was about to be my turn the lady working there shut it down and said I would have to come back the next day.",
        "At work today, I got blamed for a problem that I had nothing to do with.  A report was written incorrectly, and I was blamed for the incorrect figures even though I didn't provide them.",
        "A couple years ago someone tried to steal my phone cause they thought I wasnt looking, was super annoying.",
        "A guy almost crashed into me a week ago. It was really frustrating because he ran a redlight",
        "I was at the gas station filling my car up with gas and this guy pissed me off. He kept looking at my butt and making comments.",
        "Someone cut me off on the road and almost caused me to wreck.",
        " I was really upset when I found out that the Dallas Cowboys were going to let go of Dez Bryant. I think he's a really good wide receiver if only he wouldn't run his mouth.",
        "I was furious when the distracted driver swerved in front of me, causing me to slam my brakes. I wasn't surprised when I saw the lady yakking on her cell phone.",
        "I was in a queue and some idiot stepped on my toes without apologizing ",
        "when my girlfriend cheated",
        "I was angry when my car peed on the rug.",
        "My cat vomited on my favorite shoes and I was so mad about it.",
        "I was waiting for a package and I watched the mailman drive by my house without delivering it.",
        "Some sad individual could be calmed down by a sweet word",
        "I was charged by a subscription magazine, even when I cancelled my subscription a month ago.  Now I have to call or write to them and lose a lot of time.",
        "When a friend slapped me",
        "I saw a fly in the food that I was served at the resturant",
        "Im tired of paying rent. Id rather have a mortgage and own my home",
        "when i ordered food and it was bad ",
        " i went out with a couple friends to a local bar and we were having a great time. then my friend said he was going to step out and do some drugs and i knew my friend for years and i told him no just stay and party with us but he declined and i started yelling at him and he punched me. i felt like he chose the drugs over our friendship",
        "I and my friend got into fist fight while playing football",
        "My daughter is being bullied at school and her teachers aren't doing a thing about it.",
        "I ordered chicken the other day and it was still pink on the inside.",
        "I worked so hard on a project, and someone stole it and presented it as their own.",
        "My uber had me late to work this morning. I was not happy.",
        "My nephew told me once of something really stupid that he would do if the situation arose.",
        "I put in vacation request since January for next week. And now they're telling me they're too busy to let me go.",
        "I was driving through the parking lot the other day and someone backed into my new SUV!",
        "Asked a relative to care for our pet while we were gone and the dog ended up missing.",
        "All my neighbors constantly want to get together to gossip and talk bad about the people who live across the street. I'm sick of it!",
        "Somebody said something about me that was not true.",
        "I was expecting our anniversary avidly. But on the day my betterhalf had work in her native place. So she went and I was alone here. Also in mind pressure she forget to wish me.",
        "I got mad when I lost my dog",
        "I was upset when my dog ran away",
        "I recently got in trouble at work for not making my schedule, but it is their fault because they gave me one they knew I couldn't work.",
        "My light bill was super high",
        "I got a final warning at work today for something I didn't even do!",
        "I worked so hard on a project to find out that they had 2 teams working on the same thing.",
        "I am so pissed of at President Trump",
        "I got really mad when I failed a final in college. I just did not try hard enough",
        "Once my brother stole a pizza i made from me. He says he didn't each it even though i found him with a paper plate with fresh pizza sauce on it.",
        "My sister had my laundry for two days and is sending it back dirty.",
        "I was upset when my dog ricky went missing",
        "Yesterday, I took a flight. During the flight, I went to toilet and came just after me. She kept knocking on the door repeatedly, aggressively and multiple times.",
        "I can't believe my favorite restaurant was closed today. I was so upset.",
        "Once my Uncle made racist comments towards me. I told him it's not funny, thinking he was joking. Turns out he was serious, and all he did was make more racist remarks.",
        "I am so mad that I couldn't go to Disneyland.",
        "My pizza didn't arrive on time last night - it was an hour late!",
        "A guy out in traffic getting mad at me and then giving me the finger when he is in the wrong",
        "My friend took my car without permission a few days ago. Literally...without even asking me!",
        "I was so upset when Michael Jackson died.",
        "My mom said I had to get rid of our family dog because she was allergic. I cried for a week it was unbearable, I resented her.",
        "i gave my buddy money to buy me a huge roll of toiletpaper from Costco but he used the money for other things",
        "I was angry when the Eagles lost the superbowl in 2004. I was young but I was still mad",
        "I was angry about my work today, It's been frustrating.",
        "McDonalds got my order wrong again. Im going to complain.",
        "I was angry about the dog I have being abused.",
        "when i found out my wife cheated on me ",
        "Got to the hotel where I booked my room, and it turns out they gave my room to someone else!",
        "I did really well on a test last week. I got most of the answers right, but the teacher gave me a failing grade. The person sitting next to me cheated off of my answers, so she failed both of us. It's not fair.",
        "I have the worst neighbors. They have company all times of the night and constantly slam the doors.",
        "I was at the dentist's office today and had to wait 45 minutes past my appointment time to be seen.",
        "I'm livid when I hear about my friend's situation with his kids.  He's a single dad with 2 daughters but his ex-wife just takes advantage of his generosity.",
        "My manager keep lying about a promotion that he promised.",
        "My coworker told my boss that I came in to work 15 minutes late this morning.  I couldn't believe he did that to me!",
        "I am so mad.  My dog wont stop barking at every little noise.",
        "I am so mad.  My boyfriend is drinking beer and he so dumb when he drinks.",
        "My neighbor hit on my wife!",
        "Last night someone broke into my car. They stole all my change that I had in the cup holder and also my son's birthday present that was in the trunk.",
        "I spilled my coffee on my keyboard and now it's sticky. I am so furious!",
        "My ex is such a jerk. He posted my phone number on facebook.",
        "I hate it when I get ignored. It makes me feel less human and I get very mad!",
        "MY kids refuse to go bed every night. I can't stand it.",
        "I just stubbed my toe a few minutes ago. Why does that have to even be a thing? Something so small on your body can cause you such great pain, and all you can do is just hop around like a moron.",
        "I was very upset when I realized my neighbors dog had puppies, about ten of them. They don't take care of them and they are malnourished. It's enfuriating.",
        "I had a job interview. Everything went great and I just knew the job was mine.",
        "My sister always borrows money and never pays it back on time.",
        "I got angry with people in the supermarket. They were letting their young child push the trolley and it was very busy. They were blocking all the aisles.",
        "Finding out that my girlfriend had cheated on me with a close friend.",
        "I went to get in my car to drive home after work, and another car had parked right behind me, blocking me. I tried calling the number on their dashboard, and they just ignored my call. I had to get the police to help just to leave.",
        "My flight was cancelled ",
        "Not too long ago a people stole my identity.  I am so upset by it.",
        "I get angry with Prime Minister's question time. The MPs just shout at each other.",
        "My friend broke my phone that I had worked hard to buy",
        "For the 3rd month in a row, I have received and incorrect cell phone bill!  I feel like screaming at the customer care representatives!",
        "My boss fired me for no reason",
        "my rent increased ",
        "My cousin crashed my car",
        "my neighbor's cat keeps pooping on my balcony",
        "The store down the street never has any Corona light in stock",
        "My supervisor belittled me in front of all of my coworkers in a meeting.",
        "when my neighbors wouldnt stop their dog from barking and it bit me ",
        "My husband gets cranky when he gets woken up and takes it out on me.",
        "I am piss-off",
        "I just witnessed someone steal from an old woman walking across the street. Boils my blood!",
        "I am so mad at the republicans.",
        "I got out of work the other day and noticed that someone had slashed one of my tires in the parking lot.  I was taken aback and upset",
        "Yesterday, somebody stole my cappuccino at Starbucks. I was livid! ",
        "I lost the spelling bee when I was in second grade. I was so peeved.",
        "I had a huge conflict with my parents about moving to another country and I was simply enraged to have them trying to control my life.",
        "My husband's sister was living with us. She was acting rude, and we ended up kicking her out. ",
        "I was at the store and I noticed someone cut in front of someone else in line.",
        "Some one took away my lawn mover ",
        "My car broke down",
        "My neighbors cat keeps pissing in my grill",
        "Someone cut me off in traffic the other day.",
        "I am upset the baseball game got canceled.",
        "I wsa really upse when I found out my co-worker was fired",
        "I was overcharged at the grocery store but did not realize it until I got home. ",
        "I hate it when I see people get bullied. It makes me so furious!",
        "I can't believe I lost another bet to my sister. I think she cheats.",
        "I'm upset about a project my daughter is working on.",
        "My son is being bullied in school and no one is doing anything about it.",
        "I found out that someone I thought was my friend really isn't my friend. She stole money from me!",
        "I saw a man yelling at a young boy.  It made me very upset.",
        "I hate trying to apply for jobs, putting so much effort into it, and then not getting any sort of response back. It's like, yeah, okay, I understand if you can't hire me, but can you at least tell me that you're denying me, and maybe why, too?",
        "Someone in my family snuck $20 out of my wallet without asking me. It had to be one of them, because it's been here on the counter all day, and I know I definitely had two $20 bills in there. No one will own up to it... ",
        "I am mad at the democrats.",
        "These people at work are so disrespectful and racist!!",
        "Manager schedueled me for an entire week of shifts, many of them doubles and without much time for a break between.",
        "Someone ate my lunch at work.",
        "After dating my girlfriend for 3 years she still won't accept my marriage proposal, I am so furious",
        "I lost a game of DoTA today! My stupid teammates all left the game and I couldn't win on my own.",
        "I ordered a product with express delivery, and it was delayed for a week!",
        "Why won't I get my stuff after all the effort I put in, It's so unfair ",
        "Why won't I get made at you?",
        "Someone cut me off in traffic this morning.",
        "My friend crashed my car.",
        "I just got a new car. I parked it in front of my house. Right away some neighborhood teens came around and keyed it. Now I have to get it fixed.",
        "My workers did not perform the task to satisfactory standard.",
        "I was mad when I woke up and it was only Tuesday!",
        "A friend of mine misunderstood I was saying",
        "I lost my job yesterday",
        "I was mad when it was only tuesday!",
        "My kids don't like to listen and it drives me crazy.",
        "that dang storm last week upset me",
        "I was mad when I didnt get paid my entire check",
        "My father cheated on my mother. I was not happy with him at all.",
        "my neighbors dog keeps pooping on my driveway",
        "Brother took my car without asking and i had to go to work. I was so furious at him and wasn't happy at all.",
        "My dog pooped on the rug yesterday. I was so mad.",
        "My dog threw up all over my $10,000 tuxedo. I was quite irate.",
        "My sister and I are fighting.",
        "I just bought some honey buns and the entire box is gone. I didn't even eat any.",
        "I am so mad.  My husband won't stop playing his video game.  It has been days.",
        "My daughter left with her friends and her room is a mess. I am so upset.",
        "I am soooo mad.  I came home and someone burnt a pizza in my oven and left it there.",
        "I am super frustrated that someone I know keeps ruining their life. They keep repeating the same bad mistakes to destroy everything, anytime anything good happens.",
        "I lost my car keys at a bar last night.",
        "I am angry with how my neighbors talk to their dogs. They yell at them everytime they go outside for the MINUTES they are out there and they get harassed the whole time until they don't want to get off the porch..then they get yelled at more!",
        "I am super OVER the people who litter on the outside of my lawn everyday. I don't know what to do with how upset I get at picking up everyone elses trash.",
        "I am upset that my brother stole from me.",
        "I am so mad!  My insurance company keeps denying a valid claim and it causes the Doctor to send me a bill!  I keep having to call and do their job for them!",
        "My Mom didn't make my oatmeal right yesterday. I took it from her hands and dumped it all over head because I was so mad.",
        "My refrigerator broke today. I just went grocery shopping",
        "I can't believe my daughter left the freezer open.  The popsicles melted.",
        "I had to go to the DMV today to renew my license.  It took 4 hours and I ended up having to use a sick day...Not happy!",
        "I lost another wallet today. I just can't keep up with those things",
        "I was so mad when I got a flat tire last weekend. It was in traffic as well",
        "I was waiting in a long line to take the bus. Two young women cut the line and go directly in front everybody.",
        "I kept playing a card game with my brothers, and I kept losing. They were bragging over and over, and being disrespectful. I just wanted to spend quality time with them... It gets frustrating sometimes.",
        "I was very angry when I failed my science test. I should have tried better",
        "I am angry that the person I live with still doesn't like paying bills. You have to pay bills to have things. That is how life works.",
        "I am really upset about my electric bill. Its twice as  high as last month.",
        "My kids still arent sleep. I sent them to bed hours ago",
        "I am so tired of my friends flaking on plans. They are so unreliable",
        "I saw a person screaming at a puppy today.  I was so upset to see it.",
        "My mailman delivered my package to the wrong address.  I am furious about it.",
        "I had just washed my car last week because I was supposed to drive it through the parade. When I got home I realized that whatever chemicals were used in the car wash had stripped my car's paint!",
        "I am so mad I have to work on Sunday.",
        "I ordered pizza today and they forgot to put pepperoni on it.  I am so disappointed about it.",
        "I took this girl on a really nice date and then she said that it went well. Then, out of the blue, she dumped me and said she wasn't ready.",
        "I lost my wallet at work today.  I am so upset I did that.",
        "My friend never paid me back the money I loaned him. Even worse, he acts like it never happened!",
        "My boyfriend and I broke up and he moved out. Before he left, he damaged a lot of my stuff.",
        "I just discovered that my girlfriend had been sleeping with my best friend. It's infuriating to know that she did that behind my back",
        "Someone broke my window with a soccer ball.",
        "I went on a date with this girl and she told me the date went well. After that, she then ghosted me which made me quite mad and upset.",
        "Yesterday, someone took the bus without paying.",
        "i was pissed when the gate was left open and our dog got out",
        "it upset me when i couldnt leave work on time",
        "I am so mad!  I took my car in to the dealership for an oil change and find out I need new brakes!  They want to charge me $800 for just the rear brakes!",
        "I dropped my laptop and broke it.",
        "once my brother insulted me infront of my family.",
        "I am so mad!  I went outside and an armadillo was eating my plants.",
        "My dog decided to take a break from potty training and go all over my house while I was at work. No more free roaming for that bad dog",
        "my chief in my company scold me for the unnecessary reason.it makes me felt bad",
        "Someone stole an ice chest out of the back of my truck.",
        "I was going to see my favorite band. But the show was canceled!",
        "Before my birthday, my boyfriend tried to get me to pick menu items that everyone could eat--including him. This meant I picked place that served only chicken because it's the only meat my boyfriend can have due to his digestive/health issue. Of course, I got anxious and upset because the place I picked was serving healthy food--my preference--but the serving sizes were missing and I couldn't tell what ingredients were in what; this lead to us arguing.",
        "I was driving in my car and some person pulled out in front of me. Then they honked on the horn like I made a mistake.",
        "I am so not happy with my mother for not telling me who my father is",
        "Yesterday I paid at the bakery in cash and the gave me the wrong change,  went I told the cashier so she told me I had given her $10 when I was sure it was $20, I had to speak to the manager.",
        "I crashed my dirtbike on a gravel road. Scratched my knee up real badly and had to go home for a ride with the police.",
        "I was driving to work this morning and someone cut me off. They didn't even both to indicate they were turning.",
        "I am so upset because I lost my favorite shoe. I am late for the gym now!",
        "Was let go from my job after 11 years.  Coincidentally it was almost immediately after I told them I was pregnant with my 2nd child.",
        "My friend wrecked my car when I let him borrow it over the weekend. Now it's a giant hassle to manage insurance",
        "I'm so mad, I was supposed to go out with some friends tonight. But suddenly everyone is busy now, so im just home alone",
        "My dog decided to pee on my bed when I wasn't home. I just cleaned it too!",
        "I was driving home from work last night, when a guy talking on his cellphone started coming into my lane.  I started honking at him and then he flipped me off",
        "I was very mad when France won the world cup 2018. Croatia should have won!",
        "My kid destroyed my entire bathroom today. It upset me pretty bad.",
        "Today I was driving home and someone almost hit me.  I was really mad because I just got a new car",
        "I took my daughter shopping for school clothes and she didn't like anything in any store. We bought nothing",
        "My roommate drank all my milk. I wanted to have cereal for breakfast. ",
        "I never thought my ex and I would break up for good. I think we are really done now.",
        "I was so mad when I forgot to pay my credit card. I felt dumb",
        "I can't believe my landlord has fixed my stove yet",
        "My friend was really rude to me. I'm so upset!",
        "I can't believe my friend got back with her ex. She knows he is no good.",
        "I was pretty mad tonight when my friend canceled on me. I was wanting to go out",
        "My son just wasted my soda all over his school papers. I am so upset",
        "Somehow a LEGO got stuck under my front-door to my house, and now it helped to crack the frame of the door, and it needs to be replaced. What's worse is I had just gotten done telling my child that they need to make sure they're more responsible with their toys, and to put them in their appropriate places. I'm trying to be patient and not overreact in the situation, but it's hard.",
        "Took son to ER because of sore throat.  They said it was just a virus and sent him home.  Still sick 2 days later, took to his doctor.  Just sore throat, heres some antibiotics.  Getting worse, took to ENT, Severe strep throat,  here is the correct antibiotic.  That worked.  ER visit bill, DR bill and ENT bill, for a simple sore throat!",
        "i was mad when i returned to my car and noticed someone put a dent in my door",
        "A part for my computer that I've been putting off buying went up 10% right before I finally ordered it.",
        "i was upset when i was told i couldnt go home on time",
        "i was upset when i saw someone had dented my car door",
        "I was going to have a picnic at work today but it began to rain, so I felt pretty ticked.",
        "I was fired from one of my jobs because of something a coworker did and I was blamed for.",
        "A colleague at my job took credit for months of my work and claimed I was of no help to them. It all worked out as it should have in the end, but that's never an easy situation.",
        "I was driving down the highway and a semi-truck doesn't even look and just merges into my lane.  I had to swerve over and luckily there wasn't a car there.",
        "MY mailman is the worst. He never closes my mailbox and sometimes it flies away",
        "I get so ticked off when I see people leave their grocery carts in the middle of the parking lot. Some people are so inconsiderate!",
        "I am super ticked at people who just want to make everything upsetting for everyone else. Why can't people just let others be if they are in a bad mood?",
        "I feel upset that someone I know would throw away progress constantly. They continue to listen and do things but none of it is doing anything because it's all a show.",
        "Today I was cut off in traffic and almost hit someone. It really mad me mad.",
        "I wanted to take friday off but, I'm unable too.",
        "Someone broke my window to my cat room and pushed in the screen. It makes me furious more than anything",
        "I don't get big companies who think they can take advantage of everyone. When I get a product, it should work right or they should replace it.",
        "when i was next in line and someone cut me to jump ahead ",
        "I am angry that my brother ruined a movie ending for me, that is such a rude move",
        "I was so mad when I didnt get a promotion",
        "I forgot my lunch at home two days in a row.",
        "i get so frustrated with my slacker coworker",
        "A man poured a beer on me at the bar.  I was so upset at him!",
        "My manager keep lying to me. He is trying to advantage of me.",
        "My car was involved in a hit and run! Good thing it was just parked on the street but I'm annoyed I have to pay the bill.",
        "My boss fired me because I kept making him look bad.  I am so mad about it!",
        "Someone threw a bunch of trash in my yard.  That makes me so mad!",
        "I once found out that my mother threw away my drawing.",
        "Today i waited for the cable company to show up at my house for 5 hours... No one ever came",
        "I found a hair in my soup at lunch today. I was not happy.",
        "I'm pissed, my wife came home from work and went out to eat.   She didn't even bother to see if I wanted anything!",
        "My neighbors woke me us this weekend with their lawnmower at 5am. I went outside to ask him to stop but he just ignored me. ",
        "I lost my credit card and someone charged 500 dollars on it.  I am so upset it happened.",
        "I'm quite upset at those I know that complain all the time. I get that we all can once in awhile..but incessantly day in and out no matter WHAT way things go...so either way? That's a problem.",
        "I had people stay at my house while I was  gone over the weekend, so they wouldn't have to pay for a hotel. When I came back, they had left a mess and didn't really put in much effort to put things back where they found them. They were supposed to be good friends, too.",
        "My friends didn't show up for bowling last night. I was quite peeved.",
        "I went to the post office earlier and it was closed.  I was so mad I didn't get there earlier.",
        "My kids wouldn't clean up their room yesterday. I was quite displeased with them.",
        "I fell into a puddle while I was walking yesterday.  I was so mad at myself.",
        "I am not happy that I will not be able to attend the Kentucky Derby this year.",
        "i stubbed my toe this morning",
        "I got a parking ticket for no reason!. I was livid with the city.",
        "I hate when the Cowboys lose at football!",
        "I got into a big argument with my mom. She said that we really needed to get a job but we were already looking for jobs.",
        "I get so angry when I lose any game.",
        "My son crashed my car.",
        "I'm very angry about my boss attitude to work",
        "I was pretty mad when I got fired last year.",
        "I applied to get a new passport. They have lost my paperwork.",
        "my brother flushed my fish down the toilet for fun",
        "My coworker stole my presentation idea and claimed it was his!",
        "I was mad when my boss yelled at me. I guess I was late",
        "My neighbor is taking my mail! I am so mad I am going to catch him.",
        "Any time i let someone out in front of me in traffic and they don't wave i get angry.",
        "I really don't like a judgmental person. It irks me",
        "i just hate when people drive slow in the left lane",
        "I had to work late yesterday.",
        "I arrived at work only to be told they had changed the schedule and I wasn't on it anymore.  I wasn't notified beforehand.",
        "I broke my coffee maker and now i can't make coffee",
        "I found out my group of friends went to the beach last weekend and did not invite me for some reason. I don't really know why though?",
        "I've been upset at how hard I have to work for a living.",
        "Somebody called me fat the other day",
        "I was sitting on my couch the other day, when my two year old came out of nowhere, and threw my phone at my head.  It hurt really bad.",
        "Some person cut me off in traffic yesterday and almost caused me to wreck. I can't stand people who can't drive!",
        "I was driving along today and crashed my car. The person pulled right out in front of me!",
        "Yesterday I was unloading the dishwasher and I guess not paying enough attention and dropped one of my good mixing bowls that busted all over the floor. It took so long to clean up. I was so mad at myself. ",
        "when a car almost hit me ",
        "Someone stole my phone yesterday! I can't stand people at my job!",
        "My brother tripped me and made me fall. He's such a jerk.",
        "i let someone out in front of me today and they didnt wave or anything",
        "i was upset when i saw a big dent in my car door",
        "I was mad when I almost got evicted. It was the landlords fault",
        "i was upset when i saw someone had taken my food from the fridge at work",
        "it made me mad to see someone put a dent in my door",
        "I'm a bit upset today that the man who has lived here for a couple years has this house falling down around him and isn't fixing anything. He knows how to fix things and has such talents but doesn't use them here.",
        "i was furious yesterday when i saw my dog had gotten out of the gate",
        "My coworkers are not good at their jobs.  Because of them I had to stay late and do their work before i could go home",
        "I was mad when a check bounced my friend gave me. I knew he was shady",
        "Facebook trolls",
        "i was upset when i saw someone left my gate open and our dog ran away",
        "I was pretty angry when my ac broke. It was bad timing",
        "i was mad when i couldnt leave work on time",
        "My flight has been delayed 7 hours due to weather, I'm mad.",
        "i was mad when i saw a huge dent in my door",
        "Some jerk ran into my car because he crossed a red light. Now I have to have it repaired and get a rental",
        "One of our friends got a call from the school that her 11 year old wasn't at school, and it turned out to be a mistake. Glad, but upset at the false alarm.",
        "I was supposed to mail off a check to pay a bill today and I forgot to put it in the mail when I left for work.",
        "Someone knocked all my documents off of my desk. They didnt even bother to pick them up. This really grinds my gears.",
        "my neighbor keeps being really loud late at night ",
        "People need to stop letting their dogs poop in my yard!",
        "When my son broke my favorite lamp. I though I was going to hit him",
        "I was upset at my daughter for sleeping too late.",
        "I went to a job meeting and everybody was late",
        "I am mad I got passed over for a position at work, I thought I was qualified for it too, but no contact",
        "I get aggravated by people that don't understand personal space.",
        "I bought a used car for my son recently. I found out the odometer had been rolled back.",
        "My cat spit up a hairball in my shoes today. I was so peeved!",
        "Someone parked in my spot at work that doesn't even work in the building, so I had to walk a long way to work today.",
        "My armadillo bit me today. Never felt so irked!",
        "i was upset when i saw someone had put a dent in my door",
        "I was driving home at night and the car heading towards me would not turn off their brights! Damn near made me miss the curve coming up.",
        "My son is still up. He always does this when I have to get up early",
        "Every time I open a soda. One of my greedy children steal it from me.",
        "These kids keep riding their bikes through my lawn! They've killed every one of my flowers!",
        "My sister slapped me. I was annoyed with her. ",
        "My roommate ate all of my food today. I didn't have any lunch.",
        "I bought some jeans today and brought them home to find out the zipper was broken.",
        "I thought I would get some good sleep tonigh. Nope. My toddlers are refusing to go to bed.",
        "My partner took my credit card and purchased a bag for herself without even asking me",
        "Why does no one ever pay me!",
        "Some one crashed into my car",
        "I am upset that the US is trying to ban our right to bear arms.",
        "Someone cut me off in traffic today",
        "I am so mad that I got a speeding ticket.",
        "I can not even think about losing any more money!",
        "I felt angry in the supermarket this week. The staff were ignoring the self serve checkouts.",
        "The waiter spilled coffee on my $1000 suit.",
        "Why do people get so mad at each other for no reason?",
        "The paper boy flung the newspaper and broke my window.",
        "My interest rate just went up on my credit card.  I am so mad it happened.",
        "I bought a brand new truck a few months ago. Did not even make it home and someone ran in to me. It was not my fault.",
        "My kids were arguing with each other a lot yesterday.  It was so frustrating and I got angry with them.",
        "Someone hit my car in the parking lot.",
        "I would not tolerate such attitude from a surbodinate",
        "This morning driving into work, people were refusing to use their blinker. It can become so irratating",
        "The other day my four year old smashed my favorite figurine. ",
        "My radiator broke down in my car that I rely heavily on.  It's going to cost 2000 dollars to get a new one!",
        "Someone cut me off in traffic. I was very frustrated when this happened. Then they went slower than I was.",
        "I was pretty angry when I had to wait at the pharmacy. They were taking their tim",
        "I'm staying in a hotel room for a work trip and its on the first floor by the pool. Screaming kids all day and night.",
        "I am getting frustrated with my job recently, they are overworking us",
        "I'm a bit upset that my real estate career in Florida didn't go as I had planned.",
        "I thought I would have a good day today but someone ruined it. I really kind of hate them sometimes.",
        "I went to the town hall to renew driving license. The agent gave wrong information. Because of him, I wasted three months.",
        "I hate when i let someone out during traffic and they dont acknowledge me at all",
        "At a shop, a seller was lying about the prices of the items that he was selling.",
        "I was mad last week when my car would not start. Its always giving me problems",
        "I had to renew my driving license. After 3 months, they told me that they lost my paperwork.",
        "I came back last week at home and I found that my girlfriend left me. She took with her some of my stuff",
        "i cant stand when i let someone out in traffic and i dont get a wave or anything. it really drives me crazy",
        "I was stollen my wallet at work.",
        "i was mad when i saw a dent in my door",
        "I saw a lady spit all over her hands after coughing..and then sneeze, wipe her nose..then she TOUCHED the door handle...Omg..I about died...and vomitted",
        "I just got cable installed and I can never find anything good on television. What a waste",
        "i can't believe my ex borrowed money from me and acts like he doesnt remember",
        "My best friend had to leave town to help take care of her mother who was diagnosed with lung cancer.  Her husband agreed she needed to go and then filed for divorce",
        "My landlord posted a curfew for our complex. Its pointless now the summer is over",
        "My dog pooped on the rug. I was so mad!",
        "it makes me very unhappy when i let someone out in traffic and they dont acknowledge me",
        "I saw a guy throw a bunch of garbage out his window. I was so mad. I yelled at him to clean up the trash.",
        "My crocodile bit my hand off. I was so mad!",
        "My dog pooped on the rug yesterday. I was so mad!",
        "My armadillo pooped on the rug last night. I was so mad.",
        "I asked for extra pickles on my burger at McDonald's. When I got it they only put 5 pickles on it!",
        "MY son is refusing to go to sleep. I had a long day and am really tired",
        "My parrot pooped on my arm last night. I was so mad!",
        "Someone threw away my lunch at work.  I am so mad that it happened.",
        "I am mad that my sister always asks me to babsit, but never does it fofr me",
        "People keep littering around my apartment building. It makes me so mad.",
        "I walked in on my brother going through my desk!",
        "I swear my best friend is alwasy taking advantage of me",
        "People let their kids run aroud in supermarkets at teh weekend",
        "My boss embarrassed me infront of the investors.",
        "i was pissed when i saw a dent in my door",
        "I have been working very hard on a project at work. My boss suddenly just took that project away from me for no good reason!",
        "I caught my wife cheating on me last week. She's apparently decided she likes other women now. I really don't know what to do!",
        "My friend has promised me that he would drive me to the airport for my flight. He never showed up and I missed my flight.",
        "Last, my car glass was broken,",
        "I applied for a job recently, it was a federal job and it took months to apply for. After I gave my 2 week notice to my current employer of 11 years, they pulled the job offer. ",
        "I was on hold with the cable company, kept getting transferred, then hung up on. They make me so mad!",
        "I was just accused from my wife that I stole $10 from her Purse. I am so furious right now, I would never do that",
        "i saw a man kicking his dog the otherday",
        "when my neighbor hit my car ",
        "Someone cut me off in traffic this morning. I was so mad!",
        "I'm pretty mad about the fact my internet bill went up 40 dollars out of no where",
        "I was so upset that my daughter borrowed my headphones. She never brings anything back",
        "I am so mad.  Someone took my crystal ball.",
        "The other day while driving. someone cut me off, when I honked they flicked me off.",
        "I had someone back into my truck last week.  I learned today that they did not have insurance!",
        "A manager from another team is trying to undermine my work.",
        "Someone screwed up a work task that I was partnered with. He also wasted 30 minutes of my time and his own and did it out of spite.",
        "My neice and daughter left such a mess in the play room today. I couldn't even look at them",
        "I wasn't happy today when someone ran in to the back of my moms car.",
        "I was at the grocery store the other day, and when I was walking through the isle and some kid brushed past me and almost knocked me over! I was so mad",
        "My sister in law is a horrible parent.  Her kids can run fevers of like 104 and she will not take them to the doctor.",
        "My girlfriend stole my credit card before leaving. Now, I have money issues.",
        "when my brother got jumped",
        "I spilled soda on my laptop.",
        "My sister in law drives me crazy.  She's a 45 year old special ed teacher that can't move out of her moms house or raise her kids.",
        "Our home was broken into when we moved in and it made me so mad.",
        "I'm so mad. Some guy hit my car while I was siting at a light and then ran off!",
        "I bought a watch on eBay that claimed to be a \"9/10 cosmetic condition\", but when I got it I noticed a huge crack in the watch face!",
        "My mother in law cannot mind her own business.  She always tries to bend my husband's ear to her way of thinking we should do things.",
        "My boss called me to come in on the weekend and it really has me peeved.",
        "My partner dropped my newly bought phone into the ground and the screen got a crack line on it. I had just bought it and now this",
        "someone cut me off in traffic today",
        "I am so mad that my boss made me work Saturday.",
        "In the supermarket last week I was angered by parents letting their small kids push trolleys. It was very busy and they were causing chaos.",
        "I was stopped at a light and when it was my turn to go a car from the other direction ran the light. I wanted to chase them down and give them a piece of my mind.",
        "My pizza got delivered and it's cold.  That makes me so upset.",
        "As a coach, you think you prepare your athletes for every situation and outcome. What we saw when we arrived at the track meet was unexcuesable and I've never seen anything like it before.",
        "A guy cut me off in traffic today",
        "Someone stole one of my pigs.  I am so upset about it.",
        "My cat vomited on my rug today",
        "I love my girlfriend but she can get me so angry",
        "My brother was in a drunken mood.",
        "My cat vomited on my shoes",
        "Someone stole my ketchup at work.  I was so livid about it.",
        "I have been without water for two days.",
        "i was pissed when i saw someone put a dent in my door",
        "Any time my boss asks for my ideas and they work, it becomes \"Our idea\" and then \"his idea\", but if it fails it's \"your idea\".",
        "I decided to grill a steak tonight for dinner.  I got distracted and it got burned.",
        "Every time I was the Phantom Menace, I get so mad. What was George Lucas thinking?!",
        "i was mad when i saw there was a dent in my car door",
        "2",
        "I was angry last night. My friend got drunk and annoying",
        "There's nothing that ticks me off more than someone who tries too hard to make an impression.",
        "i was mad when i saw my dog got out",
        "i was mad when i had to go into work on a saturday",
        "My neighbor is out again having a party...I find it strange because he yelled at me on a night before- but he has decided when HE isn't working- it's fine to be loud later at night",
        "My sister was supposed to show up at 3 today and she didn{t come until. Ruine my entire day",
        "My sister in law makes me furious on a daily basis.  She cannot take care of her kids, yet has no problem going out shopping and spending every dime she makes on herself.",
        "When I got cut from my hockey team. I worked so hard.",
        "I can't beleve I only got half of the maximum for my raise?",
        "I spilled coffe all over my keyboard.",
        "when my nieces play with my devices ",
        "i was so mad, my dog knocked my phone off the table.",
        "My homework submission had not been accepted for Calculus class. Professor claims it was plagiarized",
        "I did my best in my audition and I still didnt get the part!",
        "People around my workplace are always leaving litter all around the office and it really makes me mad.",
        "This is the third night in a row I can't sleep. My doc isn't giving me the right meds",
        "I get annoyed when someone is not sincere",
        "I really do not like the new text and drive laws.",
        "i was upset whewn i saw someone had put a dent in my car door",
        "The time that I found out that my girlfriend had cheated on me",
        "I was really mad with my housemate last night. She got in really late and made loads of noise.",
        "Someone threw away my lunch at work.  It makes me so mad thinking about it.",
        "I was having a party and had my cats locked up and told them and had a note on the door to not open it, well someone did and my cat got out and ran over.",
        "I made a stupid mistaske at work. Because of that mistaske, I was fired. I am angry at myself.",
        "I was at the grocery store and someone dinged my car with a shopping cart.",
        "We spent a lot of money on pizza. They didn't deliver what we ordered and then were rude when we called back! It was so frustrating. ",
        "My cat just scratched up my brand new leather couch while I was at work!  I am so mad at him right now I could scream!",
        "I woke up this morning and my truck had a flat tire.",
        "Ate at a fancy place the other night with the wife and the food was just terrible it cost that much.",
        "I'm upset with the federal reserve bank.",
        "I stubbed my toe on the side of my bed this morning. It's still hurting.",
        "I have a roommate that things it's ok to not use soap when washing her dishes. ",
        "I can't believe someone hit my car in the parking lot and left. There is a huge scrape on my door. I am livid about it.",
        "My dog pooped on the rug yesterday. I am so mad.",
        "My dog pooped on the rug today. I am so mad.",
        "My garage got broken into and my lawnmower and other things were stolen.  I was upset",
        "My dog pooped on the rug today. I was so mad.",
        "I lost my favorite jacket and I can't find it. It was quite expensive and not easily replaced",
        "My daughter made us late on the first day of school.. I hate being late",
        "A bit upset I was up all night again, not my dogs fault so much as she is just a new momma.",
        "i was angry when i saw someone had put a dent in my car door",
        " I was driving to work today. I was very late and then a slow driver got in front of me. They made me even more late!",
        "I forgot my lunch and my wallet at home this morning.",
        "I do not like walking my kids to school. There are way too many hills. I wish t car worked",
        "Someone at work threw my lunch away today.",
        "I had to go to the hospital last month when i got really sick and I was charged 400 dollars more than they said it would be.  I am ticked off to say the least.",
        "Dude cut me off in traffic turning left in too a store then had the nerve to beep back at me. By the way there was NO one behind me for a mile. ARG!",
        "I'm pretty upset I got a flat on the way to work today.  I was late and I'm down 200 dollars.",
        "i was pissed when i saw my door had been hit",
        "Someone backed into my car in the parking lot! They didn't even leave a note!",
        "i was pissed when i was told i couldnt leave work on time",
        "I am upset that my partner has put me through so much..and now going through more while he is away and trying to get treatment. In one sense I miss him..in the other..I am not sure I could ever be around him again.",
        "I am getting more mad at my landlord. They are not doing what they promise to do",
        "When my brother wanted to fight me. We had just got off the ice.",
        "i dont know why i keep going to mcdonalds anymore , they always get my stuff bad",
        "When I think of my landlord, I get pretty mad. They don't do half the things they promised",
        "I was pretty mad the other night when my check engine light soon light came on. It was just in the shop",
        "I was walking up out of the kitchen yesterday and I spilled my bowl of cereal all over myself.",
        "i am pissed that someone put a dent in my car door",
        "My son is still up and everyone else is asleep. He has to stop this madness",
        "my new neighnors keep leaving trash on the stairs. it is so annoying",
        "I was driving through my neighborhood when a car backed out of their driveway without looking. I was so mad.",
        "My boss said that I was rude to a customer earlier this year and that is why I am not getting a raise.",
        "I can't believe I missed my package delivery. I was home all day! Now I have to go pick it up at the post office.",
        "Every time I am promised a promotion they give it to someone else.  It just happened again!",
        "My partner nags almost about every detail in our relationship. Just yesterday, she criticized my taste for clothing style",
        "Someone took my phone when I was at work.  I am so mad about it.",
        "The printer at work is the worst thing ever",
        "The fast food guy forgot to give me my correct change in the drive thru. And he refused to give me my receipt! I had to demand to talk with the manager.",
        "When I got through shopping there was a scrape on my car door where someone had banged their door into it. They didn't leave a note and I was enraged.",
        "I broke my favorite vase.  I am so upset with myself.",
        "I dropped a mug and my coffee went everywhere",
        "The traffic was so bad this morning.  It just makes me so mad.",
        "Went to a fast food place, and they messed up my order. I even repeated it twice, and had them double-check with me again after that! I know they're under a lot of pressure and work hard, but why is order accuracy so hard...",
        "i was pissed when i saw someone had put a dent in my door",
        "I'm so mad at my neighbor. He blasts his tv outside his patio all night. It's making me crazy.",
        "Super upset that my yard received a ticket for being too long yet all the abandoned houses around me have 5ft tall grass. instead of ticketing decent people, they should try and stop all the rapes and shootings in the area and deal with all the abandoned houses.",
        "I didn't like when I found out my mom threw away my old Nintendo.",
        "I was driving home from work and a driver cut in front of me and made me almost hit another car. ",
        "I really do not like when I order a hamburger with no ketchup and they still put it on.",
        "i was angry when i saw someone put a dent in my car",
        "I went to the supermarket and as i was getting all of my stuff out of my cart they closed my line.  I had to put my stuff back in my cart and change lanes",
        "I am kind of mad about tomorrow. My team meeting has been pushed up on short notice",
        "Someone took my car stereo from my truck.  I am furious about it.",
        "When i see people leaving their parents in oldage home. I get furious",
        "My dog pooped on the rug last night. I was so mad!",
        "I lost my mind and lost temper when i came to know that i will not get my deserved promotion",
        "I don't like it when kids bully each other",
        "My brother keeps calling me and asking me for money. He doesn't even work! He should get a job instead of bugging me all the time.",
        "I couldnt believe my wife took money from my bank account, ",
        "why is it that bad things always happen to me!",
        "I just found out my husband is messaging another woman on facebook. He's asking her to meet up with her.",
        "I spilled whiskey all over my keyboard!",
        "someone almost crashed into me",
        "I am so mad, my landlord is selling the house so I have to move.",
        "someone almost killed me the other day",
        "It really gets underneath my skin to see a child try to bully another child especially if it comes to my family members.  I become a fierce protector and do my best to keep the peace.  I have a look though that seems to work best. ",
        "I really get mad when my taxes are raised.",
        " I lost my wallet a t relatives house with $400 cash inside of it, I immediately told them of of situation and they help look me for it and and expressed sorrow for my bad luck when I returned the following day they had bout a living room suit a immediately gave a story of how they one the lottery the night before , I was very upset and could hardly hide my true feelings.",
        "My sister in law irritates me to no end.  She lives with my mother in law and cannot take care of her kids at all.  My MIL basically raises them, feeds them, houses them, clothes them, etc.",
        "My internet company tried to deny having someone come out to fix my internet. It hasnt been working for 3 months.",
        "I get mad at overtly superficial people.  They're nice to you in person but talk crap behind your back",
        "It pisses me off when someone interrupts me in the middle of a sentence.  Throws off my whole train of thought",
        "I got pulled over for speeding the other day.  I know I wasnt speeding because I had my cruise control set.  Im so mad",
        "My car just got stolen last night! I'm so furious!",
        "I am so mad!  I just got charged double for something I only got one of!  ",
        "I asked my friend to water my plants while I was on vacation but she didn't and they died. I was so mad",
        "Some dude..because I live in a ghetto city..thought it was okay to pull up on my property beeping until I came out..smoking his cig with ashes in my driveway.. Makes me so angry at how UNCOUTH people are here.",
        "My landlord didn't want to repair the ceiling. He take rent but he doesn't want to make any reparations.",
        "MY new neighbors are so loud. They constantly slam doors all day.",
        "Some guy cut me off in traffic and caused me to swerve to the ramp.",
        "i was mad when i didnt get the day off",
        "Today, I lost my wallet. I mad at myself.",
        "I can never find anything to watch on tv. I pay too much for this satellite",
        "My father promised to buy me a car when I graduate from university. He never did.",
        "My dog was hit by a car and the person drove away. He had no regard.",
        "Some days every little things get me irritated",
        "I am so tired it is making me mad",
        "I'm upset at my brother for stealing my ice cream",
        "My car got towed when I was getting coffee for my boss",
        "I called my bank to resolve the issue regarding them blocking my debit card. It took me hours until i could get to a representative",
        "I am so mad at what Andrew Cuomo said.",
        "My girlfriend didn't want to go to dinner with me and with another guy instead. I was so mad!",
        "Some people are so slow at answering text messages, it's like they read it and never reply",
        "My dogged pooped in my neighbors lawn. It becomes a habit for him",
        "I was having a great day until someone rear ended my bumper on the way home",
        "I was so mad when Beverly Hillbillies got canceled. It was my favorite show!",
        "I really am mad at my brother.",
        "My neighbor keeps backing into my mailbox! I've gotten the police involved but they won't do anything about it. He's so nonchalant about it too.",
        "I was backing out of the driveway and I ran over a bike that I had told the kids to put away. I was so mad.",
        "My mother got scammed out of hundreds of dollars.  It was some internet phishing thing.  She had no recourse.",
        "my dad bit someone and I'm furious that he let his drinking get this out of control",
        "I need a root canal.",
        "I got into a fight with my wife lately and we were so mad with each other. ",
        "Someone slapped me, I felt so furious",
        "All the rain storms that have been blowing through lately has saturated my garden which I've been working on all summer. This is a big month for pulling veggies so I'm at a a loss.",
        "I steam cleaned my antique rugs last night but because they are so old they have ta horrible smell. I wish I would have just left them dirty.",
        "I got a dog from the pound laxst week . And they said all of its shots were included in the initial payment. Come to find out I had to pay $40 extra on top of the $50 I initialy paid and I was furious.",
        "today my boss made me angry by giving me too much work to possibly do",
        "A car nearly hit me yesterday just because they wanted to change lanes while turning ",
        "I saw someone put use gum in a homeless man's cup.",
        "My dishwasher leaked and we had to have our whole kitchen and living redone due to the damages.",
        "My son got brought home by the police last week for spray painting an abandoned building. I was furious with him!",
        "My cat attacked me over food!",
        "I'm so mad. My husband ate all my ice cream. ",
        "I was angry when my dog got into the garbage can while I was out!",
        "My daughters's boy friend got drunk and started a fight with my husband. We had to call the police.",
        "got a call from my kids school yesterday letting me know she never showed up. When I asked my daughter how her day was in school she had no idea I knew she did not go. Totally lied to me.",
        "I found out that my first boyfriend had been cheating on me. I was so mad at him because I knew I deserved better. He never apologized to me about it and I told him I never wanted to see him again.",
        "I think someone stole my headphones recently.",
        "i lost my purse",
        "My mom yelled at my girl friend for something that wasn't worth yelling about.",
        "Went out to eat with a group of friends. Everyone got their order except me. Put it in again and still after 40 mins had not gotten it.",
        "My neighbor lets his dog poo in my yard.",
        "I was super annoyed when a scammer called me on the phone today. He wouldn't listen to my pleads to stop calling me.",
        "fell on my keys",
        "I went to the mall with my friends, I had my purse in my hand and someone hit me on my shoulder causing my purse to fall. He did not apologise.",
        "Our home was broken into right after we moved in and I felt this way.",
        "I won a small contest. So, my friend was there when I entered the contest, and he was the one that encouraged me to enter. Now that I won, he says he deserves some of the winnings because he was the one that made me enter. I disagree. But he keeps bothering me about it.",
        "I was mad to see my best friend start dating my ex girlfriend.",
        "Someone threw away my lunch at work today.  I was so upset someone did that.",
        "My brother tried to fight me after class. I couldn't believe it.",
        "i got the wrong item",
        "My dad's wife asked me to give her back the glassware she gave us at our wedding.  We've been married 10 years!  I think this is an insane request.",
        "My brother accused me of taking his money but i would never do that!",
        "I came home from vacation to find my home had been broken into. They stole my grandmothers broach.",
        "I am mad at how the Eagles played the other day, they lost to the browns",
        "One time my friend and I were going to a concert and we had both paid for front row tickets...I was so mad at myself when we got there and I forgot it back home",
        "A few weeks ago my 3 year old broke my favorite eyeshadows.",
        "Someone bumped into me in an intersection and took off. I have no idea who it was and now I am left with the cost.",
        "It really bothers me when people stand close to me in line",
        "I was supposed to close on my house this weekend, but the people are refusing to move out!",
        " I saw a man slap his wife today. it made me extremely mad",
        "I was on a train in Sri Lanka. I asked the passengers if I was at the right stop. They told me no. Turns out I was at the right place.",
        "I hate this new printer at work!!!!",
        "I was cut off today and crashed my car to avoid colliding with someone. ",
        "I am mad at my brother because he broke my bike. He always want to use my stuff and break it.",
        "my room mate will not clean anything. It is so ridiculous.",
        "I was cut off this morning on the way to work. It caused me to crash into the ditch. I am so mad.",
        "Someone broke into my home right after I moved in and I felt this way after it happened."
    ]
}