{
    "threshold": 0.8,
    "seed": [
        "I was driving home from work and some jerk cut me off. I can't believe that. ",
        "When my boss backtracks on what he says",
        "We have recently changed over to recycled toilet paper because my wife want's to save the world. It's like sandpaper! ",
        "I bothers me a great deal when people show up unannounced.",
        "I have a friend who is always complaining about something. When I was going through a hard time she got even worse to make sure she sounded like she had it harder. ",
        "Got a pizza last night. It gave me food posion. ",
        "I came home to find my leftovers had been eaten. I was perturbed to say the least.",
        "Ok I was in Walmart buying a video game when this dud eshows up and immediately questions my selection.  Like it's some kind of internet forum!",
        "I'm annoyed at myself currently because I can't figure out how to install a game on a different disk drive. I'm also kind of tired and don't feel like looking online. I might just look tomorrow.",
        "i am trying to type and my cat keeps moving on my lap",
        "I'm so mad my son came home late last night.",
        "my neighbour is olay",
        "I have a card table that I put my computer on.  My son keeps putting his foot on it and I have to constantly tell him to take it down.",
        "I work in a call center that has 4 members on the team and is based on a queue.  Once you finish a call you go to the back of the queue.  On a regular basis I will get off of a call and the others will log out of the queue so I am back to the top again.",
        "I have a staff of 30 one lady cries daily",
        "My sister in law planned a get together during a time that we couldn't go, but asked to take my daughter instead.",
        "We went to a concert a few weeks ago, people wouldn't move so my son could go to the bathroom.",
        "Sometimes people ask me to do a lot when I am already doing alot. It's like they don't care that I have stuff to do.",
        "i couldnt stand it when my neighbor was using power tools at 8 am on a saturday",
        "My son's school starts next week, they just changed the day that is his first day. My husband had to ask off a different day as well.",
        "I was trying to watch my favorite show on tv and my husband kept talking to me.",
        "Ever day my boss is late to work. Today I was 1 minute late and got a write up.",
        "my bus broke down and i was late for work",
        "I was trying to buy something at Walmart, and this dude just starts criticizing what I'm buying like I asked his opinion!",
        "Its so bloody hot here, its unbearable",
        "Drunk guy puked on me",
        "This guy at school follows me around.",
        "i am annoyed at my neighbor's loud lawnmower",
        "My roommate left a bunch of dishes in the kitchen.  I wish he'd clean up after himself",
        "im frustrated by all the other drivers on the road lately",
        "sometimes i just wish i could be a hermit and never deal with people.",
        "I was irritated to find out my phone company was billing me for things i did not use. I never get the time to follow up on that",
        "I was driving home from work yesterday after a long day and I realized just as I pulled into my street that I had actually left my bag in the office - with my purse, phone and house keys!  I had to travel 40mins back to the office to get them and then 40mins back home again.  I was sooo annoyed and cross with myself!",
        "i live next to a football field and every football season i hate living here.",
        "I saw something that looked really good in an ad, but when I went to the store to get it, it didn't look as good.",
        "I went to a restaurant and the waitress put things on our bill that I did not order.  ",
        "I really hate when people let their kids run wild in public. I do believe kids should be kids but there is a time and place for it. ",
        "The other day I was at the store and the woman ahead of me acted like an alien who had never seen a self checkout machine. I wasn't in a hurry or anything but it was obnoxious that she was holding everyone up.",
        "I made plans to have a family cookout but it started storming I was so irritated.",
        "waiting for cable repairman who is late",
        "My neighbor next door is remodeling his house. I wouldn't mind but he starts at 5:30 in the morning.",
        "I went to see a movie last night. A couple two rows in front of me would not stop talking. It was incredibly annoying.",
        "I was trying to finish a work project but the server went down!",
        "My bra is driving me nuts",
        "My cat keeps attacking my foot. It was funny at first, now it's just annoying.",
        "it is frustrating waiting on hold to speak to a human",
        "Just got home from the grocery store. Forgot my wallet at home. Got to check out and had to apologize to the cashier and leave with out anything. ",
        "There was a bad crash this morning and I got so irritated it had me late for work.",
        "I hate going to walmart.  People just walk right out in front of you and don't even say excuse me!",
        "my cat vomited in the floor and i stepped in it!",
        "I was super irritated when my boss kept pulling my hair for \"fun\". He doesnt seem to realize how irritating it can be.",
        "A friend of mine borrowed my lawn mower. He ended up bringing it back broken.",
        "On my way home today there was someone in the fast lane going so slow in front of me.",
        "My cat keeps climbing up the curtains in my room. I really wish he would stop.",
        "My dog refuses to eat the food I bought for him. I bought a huge bag of it, so it's rather irritating.",
        "I had a coworker at one job that just would NOT stop talking. She would hold you for 30 minutes, just chatting away about nothing.",
        "the rain today is frustrating",
        "This old lady ran a stop sign the other day and almost hit me when I was in the crosswalk on my bike. I wish people would pay attention to pedestrians.",
        "Our mailman keeps leaving packages outside of the building instead of putting them in the entryway. The other day it rained and my package was ruined, and a few times my things have been stolen.",
        "A co-worker of mine was late delivering materials for a project.  I wish he'd care more",
        "I have this one co worker who is so lazy and it just makes me so irritate because I have to do extra work.",
        "I went out to the garden and there were a ton of mosquitoes, I couldn't even do any gardening.",
        "I kept getting stuck behind a man on his phone in the grocery store yesterday. Somehow he managed to always be in the same aisle as me, and always take up all the space. He was really loud, too.",
        "Last week I smelt something on the way home that was very disturbing. ",
        "My neighbor recently began renovations on his home. I don't mind it, except he starts hammering on stuff at 5 am on the weekends.",
        "A coworker took credit for a work I  had done. I had to go to my manager to get it straightened out.",
        "Im trying to get some work done and my dog just wants to play!  I love him to death but he needs to be independent at times too!",
        "A co-worker of mine was late with work materials.  I hope I can get the project done in time",
        "I was walking around my office and someone spilled coffee on me.  It was a new dress shirt as well",
        "I was upset when my family kept leaving me on vacation",
        "I get so irritated when drivers drive slow in the fast lane this be the reason behind wrecks and traffic it is especially horrible here in Florida.",
        "I made plans with a coworker and she never showed up to dinner I was so angry.",
        "I'm getting very frustrated with how often my bank calls me. I prequalified for a mortgage on the website last week and they've called me 3 times a day ever since.",
        "My bank won't stop calling me about a mortgage.",
        "I had a flat on the way to work this morning.  When I went to change the tire, the handle to my jack was missing. I had to use a screwdriver to work the jack, and it sucked.",
        "I was trying to contact my friend so we could set a time for our plans today but he never got back to me. I was looking forward to catching up.",
        "One day I was talking to a friend. They kept talking about how smart they were compared to other people. It was really annoying.",
        "I coupon at groceries stores on a regular basis. It is really frustrating when the cashier does not understand coupons. Sometimes I feel like the companies should train their employees better when it comes to coupons.",
        "I went to a restaurant that had call ahead seating. I called ahead and was put on the wait list. We arrived 10 minutes later as directed. However, we still have to wait over 45 minutes for our table.",
        "i am bothered by my neighbors loud power tools next door",
        "My sister in law is always thinking of herself and not taking anyone else's schedules into account.",
        "A co-worker I work with on a project has been late.  It's been very irritating trying to get things done",
        "I took my kid's phone away as punishment for getting on the phone late at night. She found the phone and was watching YouTube. She needs to start preparing to get up early for school.",
        "My son just started a new school.  The communication with them has been terrible!",
        "Our marketing manager at work recently added a ton of new tasks to my workload that weren't part of my job when I was brought on. I'm a little irritated, like she's passing her work off on me.",
        "My dog keeps attempting to chew up my shoes no matter where I put them!  It's like he is hunting them.",
        "My grandma threw out my high school yearbooks. I am not overly nostalgic about high school or anything but it made me kind of mad, they can't be replaced.",
        "My dog doesn't seem to ever tell me when he needs to go outside! I walk him for about 30 minutes and he still uses the bathroom in the house.",
        "My husabd has been getting on my nerves worrying about his football team losing.",
        "My neighbor keeps playing his music loudly late at night when I'm trying to sleep. I think I need to have a word with him.",
        "My neighbor's dog keeps barking all day. I've talked to him several times about it, but he seems to not care.",
        "My neighbors are really getting on my nerves.",
        "I can't believe I lost at Bingo! I spent 40 dollars and didn't win a penny",
        "my internet connection is horrible sometimes",
        "I am so annoyed I was billed twice by accident. But it keeps happening. ",
        "I was trying to find my son's back to school supplies myself over ordering them from school.  They wanted specific brands and I had a hard time finding them.",
        "I was driving and someone cut me off in traffic",
        "My girlfriend's cat constantly walks over my head in the middle of the night for no reason. Apparently she doesn't do it when to my girlfriend ever, and only acts up when I'm there. I'm pretty ticked off.",
        "My sister leaves her clothes all over the living room. I get so irritated and I always tell her, but she seems to very lackadaisical. ",
        "Traffic in Dallas can be so frusterating! To think todays traffic was because 2 people decided to argue in the middle of the intersection and block everyone. ",
        "I was studying at the library and the lady was smacking her gum across the table from me.",
        "My upstairs neighbors make a ton of noise at all hours of the night. It makes it difficult for me to sleep. ",
        "My bank has called me three times a day ever since I applied for a mortgage. It's been a week and they show no signs of slowing down. ",
        "My upstairs neighbors make a ton of noise at all hours of the night. It makes it difficult for me to sleep.",
        ": My bank has called me three times a day ever since I applied for a mortgage. It's been a week and they show no signs of slowing down.",
        "My dog sheds so much I have to vacuum my room practically every 4 days if I don't want little tufts of fur everywhere. I'm so irritated, but it isn't his fault and I love the big goof.",
        "this math problem is so annoying",
        "I had to sit in traffic for over 2 hours due to road construction! I was so frusterated!",
        "My brother keeps not washing the dishes!",
        "My dog kept barking and waking me up.",
        "my sibling screamed at me and it really made me feel sad",
        "I feel anxious when I have to wait for people that are late. Why can't everyone just be on time?",
        "my neighbor dog is always barking, I can't stand it",
        "At work today, a lady was outright belligerent.  She wouldn't leave me alone!",
        "I work in tech support and customers often get mad because they are trying to do something our software cannot do.  They then demand I fix it.",
        "My internet connection keep breaking! How am I going to get all my work done?",
        "No matter who comes to the door, my dog barks. He's such a nuisance, but I love him.",
        "you know at work, one of my coworker is always singing to himself, it bugs me"
    ]
}