{
    "threshold": 0.8,
    "seed": [
        "Someone offered me a job online to make a lot of money. ",
        "I was apprehensive to get married.",
        "Had HELLP syndrom with first child.  Spent all 9 months being pregnant with 2nd child worrying about the same thing happening.",
        "Back in October of last year I had my first drink. At that time I had never drank or tried any drugs or anything, so I was very nervous about trying anything mind altering like that.",
        "I just started working out and wasn't sure how to start.",
        "I was traveling to my daughters new house at night and I was feeling a little anxious about not finding her house.",
        "I have a big meeting coming up soon, and even though I am pretty well prepared, I can't help feeling like this is a big risk.",
        "I was unsure about letting my son go to a sleepover since we didn't know the family very well.  It was hard to decide what to do.",
        "Buying my first home, and I'm worried about all the expenses that might happen besides the mortgage.",
        "i was on a date with a new girl.  we were walking to a concert.  some toughs were approaching the other way.",
        "I am tired of working midnights, but scared to start something new",
        "Who knows what the future hold? All is in Gods hands! Take no thought about the morrow",
        "I am very apprehensive these days.",
        "Me and a few friends got offered to go to this party off campus. It seemed really sketchy but it turned out fine and it was a lot of fun.",
        "The first time that I ever tried weed was so scary at first. I was in Amsterdam and I was offered a hit from a bong and I was really hesitant, but it was a great time after that.",
        "I feel uncertain of  the consequences, climate change will bring, it could make the pace I live underwater some day.",
        "I can remember my first day of high school. I was nervous and not sure if it was going to be okay.",
        "I'm worried about my daughter starting middle school next week.",
        "I got a job offer but, i'm not sure if I should take it. ",
        "I was approached by a man that I did not know while walking in the park.",
        "I went to a new school my sophomore year. I was just leary about the whole thing",
        "I am nervous about going to law school soon",
        "I was not sure if I needed to accept this new job offer. I just did not know anyone there",
        "I really don't want to drive on this long trip, a lot of things could go bad.",
        "I was worried when I was deciding whether to put my schooling on hold",
        " I was scared my first day of high school. I was not sure how it was going to go",
        "I am on the fence about pursuing a promotion opportunity at my work.  I am nervous that I may not interview well.",
        "My boss wants me to babysit his daughter.",
        "I am a little nervous.  I am starting a new job on Friday.",
        "I am nervous.  I have to go to court for the first time.",
        "I got a speeding ticket today on my way back from work. I did not believe it so I tried to argue with the cop, still got the the ticket.",
        "I really like this girl at my job, but I am sort of nervous to ask her out.  I am not very confident when it comes to those types of social situations.",
        "Kind of scared to file for my financial aid this year. Not sure if it will cover all my expenses for the semester. If it doesn't, I don't know how I'll make ends meet and attend school.",
        "I was nervous when I was trying to drive where I wasn't familiar",
        "I had to make an out of town trip on a unfamiliar road. I was a little uneasy about it.",
        "I was a little on the fence about letting my daughter go to a party",
        "I dont think Im going to vote anymore",
        "I feel apprehensive about an upcoming job interview.",
        "this car nearly hit me head on while driving down the freeway at a medium speed",
        "I went to Disney World in March.  I was in line for a roller coaster, and started feeling very nervous about it.",
        "to believe my friend who said she didnt tell my secret ",
        "I got an item  for a birthday gift from my shopping wishlist and I am excited even thought it's been 3 months",
        "I am thinking about going back to school. I am just not sure I can handle the work load. I haven't decided yet.",
        "I wanted to take my son to a birthday party that he was invited to, but I was worried because he has been acting out a lot lately and I didn't want him to throw a tantrum while we were there.",
        "My first pregnancy did not go to plan.  I developed Hellp syndrome and it was very touch and go there for awhile.  both of us came close to not surviving.",
        "drinking on lunch break",
        "I was not sure what to think when I changed schools. I was just not sure how it would go",
        "When I first started my current job I was very scared. I had to psyche myself up in order to just walk through the front door. I had never worked in that field before and was terrified I would do a bad job. I read self help books with positive outcomes in order to get through the first few weeks.",
        "I don't think I want to go on a cruise.",
        "I was a little nervous about driving on my tire",
        "I'm thinking about becoming a vegan, but I'm not so sure I can do it.",
        "I wanted to visit with my mom, but it had been a long time and I was nervous.",
        "My boss wants to talk to me after lunch. I don't know what it could be about.",
        "My dog wants to play tug of war with me with this little rope toy she has. But when we played last night, she got so wild and energetic, that she started attacking my other dog! Not sure if I should do it again...",
        "I haven't heard back from my mom yet. Wonder if she's ok.",
        "I always get a little scared when moving into a new neighbor hood. I didn't have any problems the last time though.",
        "I was shy when going to a new school in high school. I did not know anyone",
        "I was a little nervous for placement testing",
        "I'm starting a new job in September. It makes me a bit nervous and scared about how I will fit in",
        "I am not so sure how I feel about buying a used car. I don't know if it will be good  quality.",
        "I start a new job tomorrow and I can't sleep. I'm so nervous about it, and I feel a bit ill",
        "One time I got invited to a shady party and I thought that it was a bad idea to go. We did though and it was a great time.",
        "I went paragliding yesterday.",
        "son applying to colleges",
        "I had been laid off from a job I'd had for 25 years. I wasn't sure what would happen",
        "when my friend wanted to move into my house that i have up for sale. ",
        "I was in one of those rent to buy furniture stores the other day and of course I got hounded by a salesman. He was pitching me some unrealistic sounding deal on a kitchen table that I totally didn't believe. It was so hard to get him to leave me alone. ",
        "I am very reluctant to confront my boss on her behaviors recently. She is picking on all the male employees for no reason..",
        "I've been reluctant to confront my mother on her stealing my money. I know what she's doing is wrong but she is mother after all.",
        "Im a little nervous.  I just finished my online class and the grades still aren't up yet.",
        "I am reluctant to confront my my best friend's girlfriend. I think my best friend is cheating on her...",
        "Welp.. I am a little nervous about going back to school this year.  I am starting at a new school.  An alternative school.",
        "I'm thinking about switching jobs, but I'm not sure if I should.",
        "Well someone I am thinking of working things out with talked about coming over on Sunday. I felt really uncomfortable with that because they haven't done enough to build back enough trust with me yet. And lo and behold..they acted up and made the decision for me anyway.",
        "I was very apprehensive about someone coming to my house this weekend. I felt very uncomfortable and like I would be stepping back in too old patterns",
        "I sent in my short fiction for a competition too close to the deadline. I'm not sure if it'll make it on time.",
        "I'm not sure if my boyfriend is the right one for me.",
        "My son goes to kindergarten in a week and I can't imagine him being gone through the day. It's hard to not be worried about how he'll be at school.",
        "I am a little nervous about dating",
        "I was nervous when I started a new school. I did not know anyone",
        "My husband wants to have another child. I am just not sure that it is the best idea right now. I just cannot decide.",
        "My husband wants us to move to another state for better job opportunity. I just do not know of it is worth starting over and having no family around.",
        "I am very anxious on the direction the country",
        "I am not looking forward to jury duty.",
        "I'm thinking about upgrading my computer soon, but I'm not sure if it's worth the cost.",
        "I am hoping to win the lottery this week",
        "I've had a lot of headaches recently, so I need to see the doctor.  But I'm really nervous about what he might find, so I've been putting it off.",
        "my ex girlfriend started talking to me out the blue again , im not sure to trust her again",
        "I'm a little unsure if I should take a higher position with better pay due to the added stress of the job.",
        "I have my big pilot certification test coming up. I am so worried I forget all the answers to the test. I don't know what I would do if I don't pass!",
        "I am a little scared. I found out my neighbor is a satan worshiper.",
        "I was having a test today. This one was for my graduation.",
        "I have to go to Mexico for business in two weeks.  I have never been and I am nervous",
        "I had to have a scheduled c-section with my 2nd child.  But then, about a week before it was scheduled, my blood pressure went up and they decided to do it right then.",
        "The feeling I had the day before my final exam ",
        "I was not sure whether I should date this girl. She was too good to be true",
        "My friend said they wanted to talk to me and didn't sound like their usual on the phone.",
        "I want to ask a girl out on a date, but I'm not sure if I should. She doesn't seem that interested in me.",
        "I just went for my yearly physical and thought everything was good, but I got a call that the doctor wanted to talk to me about some blood work.  Its awful because they aren't open until tomorrow so they haven't gotten back to me yet.  ",
        "im a little on the fence if i should ask for time off this week",
        "My friend has a habit of going nuts every vacation and I want to cancel ours.",
        "I was a little unsure about going to see a movie alone tonight. It just didnt feel right",
        "I'm not sure if i sound join the Comic Book Club at school.",
        " when my mom is dying I dont know what to do. I felt scared for the next thing will happened to her and to us. ",
        "I want to send my son to daycare, but I think he is too little. He doesnt talk and I don't trust people like that.",
        "My husband wants to take a job in another state. I am just not sure that it's a good idea to uproot the kids like that right now.",
        "When selling my house and the buyer wanted to move in prior to closing date. ",
        "Feeling strange about payday. It is a stressful time and even more so now when dealing with mental illness of the one getting the payday.",
        "I saw a stranger on the side of the road who needed a ride. I was not sure whether or not to pick her up.",
        "I am really nervous about work tomorrow!  I am supposed to be presenting at a meeting in front of upper management and feel uneasy.",
        "well I started my new job this week... It is weird to be with people who don't know me",
        "I went to the doctor yesterday due to an ongoing cough and tiredness.  They did some tests and now I am waiting for the results",
        "I recently ran by an ad online for this online swimsuit store. It seemed to be based outside of the US so I was a bit skeptical to order from them. I ordered anyway and will wait to see what happens!",
        "I don't think I should get on my flight in the morning.",
        "I want to visit my friend who lives in a large city an hour away, but I've never driven in such a large city.",
        "I really don't want to go to the dentist next week..",
        "When I was alone in my home, someone knocked the door forcefully. I just started to feel panicky and breathless. ",
        "Me and some friends got invited to this shady college party. We were hesitant to go but we did and it was great.",
        "I was offered a job and wasn't sure if I should take it or not. There were a lot of variables in play.",
        "My car broke down yesterday and it had to be dropped off at the mechanic.  I am really nervous about how much it will cost to fix it!",
        "to let my daughter go in the pool without her swimmies. ",
        "I don't think I should drive my car again until I get new brakes.",
        "I got asked to go on a cruise but, I'm not sure if I should.",
        "I felt a bit taken back to actually move out of my parents house",
        "I am scared of Trump.",
        "I ma just waiting for my next vacations",
        "I recently started dating this girl but Ive already seen some red flags. Not sure if I should continue seeing her or not.",
        "I'm a little uneasy about making it through the last half of this year.",
        "I am going to do scuba lessons in a couple weeks.  For some reason I am really nervous about it.",
        "I am receiving notifications from a friend. They are saying that I am owing them money.",
        "I have done dives off small diving boards for long time. One day, I decided to dive off big diving boards wondering what would happen.",
        "I was informed by my doctor that I had to have a biopsy of a suspicious mass. The whole process of waiting for the test and results caused a lot of anxiety.",
        "I have a health check up tomorrow, but I am a bit nervous to go. It's been a while.",
        "I was not sure when it came to the dmv. I did not want to go there",
        "I do not want to go to school on Monday.",
        "When waiting for my final grades before college graduation.",
        "I don't think I want to meet this person off Craigslist to purchase a couch.",
        "Someone I am kind of in a relationship with wants to come over this weekend and I am not sure about it. It's too soon after so much has happened and I don't want to deal with anymore upset.",
        "I was not sure if I wanted to start my new job. I was just nervous",
        "I am going skydiving for the first time and I am not sure what to expect",
        "I had a job interview a month back that was very important to my career. I went in there extremely nervous. I guess that didn't show because I ended up getting the job.",
        "I recently started working out and I was very apprehensive my first day in the gym.",
        "when my friend wanted to borrow money ",
        "I am supposed to be moving in with my boyfriend next month. I keep wondering if it's the right choice.",
        "I'm dreading the loss of my parents.",
        "I was a bit nervous on my wedding day. Would my wife really only be with just me for the rest of my life?",
        "The first time I donated blood, I instantly regretted signing up. I was so nervous of the big needle, but when I finally donated it was totally nothing.",
        "I felt this way while waiting to see if i got into grad school.",
        "I'm trying to be more careful with my money these days.",
        "I have felt this way while waiting for my son to be born.",
        "I am a bit worried about taking my SAT test. I am afraid I will not do good. I never get the math questions right.",
        "I have an exam tomorrow, but I'm at work pretty late.",
        "I am sick and need treatment.",
        "My kid has been staying late at school so much lately.",
        "I a little afraid to meet my boyfriends parents. I don't think we are meant to be anyway",
        "I have to call my landlord about being late on the rent. I really don't want to have this conversation.",
        "I'm thinking of trying out a dating app. I don't know how I feel about meeting strangers from the internet though",
        "I was going out on a blind date and just wasn't sure if it was a good idea or not.",
        "I could break my bones at any time!",
        "I got asked if I wanted to go to this party in a shady part of town. I went anyway and it was a great time!",
        "I had a difficult job interview. I need a new job as I am unemployed.",
        "Last month, I had to give a presentation at a big research convention. I was really nervous!",
        "I don't want to go on this date.",
        "I found out the my girlfriend's mom had diead. I had to tell her the news myself since she didn't have any other family to tell her. I've been dreading having to actually say it.",
        "Roller coasters this weekend",
        "I've been feeling nervous lately.",
        "Feeling a bit scared about the weekend. I have a hard time with my anxiety sometimes and I will be alone a lot this weekend.",
        "I just received a job offer. I should be happy but there were some red flags in the interview. Not sure if I should take it.",
        "I am having my first baby; a boy.  I hear all these different labor stories that aren't exactly reassuring!  ",
        "I really dont know what to expect after all, i've done my best, ill leave the rest to fate",
        "I rented a big Uhaul truck to move to a new house.  The truck is huge and I am quite nervous to drive it!",
        "I was nervous going to the doctor today. It had been awhile",
        "I was nervous going on a first date last weekend. I thought about not going",
        "I was nervous going to meet this girl. It was a blind date",
        "I feel a bit nervous to return to Florida.",
        "Yesterday, my mom came home late. I was very worried. I prayed until she came home.",
        "I am feeling quite a lot of trepidation about the weekend coming up. It might involve seeing someone I am kind of involved with and I am not ready to see them again.",
        "I'm going sky diving and kind of terrified.",
        "I think I'm going to try a dating app. I'm worried about being murdered though.",
        "I got a job offer at a different company and the benefits sound good but I'm not sure if i should take it",
        "I am not so sure about my daughters new school. They don't even have to wear backpacks",
        "My friends tried to convince me to jump into the lake.",
        "I really do not want to go visit my Dad.",
        "I was opening the results of my degree last month and I was really worried I hadn't done well. I had worked really hard and put a lot of effort in.",
        "I have an important job interview this week",
        "I hae an important job interview this week",
        "ordering something onliine",
        "My friend wants to take me to a haunted house at the carnival this weekend. I really hate haunted house. But I know my friend really likes them. I'm worried about having to go through it.",
        "was late to an appointment recently because I got stuck in a traffic jam",
        "I am leaving to go on a three month backpacking trip. Im getting cold feet about it though.",
        "I want to take a writing class, but I won't know anyone and haven't been to school in so long. I'm not sure whether I should do it.",
        "When I first started working out, I was very nervous and apprehensive while lifting weights.",
        "I am weary about ordering chicken now. It made me really sick once",
        "I am going horseback riding for the first time this weekend.  I am really nervous for some reason though!",
        "I am going to ask my boss for a raise and the end of this week.  I feel I really deserve it but I am really nervous to bring up the subject to him.",
        "I am worried about attending my firearms class. I think I will fail the test.",
        "Tomorrow, I will be evicted from my appartment. I don't know what to do.",
        "My husband says he stopped drinking but I'm reluctant to believe him",
        "I felt this way while waiting for my son to be born.",
        "My wife wants to have kids, but I'm not really sure I'm ready. I'd like kids one day, but maybe not right now.",
        "I caved and ordered online grocery.",
        "every time a new restaurant opens , i kinda dont trust it ",
        "Me and my wife booked a cruise ride. I am fearful of sea rides and have an intuition something going to happen",
        "I do not want to go to school Monday. They will laugh at me.",
        "I am nervous about an interview I have this week",
        "I injured in an accident. I worried to go home, since my dad will scold me.",
        "One of my friends told me that I was doing this math problem wrong. I was hesitant to believe that but it turned out that he was right.",
        "I am worried about an upcoming interview.",
        "I got invited to a party out of the blue in a weird part of town. I decided to go to it anyway and it was so fun!",
        "I feel apprehensive every time I have to make a speech ",
        "my friends had to push my down the slide, i wouldnt go",
        "I made a mistake at work. My manager have set a meeting to talk about it. I am a little bit worried.",
        "I'm neverious about going to work on Monday. I have a meeting with my boss but I don't know what it's about.",
        "My friend has been very distant lately.",
        "My new job promised a raise at the end of 90 days, but I still haven't heard anything.",
        "The hotdog I had tasted pretty funky. I'm not sure if it's gone bad.",
        "Starting some new herbs and I am a bit scared I might have bad effects. I have SUCH a sensitive digestive system.",
        "We keep getting these flood warnings, but they never happen when we're told it will.",
        "There's this guy that keeps wondering around my home the same time each day.",
        "I had to have a medical test done about a month ago.  I waited for two weeks for the results and it was so nerve-wracking.",
        "Im not sire my boyfriend is right for me.",
        "Once, I was pulled into the manager's office at my work and was offered a position that I felt that I wasn't really ready for. I had spent about the next day thinking over and over how to turn it down and worrying about if it affect my current job.",
        "I'm worried about an interview I have on Monday",
        "I am going bungee jumping for the first time next week and I am very nervous",
        "Maybe my paycheck wont come in the mail this month.",
        "My friend invited me on a cruise but I wasn't sure about it because I get seasick easily.",
        "I recently started working out again and I was very apprehensive in the beginning.",
        "I'm really nervous about going to work tomorrow. It is my first day. ",
        "I have decided to move my son to a new daycare that is closer to home. I really hope I made the right choice, but I am not  sure.",
        "With global warming and political turmoil, I sometimes worry about the future and what it could hold for the future generations.",
        "I am worried about starting my new job tomorrow. I am nervous about making good first impressions.",
        "taking a new cbd oil",
        "I am feeling a bit of trepidation about today actually. My partner was being a bit rude and he can explode easy, so it's hard",
        "I'm afraid to check my messages. The last line I saw from my friend is \"we broke up\".",
        "I am not sure that I want to apply for a transfer with my job. I would make more money but I would have to move",
        "I homeschool and am used to schooling one child but now I started 2 kids in school this year and I'm not sure if I'll be able to juggle it well.",
        "I'm not really sure what I'm supposed to be doing with my life right now, but I'm trying to at least get back home.",
        "I'm long-distance with my girlfriend right now, where she lives almost 1,000 miles away. I live on the east coast, she lives in the midwest. She has a good job, and I'll just be graduating college, so she's established. She's determined that I need to move to her, but I don't feel great about the idea.",
        "I have big two month trip coming up. Im getting a little nervous about going. ",
        "I really like a new perfume that I've tried but it's so expensive I don't know if I should get it",
        "I am not sure about my new job. I was excited but I dont think its right for me",
        "I have first date on Friday and I'm really nervous. I haven't been on a date in a while.",
        "I have to have some medical tests done.  The place that schedules them cannot get me in until September - this is very nerve wracking.",
        "I just got a new job offer, but I don't know what I should do.",
        "I have long three month trip coming up soon. I am feeling like I shouldnt go.",
        "I'm seeing my boyfriend for the first time in person for 1.5 years because he's been serving in the Army.  I'm excited but have butterflies too and am nervous about it.",
        "I was driving in a sketchy part of town to drop a computer off to a friend, and I did not feel safe at all. I was scared I was going to be carjacked",
        "I was not sure about going to this new mechanic. I had heard good and bad things",
        "I don't think I should drive in town today.",
        "I have just purchased a new gadget. I took it out of the box and tried to activate it but it will not work.",
        "I was supposed to take a flight tomorrow, but I am not sure I want to do it since there is supposed to be a storm at the time. ",
        "I just started a new job and I noticed a lot of the people gossip about each other. I'm not sure how long I can keep working here. ",
        "I am making my wife dinner with this new rub I just bought.  I think I\"m gonna love it, but I'm pretty sure she's gonna hate it.",
        "i have a doctors appointment this thursday and i'm very worried about it.",
        "I think something bad could happen on my vacation.",
        "i have a doctor's appointment on thursday that has me a little worried",
        "I got a job offer but I am not sure if I should take the job or not. It is a little far from home.",
        "A bit worried about the future today. There is so much to get done before winter comes and I only have so many hours in the day",
        "I have to go to a early team meeting in the morning. I am unsure whats going to happen",
        "So, for the last two months, I had been emailing a Shaker museum about visiting their location.  I had worked out all the activities for the day.  I found out just today, I had been emailing the wrong location.  So when my family and I arrived at the real location, I realized the mistake I had made.  We were so nervous and upset, we really didn't know what to expect.  Thankfully, it turned out wonderfully!",
        "I am going in for acupuncture for the first time and am a bit unnerved by the idea",
        "I am going sky diving this Sunday, but I am a little scared about it.",
        "I met a guy on a dating app. I'm not sure if I should meet him in person or not.",
        "I have to get a root canal tomorrow. I think it's gonna hurt.",
        "So, my youngest sister, whom I never met face to face,  hit me up asking for me to reach out to her, but It's difficult to really know what to say. ",
        "I got invited to this one party in a shady part of town. I was hesitant to go but I did and I was glad that I did!",
        "I recently was worried about a job interview even though I think it went well. I hope I get it.",
        "I'm going to watch a film this weekend, but I am not sure if I will like it.",
        "My girlfriend wants me to go to Thanksgiving at her parents this year, but I haven't even met them yet.",
        "I was invited to a party last week to a pretty shady area. I didnt know if I should go or not",
        "I just applied for a job. I'm really nervious about them not hiring me.",
        "My friend wants me to go hiking with him this weekend on some sort of scary trail where there's thin walking trails along some dangerous ledges... Not really my thing, but he's been kind of lonely recently",
        "Just got a new position after the old manager was fired",
        "As a teenager my family moved around a lot. I never looked forward to entering a new school.",
        "When I used to be prescribed on Adderall and the dosage was too high I would get jumpy and paranoid.",
        "Not sure if I want to ride the coasters!!",
        "I went skydiving for the first time recently.  I almost could not make myself jump out of the plane",
        "I'm feeling a bit nervous about my next decisions in life.",
        "With all the fires and thing happening in the world,  I don't know what will happen in the near future if Global Warming is not stopped.",
        "I always feel nervous at the start of a new school year.  It's hard to know how the students will be, and how they will work together.",
        "I start a new job in a few weeks and I'm nervous, I hope I'll like it. ",
        "When I was a kid, I watched Psycho at a sleepover on Halloween.  I avoided the shower for days after that.",
        "We are wanting to buy a newer and bigger vehicle. We aren't sure if we can afford it though. So, we haven't bought one yet.",
        "I was invited on a road trip with my kids. I was worried about not having my husband there to help me. ",
        "About a year ago, I was about to run my first 50 mile race.  I had broken my toe a few weeks prior and was very nervous that it wasn't going to hold up through the race.",
        "Someone at my work missed part of their shift due to a personal issue, but requested I withhold any information that would reveal they missed such time.",
        "All my friends signed up for horse back riding lessons but I had never been before.  I wasn't sure I wanted to go with them but they convinced me to sign up and go even though I was very scared!",
        "I had a c-section planned to deliver my baby. I was excited about seeing her but nervous about the surgery.",
        "I am worried about going back to school, I don't know if I should do it. It can be hard.",
        "Working as a nurse, there are many times when I have been worried about my patients. Sometimes when a patient is just starting to get seriously ill, there are not any obvious signs, but my intuition is almost always correct.",
        "When I joined the army I was really nervous. ",
        "My boss called me into his office without giving me a reason. ",
        "I applied for a barista job recently and wasn't sure I would get the job. I was very nervous waiting for the call.",
        "I use to work on a farm that required me to do a lot of different things. On on day in particular my boss asked me to stick my hand up a cows rear end to check if it was pregnant.",
        "My husband was offered a job in Hawaii. It is our very favorite place, but it is very expensive to live there. We also had no friends or family lived in Hawaii. It was a bit nervy but we did decide to move there.",
        "When I had my first born child I was so anxious and fearful about every little thing with him. I swear I would watch him sleep just in case something would go wrong, at least I would be right there.",
        "I remember when I was younger, our teachers would provide us with pancakes every Tuesday. I miss those days.",
        "I've been anxious because I think my new landlords don't approve of dogs in the house I'm renting and I have a dog!",
        "About a year ago, my doctor asked me about an unusual mole on my shoulder.  She got out this special light and said she didn't like the look of it.  She sent me down to a dermatologist and I waited around for a couple hours.  He took a biopsy and I had to wait a week for the results.  It was a long wait.",
        "I got a call from my sisters boyfriend saying she had been in a wreck and was life flighted to a hospital. I had to drive 2 hours to get to where she was without knowing any details about her condition.",
        "Started a new job.  In an industry i have never worked in, with people from all over and a physically demanding job.",
        "I am very anxious socially and don't like to go out with large crowds. Tomorrow I am going to a MLB game with my best friend and her parents. I am apprehensive because this will be my first in a large crowd in over 8 years. ",
        "I was about to deliver the biggest presentation of my life. It was going to be in front of 4000 people, and I was extremely nervous. I'd never done this before.",
        "I got tensed when my reslt didnt come out with others",
        "I had to give a presentation at an international conference recently. It was terrifying!",
        "I already have one cat and he's older. (14) I work long hours and I've thought about getting him another kitten to have and spend time with but I'm not sure.",
        "I've gotten this job opportunity but, I don't think it will be a good fit",
        "Had my employee review this week and my boss has been putting it off for 4 days.  Shee keeps says she'll do it and then puts it off.  I still don't have the results and I've been worrying about it all week. ",
        "The building where I work is under construction and senior leadership was recently offering tours to staff members. I was a little nervous about having to walk through a live construction zone and thought I might trip on something. ",
        "I was nervous when I sang a song at a concert the other night.",
        "I applied for a job I knew I was under qualified for, and ened up getting an interview.",
        "My daughter is starting to play softball this year.  I tried playing when I was younger, but but the other girls were mean.  I know she's excited, but I can't help but be a bit scared as well.",
        "I am starting a new job soon. It is quite a step up from my current position, so I'm a little scared that I won't perform well. ",
        "I was home alone when all the power went out. I heard a noise and didn't know what it was.",
        "My car would not start, I was close to someones house so I went there to seek help. A man answered and asked me to come in, but I was really scared.",
        "The other day I wasn't too sure about letting my dog off his leash but he seemed to be doing really well recently so I let him off and he was quite obedient and never strayed too far away from me!",
        "Starting a new job is so nerve wracking but exciting at the same time.",
        "There was a time when I finally dredged up the courage to visit my neighbor's chickens. I was really scared that they would peck at me, because I've heard that the roosters are very angsty and territorial.",
        "So, my mom was missing for a lot of years, but I searched and found her. It will be interesting to see if she still loves me when we meet in person again.",
        "I was hesitant to run a marathon with my friend",
        "One time I went cliff jumping with my friends. I was scared to go since I'm afraid of heights but I still managed to do it!",
        "One day I walked into a room full of smoke.  My father use to smoke and he was not always nice so it reminded me of him.  As i walked into the room I thought of all the mean things he had done.",
        "I was offered a new job last week but I dont know if I will take it.",
        "i'm always scared that something bad will happen.",
        "I thought my wife had umbilical hernia. Which is a serious health condition. Doctor told her she might die or end up in an ER! .",
        "I'm 47 years old and have been taking psychotropic meds for well over 30 years. I'm having more and more trouble with them working properly. ",
        "When my daughter told me she had news for me over the phone, her tone made me so apprehensive. Turns out, she just wanted to tell me she scratched the car.",
        "I really love a good scare, but I'm also kind of a chicken. My friends convinced me to go to the annual haunted house at my county fairgrounds many years ago and I was super excited. Once we were there, though, I got really nervous and wasn't sure I wanted to go in!",
        "I was to check my name on the list of students that passed, I was so tenses",
        "I am a little bit uncomfortable with knowing that my Ex has HIV",
        "We were driving on the interstate and I noticed a woman hitchhiking. I wanted to pull over to help but something told me not too.",
        "I'm waiting to hear back on whether or not I got the loan approved. I'm running in circles all bent out of shape about it.",
        "I'm about to leave the job I've had for 3 years and go to a new company. ",
        "I was gardening last weekend and I had to move a bunch of pots. I knew there might be spiders so I took my time to look carefully. ",
        "I got my associate's degree last year, and I had to get an A on my last final exam to get an A in the class.  It was three days of intense waiting.",
        "When my kid didn't get off of the bus yesterday",
        "One time I just signed up for a gym and on the first days I was supposed to go, I signed up for a free lifting workout with the trainer there. Before I left I was wondering to myself if I should go or not, and wasn't too sure what was the best plan of action. ",
        "I've been thinking about applying for a job that looks really great. However, I'm not sure if I'm qualified for it.",
        "I can't make decisions when buying things if there is too many choices",
        "My son is getting ready for his senior year. I'm nervous about him leaving home next year. ",
        "I have a job interview today. I have been out of a work for a few months so I am a bit rusty.",
        "I got a call about a job offer back in late May this year. I wasn't sure if I wanted to try and interview for it it since seemed like just another in a long list of jobs I'd applied to. But in the end I decided that it was better than being unemployed, so I went for it. I won over the recruiter in the phone interview, and was hired the same day!",
        "I recently joined a new team of people at work (a new work group), and I was feeling unsure about the goals of the project we were working on or whether the project was even a good idea or not.",
        "School starts back in 2 weeks.  I'm a bit nervous about the new students/class that I will have.",
        "This guy on the phone kept asking for info and i was worried it was a scam",
        "Just had a wreck the driver that hit me was not insured not sure how this will turn out",
        "I invested a lot in shares. One day one of my important share went down. I was very worried at that time.",
        "Approaching a sheer-drop water-slide.",
        "I had a biopsy recently and I am still waiting for the results. I'm very nervous about it.",
        "I was at the dog rescue and I wanted only 1 dog but I ended up getting 3, I hope I can afford them.",
        "I remember going to a theme park and wanting to ride a roller coaster. I'm afraid of heights and this was my first experience riding a roller coaster. I ended up enjoying the experience and now I love roller coasters. ",
        "I was apprehensive a few weeks ago when I got on this rickety roller coaster. It was an old wooden one and kind of scary. ",
        "I just moved across country and i feel a bit unsure if this was the right move for me.",
        "I was reallt nervous about my first date with my girlfriend because it had been a long time since I'd dated anyone.",
        "So the president of the school's pto and I don't get along. It makes having to go to this meeting today hard.",
        "I went to a water park onetime and my top came off while I was going down a slide",
        "when my daughter wanted to get dropped off at the movies",
        "I'm supposed to visit my sister's family for thanksgiving this year, but I'm not really looking forward to it. We haven't gotten along over the past several years. ",
        "Someone knocked on my door the other day. I peaked around the corner so they could not see me. I don't know anyone and was alone so I wasn't sure if I should answer the door",
        " I rode on my boyfriend's motorcycle for the first time on the highway and I was a little anxious about it",
        "There's so much going on. I wonder what the future holds",
        "My husband and I decided to get another dog. I was really nervous to tell his parents about it because sometimes they can be a bit judgmental of our decisions. I wasn't sure how they would react to knowing we'd already put a deposit down.",
        "When we were deciding to move across the country i was really nervous about the whole idea of it. I almost got cold feet.",
        "My sister wants me to come out for drinks with her. I don't really drink nor do I like her friends. I don't think I want to go. ",
        "I was walking to my car in a parking deck and heard a strange noise.  Then I saw a guy and he was walking away from me.  As I passed him I realized the noise I heard was breaking glass.  He was breaking into the cars.",
        "I was at the store and the salesman was really pushy.",
        "I remember when I went to college out of state, I was a bit scared of the unknown.  It was hard to adjust, but I made friends quickly and that helped.",
        "I went to go buy a car at a dealership and felt i was being taken advantage of. ",
        "I got invited to speak at a conference, but I'm not sure I want to do it.",
        "I don't know if I should take the job offer I got today.",
        "I'm going for an interview for a job on Monday and am feeling nauseated when I think about it.",
        "I was careful when choosing my new phone.",
        "I was really late to work the other day, and my car was running on fumes.  I just knew my gas was going to run out before I got there.",
        "I recently started working out and I was nervous when I first started back up./",
        "I am thinking about looking for a new job. I just do not know if I should or not.",
        "I was apprehensive when I went to my doctor's appointment.  They're doing tests for cancer.",
        "I have been feeling this way about getting in to grad school.",
        "I want to adopt a new cat, but I already have three dogs. I'd love to have a cat, but I'm not sure if my current dogs will take well.",
        "I was thinking about going camping, but I'm worried about the weather ruining it.",
        "everytime i am trying something knew i get that paralyzing fear of the unknown feeling.",
        "We're going to the amusement park and roller coaster riding tomorrow",
        "A homeless man asked me to roll down my window in my car.",
        "I'm signed up to go sky diving for the first time this weekend, but I am nervous.",
        "ordering something from a sketchy website",
        "I hesitated before getting on the rollercoaster.",
        "I was starting a new job and could not sleep the night before. I was feeling extremely anxious about the decision to change jobs.",
        " was at the store the other day and this random lady kept asking me my political party. She was very weird. ",
        "I want to try to eat sushi someday.  I am afraid I will get sick though.",
        "I don't know if I should apply to university or not.",
        "My friend ordered me some sushi but fish food scares me. I didn't feel like taking a bite.",
        "I've been applying for jobs lately, and though I want a new career, I also have to apply for anything I'm close to qualified for to get paid even though I don't want to in case I get stuck there.",
        "Sometimes I'm afraid to ride the city bus because you never know what kind of drama will unfold.",
        "I need to buy a new car. I am looking at something that uses alternative fuel, but I cant decide what kind to buy.",
        "avoided placing an order",
        "I really do not want to go to the concert tomorrow.",
        "I am enrolled in a motorcycle class tomorrow!  I am a little nervous though!",
        "I'm edgy about the last half of this year. I'm having rough financial times.",
        "When I was at the pool and some guy came in wearing all dark clothing and a bookbag. ",
        "I ate at  a very popular restaurant in my city last night. This morning I woke up to the news saying they found out that they were not serving real meat.",
        "I met a stranger once. He asked me for a ride.",
        "I had to go to a new doctor last week. I was a little unsure and nervous",
        "I was invited to a party today. I am not sure I want to go.",
        "A homeless person begged me for money the other day. I wasn't sure if I should give it to him because I didn't want him to spend it on drugs or something",
        "This guy called from the phone company asking for very personal info",
        "I heard a coworker talking about welfare and other social support in a very negative light. I was offended  but decided to hold my tongue.",
        "I decided to change jobs lately, but I am now not sure I will adapt to this new job.",
        "A couple years ago I went back to college and it had been a little over 20 years since I had dropped out.  Needless to say it was a little intimidating.",
        "I want to take my kids to a buffet. I am afraid it will be a waste of my oney",
        "I used to be nervous if someone tried to confront me or start a fight...but since I've taken up boxing mma and wrestling I really don't fear anybody",
        "We just bought a used car and we've already had to take it to the shop",
        "I have felt this way while getting ready for graduate school.",
        "Tomorrow is the first day I start a new job and career.",
        "I always feel on edge when the puppies are outside for too long.  It makes me worry too much.",
        "This girl just invited me out on a date. She seems sweet and I'm interested.. more interested in her than I am this other girl I've been seeing for a few weeks. But I feel bad just dropping this girl I've been seeing recently. Like, wouldn't that be rude?",
        "I felt uneasy as I looked at the looming rollercoaster. ",
        "I'm not sure if my boyfriend wants to get married yet. I won't rush him though.",
        "I have this feeling because I am applying to graduate school and I am anxious.",
        "I'm going to eat sushi for the first time this weekend, but I am a little nervous.",
        "We're going roller coaster riding this weekend",
        "My current employer is having big financials problem. I am afraid that the company will go into bankruptcy.",
        "I have an overseas trip coming up. I have never been and I am feeling a little scared right now about going."
    ]
}