{
    "threshold": 0.8,
    "seed": [
        "We were getting ready to move back to our hometown after nine years away. I could not wait to be back close to family and friends.",
        "Had a interview yesterday. I think it went pretty well. I hope I get the job.",
        "waiting for christmas! ",
        "We tried for a baby for a long time, almost 4 years.  Waiting those 9 months to meet her were so hard!",
        "I remember waiting for the Nintendo Switch to come out, I was so excited, I still love using it every day!",
        "Shortly after I got married, my wife and I decided that we wanted to have kids. When we found out she was pregnant, we couldn't wait to find out if we were having a boy or a girl.",
        "I'm predicting a very warm summer this year.",
        "My parents always taught me the value of patience.  A couple of Christmases ago I woke up on xmas eve to see if gifts were there but there was nothing...then the next day I got an xbox 360",
        "My vacation is coming up in a month. I've worked nonstop for 9 months.",
        "My wife is at the hospital getting checked right now. I think we might be getting good news about a new addition to the family.",
        "I have a very hard time with job interviews. Every time I have one I get really nervous, and the closer I get to the interview the worse I feel.",
        "Just heard back from my boss about a promotion. He says it sounds good that I would get it.",
        "I was waiting for a package that had been back ordered to finally arrive.",
        "I can't wait for next Sunday",
        "I went on a job interview and I have been waiting all week for an answer about if I got the job or not.",
        "I can't wait for next Sunday.",
        "It was my sixth anniversary the other day. I was pretty sure my boyfriend was planning on proposing. For a couple of days leading up to the day I was so excited I could hardly wait.",
        "My aunt is coming to visit.",
        "I can't wait for the weekend.  I am going to Disney World in Florida.",
        "I am counting the days until I go on vacation.  I can't wait!  I am going to Europe for a month.",
        "My current employer has financial difficulties. It has layoff 25% of the employees. I started to look for another job. I am expecting to be part of the next layoff.",
        "The other evening watching the World Cup soccer I was full of anticipation, hoping that England would make it to the final",
        "I can't hardly wait for the outcome of Strzok testimony yesterday. It would be interesting to watch for time to come. Criminal investigation coming to conclusion and what to do about Strzok and his evilness. ",
        "I can't wait til my birthday next year. I'm gonna take a cruise",
        "I was anticipating when i applied to college",
        "It seems like every weekend I cannot wait until it gets here. I'm always counting down the hours on that Friday.",
        "I'm starting my junior year in college in a month. I am so excited. I can't wait.",
        "I'm really looking forward to the future.",
        "I'm going on a date this weekend. I'm pretty anxious about it.",
        "Back when I used to wrestle I always expected my opponent to be better than me, so I would go 110% in every match",
        "School is about to start again. Me and my kids are so ready!",
        "Just got back from a job interview. I was able to answer all the questions and the recruiter seem impressed.",
        "Been waiting to hear back from my wife. She's at the doctor getting checked, and we've been trying for a baby for a long time.",
        "When playing video games, I always worry and think about if i can win or not.",
        "I'm going on my first trip to Disney World in a few weeks. I can't wait!",
        "I can not wait for Top Gun 2.",
        "School is going to start in a few weeks. Not looking forward to it.",
        "Turning 21 next week. I hope I hit it off with a girl.",
        "I was excited my first day of college. I was excited about my next step in life",
        "I am feeling very hopeful about my business. It can make me jittery but happy everyday.",
        "A time when I felt excited was when I was waiting for Black Friday to purchase a new surround sound system.",
        "I can't wait until I get paid on Friday.",
        "My brother is about to find out that I had to steal $20 from him to pay for gas, since I was in such a bind. He's gonna be so mad at me.",
        "I am anticipating the new super smash bros game coming out soon",
        "I cannot wait for the new Pokemon game to come out soon!",
        "I hate going to the dentist. I have an appointment coming up and I don't want to go. I have a tooth that has been hurting me for awhile and I have already put it off.",
        "I just went on a fantastic interview. My nerves are really bad awaiting their decision on if I got the job or not.",
        "Got a call that I won the weekend trip to New York. I've never been!",
        "I haven't gone camping in years that I don't remember what it's like anymore. Finally getting a chance to go again.",
        "I'm starting a new job soon.",
        "When i was younger i had a to get ready for a camping trip. People told me not to bring a rain tarp but i brought it anyways.",
        "My daughter told me I should be expecting a shipment soon. I don't know what it could be!",
        "I am hopeful about moving out of this town.",
        "I could not wait to go to my aunts house as a kid. She would always cook us good food ",
        "Christmas eve is the worst day for me every hear.",
        "I'm anxiously awaiting for my child to start kindergarten. ",
        "I can't wait for my birthday!",
        "I can not wait till Christmas.",
        "I am so ready for the mid term elections.",
        "I cant wait for the fall season to begin.",
        "I waiting to find a good show to binge on. Ive seen everything",
        "I am really looking forward to this upcoming football season! I can't wait for it to start!",
        "my daughter starts school this year! im pretty ahhh about it honestly! ",
        "I live everyday expecting to be a better version of myself at that present moment.  That way I can feel closer and closer to living the idea life I want for myself",
        "I am excited for the new super smash bros game coming out for the switch soon",
        "I booked a vacation next week and it's going to be fun!",
        "I have a vacation coming up. I am going to Colorado for a few weeks.",
        "I can't wait for the releash of the new Super Smash Brothers game.",
        "I invested pretty heavily into cryptocurrency. I'm anxiously awaiting to see how it pans out.",
        "I can't wait until Madden 19 comes out next week.  I get it every year and it helps me look forward to football season!",
        "I was once waiting on a package to arrive in the mail. I felt like an anticipator.",
        "I have a 2 week vacation coming up that I am looking forward to. It's so hard to work when you can't wait!",
        "On my drive home from work I noticed there were a lot of dark clouds rolling in. Usually this means there will be a lot of rain. I anticipated thunderstorms and was right.",
        "I am expecting a big recession on the horizon.",
        "My husband and I were planning our first vacation away together. I was so excited.",
        "I am starting off at a new school next month. I don't know anyone and I am so nervous.",
        "I can't wait for school to start in 2 weeks. I need a break from my  kiddos.",
        "I can't wait for the new Insurgency Sandstorm video game to come out on Steam. It was supposed to come out this summer but no news yet.",
        "my house to sell ",
        "I hate it when you have to wait for the results of creating a new bank account. The waiting is killing me!",
        "I can't until next summer! This past summer was such a happy moment in my life!",
        "I am ready for the Frozen Four.",
        "I cannot wait for the new super smash bros for the nintendo switch",
        "I can't wait to see the results of our local elections today.",
        "I'm getting a shipment from my mom. I'm so excited!",
        "My friend just adopted a dog. I can't wait to see him!",
        "I've never been to Washington, DC before. I'm pretty excited.",
        "I dropped my friend's birthday cake on some kid.",
        "I haven't seen my grandma in 5 years. I'm so excited she's coming to visit.",
        "I can't wait for the new season of this is us. That is the best drama out there.",
        "I can't wait to graduate. A bachelors degree should open so many doors for me.",
        "We are looking in to buying a newer and bigger vehicle. I have wanted one for a long time. It will be so great to have a bigger vehicle.",
        "I been waiting a while for the official release date for a new video game. There's been a lot of rumors but nothing set in stone.",
        "My birthday is next week. I can't wait until then!",
        "Beach vacation coming up",
        "I start my new hob next week. I am very nervous and not sure what to expect.",
        "I am really looking forward to the next NBA season!  I can't wait.",
        "I've been wanting to get a new laptop for a while now, and I can finally afford one! I just need to wait for it to get here",
        "I cannot wait to go to an anniversary dinner with my partner. It promises to be a special dinner!",
        "I am looking forward to an anniversary party for my parents. They have been together for many years.",
        "I am looking forward to my birthday,",
        "I was looking forward to my birthday party. I always throw big ones for the kids, and now it was my turn since it was a milestone birthday. ",
        "Im so waiting for my new car, and cant wait to go pick it up. ",
        "I am getting ready to go on a vacation to China. The anticipation is really exciting but it is also pretty exasperating. There seems like there are a million things I still need to do before I go.",
        " I just talked to my kid's pre-k teacher. They already know each other. I can't wait",
        "I cant wait for the NFL season to start",
        "I cant wait for saturday to get here!",
        "I'm waiting for this semester to start so I can get it over with.",
        "I am waiting on my grad school interview. ",
        "I can't wait till next week.  School starts on Monday.",
        "I could not wait for first day of college. I was just ready to do something new",
        "My daughter is going to be a senior in high school this year. She will graduate and go to college next year. I am so excited for her.",
        "I can't wait for the Mile 22 movies to come out. It has one of my favorite UFC fighters in it and I can't wait!",
        "I can not wait for the new Mission Impossible movie.",
        "One time I ordered a game on the internet and it took a week longer that it was supposed to, to get delivered and I had no idea when it would be delivered. ",
        "I can't wait to get to the ocean!",
        "I'm going shopping with my mom tomorrow. I can't wait.",
        "I can't stop thinking about when Christmas will be here. I love how New Years comes right after that.",
        "I can't wait until tomorrow. It's going to be lit!!",
        "I can't wait for the fall tv line up. The best shows come on inthe fall",
        "I can't wait to get on the road",
        "I can't wait to be off work",
        "I am looking forward to going boating this weekend",
        "I'm waiting to hear back if I could get earlier flight tickets to my friend's wedding.",
        "Waiting for my brother at the airport. Haven't seen the dude in years.",
        "My friend's cat had kittens! Can't wait to see them.",
        "I can't wait to visit my aunt",
        "I am so ready for this weekend. I am going to a party.",
        "I need to buy some clothes for winter. I need a new jacket and boots.",
        "My wife is pregnant with our first child.  I can't wait to see this baby for the first time!",
        "My big soccer game is tomorrow. So excited that I can't even sleep.",
        "I could not wait to go to the amusement park. I had no been to one in a long time",
        "I can’t wait to go on a blind date",
        "My girlfriend is finally coming back to the states after being away for 4 years.",
        "Going camping next weekend. I haven't hung out with my friends in so long.",
        "I can't wait to go to the mall tomorrow.  I have been saving up for weeks!",
        "I am looking forward to getting a new vacuum on Tuesday. I haven't bought a new vacuum in years. It's long overdue.",
        "There's a battle of the bands going on. I hope my favorite band gets so far.",
        "I am looking forward to the new season of Game of Thrones.  I am so excited for it!",
        "I am so ready for Thanksgiving.",
        "I am ready for the end of summer party.",
        "I have successfully complete the part that was crucial for the project. I am hoping my supervisor would promote me",
        "I cant wait to go on my end of summer trip",
        "I am going on a trip with my family soon. I am really looking forward to it",
        "I recently refinanced my auto loan and will be receiving a large refund from my GAP insurance. I can really use the money and have been waiting for it to arrive.",
        "I was waiting for nearly 2 entire months for the results of a test that I prepared for a long time to take.",
        "I can't wait for the movie Mile 22 to come out. I love seeing UFC fighters in movies!",
        "I planned and booked a surprise trip for my anniversary and I can't wait to tell my spouse. ",
        "I am feeling a blue wave coming in november.",
        "At the end of the year a good friend of mine is coming down to visit.",
        "i planted a garden and was so excited in anticipation of the plant growth.",
        "I am expecting a call from someone today. They will tell me the gender of my baby!",
        "I have a two week vacation coming up in Greece that I've been looking forward to. It can't come fast enough!",
        "When I went to the baseball game I was sitting in the outfield. I heard a loud crack as the batter swung. I looked up in excitement and actually caught the ball with my bare hands!",
        "In a few weeks my friend and I are going to see Ben Folds. Even though we've seen him over ten times we go every time he's in town because he puts on such a great show. ",
        "I'm going to try out for our local kickball team. I'm looking forward to get some exercise and make new friends.",
        "It was three days before my 21st birthday.",
        "I'm going to volunteer at a local food bank. I hope I can make a positive difference.",
        "i cant wait to get my next paycheck",
        "I know I'm going to get fired tomorrow.",
        "I could not wait to start school this past semester. I just wanted to learn",
        "There is a new video game that I really want to get coming out in November. I can't wait for it to be released!",
        "a few weeks ago, my friend threw a birthday party and invited all my friends. i hadn't seen my any of them in awhile and had been kind of lonely.  for a week straight, i was so excited about the party that it was all i could think about",
        "I could not wait for last weekend. We were going to some new breweries",
        "I'm hoping to move soon (buy a home), and I am feeling a lot of anticipation regarding moving.",
        "I can't wait until Friday!",
        "I can't wait for the next Avatar movie to come out. I have been waiting so long. It is going to be great.",
        "I'm having a baby in 3 weeks..... the waiting is makjing anxious!",
        "i cant wait for my new raise to kick in!",
        "I just ordered some new clothes since I lost some weight recently. I can't wait until they get here. I hope they fit.",
        "I can not wait for the new Super Smash Bros, it is only a few months away now!",
        "christmas, the holidays in general this year in my new home. ",
        "I am really looking forward to eating dinner later.  I can't wait to eat tacos!",
        "My dog is coming home from doggy day care.  I can't wait to see him.",
        "One more week then I am off for two weeks and heading to the beach!!",
        " The new movie theater is opening soon.  I can't wait to go there.",
        "I get my new vacuum tomorrow! It's been a long time since I bought one brand new. I am super excited!",
        "I can not wait for my cruise during Thanksgiving.",
        "I am looking forward to the next Star Wars movie.  I can't wait for it.",
        "I'm looking forward to the new Mexican restaurant opening up.  I just can't wait.",
        "I can't wait to see the new James Bond movie.",
        "I was only two days untill my disney land trip",
        "I am so excited because I am starting a new job next week. I've been trying to get hired for months at this company.",
        "My girlfriend is mad at me, and I feel like when we try to have another discussion tomorrow about why we're fighting, she's just going to get even more angry with me. We're not the best at communicating.",
        "I am sad but ready for my child to gradate high school.",
        "I am looking forward to the upcoming football season.  I can't wait for tailgates!",
        "I'm going to Vegas next weekend. I can't wait!",
        "I'm going camping next weekend. I heard there are making camping spots, so we won't have to sleep in our cars this time around.",
        "I have applied for a new credit card with Chase. I am hopeful that it will be approved",
        "I can't wait to get married",
        "I cant wait to go on my trip",
        "i cant wait to go on my trip next week",
        "I had to get a certain grade on a test not to fail calculus and I had a bad feeling that I just barely didn't pass. Well that's exactly what happened and I knew it.",
        "Waiting for the weekend",
        "I can't sleep when I'm anticipating a big event or trip thats coming up.",
        "I could not wait to go to the amusement park a few weeks ago",
        "I could not wait to go see a movie last week with friends. I needed it",
        " I can’t wait until my nephew gets to come over.",
        "I am having some issues with my manager. I have the feeling that I getting fired by the end of this week,",
        "I am hoping to join the Army",
        "I am looking forward to my paycheck on Friday!  I am expecting a bonus!",
        "waiting for my house to sell ",
        "I was waiting to see if I had won the contest!",
        "I am getting ready for an upcoming economy crisis in the USA ",
        "I have a big test coming up. If I don't pass, it is going to really affect me negatively.",
        "I am excited about my work this week. It is promotion time and I am going to be promoted!",
        "my new purse purchase! ",
        "I am looking forward to win",
        "I am sure we are about to enter a economic recession in the near future.",
        "School is about to start and I can't wait!",
        "I can't wait for winter time. I'm already doing some shopping for warm clothes.",
        "i cant wait to play the new madden, ive been waiting months for this",
        "I can't wait for school to start. I love to learn!",
        "I have felt this way when waiting for my son to be born.",
        "I am going to eat nachos later.  I can't wait to devour them.",
        "I'm entering a music contest with my friends. This is our first!",
        "i cant wait to see my new raise on my next paycheck",
        "I can not wait to go see my grandfather in December.",
        "I'm doing laundry and packing my clothes to fly to see my long distance girlfriend tomorrow. Even though I just saw her a month ago, I'm really looking forward to the trip.",
        "I could not wait for last weekend. We were going to a game",
        "There's a group project coming up and team members are totally random. I hope I get good people.",
        "I'm anticipating to get a raise at my job this month, I think my boss hinted at it.",
        "I could not wait till my brother got home last night. We were going to get steaks",
        "I'm so ready for the weekend. I'm going camping. ",
        "I'm stoked for when I get my big break.  Don't know when it's coming and I know I'll probably have to put up with a bunch of crap. But I'm willing to go through whatever I was put on this Earth to reach the pinnacle of success in this life",
        "I'm texting 2 girls right now, one 18 and one 24 both smart and super attractive.  I'm curious to see who I'll end up dating first",
        "i cant wait till i start my new job",
        "One day, I ordered some pizza. It was going to come in 30 minutes, but that 30 minutes felt like hours.",
        "I am going to a concert of my favorite band soon, and I am really looking forward to it",
        "my last paycheck to come in the mail ",
        "I'm pretty excited for my paycheck at the end of this month",
        "We are going on a cruise next year for Spring Break. We have never been before. It is going to be so much fun and we are so excited.",
        "I am waiting intensely for a call back for a new job!  I figure I have it!",
        "I cannot wait for the newest Mario Party game, it looks like so much fun to m!",
        "I have felt this way while waiting to take my gre.",
        "I got some BHB salts that are for keto in the mail today and I am VERY intrigued and couldn't wait to try them! I sometimes eat too many carbs or sugar now and again and wanted a way to get back in too ketosis quicker.",
        "My son is due in a couple of months and I am feeling this way.",
        "Tomorrow is payday...I am looking forward too it and NOT in a few ways...I don't know what will happen. But either way I am not letting it bother me.",
        "I got a foreclosure notice from the bank. I am preparing myself to move out from my home.",
        "Going to the movies this weekend with some friends and really looking forward to it.",
        "I am ready for UFC 229.",
        "I am ready for my vacation in late August.",
        "I feel ashamed for eating an entire pack of cookies",
        "I am looking forward to  a good match today. I have worked hard ",
        "I can't wait for the delivery man to arrive.  I ordered a huge 70\" television.",
        "My mom is getting remarried this weekend.",
        "I am looking forward to the next season on Game Of Thrones.  I can't wait to watch it.",
        "I have a package coming in the mail today... i cant wait",
        "I am looking forward for the new pizza joint to open up here.  I can't wait to eat there.",
        "I am really looking forward to the upcoming football season.  I can't wait for it to start.",
        "I am really looking forward to going to the cinema this weekend with my mates.",
        "My wife want to divorce. I need to prepare myself to not be in very bad financial situation.",
        "I'm really looking forward for the new Greek restaurant to open here.  I can't wait to try it.",
        "Looking forward to getting my new vacuum for the SECOND time tomorrow. I hope it works..I swear I will cry if it doesn't.",
        "I just took a final exam for school. I need to make a b or higher. Our grades are released next week. I cant wait to hear what I made.",
        "This week is a big week for me at my job. I should find out if I get a bonus or not.",
        "I'm going back to college at 36 and start next week.  ",
        "I can not wait until Saturday. It will be my wife and I's 5 year anniversary",
        "I'm looking forward to going on my vacation next week to the Bahamas. It's been awhile since I've had one.",
        "I remember this time in high school, I was really bad at Chemistry and the mid term exam determined the majority of our grade for the semester and I studied very hard. It was so hard waiting to get my score to see if it would lift my grade enough to pass the class! I hate uncertainty!",
        "I cant wait for the weekend. I am going hikinh",
        "I'm excited about the weekend. It's my last one before vacation ends.",
        "I cannot wait for the newest Pokemon game, it looks amazing to me!",
        "I am saving money to be able to buy a new car. My current car is having too many car failures. I think one day it will stop working.",
        "I cannot wait till next month. College football starts",
        "I cannot wait for next week. We are going on a trip",
        "i cant wait for the weekend!",
        "i cant wait for next week!",
        "I just ordered some hot wings. I cant wait til they get here",
        "waiting for a packaget to be delivered",
        "We took our girls on a surprise trip - we told them it was the beach.  It was Disney",
        "I can't wait until all of my kids are out of the house. I love them but gee whiz",
        "I'm so close to giving birth... it could be any day now",
        "i got madden today i cant wait to play it",
        "I can't wait to get my new galaxy note 8!",
        "My wife is having her baby tomorrow! Never felt so alive!",
        "We waited a long time to get pregnant.  It was very hard to wait and I spent my time going overboard on the baby shopping.",
        "I am going camping next week",
        "I'm loking forward to the football season starting",
        "I'm planning on going to this really fun party tonight after work. I can't wait to finally get there and have time to hang out with my friends!",
        "I am looking forward to the soccer season starting again",
        "I'm looking forward to the new soccer season starting",
        "waiting for a package to get here",
        "Sunday will be so fun, I can't wait!",
        "I am going to my friend's big party tomorrow night. I can't wait for it to come. I'm so excitied!",
        "I am waiting on to see my son talk",
        "Looking forward to trying some new supplements on Saturday!",
        "I am so excited for halloween. We are getting started with idea costumes.",
        "I can't wait for the new call of duty game. The beta starts today",
        "I have a vacation coming up soon. I am really excited to leave already.",
        "cant wait for football season to start up soon",
        "I'm looking forward to the coming Fall weather.",
        "I am having a hard time concentrating on work. I leave for vacation next week. I cant wait to go.",
        "every time friday comes ",
        "In september I should be getting a sort of bonus check.  I'm gonna use it to pay off my truck and I can't wait",
        "I'm looking forward to a promotion in Feb.",
        "I'm really excited for dove season that starts next month.",
        "I'm so looking forward to college football season, Saturdays are going to be awesome!",
        "School starts next week!  Hooray!  I can't wait to see my youngest start high school!",
        "Can't wait til my wife gets home, I'm surprising her with flowers and dinner.",
        "This past February we went to Walt Disney World.  We weren't sure we were going to be able to go, but in December we realized we would be able to.  I couldn't wait for the next two and a half months to go by!",
        "I'm waiting to hear back about a promotion at work",
        "I am really excited for the new super smash bros coming out, that will be such a fun game!",
        "I cannot wait for the new super smash bros game, it looks amazing!",
        "Waiting for pizza to come. I ordered extra of everything.",
        "I had a argument with my manager. I think that I will be let go soon,",
        "My birthday is next month and my wife has a surprise planned.",
        "I really like the Marvel Universe. I can't wait for the next movie to come out!",
        "MMA shows tomorrow.  Taking my nephew!",
        "I am going on vacation in 1 week.  I cant wait. I am so exicted",
        "There's a new water park about to open near me.",
        "My daughter is entering a local battle of the bands contest.",
        "I have a dentist appointment next week. I am not looking forward to it.",
        "There's a new pizza place opening up.",
        "the concert i am going to on sunday should be awesome!",
        "sunday i am going to a good concert, i cant wait",
        "My son is due in a couple of months and it has me feeling this way.",
        "I can't wait for Fall. This summer heat is killing me.",
        "My husband and I are taking a vacation by ourselves.  We are going to a little beach area in Florida for a week.",
        "im going to a concert on sunday, i expect it to be awesome",
        "i am going to a show this weekend, i expect it to be awesome",
        "Going to an MMA show tomorrow. Can't wait.",
        "I am having my first child in a couple of months and I am anxious about it.",
        "im going to a show on sunday! i expect it to be very good",
        "Australia will win 2019 cricket world cup. I have a good hope",
        "Going to Florida soon!",
        "Back in the day I really wanted Halo 3. I waited all night for it and got in the store really early.",
        "I am so ready for the water parks to open.",
        "I am so ready for my first hockey game this winter.",
        "I am looking forward to the new football season.  I can't wait for it.",
        "I ordered something online last week and I've been waiting for it to come on the mail ever since",
        "I am hoping to have  anew job by the end of next week",
        "I am looking forward to the new Star Wars movie.  I can't wait to see it.",
        "In a couple weeks my wife and I will be finding out the gender of our second child",
        "I am looking forward to the new pizza joint opening here.  I can't wait to try it.",
        "I ordered pizza and I can't wait for it to arrive already.",
        "i cant wait for monday!",
        "I am anxiously awaiting a second puppy from a dog I rescued. I thought she might be pregnant but then I thought she wasn't after a week. Well...today proved that wrong! She is a bit neurotic as a mother though",
        "Things are getting better and better for me everyday.  I'm still waiting for my big break but I'm in no rush.",
        "Looking forward to getting my cats a new cat tree tomorrow! It is a warehouse deal so I am hoping it is in good shape! It was one I have been watching for awhile and the price finally dropped to my ideal.",
        "i am really looking forward to taking a few days away from work before the end of the year",
        "i cant wait for monday to get here!",
        "I am looking forward to tomorrow. I think church will be good for me",
        "I pre-ordered a video game that comes out in the fall. November can't come fast enough!",
        "I'm going to the waterpark tomorrow! It's my first time going!",
        "My birthday is next week! I can't wait!",
        "I just ordered a pizza. I can't wait for it to get here.",
        "Me and my partner are expecting our baby to arrive in two month. It will be our first baby",
        "I can't wait for my daghter to get a job and start spending her own money",
        "I'm looking forward to the Spanish Supercup tonight.",
        "I am so ready to go to Japan.",
        "Im looking forward to the Spanish Supercopa tonight.",
        "I'm looking forward to all the football today",
        "I will be the first in line to see the new Top Gun 2 movie.",
        "I'm lookign forward to all the soccer on TV today",
        "I am looking forward to having everyone home next week",
        "I am looking forward to having donuts later.  I can't wait to eat them.",
        "There is a craft fair I just love to go to. They have such wonderful things. I couldn't wait to go. ",
        "In the past, I was jobless for 14 months. So now, I am putting a lot of money in my savings in case this happened again.",
        "I get to go to the zoo this afternoon.",
        "I was really looking forward to New Year's. We were going to a nice restaurant and then eating lots of delicious food. ",
        "I'm getting to eat lobster for the first time this weekend. Looking forward to it",
        "I cannot wait until we go on vacation next year.  We are headed to Florida to do all the beach things.",
        "I am going on a weeklong vacation next month and I cannot wait!",
        "i am looking forward to trying to get pregnant by the end of the year",
        "Disney world in december!",
        "i really expectant",
        "Can't wait to go the movies tonight with my family, I love family movie night!",
        "I'm so excited to see the next Star Wars movie. I love that franchise!",
        "I'm waiting on my food downstairs to finish cooking, but you can smell it all the way up here! I can't wait until it's done.",
        "I ordered a really nice chair online, I cant wait until It arrives tomorrow, it will look so nice in my living room.",
        "We are leaving for Hawaii in the morning.  I've never been out of the continental US nor have I flown, so this is so very exciting for me.",
        "We are headed for a big vacation in Florida next summer for our daughter's graduation trip.  We are planning on Busch Gardens, Sea World, and a few other animal related places.",
        "I am going to a concert tomorrow. I can't wait!",
        "I have to go get some shots at the doctor this week and i am not looking forward to it.  I don't like shots at all",
        "I just cleaned my a/c condensror, and i'm really hopeful I'm gonna save a lot of money!",
        "I'm getting married in two months. I'm pretty excited for this big moment.",
        "I regularly put in orders for items online and as per the usual have them shipped instead of picking up at the store. The waiting and anticipation for the items is bad sometimes I check tracking even though I know its otw",
        "I've been exercising consistently for 3 months now. Been feeling so much better.",
        "My new ceiling fan is arriving this afternoon, cant wait",
        "I was trying to procure a loan to buy a car, my credit is very average and I don't have many assets so I am getting very nervous hoping to land it.",
        "I was going to the work training last week. I was also hoping to achieve a promotion from the training.",
        "I can't wait to eat my sub.",
        "waiting on a package to come ",
        "Just a few more hours until the work shift is over.",
        "When I'm in a nightclub and I see a bunch of cute girls I try not to start hitting on all of them at the same time...I wait til the one who's been dancing the craziest and most sensual finishes dancing then I start chatting her up after",
        "I get off work in 45 minutes. I can't wait.",
        "I'm looking forward to the upcoming weekend.",
        "I have a dentist appointment next week. I am not looking forward to it. I don't want to go!",
        "I'm looking forward to the future.",
        "I cannot wait for tomorrow! I'm going to my favorite amusement park! I can't wait to ride the rollercoasters!",
        "I have to give a big speech in class tomorrow. I don't want to go because I am so nervous.",
        "I can't wait for the new Super Smash Brothers game to be released.",
        "I'll sign a new contract at my work soon so I am excited about that.",
        "I cannot wait for the new super smash bros, it is going to be so good!",
        "I am excited for the new super smash bros, I cannot wait any longer",
        "I cant wait for this semester to start. Im getting closer and closer to finishing.",
        "My appraisal is coming up next week, I am looking forward for a good hike",
        "I'm gone vegetarian for over a year now. I wonder how my blood results will be.",
        "I'm excited to start a new project at work",
        "I cannot wait until next spring, I'm doing something I've never done before.  We are going on a cruise.",
        "I cannot wait until next summer.  We are taking our daughter on her graduation trip to Florida to see Winter the Dolphin.",
        "I can't wait till the weekend! I'm going to a waterpark!",
        "Going to panama city in a few weeks.  Can't wait!",
        "I can't stop thinking about my job interview tomorrow. It's going to be tough!",
        "I believe car prices will go down this by looking at the economy",
        "I can't wait to go the cinema this weekend. I'm really excited.",
        "I am looking forward to my new job.  I can't wait to start.",
        "I am looking forward to the winter.  I can't wait for the cold.",
        "to get my check in the mail ",
        "i cant wait until next week!",
        "I'm making guacamole for the first time.",
        "I have a big test coming up, I wish time would hurry up.",
        "I'm really excited for Halloween this year. I have so many ideas, I don't even know where to start.",
        "I called my new boss about when I need to come in to work for the first time, and they said they'd call me back. I keep waiting for the phone to ring, and it's getting late, but they're not calling me.",
        "I just ordered from a new restaurant. I hear its really good.",
        "I just took my finals. I should be getting my grade any day now.",
        "I'm watching my neice and nephew for a week while my brother and his wife go out of town.  I think it'll be fun and tough.",
        "I should really stop expecting so much from people in this game.  I get a good partner convo going, thinking that every conversation will be the same...then I get some idiot and all my hope in humanity gets trampled on",
        "I'm leaving town tomorrow  for a mini vacation.",
        "my husband and i are trying to get pregnant by the end of the year",
        "I can't wait to buy some cake this weekend. Been craving cakes.",
        "I think the cops are coming to my house tonight.",
        "I'm going for some hot pot this weekend.",
        "I got a new job. I'm kinda nervous!",
        "I cannot wait for 2 weeks from now. College football is starting then",
        "I looking forward to get a good hike this year in the company",
        "There's this Japanese restaurant I keep passing on my way to work. I'm finally going to check it out this weekend.",
        "I cant wait for this is us to come back on it is my favorite show",
        "I've been waiting to hear back from a job interview I feel went quite well.",
        "I am going on a cruise in November. I've been planning this trip for six months.",
        "I am finally getting to go to the Harry Potter attraction at Universal Studios!  I love the movies and can hardly wait!",
        "I am leaving for a long three month vacation next week. Its all I can think about. I am so ready to leave.",
        "I'm having a difficult times even doing basic tasks for myself, due to anxiety. But I'm hopeful that something good will happen for me.",
        "I ordered a new fishing reel. I can't wait for it to come in the mail.",
        "I FINALLY get my lawn mower fixed on thursday..and I am strangely excited to use it and have my yard nice again!",
        "I have a three month trip planned starting in September. I have been counting down the days until I leave.",
        "I am going on vacation to Hawaii next week.  I cant wait to go.  Ive already started packing",
        "We saved up all year to take a nice beach vacation.  This was the first time we've even taken a family vacation.",
        "I am super excited for the upcoming super smash bros!",
        "i've got a doctor's appointment tommorow that i've been worried about all week",
        "Can't wait for the weekend",
        "My husband gets back from a month long business trip on Friday! I'm really looking forward to it!",
        "I am ordering a chocolate cake tomorrow. I want to eat the whole thing!",
        "I cannot wait for tomorrow night. We are going to a cigar bar",
        "We are taking a big trip next summer to florida for our daughter's high school graduation.  We are going to Busch Gardens, Sea World, and to see Winter the Dolphin",
        "Waiting for my marks to come online after exams. I went hard.",
        "I cant wait to see equalizer 2. I heard it was really good",
        "I am going to eat at my favorite restaurant tomorrow. I am really looking forward to going.",
        "I just got a new apartment and I don't move in for a week. I am getting very antsy about it! I'm currently at my mother in law's and I liked to give her her house back.",
        "I had a job interview yesterday and it went great, so I'm expecting for them to call soon.  I look forward to working for that company, since it seem really nice.",
        "I'm waiting to hear back from the nursing program I applied to for my degree ",
        "I return to work in September to a new role. I'm excited but anxious. ",
        "We're waiting to see what size my husband's bonus will be.  It's the first year he'll get one.  We're hoping it's enough for a new roof.",
        "I wish to be at my friend's birthday tomorrow",
        "We are temporarily moving soon. I'm so excited!",
        "My husband has a job interview coming up and we are really hoping he will get the job. It'll be a really nice job for him and it pays well too.",
        "I was on the edge of my seat watching the local election results. I was hoping my candidate would win.",
        "I am looking forward to my wedding date!",
        "I have never felt more anticipation that waiting to hear if I got into grad school.",
        "Love to cruise.  Have a 14 day coming up.  So looking forward to unplugging for 2 weeks.",
        "I heard on the radio that there will be a Beyonce concert coming to my city soon.",
        "A game I'm really looking forward to is coming out in October, and I'm very excited for it.",
        "We are buying a new car today",
        "I've been waiting all day to talk to another human being. I'm homebound at the moment with an illness and I love social contact.",
        "Every Wednesday is new comic book day, and it's the one thing I can regularly look forward to.",
        "I was building a computer and was getting each part in the mail, and I was anticipating them and was excited",
        "I was expecting a important mail. ",
        "I just finished my final exams and have been constantly checking my phone to see if the marks have been uploaded.",
        "Riding the Greyhoud across country",
        "Every year I really look forward to Halloween. My daughter loves trick or treating and I always enjoyed eating her candy.",
        "When I was pregnant with my son I lived right down the street from Dairy Queen. I was obsessed with chocolate shakes! Every day my husband would bring one home from work and I would be so excited!",
        "My birthday was last month and I had a feeling my husband was planning a surprise birthday party. I was excited!!",
        "We are taking my 11 year old to universal for her birthday. She has never been but loves rollercoasters. ",
        "I just got tickets to see my favorite band at Red Rocks Amphitheater.  Seeing a show at that venue is on my bucket list, plus it's my favorite band.  The show date can't get here fast enough.",
        "when I was kid my parents planned a trip to Disney world. It was the longest wait of my life. ",
        "I bought a bunch of dresses online to try on for my brother's wedding.  I really hope at least one of them works.",
        "The other day i ordered a large group of books i've been wanting forever.",
        "This october im heading over to Orlando with a bunch of friends to go to Halloween Horror nights at Universal Orlando!",
        "I'm pretty excited about this new Spider-Man game on PS4.",
        "i am currently waiting for my nephew to be born",
        "i am waiting for my sister to come into town, havent seen her in 6 months. ",
        "I had to look for another house but couldn't find anything for three months. I thought I was never going to find one.",
        "I can't wait for football season to start.  It is my favorite sports time of the year.",
        "I was going on a train ride on the Amtrak.",
        "I was really looking forward to my recent vacation. I was counting down the days, and I packed really early!",
        "I was wanting my morning cup of coffee before I even went to bed last night.",
        "I'm eagerly awaiting another festive season,especially the black friday",
        "I'm waiting for my financial aid so I can get a new car. My current car is having transmission problems.",
        "My birthday is coming up this week. I'm feeling so excited!",
        "I'm really excited that football season is right around the corner. I'm ready to see what my favorite teams will do this season. ",
        "My wife and I going on vacation to Maine this fall, and I'm very excited for it.",
        "My husband said he is buying me a new car for my birthday. I can't wait! ",
        "I recently got a $50 gift card that I'm really looking forward to using. ",
        "I am looking forward to my wedding night",
        "looking for a mailed check that hasn't yet arrived. i needed it before i left town for a weekend.",
        "I have a big presentation at work",
        "I've been working so much lately. I have two beach trips coming up in September and I can't wait!",
        "I was waiting on my best friend to come over so we could watch a movie but she did not show up",
        "I ordered a dna test for my new puppy to see what breeds he is. I can't wait for the results I'm so excited!",
        "In the months before my move across the country , it was all I could think about and the days felt so short.",
        "I once ordered something online, and was waiting for it for a long time. It was kind of fun to wait for it and look forward to it coming though.",
        "I am waiting to hear back about a job interview, I hope i get the job!",
        "I had great expectations from Belgium. They should have won the world cup!",
        "My birthday is coming up and i know my wife is getting me something cool",
        "My first grandchild will be born this fall and I am anticipating being a grandmother!",
        "The new school year has begun and I'm can't wait to see what the future has to offer",
        "I can't wait to go on vacation.",
        "January my brother came to visit me. I haven't seen him in ten years. I was a little nervous before he arrived.",
        "I just put a deposit down on a real live pizza oven! This will certainly help me better my skills as a pizza maker, and I'm so happy that I get to make pizza whenever I want!",
        "I am anticipating the weekend. After everyone gets home we are going to spend time together as a family.",
        "College football officially starts tomorrow.  I can't wait to watch some football.",
        "Waiting for my test back from my math teacher. I think I scored well.",
        "I have been in vacation in Mexico for one week now. I am buying gifts for my family before coming back.",
        "I caan't wait to go to a concert i just bought tickets for.",
        "I have a feeling I'm going to be getting a new car soon.",
        "I have my annual evaluation next week.  I really hope I get a raise.",
        "I can't wait til Red Dead Redemption 2 comes out!  The first one was my favorite video game of all time!",
        "I have been excited to sell this stuff around my house i never use. I'm making pretty good money!",
        "Going on vacation to florida soon.  Can't wait.",
        "Its been cloudy all day and I think it will heavily soon.",
        "I am really excited for the new super smash bros, it looks awesome so far!",
        "I have a dentist appointment next week and I don't want to go. My tooth hurts really bad.",
        "I can't wait for the next Avatar movie to come out. It seems like it was such a long time ago when the first movie came out. I can hardly stay patient any longer.",
        "I can not wait to start my new dream job on Monday.",
        "waitng for my son to be born",
        "I am going to the beach again this weekend, so I'm really excited about it.",
        "I cant wait for red dead redemption 2 to come out",
        "The college football season starts today.  I can't wait to watch some games.",
        "Saturday morning and its a great day to be alive!  I am anxious for what today has to bring me.",
        "When tax season came I was in a hurry to get mine done. I was looking forward to a big refund.",
        "The time I waited to see if I got accepted in to school. I was so excited.",
        "I cant wait till I save enough money to take a trip to Antarctica. Its been a dream of mine.",
        "We planned a trip to the Bahamas and we leave in 3 days. I can't wait!",
        "I am so ready for college football tonight.",
        "I'm looking forward to next year as I get a raise in feb.",
        "I am going to Boston in a couple weeks!  I have never been and am really excited and looking forward to it!",
        "I cant wait for a few more weeks to go by so I can be debt free, and hopefully happier! ",
        "I have big trip coming up to California. I have never been before so I am getting a little antsy.",
        "I took my dress to a seamstress for alteration, i was given a date to pick it up and it was not ready.",
        "I cannot wait till tonight. I am going to a tattoo event",
        "Dove season opens next weekend.",
        "preparing for a trip.",
        "I'm always expecting new money opportunities.  If a door opens I'm going in",
        "I can't wait for my new nephew to be born, it should happy at any moment.",
        "I have a very good feeling about the upcoming football season.",
        "My grandma went into the hospital we are not expecting the best news",
        "My son signed up for this program and I felt so anxious about it the day I had to drop him off",
        "I cannot wait for the new super smash bros, it is gonna be amazing",
        "I am expecting to get a big bonus. I hope it happens!",
        "The place I ate at for lunch today only had a \"B\" rating for cleanliness, etc. on their health inspection. I never ate at a place that had less than an \"A.\" But I ate there anyway since there wasn't anything else close by, and it smelled good and was cheap, and I'm poor.. I just know my stomach is going to be churning later.",
        "I had a date last night and I spent all day looking forward to it. I clean up the whole house and spent a long time getting myself ready.",
        "I'm excited for fall to start, I love layering my clothes",
        "I am waiting to see if I pass my graduate exam and I am feeling this way."
    ]
}