{
    "threshold": 0.8,
    "seed": [
        "Waiting for my food at dennys.",
        "I have a fun trip to Las Vegas coming up in the fall that i'm very excited for!",
        "I'm really eager to get off work tonight to see my boyfriend. ",
        "I am looking forward to winter.",
        "I am looking forward to my next vacation ",
        "when i applied to college for the first time and waiting to see if i got accepted ",
        "I want to see the Halo TV series.",
        "i will be on vacation next month",
        "When I went for a show in New York, I was expecting to see beyonce",
        "I was expectant to see my mom after 5years",
        "i will be a masters student soon",
        "I was expectant of money lately",
        "I was very expectant of money ",
        "I was expecting to see Beyonce in a concert yesterday ",
        "I can't wait for school to start in the fall.",
        "When I was pregnant, I tried to figure out how I would feel once my son came. I thought about it alot!",
        "I cant wait to back to uni full time again in the fall",
        "I waited the whole day in the doctors office for my blood test results.",
        "I see a lot of work coming up ahead at my job.  It will be a frustrating experience",
        "It's a matter of time until either the wi-fi will go off or the electricity will.",
        "I am currently waiting for my security deposit from my old apartment. It will help me pay for a washer and dryer for my new place.",
        "Yesterday I ate a delicious dinner it was all I hoped for that meal.",
        "I got a car for my birthday.",
        "I cannot wait to go to dinner tomorrow",
        "i am excited to see my son and his fiance!",
        "I am looking forward to this season of the Lakers. With Lebron coming in, i really think this will turn out to be a fantastic season for them",
        "I am looking forward to fall.  It is my favorite season.",
        "i am really looking forward to Lebron playing in Lakers. This season is going to be legendary for the Lakers.",
        "I can't wait to see the next avengers movie. So much mysteries to be solved, i can barely contain my excitement.",
        "My birthday is coming up in a week. I'm going to be seeing friends that I haven't seen in years.",
        "I look forward to fall every year, and can't wait for it to come this year in particular. It's been unbearably hot where I live.",
        "I start my last year of my Masters program Friday. I'm scared I feel like I'm all ready behind.  ",
        "I can't wait to go to costco tomorrow",
        "About a month ago I had an eye surgery, and now I can't wait to see 100%.",
        "I am still waiting for my new passport book.",
        "i can't wait to go on my holiday",
        "School",
        "I'm looking forward to meeting up with some friends during the weekend.  Should be a lot of fun",
        "I can't wait until the summer is finished.",
        "We have a team building at woek in a few weeks our office is full of problems but I'm going to predict this team building turns out good.",
        "Next month my wife and I will go on our first vacation together. I can hardly wait for our flight.",
        "My son had court last week.  He is 18 and got a possession of marijuana charge and driving while suspended.  It was so nerve wracking to see him go in front of the judge and not knowing what they will do him.",
        "After working at my job for 1 years my review is coming up. Im hoping it goes well since i work hrad. ",
        "My son is supposed to be sending me some money. I've been waiting for several days now.",
        "Saturday I'm climbing Mt. Elbert the highest Mountain in the lower 48. The nerves has started to set in.",
        "My brother is supposed to be paying me back for the food I bought for him last week. I've been waiting for a while.",
        "I remember when the PS4 first launched.  It was the first game console I ever ordered online and I was really looking forward to having it delivered.",
        "I just got out of a job interview for a customer assistant role.",
        "the mountain ahead ",
        "I have been doing so well at work. I feel my yearly review thats coming up will be very good. ",
        "I spent hours studying for a final exam. I was expecting to pass, but didn't think I'd get a 91!",
        "anticipating a great amount of mone",
        "I did really well this past semester, so Im hoping my GPA will be at 4.0",
        "the questions  i knew they would be coming up",
        "When i ordered a new pair of headphones online. They are a high end pair and i couldn't wait to have them.",
        "I'm very ready for school to start!",
        "I won 4000 on a scratchoff  lottery ticket one day.   I couldnt wait to go cash it in.",
        "The possibility of winning a lottery this time is high for me.",
        "I am looking forward to getting a promotion.",
        "I am really waiting on getting my tax returns this year I could use new carpet",
        "My cows are finally pregnant. I can't wait for my baby calves to be born!",
        "I really wanted an Oculus Rift.  I saved up enough and had to wait about a week before the store got them in stock.",
        "I had to wait for the cable guy to come install internet and cable in my new house, I was so excited.",
        "I am going on a trip next month and I'm really excited about it",
        "i applied for a job promotion. But i won't know if i got it or not until next week",
        "I am probably one of the few people in the world that looks forward to winter coming.",
        "The first time my girlfriend invited me to her father's house, I was super anxious. He mostly speaks French, and although I understand it perfectly I have trouble speaking. He turned out to be super awesome and he never made me feel bad for trying my best!",
        "i'm look forward to next week!",
        "the security guards",
        "My wife and I ordered our first new car last month, delivery time was six weeks. It seems like it is taking forever.",
        "One time I was waiting all day for the mail man to deliver my package",
        "I was waiting to hear about a potential job offer. The waiting was absolutely killing me.",
        "I can't wait until all the trees change colors and the weather starts getting cold. I love Autumn!",
        "I was expecting a surprise birthday party today. My expectations were somewhat true; my brother's friend celebrated not only my birthday party, but two other birthdays today. It was wonderful!",
        "My husband has been searching for a job for a long while but can't seem to find one. He had an interview last Thursday and we are eagerly waiting to hear back about whether he got it."
    ]
}