{
    "threshold": 0.8,
    "seed": [
        "I have someone always asking me questions about how to use mobile.",
        "I get irritated with a coworker that gets on my nerves all the time by coming and bothering me smelling like smoke and trying to chat itu p",
        "I am so annoyed by my new manager at work. He always lies to us. ",
        "I am annoyed by a coworker making joke about me.",
        "My next door neighbors are always arguing in our shared hallway. Now they have a baby and the scream while she cries. It is so annoying.",
        "My fence is collapsing at areas where my neighbors keep climbing over to get their ball. It's going to be expensive to fix.",
        "my wife keeps giving our son a stick and he keeps hurting himslef.",
        "My friend is annoying me.",
        "I recall this time when I was making a pizza and I got an important call from my boss. I had to talk with him for about 15 minutes and when I came back, I realized the pizza had been burnt in the oven. I was very annoyed because I worked hard to make it!",
        "My friend is such a narcissist sometimes. He seems to think that he is the best looking, strongest guy ever and he constantly tries to brag about it to me and compare himself to me.",
        "I was in morning rush hour traffic, and the driver in front of me was putting on makeup. Her complete lack of attention meant that she did not notice when the car in front of HER moved, and we missed the light.  It is a LONG light that we had to sit through AGAIN. Ugh!",
        "I am so annoyed that France is in the world cup final.",
        "I once told a co worker about an upcoming job promotion and they applied for it themselves, but also made me look bad in the process.",
        "During college, I was bullied.",
        "My boyfriend kept me up all night when I had to work the next morning by playing video games",
        "My friend Phil really bugs me.",
        "I was so irked when I took my car in for an oil change.  The salesman pushed a bunch of things I know I didn't need.",
        "I hate it when people make loud breathing noises while eating a sandwich.",
        "waiting at the dmv",
        "I tripped on the stairs of a subway because one stair was higher than the others and I got quite angry at it.",
        "Sometimes my kids will just not go to sleep! It doesn't help that it stays light out until 9:30pm nowadays!",
        "I ordered a burger ,but was  served a pizza .I got home,about to it ,and boom! Got the shocker!",
        "I was not feeling good when my boss complained about my work",
        "I accidentally left the lights on in my car and killed the battery, was super awful.",
        "I have a coworker always disturbing me during working to talk to me about subject that I am not interesting in. ",
        "I get sad when peolpe dont pick my calls",
        "I was really peeved when I saw that my cat peed on the carpet.",
        "My friends are late to plans all the time.",
        "My nanny came late making me late for an important meeting.",
        "Reality TV really annoy me ",
        "Iy gets on my nerves to work with people who don't pull their weight,",
        "MY internet is terrible. It is always cutting out.",
        "My brand new Toyota Camry got hit from behind",
        "Hi, I went on vacation to Mexico. There is very frequently electricty outage. It is bothering me a lot.",
        "People are always parking in front of my apartment. It really gets on my nerves.",
        "The maintenence in my apartments is terrible. They take forever to fix everything.",
        "My boss didn't accept my vacation plan.",
        "My ex is always late with his child support. Its nerve wrecking.",
        "I really hate when people who work in customer service dont want to help the customer.",
        "My son drew all over my car with permanent marker!",
        "I really hate when people play their music really loud during the week at 3 am",
        "I stepped in gum someone spit on the side walk",
        "usps lost my mail",
        "Earlier this week, I was in the middle of an email, and my computer shut down randomly. It took nearly an hour to reboot, and then was super slow. ",
        "I was returning an item at a store and the person in front of me had a whole cart of items to return and was taking forever.",
        "to see a kid throwing stones at a lame dog",
        "My brother was bothering me on the road trip last week.",
        "I go grocery shopping on Saturday morning, and my adult son has the weekend off and he proceeds to sit around all weekend eating all the food with zero self control.",
        "this lady was infront of me at the store and she would not move her 4 items so i could put my items to scan",
        "Sometimes I get annoyed by my parents, there seems to be such a generational gap between us sometimes",
        "I thought my new neighbors was nice but the police have been over too much.",
        "I am never late for anything, but now I am always late for work or barely on time. It's driving me nuts. And it all started now that I have to carpool.",
        "Hate it when I meet a Tinder date and she looks nothing like her pictures.  I'm not a shallow person but catfishing should be illegal...if you need 5lbs of makeup and filters to cover up your self-loathing maybe you should just work on yourself as a person",
        "I was upset when i saw my dog had gotten out",
        "My coworker is always coming over to my desk and talking for long periods of time.  It causes me to get behind sometimes.",
        "My neighbor keeps making noise at 2 in the morning.",
        "It irritates me when my roommate doesn't clean up after himself",
        "MY kids just got back and now the house is no longer quiet. I cant stand them sometimes",
        "I've been pretty agitated about the slow internet speeds. I think it's the weather?",
        "I was cut off in traffic the other day and it caused me to spill my coffee.",
        "My dog pooped on the carpet last night.",
        "President Trump annoys me.",
        "Hillary Clinton annoys me.",
        "I do not like watching horror movies.",
        "I was annoyed with people at the store that reach around me.",
        "When I go to do the dishes and people haven't rinsed their plates. It drives me crazy to have dried on food. It is so hard to wash off.",
        "I really hate when I do work at work and I see non of my coworkers working.",
        "I was late for work the other day because my husband accidentally took my car keys to work with him. He said he had an important meeting and could not bring them to me until after that. How is that my problem?",
        "I went to the gym the other day and I forgot my workout shoes. I had to drive all the way home in rush hour to get them.",
        "In the queue at the supermarket",
        "My son woke up soooo early this morning. I barely got any sleep.",
        "My job can annoy me sometimes, people always have issues",
        "Went to the rec center today after work, and it was closed. They didn't announce it or anything",
        "I am so tired of people missing the dumpster in my apartments and just leaving the trash on the ground.",
        "I hate it when my friends complain about being broke but spend over $100 at the bar in one night.  It's just stupid.",
        "This one time it really bothered me when someone told me that I couldn't accomplish a task.",
        "when i lost my wallet at the store",
        "My dog pooped on the carpet yesterday. I was so annoyed!",
        "My brother dumped out all of my cards.",
        "I purchased a new router and it was DOA",
        "Stuck in traffic due to a wreck and a person flies by on the emergency lane - ",
        "I am very annoyed with my mail person. He writes on my mail and never delivers it and lies.",
        "I got caught by a train and it made me late for work.",
        "When my brother got in trouble at school, I was slightly perturbed. He knew better",
        "My cousin is coming in town for a week and has to stay with us. I am not looking forward to it at all. All she does is get drunk and act really crazy. She is no fun to be around.",
        "My father in law is coming to visit for a whole week! He will be staying at our house. I am dreading it so much.",
        "MY daughter cannot follow simple directions because she is glued to her phone",
        "My teacher wouldn't pick on me when I was raising my hand over and over. Made me feel anxious.",
        "There is a thunderstorm going on right now, and my neighbors dogs that I'm dog-sitting keep barking every time it thunders! They're really starting to get on my nerves. Not sure how much longer I can stand it.",
        "My aardvark pooped on the rug yesterday. I was quite peeved.",
        "I was really annoyed when my boss was not being treated well.",
        "We got a new employee at work, and I don't know why, but it always bothered me that he always decided to sit at my station, even though there was always an empty desk next to my usual one.",
        "I work on this group that I have to do surveys. Sometimes I have to wait a long time to get a partner to do my work it drives me crazy.",
        "My brother calls me all the time, I can't stand it.",
        "my girlfriend never let's me sleep she is always talking to me and not letting me rest",
        "I was a little put off when I was passed over for the promotion",
        "My daughter is still up asking for snacks.",
        "I cant believe my neghbors are partying at 3am on a wednesday!",
        "I got annoyed the other day when a woman was walking her dog. It had an extendable lead and was blocking the pavement",
        "i can't believe what just happened\\",
        "Last month i had an argument with a friend and he threw me into jail with false claims that i had assaulted him.",
        "My roommate recently started smoking marijuana and keeps it in my girlfriend's home now. It reeks in the hall and aggravates me in my office as well.",
        "My board meeting which I had prepared for was cancelled at the last minute",
        "My neighbor got this fancy audi that i saw at the dealership, it must have cost 70k. Very nice car",
        "my neighbours were so loud last night i didn't get enough sleep. uhhh",
        "I am so tired of being late for school every day. It is because I have to wait for my sister to get ready and she takes forever! I would rather ride the bus!",
        "I felt irked when my friend kept bugging me for help moving.",
        "my neighbors are so loud ",
        "My fiance gave our toddler juice boxes when I told him not to, simply because I knew he would make a mess. He gave him juice boxes anyway, and this morning I had to figure out how to clean up a sticky walls and tables and half of all his toys!",
        "My husband keeps leaving his socks and underwear all over the house. I keep having to pick them up.",
        "Everytime my friend comes over and brings his kids, he never keeps a close eye on them and they ravage my place!",
        "I am not happy at how I am treated because of my orientation to life",
        "I have a headache.",
        "I asked my son to do the dishes. He said he had to play his video game and he would do it later. Well, he never did them.",
        "Most of my co-workers are incompetent and can't recognize basic patterns.",
        "My kids are doing everything but listening!",
        "There was a traffic jam because people were slowing to look at a wreck on the other side of the highway.",
        "I showed up for work and was told that I would be training a new employee. That meant that I would have someone following me around all day and sharing my tips. That means of course that I will make less money and have to work much harder.",
        "My cat pooped on the bed",
        "We recently had a 14 hour road trip with our 4 boys for our vacation. Kids can really get on your nerves when you're in the car for that long!",
        "I have a bunch of flies in my room and I cannot seem to get rid of them. It's driving me nuts!",
        "when my neighbor kept parking in my spot ",
        "I get aggravated with people who don't understand personal space.",
        "I do not like to be bothered when I am working.",
        "I stubbed my toe on our new table. I was running to turn my alarm off. It hurt so much.",
        "I was kind of bothered when I got passed over for a promotion. ",
        "This tax war that US has started is borthering me because prices are now increasing because of it.",
        "I'm supposed to hang out with my friend, but's like 15 minutes pass the time now.",
        "Nail in tire was very frustrating",
        "My husband's sister lived with us, and she slept in all day. She was on our couch and would just lay there with the curtains drawn until like five o clock.",
        "I took the subway home from work today. Due to a police investigation I had to wait a really long time for the train and then it was really crowded.",
        "My son just graduated high school. One of his ex girlfriends pushed past my mother and I to get to him. She jumped on him and hugged him for 10 minutes and wouldn't let me get anywhere near my son",
        "I was not impressed when I realized that I left my badge at home",
        "My neighbor's party is still going on. I need to wake up early tomorrow.",
        "My husband always stops at the store on his way home from work. We are all waiting on him for so long while he just takes his time.",
        "I can't believe my neighbors are putting up pictures at this time of night.",
        "I was bugged by my room mate to take the trash out. It wasn't my turn to.",
        "I ordered a meal from a restaurant, and when I went there to pick it up they claimed they never received it. I was really upset, and they did not offer to correct the situation.",
        "My friend borrowed a book from me, but he lost it. It was one of my favorites and it's not so easy to replace",
        "This lady in line behind me in Target wouldn't shut up. She was on her bluetooth screaming to the person she was talking to.",
        "i stubbed my toe the other day and was ticked off.",
        "My boyfriend gets on my nerves so bad.  He can never throw anything in the trash.",
        "I have a friend who was constantly calling me last night attempting to get me to do his project for him. I really wasn't able to help him at all because I don't know anything about the topic.",
        "My brother won't stop teasing me about the pimple on my face.",
        "In the airplane, last week, I was borred by someone knocking repeatedly and aggressively on the toilet door.",
        "My tooth is hurting me today.",
        "I was going to order a pair of converse for my daughter for school. I put them in my cart and the next day they were sold out!",
        "I was upset when I had to pick up mu drunk friend last weekend. He was being a pain",
        "I had a kid on a plane a while ago keep hitting my seat from behind. I was getting really irritated about the kid and asked the flight attendant. ",
        "I waited all day for my package to arrive.  The mailman didn't even come by.",
        "Someone cut me off in traffic the other day.",
        "My computer keeps overheating when I play intense games, it won't stop bugging me. Ugh",
        "My daughter only like to talk to me when I'm on the phone. She is the worst.",
        "MY new neighbors have decided to move their thing around at midnight. IT is so loud",
        "Yesterday I saw a bird had pooped all over my car. I had just got it washed. I was so ticked off!",
        "My cat constantly jumps on my keyboard even though I put him on the other side of the room. I can't get anything done, and if you lock him in another room he meows like a madman",
        "Today, it is rainning because of that I can't get out. It is boring.",
        "I am so sick of being used by my friends. I am done with them.",
        "MY neighbors have been playing loud music all day",
        "I have a neighbor who sits outside all day and it's across from my backyard so I can't sit and relax and watch the birds. He is crazy/mental illness that is not taken care of and he yells over a lot.",
        "I am very irritated with people who want to make everyone else miserable when they are.",
        "I was at the pool the other day with my family.  It would have been quite relaxing if there wasn't this little kid shooting water on us and bothering us the whole time.",
        "It really bugs me when telemarketers call my house.",
        "I wanted to make beef wellington but the gorcery store didn't have english mustard.",
        "My cat threw up a hairball on my bed yesterday. I was so peeved at her.",
        "I am super aggravated at people that just can't let things be peaceful. Even if you disagree..what is so hard about just being nice and letting it still not get ugly?",
        "I picked up my son from daycare today and they said another kid had pushed him over and taken his toy.",
        "I was aggravated when I failed my science test. I was mostly upset with myself",
        "I got a ticket today for not coming to a complete stop at a stop sign. So I stopped but they didn't think it was long enough. Ridiculous.",
        "I was a bit irritated when the police bothered me the other night when I was simply walking. They do this a lot here. Seems like I can't ever go walking at night without them rolling up as if they don't have a million other things to do.",
        "I took off work to go to a concert, but it got cancelled.",
        "The store I usually buy bird food from raised their prices at least 4 times.",
        "My friend always interrupts me when I talk.  It really gets under my nerves.",
        "Someone in my house ate the last slice of pizza.  That really bugs me.",
        "My new neighbors put their dogs out at the same time I had mine out. Of course mine went nuts running to bark at the new guys on the block.",
        "My girlfriend annoys me sometimes, but I guess that is what love is anyways",
        "Once a buddy of mine ate my food after I told him not to",
        "i was upset the other day when i couldnt leave home on time ",
        "I can't stand it when you talk to someone who doesn't know a lick of English. It makes everything so difficult...",
        "I hate it when my internet cuts off and starts slowing down. It bugs me out so much, maybe it's time to upgrade ISP.",
        "I don't like doing my job and the duties of other co-worker that slack.",
        "I had a doctor's appointment recently and intentionally scheduled it as the first one of the day so I didn't risk him getting held up with another patient. I got there early - actually had to wait for the receptionist to get her coffee. After all that, I was put out when the doctor showed up over an hour later. He decided to have breakfast with his son!",
        "They are doing construction next door and they woke me up early on my day off, so annoying",
        "My next door neighbor is so inconsiderate.  They let their dog go to the bathroom in my yard.",
        "During my finals, I live in a college housing co-op, and in this co-op we have job duties and required working hours. One time, a resident wasn't doing his scheduled labor and was unapologetic about missing it, making other residents having to pick up his work. I had to confront him and make a big deal about it with the officers. ",
        "Installing new light fixture and everything went wrong. Very aggravating!",
        "i was out in my garden and i was trying to clean up the plants a little bit then ended up getting swarmed by mosquitos",
        "I got a speeding ticket the other day",
        "I made a new friend today. Then I was told that they are not very nice.",
        "Once I was running late for my flight, and was in a really long line to check my bag. It was almost my turn and this lady cut right in front of me! ",
        "I'm waiting on my friend to confirm our plans for tonight, but he's taking so long. I'm not sure if it will even happen at all.",
        "I often get mad irritated because of my sister. Yesterday, she pranked me and I was very mad at her.",
        "when mosquitos are eating me alive",
        "I'm so upset that people don't understand what I'm saying. ",
        "My sister is always borrowing  money from me and never pays it back on time. That really bothers me.",
        "I was agitated when my brother canceled plans on me tonight. I was looking forward to going out",
        "I'm getting a cold sore on my lip right before my big job interview!",
        "My cubicle neighbor at work really bothers me.  He eats all day long and is always chewing loud foods with his mouth open!  I can barely think with him chomping like a cow!",
        "My neighbors are still shooting off fireworks a month after the 4th of July",
        "MY kids never go to bed at a decent time.",
        "We just hired an exterminator for silverfish, and they are back worse than before.",
        "MY new neighbors have been moving in for a month. The apartment isnt even that big.",
        "My cat decided to scratch my face as I was trying to give him a bath. Obviously he wasn't too fond of it",
        "My duck is getting on my nerves a bit. He is a big fat guy and screams all the time if he feels he hasn't had enough food. I love him but I hate it when he screams.",
        "An ex girlfriend asked is she could spend the night at my house because she was kicked out of her current home.  In the middle of the night, I woke up because she had wet the bed.  She's 40!",
        "I get annoyed by my job sometimes, but at the end of the day it pays my bills",
        "Telemarketers calls are so awful and come at the worst times",
        "i was irked when i saw my cousin coming inside the  house",
        "My coworker can be really aggravating.  He is constantly talking and asking me dumb questions!  I can never get anything done in peace!",
        "I was on a flight and a kid kept kicking the back of my chair.  I was so irritated. ",
        "My dog always barks when I am on the phone.",
        "My little brother always plays electric guitar. Yesterday, I was really very irritated. I screamed at him.",
        "My mom makes me babysit my nephew all the time. I am sick of it. He is a brat.",
        "I bought a pizza earlier and they overcharged me.  I am so irritated about it.",
        "my little brother is always following me around",
        "My dog pooped on the rug yesterday. I was quite peeved.",
        "every yime i get food, my wife insists we share.",
        "My best friend always interrupts me when I talk.  It is so irritating.",
        "My dog pooped on the carpet. I never felt so peeved in my life.",
        "I have a co-worker who frequently asks for help. He is very incompetent and i do not understand how he was hired",
        "My navigation took me to wrong address today.  I was extremely irritated.",
        "My dog pooped on the rug. Never been so peeved in my life.",
        "My cat vomited on my shoes the other day",
        "Neighbors get on my nerves",
        "I cant watch movies with thick accents",
        "I lost my keys at the park yesterday.  I was so irritated at myself.",
        "Someone stole my dog!",
        "i lost my wallet today",
        "I hate driving in heavy traffic.  It makes me so irritable.",
        "I stubbed my toe today",
        "A truck cut me off from my exit on the highway.",
        "I keep disconnecting from my internet",
        "Small talk just annoys me.",
        "I have a toothache.",
        "After all the extra credit and hard work, I still failed the class.",
        "I fed up with the decision made by my spouse. He wants to break up our relationship.",
        "Some one I lent money to has refuse to back my money",
        "My neighbors kept me up all night with their music. I am so tired",
        "my neighbor keeps borrowing my shopvac and never returns it on time",
        "I ordered $50 worth of food to be delivered and it was all wrong when the guy delivered it! ",
        "I'm aggravated that I don't earn more.",
        "My neighbor lets his dog bark all night long and go to the bathroom in my yard.  I think it is inconsiderate of him.",
        "Traffic was unusually bad on the way to work this morning.",
        "My boyfriend kept me up all night playing video games. ",
        "My cat won't leave me alone. I can't figure out what he wants, but he's so clingy",
        "Still waiting on the insurance company to give me approval to get my estimate.  My car was backed into over two weeks ago.",
        "when lightening hit my house ",
        "My friend would not stop whistling even though she knows I can't stand it. I was so irritated by it.",
        "I was moving some furniture and all of a sudden it fell apart. I guess the furniture was made out of cheap wood. I was so ticked off when that happened.",
        "My neighbor keeps parking his car in front of my house instead of his own and it obstruct my view of the park in front of my house.  Man, it bothers me so much!",
        "Everytime my cats run out of food I have to repeat to my fiance why they need a specific kind of food that happens to cost more then normal cat food. He just doesn't understand the brevity of the situation and why it would be so much cheaper to just buy the stupid food then to pay for a bunch of vet bills due to them not eating the certain food.",
        "my coworker comes into work late everyday and it drives me crazy",
        "i was supposed to get madden today, and the store didnt have enough copies",
        "I dropped my phone in the toilet.  I am so irritated with myself.",
        "MY kids were up giggling all night. I am still so tired.",
        "Someone took my parking place today. I didn't have a place to park my car.",
        "These mosquitos keep biting me no matter what I do. I've tried using sprays but they keep biting me.",
        "My new dog who was starved is getting a bit on my nerves today. I am just a little cranky today and she is finally having energy and being a handful",
        "it irked me when i saw my brother coming into the house",
        "I have a hole in the sole of my only pair of shoes.",
        "I once bought expired food, went back and accidentally bought it again.",
        "Everytime I try to eat dinner, a salesman calls me on the phone.",
        "During a work meeting, I was presenting and two coworker keep talking to each other. It was bothering me.",
        "I'm annoyed with all the political talk and drama. I know everyone has an opinion, I just don't need to hear it.",
        "I spent so much time working on a project and it was just ignored by my bost. I'm so upset by his ignorance.",
        "My neighbors are so annoying.  They keep playing music so loud and today they parked on my grass.  I want to complain but i don't want to start a fight",
        " was irked when i saw my dog had gotten out",
        "I hate when people talk to me!",
        "My sister always is wearing my makeup",
        "I could be sleeping tonight but got back up because I have dogs barking on both sides of my house, so loud that not even a fan drowns them out.  ",
        "I got stuck behind a slow car on my way to work this morning. It made me late.",
        "I'm a bit unhappy about today's weather. It's about to rain.",
        "I have to run an errand after work so i'll catch traffic and its going to take me an extra 30mins to get him.",
        "No one will watch my Youtube videos.",
        "My internet keeps going in and out and it is really bothering me!  Why can't it just work like it is supposed to!",
        "My neighbors were so loud last night",
        "lazy workets bug me",
        "When my brother lied to me. ",
        "At the movies last week, the children would not stop talking. I was getting so fed up",
        "I waited on hold for 20 minutes to talk to someone about the bill I got and then the phone hung up on my.  Its quite aggravating",
        "My neighbor lets his dog wonder the neighborhood freely and he keeps pooping in my yard.",
        "Went to lunch and no one ever came over to wait on us.",
        "I was at the post officer yesterday and I had to wait in line to use the ONE pen in the whole post office. Why do post offices only have one pen?!",
        "My daughter always waits until I am busy to talk to me about nothing",
        "I get frustrated by my job sometimes, the people who call in just are not competent sometimes",
        "My roomate ate my steak that I had in the fridge. What a jerk. I'm so annoyed!",
        "My kids are the sweetest until I pick up my cell phone. Then they are like animals!",
        "I have not been in the best mood today. It's hot, I have no energy and my two girly dogs want to be right on top of me all day.",
        "My pet alligator bit me today. Never been so peeved in my life.",
        "I get so frustrated when I see people littering. Some people do not respect the environment at all. I want to scold them for being so inconsiderate.",
        "My dog peed on the carpet today. I felt peeved.",
        "My dog pooped on my carpet. I was so peeved!",
        "I was trying to get some work done but people kept interrupting me with questions.",
        "I got that horrible song stuck in my head. I think it's called Baby Shark.",
        "I wouldnt mind my son sleeping in my bed if he didn't climb over me all night. I cant sleep like that",
        "my neighbor is always throwing poop over the fence",
        "This headache needs to go away.",
        "when somone wont stop talking",
        "I got annoyed because I missed a delivery. I now need to go and collect it",
        "i was irked when i saw a dent in my car door",
        "i was irked when i saw a dent in my car door the other day",
        "Despite leaving to work with enough time, the train was out of service and delayed for about 30 minutes",
        "I haven't been able to find      my phone charger in 2 days.... grrrrr!",
        "My neighbor never picks up after his dog.  It is so irritating to see.",
        "My paper boy never brings my paper on time.  I get so irritated by that.",
        "I had to complete a project at work with my team. Unfortunatley I was the only one dedicated to actually doing it. The rest of my team just sat around and watched me scramble.",
        "I do the dishes at my house.  I can't stand it when I go to do them, and my wife has put a plate in there full of food still.",
        "My neighbor always interrupts me when I talk.  It is so irritating to me.",
        "My friend told me I'm getting fat.  I was so irritated by that comment.",
        "I have a cut on the bottom of my foot.",
        "I can",
        "I am so sick of cleaning up after everyone. I cleaned the whole house last week and no one will even help keep it that way by at least cleaning up after themselves.",
        "My police force is so corrupt. My neighbor has not come out of his house or let his dogs out in days. I am sure they won't do anything!",
        "I ordered a vacuum from a company online on a warehouse deal..and even though it was inspected..the power button didn't work unless you held it IN! Dealing with the CS took awhile and was a pain!",
        "Almost every night, something keeps dumping over my big trash can outdoors.  I keep watching for animals but the way its propped up on a board, I don't see how an animal can do it.",
        "i was pissed ofby my friend",
        "My boss can be so bothersome at times.  He will give us a bunch of work to do, but want to sit there and talk to us at length while we are trying to concentrate on our tasks!",
        "the last person i talked to said they killed a rabbit",
        "My dog keeps running around the yard in the spot where I just planted sod.  I thought the grass was good to go but it looks like he's destroyed it.",
        "I was pretty ansy in traffic today. It was so irritating",
        "I cannot find my mailbox key anywhere. I think my boyfriend took it.",
        "I was pretty annoyed at the grocery store. The checkout line was so slow",
        "Traffic was difficult tonight. It was very irritating",
        "Traffic where I live is irritating. Its also so random",
        "My husband leaves his dirty clothes around and it's annoying.",
        "Sometime, I have problem respecting my sleep schedule. So I wake up tired.",
        "I ran out of my favorite lotion and i can't buy it in store. so i ordered one online and i got an expired one!! so annoying",
        "MY kids love when I take a nap. So they can come be lous in the room i am in. They are the worst",
        "I ordered a pizza and it took an hour to get here.  I am so irritated it took so long.",
        "I live in a duplex and my neighbors keep parking their cars too far apart for me to park my one car and its a driveway for 4 cars.  They really don't know how to park.",
        "I'm so hungry and my husband is taking long bringing me food",
        "A guy pulled out turning left right in front of us, he didn't even STOP in the turn lane and he made a semi circle to also pass the left lane and come ALL the way over to the right lane and cut us off. We had to SLAM on the brakes. I truly hate bad drivers",
        "I'm a few dollars short for an important bill I have due.",
        "My dog crapped on the rug yesterday. I was so peeved!",
        "My dog pooped on the rug today. I never felt so peeved!",
        "My daughter just got her permit and is learning to drive.  Some drivers are so mean, yelling at her and blowing their horns.",
        "I think my neighbors is having a party. on a thursday. the music is so loud",
        "i really felt upset when someone i have really helped gave me a slap",
        "i get frustrated when i let someone out in traffic and dont get a wave",
        "My co-worker always interrupts me when I talk.  It gets me so irritated.",
        "My neighbor is asking to borrow stuff from me.  It gets so irritating.",
        "I really dont like my post office. They had suxh bad attitudes when you have to go up there",
        "I really do not like it when people lie to me.",
        "My pet bird is always making noise.",
        "none of the girls at school like me.",
        "My sister is staying with me for a few months along with her little dog. The dog will not stop using the bathroom in my house!",
        "My housemate got home really late last night. She made loads of noise. She kept me awake for hours.",
        "One of my coworkers ate my lunch I had left in the company refrigerator. I was upset and puzzled as to why they would do it.",
        "My friend was supposed to pick me up to go shopping yesterday. But my friend never showed up.",
        "Currently, I am having some financial issues.",
        "i was irked when i saw someone put a dent in my door",
        "I have a bees nest in my garden. They keep attacking me.",
        "when someone dosnt stop talking",
        "I ordered a vacuum that I needed asap..however it didn't work when I got it and they wouldn't rush ship another one to me.",
        "I got behind a slow driver on my way to work. It ticked me off because it made me late to work.",
        "i WAS IN THE GROCERY STORE AND KIDS WERE KNOCKING OVER ALL OF THE FOOD ITEMS. i WISH PEOPLE COULD CONTROL THEIR KIDS MORE",
        "hate when the yard guy makes noise early in the a.m",
        "I got a cup of coffee this morning and spilled it all over my work papers. Now I have to reprint everything and sort it out again.",
        "I hate when people move in late at night and decide to also hang their pictures up.",
        "I stubbed my toe last night",
        "I was walking to work early one morning and spilled all my coffee. I was really looking forward to it to.",
        "I can't get my printer to work properly. It's driving me crazy.",
        "My kids ask me 500 questions a day. 490 while I'm on the phone",
        "I can't believe my sister didn't pay her phone bill again. this really gets on my nerves",
        "My landlord is boring everyone in the building. He is here every day asking questions.",
        "Someone used some racial slurs today and it really made me angry. I freeze with anger when that happens",
        "I am seeing so much litter these days around my school...",
        "I was at a restaurant and the waiter didn't serve us at all! She was so lazy! I was so dissapointed.",
        "There is a fly in my house and I can't catch it! I really hate flies",
        "I got called into work on a Saturday! So frustrating.",
        "Someone keeps calling my phone. I'll block them, but they just call from a new number.",
        "I don't know who keeps double parking at my workplace.",
        "My husband is talking so loud on his headset playing video games. ?ugh",
        "I keep finding dog poops in my yard.",
        "The soccer ball of my neighbor kids keep landing in my yard. It is very frequent.",
        "My friend is so slow. It takes him a long to get anywhere. ",
        "I keep heading a noise coming from my attic ",
        "My elder son beaten up his sister. She is crying so hard. I was angry with him.",
        "This restaurant keeps leaving flyers on my door every week, and it is just piling up all over the neighborhood. ",
        "I really don't like it when people talk during a movie.",
        "While driving in the road, people do not use indicators properly. They are using the blinkers for left and taking a right. Quality of driving is going down",
        "i stubbed my toe the other day",
        "I got cut off in traffic today",
        "Stubbed my toe earlier.  UUUGGGHHHH",
        "I was checking out at the store and the lines were very long. They only had two registers open. ",
        "The person that was in charge of my reservation couldn't speak english well",
        "I forgot my wallet at work.  I am so irritated with myself.",
        "Poor people are always asking me for money.  It gets me so irritated. ",
        "The person taking my information at the Registry was very slow and they misspelled my name twice",
        "my cat vomited on my rug today",
        "A guy keeps talking to me about pigs. I don't know anything about them",
        "One of my friends really loves to play devil's advocate. It really makes me mad sometimes.",
        "My neighbor left feces on my lawn.  I am so irritated about it.",
        "I have never this unhappy  in my whole life",
        "I get annoyed when I see over weight people",
        "I have gotten into fights with this particular co-worker ( teacher) a few times. She's always late, un organized and her class is so bad. I asked to be moved away from her room this year and instead they put me next to her.",
        "Someone cut me off in trafic a few days ago.",
        "I spent two hours washing my car and it stormed a day later and got dirty again",
        "As soon as my husband gets home from work, I have to leave for work. Lately he's been taking his time getting home because he's socializing with coworkers and it makes me run late.",
        "i was irked when i couldnt get the day off",
        " finally got to mow my lawn and two thirds of the way done it starts raining.",
        "i was upset to see someone put a dent in my car door",
        "i was upset when i saw my dog was missing",
        "My biggest pet peeve is poor people who complain about their situation and do nothing to fix it.",
        "I was pretty irritated on the store earlier. The cashiers were being slow",
        "I was making myself a pancake the other day and my dog kept bothering me because he was upset.",
        "I sat in a lot of traffic the other day as there was a wreck up ahead.  This crazy person decided he was more important and zoomed by in the emergency lane.",
        "My friend is always at least 30 minutes late to everything.",
        "I am irritated by the weather now.. I wish the sun would come out",
        "My new neighbors have had so many guests already. At all times of the night",
        "I'm so ready for my kids to go back to school. they keep asking for snacks and fighting with each other all day.",
        "I work all day long and my teenagers have been home all summer.  But when I get home they've not done anything around the house.",
        "my computer wont ever work like I need it too. but I cant buy a new one.",
        "my Tv keeps getting cut off, even though I pay the bill.",
        "I asked my husband to make me a sandwich and he's taking so long, ugh. ",
        "I can't believe my daughter added things she didn't need on her supply list",
        "I do not like the fact my brother always uses my car.",
        "My brother wont stop making fun of my pimple.",
        "my friend delayed our lunch plans... again.  They can never make it anywhere on time.",
        "i hurt my elbow a month or so ago.  I thought it was on the way back to being better, but then yesterday I tweaked it again.",
        "I get angry with  people that are not sincere",
        "My landlord has not fixed a leaky tap in my apartment even though I've asked 4 times. ",
        "I'm annoyed that many things are closed on Sundays.",
        "These contractors are fixing the roof and they are so messy",
        "i changed my sons diaper after he peed and said no poop.  five minutes later he pooped everywhere in his new diaper",
        "My friend is literally changing his moving day, so that I can help.  I had to work on the first day, so he changed it...",
        "I'm annoyed with my new neighbors, it seems like they never go to sleep and make so much noise.",
        "I ordered food almost two hours ago and it's still not here, ugh!",
        "My back has been having sharp random pains throughout the day, it's annoying!",
        "Trying to get rid of house gnats is a pain.",
        "I was stuck in traffic the other day.  This guy thought he was more important and flew past us in the emergency lane.",
        "There was this giant spider in my room. I'm afraid of spiders. I went to get something to get it with, and I came back. The spider is now missing.",
        "There are many situation that perturb me and regularly I experience them on here Go figure I know! Generally its from people still using hit scrapers and preventing the rest of us regular users from even getting a chance at hits. Some will be posted with a boatload available and in .00000001 seconds they're gone!",
        "My dog pooped on the rug today. I am so peeved.",
        "someone almost crashed into me",
        "My neighbors were having a party today and one of the people parking infront of my driveway and blocked me in when I needed to leave",
        "My dog pooped on the rug today. I was so peeved.",
        "I have an older sister that is always comparing our kids as if her kids are smarter.",
        "Someone threw a bunch of empty beer cans in the bed of my truck.",
        "my neighbor dog keeps barking for no reason",
        "I was up most of the night again. A new mom who is quite obsessive with her baby and she keeps accidentally sitting on him and making him squeal, so I had to get up a lot and move hime",
        "when i got home and my shampoo and conditioner wasnt in my bag! ",
        "I was doing some exercising earlier today. When I made it to the gym there were so many people in there!",
        "i was upset when i saw someone had dented my door",
        "My neighbors dog does not shut up at night and it's agitating me. I've been avoiding bringing it up to him, but it's getting to me n ow.",
        "I was pissed to see a dent in my car door the other day",
        "At work, a new coworker keep looking at me in weird way. I feel very uncomfortable.",
        "A manager I do not like was working at the store I love today. It makes it a bit frustrating to shop there.",
        "MY daughter knows that I am not paying attention to her yet she is still talking.",
        "I was sitting in class and people talking behind me made me unable to hear the teacher.",
        "Customer service sent me two bad vacuums now. Well the second works but the stretcher pole thing that is metal doesn't work right. Sigh..",
        "My friend got drunk over the weekend and I had to take care of him. It was pretty irritating",
        "I ha car trouble over the weekend. It was pretty irritating",
        "I left my wallet in my office today.",
        "i was upset when i was told i couldnt leave work on time",
        "When my sister plays pranks on me. She put clear wrap over the doorway and made me run in to it.",
        "I get so annoyed at my husband when he leaves his dirty clothing on the floor.",
        "I was pretty irritated last week. My landlord avoided me",
        "It's crazy the amount of people running the red light near my house every day. So frustrating.",
        "Somebodies kid had a dirty diaper on my flight last week.",
        "The weather the last few days has been irritating. I just want it to be sunny",
        "I'm constantly working and never get a break.  Its been getting to me lately and I'm grumpy all the time.",
        "I am kind of irritated at the moment. My brother fell asleep on the couch where the tv is.",
        "I really can't stand my printer",
        "I ran over a nail and I had to get a new tire.",
        "I am sick and have a big meeting this week, not happy.",
        "Printer is really grinding my gears today!!",
        "My friend told me she didn't like my chicken casserole recipe when I brought it to a potluck last week.",
        "My dog ran away yesterday. I was so peeved!",
        "I am really getting irritated with traffic nowadays and horn sounds are just terrible",
        "My brownies burned in the oven.  UGH",
        "My dog pooped on the rug today. I was so peeved!",
        "There was an internet outage for hours today, the day I decide to stay home because I don't feel well. What a day.",
        "There is a fly in my room and it is annoying the heck out of me!",
        "My girlfriend always tells me what to do.  It is getting so irritating.",
        "I love the new apartment I moved into, but the only down side is I can hear traffic all night long. It's so annoying!",
        "Every time I park my car in my apartment's parking lot, someone parks way too close to me. It's annoying!",
        "We have a camping site booked and I got everything packed up. My family won't get out of bed so we can get going. I hate waiting. ",
        "When people were rude in the store to me. ",
        "i was annoyed when i was told i had to work last weekend",
        "My brother has developed a habit of prank calling me. Occasionally it is funny but most of the time just bothersome.",
        "Someone asked me to come pick them up at a specific place at a specific time. I was a little busy at the time, but I relented. Then they sat there and took 30 minutes longer than they said they would, and I had to sit around waiting in the car. How are people that inconsiderate?",
        "My husband and I recently decided to get a puppy. I was extremely excited after we put the deposit down. When I went to tell my mom she immediately started talking badly about our decision. I got really upset about her reaction and was very frustrated with her. ",
        "My mailman didn't make it by my house today and failed to deliver my order. He's usually never even late.",
        "I was walking down the street and a fly flew into my mouth. I tried to get it out but it wouldn't leave. It tasted so nasty.",
        "The package that was supposed to be delievered today was delayed by UPS",
        "I came home from work the other morning, and wouldn't you know it, there were a ton of old dishes in the sink.",
        "I wanted some popcorn with my movie the other day so I put some in the microwave without thinking about how old it could be. I guess it was really old and it had literally exploded all over my microwave. I cant figure out how to clean it up.",
        "I have construction going on at the house next door from 6 am until well past dark.  It is very unwelcome",
        "I had one beer left when I got home and spilled the whole thing right after I opened it.",
        "At work, two coworkers are making too much noise. They are  bothering me in my work.",
        "i have a coworker that comes in to work late everyday and takes a million breaks",
        "I went to the grocery store and I had to bag my own groceries.  It was quite irritating. ",
        "I stubbed my toe and cracked my toenail tonight.",
        "My family is always bugging me to do things that I dont have time to do. Yesterday they wanted me to stop my work day, come home, and go to the old folks home to visit my grandma when i already go every weekend. Its like they think that my work doesn't matter and I can just up and leave whenever?",
        "I've been working 7 days a week for at least a month now. I'm burning out.",
        "I've been waiting for my husband to build my new furniture and he's taking forever!",
        "Was supposed to go camping this past weekend, but it ended up storming like crazy.",
        "The weather has been irritating all week. I am tired of the rain",
        "My manager asked me to work in this evening. I had plans already set. I had to cancel them.",
        "I was sitting in traffic today and saw the stupides thing.  This guy decided he didn't want to wait and flew up the emergency lane, blocking the ambulance.",
        "I have to take off work tomorrow to wait on a repair man to come to my house.",
        "My neighbors drive me crazy and they're so weird. The bring huge Cloud chairs onto their tiny front stoop and lay back side by side together. It looks like they might fall off if they move at all.",
        "when dosnt stop talking",
        "My Cd player keeps skipping nothing can stop it.",
        "My cat pooped on the rug today. I was so peeved.",
        "Sometimes I'll have a song stuck in my head for hours",
        "My neighbor keep doing too much noise during the night.",
        "I stopped to get my morning drink on the way to work and didn't check it. They gave me the wrong order.",
        "I wish poeple would just pick up their dog poop",
        "The mosquitos here have been miserable this year. I need to buy more citronella candles.",
        "someone almost cut me off today",
        "i got cut off today",
        "my pants dropped last week from getting hooked on a table",
        "My little cousin was visiting last weekend and he kept screaming for Kraft Dinner for supper. I made a delicious chicken dinner but his mom apparently always give him what he wants.",
        "I bought some fast food, and the cashier refused to give my a receipt! I had to ask the manager to print me one.",
        "I really don't like it when people talk on the phone when at the movies.",
        "I am baffled as to why it's so difficult for teenage boys and adult men to remember to take out the trash.  I swear even if I remind my son all throughout the day and the morning of trash day.  He always seem to respond to hearing the trash man either approaching or passing the house.",
        "My manager is wasting my time with stuff that is not related with work. I can not make progress in my work.",
        "One of my cowokers is always talking to me about stuff that is not related to work. I can't make progress in my work.",
        "My wife is so cranky today",
        "My little sister has to sleep in my room this week while we have company. I hate it because she really gets on my nerves.",
        "Went to trim my beard today. Trimmed a little too much on one side, had to even it out on the other. Did that like four times on accident, and now I trimmed my beard so much more than I wanted to, and I look dumb. ",
        "Came home the other day and my dogs were happy to see me. I then go into the living room to find the couch ripped up.",
        "My mom dog does not want to leave her cage even to go potty. It's getting on my nerve a bit to have to take all my strength to drag her out everyday. Phew :( Good for my arm muscles I guess",
        "I spent a 4 hour roadtrip with my wife playing on her phone the hole time.  It was aggravating to me because i needed someone to keep me occupied while driving",
        "My cat wont stop knocking over my plates",
        "Today at work there was a coworker who was not doing nearly as much work as the rest of us and it was annoying",
        "My best friend cancelled our plans last minute.  We'd been planning a night out for months.",
        "My cat keeps knocking over my dominos ",
        "My coworkers are really annoying. They talk like they are knowledgable, but really they are terrible about their jobs. ",
        "Nothing gets on my nerves more than stupid stubborn people.  Stupid people still have hope, you can convince them if they are humble enough...but a stupid person with an ego is like trying to wash dishes with cat piss",
        "People never listen to me when I talk.",
        "Today my boss really got on my nerves ",
        "MY kids act like they dont like home cooked meals anymore. Fast food is not life",
        "My upstairs neighbor is making too much noise with her heels. Sometimes, she wake me up with the noise that she make.",
        "My son really acts like a jerk at night if he doesn't get a nap.",
        "I cant believe my daughter drank my last dr pepper. She knows I can't live with out them",
        "A dude pulled up halfway in my driveway, beeping at me UNTIL I came out..like 50 times! Smoking and leaving his ashes everywhere..I am a woman..home alone..Seriously? I am so tired of people in poor areas behaving ghetto..Acting like they have zero couth and respect for others property!",
        "I cant be live my ex didnt pick up our son and now his phone is off",
        "I've been getting really bad headaches recently",
        "A random number won't stop calling me, even after I blocked them. I can't stand it!",
        "The new printer at work is awful!!",
        "I don't like people who cut in line",
        "I hate my new printer at work!!",
        "I hate it when the waitress bring another table food when I got there first",
        "I don't like it when mosquitoes attack me while I'm having a good time at the beach",
        "i was beside my girlfriend at the dinner table studing for test. She started taking her fingers and clicking her fingers against it repeatedly it it kept me distracted from my goal which was studying",
        "This new printer really grinds my gears!!!",
        "They've been doing road work outside my house all week! It just goes on for 12 hours straight everyday, mostly at night!",
        "my cat still has his claws. He has begun scratching the chair I sit in to get my attention. He is so bad.",
        "I was angry at my friend's attitude towards me",
        "I recently was talking to my mom about the new dog my husband and I decided to get. Without any research she started talking about how mean the dog will be and how it's a bad breed. I didn't even get mad because I've had to correct so many people before, but it was definitely irritating.",
        "I live on a rural property and part of my rent is making sure people don't trespass on the property to hunt. People keep trying to sneak onto the property and sometimes it keeps me up all night trying to kick them out.",
        "I spent a few hundred dollars on a purse, which is a lot for me, and it started fraying in days.  I'd barely used it!  Luckily the store agreed to replace it.",
        "I am so annoyed by my brother, He borrowed my lucky pencil when he knew I had an important test today",
        "my brother wouldn't leave me alone and I think I'm going to punch him!",
        "i hate when people tell me what to do ",
        "My coworker left early on me today and left me with a ton of work. I can't believe he always gets away with it.",
        "My daughter kept interrupting me while I was trying to work. I couldn't get much done at all.",
        "My brother asked to borrow my car lst week and I let him. he took it and when he brought it back I noticed that their was a small dent and blue paint on the passernger side door.When I asked him about he acted as if he had no idea where it came from, I wanted to kick him in his but if you know what I mean.",
        "The neighbor's dogs next door won't stop barking and let me sleep!",
        "One my coworkers has been showing up late everyday for almost a month. It's making a lot more work for me.",
        "My kids are driving me nuts! I can't wait for back to school time!",
        "My dishwasher leaked and we had to have our whole kitchen and living redone due to the damages.",
        "My coworker kept taking my lunch",
        "I work in IT and it really bothers me when people talk forever about their computer issues. ",
        "I was babysitting for my daughter. She didn't come pick up the kids until 1 in the morning.",
        "We bought a cat that is supposed to live in our barn. He is very frustrating because he constantly comes and sits at the front door of our house instead. We always have to move him out of the way because he tries to get inside.",
        "I was trying to use my smart tv to watch a movie but my internet kept disconnecting. I tried reconnectiong and it would work for a while and then disconnect again. it was a really good movie too.",
        "I was babysitting a few days ago and my cousin kept throwing her food on the floor.",
        "my sister ate all my snacks that i  bought yesterday",
        "When i went to pick up my pod from the place I was told it wasn't there. They had moved it 30 miles away without telling us when we confirmed earlier in the day.",
        "My sister can really get on my nerves. She stole money from me again.",
        "A friend of mine keeps leaving his trash everywere. It is not stinking the apartment up",
        "I was a little irritated driving last week when a car cut me off. I thought we were going to be in a collision.",
        "im up way too late",
        "I went to the movies and sat in behind a group of kids who talked throughout the entire movie. It was hard to focus on the movie with their constant blabbering.",
        "I had seven fishes in my aquarium, came from work and saw that current went out and five of the fishes died.",
        "My neighbors left their trash in the hallways. It is attracting flies.",
        "Recently I was looking to buy a car and even when I am not in the market anymore, sales people keep calling me everyday.",
        "I had to wait all day to pick my dog up from the vet, even though we had an appointment.",
        "My cat will not stop meowing at me. he is a mad man.",
        "My classmates at university are so gossip-y. They get so catty with one another, and spread rumors behind each other's backs. We're in a small major, so everyone knows everyone in this group of 50 students, and a lot of them dislike each other for no good reason.",
        "I went to Burger King today and they totally messed up my order.  I was so irritated.",
        "My friend kept pinching me. We were at school that day and he was constantly doing it.",
        "My new printer gets on my nerves so bad",
        "colleague not understanding ",
        "my cat vomited on my carpet",
        "when someone does not stop talking",
        "My son is one and a big time climber.  I feel like I spend every second taking him off the table top or keeping him from scaling the bookcase.",
        "My neighbor revs his engine sometimes early in the morning and it gets on my nerves",
        "I needed a form from my rental office but no one would answer the phone. I called like 10 times. I really need that form.",
        "I get annoyed by my brothers sometimes, but that is life I guess ",
        "I get annoyed by my brothers, they can really get on my nerves",
        "I went to the movie with a friend, apparently he saw the movie before and keeps chatting and telling me what's going to happen in the movie.",
        "I have a coworker that plays their music so loud I can hear it from their headphones. I keep asking them to turn it down but they keep cranking it up.",
        "My phone is not working very well. I am going to have to take it in again.",
        "I really dont like when someone gets too close to me in line.",
        "Every time I tell my Mom about something my child did that is so neat to me, my sister-in-law chimes in about something her child did to top it. It drives me crazy.",
        "My dad told me he was going to give me a gift card to a steak house, but he never followed through.",
        "it drives me nuts when someone stands right by me in line",
        "My roommate always pees all over the toilet seat. It makes me so mad.",
        "I was staying at a hostel and forgot to lock my backpack. I woke up the next day with money missing.",
        "There is a coworker sitting next time that he is making noise with his pen the whole day long. It is disturbing me from my work.",
        "I hate parents that shelter their kids by censoring every TV show, movie, video game, or musician.  Of course it's one thing to let a 5-year-old watch \"Silence of the Lambs\"; but do you really expect to raise the next Einstein by blinding a kid to reality? By the time he's 13 he or she's gonna have some serious repression issues and grow up to be a psycho",
        "A mosquito won't stop flying around my face. ",
        "My cat keeps biting me because he is getting old.",
        "My driver's licence got lost in the mail and I had to go get a new one.",
        "My coworker in the cubicle next to me is always talking!  He really bothers me."
    ]
}