{
    "threshold": 0.8,
    "seed": [
        "As i get older I've fully accepted who I am. I'm not here to impress. ",
        "My mother has been visiting for the last week. We have been doing a lot of talking and laughing. ",
        "I wanted to have a few things so I manipulated an account to make it appear I had money that I did not have.",
        "I'm happy with where i am with life right now. Work is great, family is good and business is booming.",
        "I ate my dinner and am relaxing on the couch in my pyjamas ",
        "I feel happy with life right now. I have a nice job and things are going my way.",
        "I just upgraded the turbo on my car. I wanted more power but I'm happy.",
        "I took my dog to the dog park last weekend. He was so happy!",
        "Lost 25 pounds now I'm a beautiful man",
        "Hanging out with my dog by a lake near my house",
        "My life may be far from ideal, but I am happy with where I am.  I am satisfied with the overall scope of my family, career, and friendships.  I am at peace with it all.",
        "When we are camping, I take a hammock with me. I love swaying in the hammock and reading a good book!",
        "I was outside with my daughter watching her play. I felt very relaxed out there in the sun.",
        "Yesterday I went engagement ring shopping.",
        "I ate a lot of pizza and i feel so good right now",
        "I just finished my bulletin board at work. It looks nice and I am glad to be finished.",
        "A competing firm offered me a job for higher salary if my ditch my current firm. But i did not, i feel satisfied with my situation now.",
        "Latey it seems life has been nice and routine. ",
        "I went to my moms funeral yesterday.",
        "i am pretty happy right now, i don't think i have ever been happier with my life.",
        "I spent the other weekend cleaning my apartment, it felt so good at the end of the day to sit back and watch TV in my nice, clean apartment.",
        "having a nice meal",
        "I found a pizza joint in town that does a buffet.  Needless to say I left satisfied.",
        "Sitting on a bench in a park used to be enough for me.",
        "I finally have all of my housework done for the day. Now I can just sit back and relax.",
        "I'm pleased with my dinner",
        "I'm been loosing weight January. I'm down 50 pounds. I have 10 more to go but I'm happy.",
        "I like to relax on the weekends. It's nice not having anything to worry about.",
        "I am really pleased with my job performance lately.  I will be getting that promotion for sure.",
        "i am pretty comfy right now in my bed.",
        "im happy with my health for the first time in a few years",
        "I was outside relaxing watching the kids play in the pool.",
        "i am pleased with the day im having today",
        "My divorce was settled. I was able to keep my house and all my possessions.",
        "We recently spent a weekend at the local lake.  Work had been hectic, and family had been challenging.  It was so peaceful to just sit on the sand and enjoy the sun.",
        "I always help my daughter study for her college exams it makes me so pleased to be such a big help.",
        "When I came home, a TV show I set to record was all ready.  It felt good not to waste time",
        "I finally got my dog all worn out for the night.  Now he is just hanging out and I dont have any more work to do for the night.",
        "I am very content with life.",
        "I just paid all my bills and don't have any huge plans for the weekend. It's sometimes nice to just be able to chill and relax.",
        "Today is my first day off in a long time. I'm playing some Zelda on the Switch, and I'm feeling pretty happy!",
        "When my son was born, it seemed like my life was complete. I have everything now that I could ever want.",
        "I am content with life.",
        "I finally got all of my work done for the day. Now I can go home and just relax for the rest of the evening.",
        "I made fish tacos the other day and did absolutely nothing but watch Netflix and relax on the couch. It was so nice and chill.",
        "I would have to say I am pretty happy with my life right now.",
        "My little brother was stuck gaming on a horrendously slow computer for years. Recently, I re-built my previous gaming computer and gave it to him so he could finally play games and truly enjoy them. I felt so happy seeing his face light up when he experienced it!",
        "sudden realisation of life",
        "I went out with a friend last September, we had some sushi and a small chat, and I really liked that time we spent together.",
        "Anytime I just sit down somewhere sunny and have some sunflower seed with me I feel so happy.",
        "I feel relaxed and at ease when I got off work Friday with no plans for the weekend. I can't wait to do nothing for two days.",
        "I passed two trials that a company put me through and I felt so good. I think I'm going to get the job!",
        "I spent this evening with my family.  This makes me realize how blessed I am.",
        "i am more content in my life",
        "I'm really feeling alright about how my life is going right now. Everything is in order. Nothing is going amazing but nothing really sucks either.",
        "life is peaceful",
        "When i got the score for my final. Got a good grade on it and passed the class.",
        "I'm very happy where I live. There is nothing else I would want.",
        "I had a great breakfast this morning: eggs, bacon, strawberries, tomatoes, and coffee. It was delicious and I felt very relaxed.",
        "I feel very happy that I moved out in the country. I thought I was a city person.",
        "I was very happy just reading a book by the pool today.",
        "I have realized that I have it good in life",
        "I realized I am happy with life",
        "I;m living my best life. I could'not be any happier.",
        "The best I ever felt was on an island in the Caribbean.",
        "I have been in my job for 3 years now, and I feel quite comfortable and happy here",
        "I got an A in all my classes, and summer is starting. I'm pretty happy with how things are going right now.",
        "I was outside with my kids playing in the pool and I just felt no stress or anything, just very relaxed.",
        "I went out to eat at a new place with my girlfriend last weekend. It was awesome and the food was great. ",
        "I received interesting gifts on my birthday",
        "I feel so happy when the sunsets are beautiful and I can take the time to watch and relax. It is the best time of the day for me.",
        "We went out to dinner the other night.  I was expecting it to be awful but it turned out to be okay.  Nothing super special or exciting but just okay.",
        "life seem like it is going pretty good for me. I have no complaints.",
        "I feel happy to know that God has got my back and I don't have to worry about anything.",
        "After feeling depressed for days, I took the time to sit outside in the sun and have a nice chit chat with my mom. The cool breeze felt comforting and completely changed my mood today, I feel good!",
        "I am at peace with myself after taking a nice hot shower",
        "i'm grateful for my life.",
        "with life",
        "I feel happy to just stay in and watch a movie at home on a Saturday night. I have no desire to go out and party like most people I know do.",
        "Last month, I finally received the promotion at work that I had been working towards. It seemed like I had finally got to the end of a very long road.",
        "I am happy with my life.",
        "I got my work done early on Friday so I got to spend the day trying out a new bike trail on my new bike. The weather was amazing. I felt really satisfied with life.",
        "My brother and his friends invited me to a party tonight. They celebrated my birthday and I felt very loved and happy.",
        "Every evening, once my baby goes to sleep, I sit up with my husband and watch TV. It's the only time we have together in the day that's guaranteed."
    ]
}