{
    "threshold": 0.8,
    "seed": [
        "I felt caring when i helped an elderly lady carry her bags to her door.  She was struggling to carry some heavy bags and i offered her help. ",
        "When my girlfriend was in the hospital.",
        "My mother was always there for me when I was sick, annoyed and sad.",
        "When I started massage therapy, I thought it would be strange, but  I actually just felt a sense of concern for my clients. ",
        "I was at the gym on Monday and a man started having a seizure. I was frozen in fear but luckily someone else tended to him.",
        "i felt caring when i picked up my puppy for the first time ",
        "I used to have a couple rabbits.",
        "i was stranded in a gas station and this lady helped me out",
        "I have such a big heart, i love my people.",
        "A friend of mine was sick.  I went over to his house and gave him medicine and food",
        "A friend needed help moving.  He didn't know of anyone else to turn to so I lent him a hand",
        "I have a full time stay at home job where I have my grandma who is in her 80's and my five year old. ",
        "My sister in law got really upset one day when she was over and I tried talking to her about it.",
        "My family is always there for me. When my dog died, they flew out and spent time with me for a quick weekend trip. ",
        "i look after my dog as if he is my child.. i cant even properly explain how i feel about him",
        "Took my dog to the park",
        "My two neighbors really love each other. The man always opens door for her. They hold hands when walking.",
        "A friend forgot his phone at the library.  I rushed back and grabbed it for him",
        "No matter how much we fought with my siblings, I am ready to be there for them, if they need me.",
        "My wife was very sick.",
        "I donated $1,000 to the American Society for the Prevention of Cruelty to Animals.",
        "My foster cat had really bad teeth, I had to take her to the oral surgeon. They ended up taking out 13 teeth! Poor thing had nothing left, I felt so bad for her.",
        "My daughter fell and hurt herself",
        "I found a new stray dog eating out the dumpster last Thursday. Today I officially adopted her.  ",
        "my son had his wisdom teeth removed, and i took the opportunity to baby him a bit.  he is 24",
        "When we moved into our house, we found a small kitten that someone had dumped. We took it in and now he is 9  years old.",
        "I found some orphaned kittens on my stoop. Their mother had been hit by a car. I took them in, bottle fed them round the clock, and then found them wonderful homes when they were old enough,",
        "I'm promoting two staff members on Sunday. They work hard and are great people.",
        "My mother has become rather sick. I'm going to let her stay at my house so I can care for her.",
        "A co-worker was having problems finishing a project.  I stepped in and helped him",
        "I saw a little homeless girl a while ago, it made me feel like a father.",
        "As a nursing student and future nurse I will be in a professional where I will help people while they are hurting the most. ",
        "My girlfriends aunt recently died.  Although I never met her due to a falling out with that side of the family my girlfriend and her sister were devistated.",
        "My girlfriend was having a horrible day at work, so I sent her some pizza to cheer her up and it worked like a charm.",
        "When my niece got send home from school sick I was a bit worried and nervous",
        "My cat got sick the other day, I felt so bad for him. I had to syringe feed him to make sure he kept eating until he felt better.",
        "I started a new job and everyone there was so kind they made we feel very welcomed. ",
        "I love  looking after my elderly parents.",
        "I never thought I would feel such love having kids.",
        "About a year ago I almost adopted a child, but now I'm glad I didn't, it's too much responsibility.",
        "I love my little fur babies they are my family and so warmhearted I don't look at them as dogs those are my babies.",
        "I recently had to babysit my cousins, but they made a mess everywhere in the house.",
        "My dog got bit by something and had a huge front lip. I felt so bad for him, I was doing anything I could to make sure he felt better.",
        "feeling full of emotons",
        "I took my neice to volunteer at the local shelter last weekend. She had alot of empathy for the homeless and needy. ",
        "I found an injured spider with a leg missing in my bathroom a few days ago. Instead of killing it like so many people do, I brought it outside and hoped for the best.",
        "I volunteer at a dog shelter every weekend. It's great to be able to help out all of the cute dogs!",
        "A couple of days ago there was a man at the gas pump at our local gas station.  He was  was trying to find a way to get himself some gas so he could get home.",
        "looking after my cats",
        "My grandma got really sick and my family and I had to take care of her. We did whatever we could.",
        "I little stray puppy appeared in my driveway yesterday.  I fed him and contacted the local pet shelter.  No one had reported him missing though they took his details incase anyone phoned up.  I have never been much of an animal person but I couldnt believe how much I felt for this poor wee pup.  I brought him in and since no one claimed him he is now officially one of the family and definitely the happiest, most loyal member.  Always pleased to see me and he has just stolen my heart.",
        "My wife is having a hard time after finding out we can no longer have children. I am doing my best to support her and care for her but it is very hard when nothing seems to work.",
        "I babysat my nephew last weekend. He slept over and was scared so I let him sleep in bed with me, even though he kicks and rolls around",
        "One of my love birds had a baby but she is a terrible mother. So I am now taking care of the baby and feeding her everyday. She is so cute!",
        "I love volunteering.",
        "I love to volunteer for others.",
        "I played with and hugged my dog all day today!",
        "I really love my wife and kids and it just puts me in a very happy mood I feel like everything is right in the world with them",
        "I saw a lonely stray cat looking skinny and scared in an alleyway and I felt so bad for it I wanted to take it home.",
        "When my dad got sick and i had to stay at home for a week taking care of him",
        "My dog was stung by a bug.  His lip got HUGE.  It looked pretty funny but I felt so bad for him!",
        "I have no children but I have a ton of animals. I love them all so much. They are my children.",
        "i have been sick for a week now",
        "I had to take care of my little brother while he was sick.",
        "I met my nephew's daughter the other day. I'm much of a fan of babies, but she was so sweet.  She adored me.  I felt my heart warm up a little bit being around her.",
        "i do love my pet doggy, she is a treat to have",
        "One time there was a stray cat hiding from a dog in my front door",
        "My guinea pig was feeling very sick but I was able to nurse her back to health.",
        "I found a large moth inside my cottage. I carefully caught it with a cup and let it go outside; there's no good reason to kill something that won't harm me.",
        "my wife is sick and i am taking good ",
        " i care for my family and always want the best for them",
        "I found a lost baby duck. The mother was no where to be found. I brought it home and took care of it until it was big enough to be let loose again.",
        "This past week my 3 year old son had strep throat. It is finally clearing up now, but I had to miss so much work to stay home with him.",
        "My neighbor recently got a devastating cancer diagnosis. I've been bringing over pre-cooked meals for her and her husband whenever I have a chance so they have one less thing to worry about.",
        "I love my daughter. Being a parent is actually a lot easier and more wholesome than I expected it to be."
    ]
}