{
    "threshold": 0.8,
    "seed": [
        "I am happy to have a good vacation",
        "I was content getting a B on my exam.",
        "I've been in my crappy apartment so long. I think just used to it now.",
        "I am ok with being fat.",
        "I am ok with being average in life.",
        "I felt a peace when I was able to stay home with my daughter after she was born. I would always be nervous if someone else was watching her other then myself. When my husband got this great job so I could stay home I was a peace.",
        "Sitting at home after a long day relaxing with my kids is the best",
        "I am happy with where I am in my life at this very moment.",
        "It was mother's day and it was a pretty, foggy morning. Me and my three kids sat on my bed cuddling and relaxing, and my husband brought us all some breakfast. I was so happy spending time with my family and enjoying such a peaceful morning.",
        "One time I needed a 50% on my calculus final in order to keep my A in the class. I got a 48% but in the end he rounded my grade up to an A anyway so I was fine with it.",
        "Ive been doing quite well for myself the past few months and things have been going well so im happy",
        "I got my engineering diploma three month ago. I have been looking for a job since then. I finaly found a job that I am satisfied with but it is not the job that I dreamed of after getting my diploma.",
        "I really wanted to keep my A in computer science back in freshman year. Although I really tried, I got a B and it made me a little upset but I was pretty happy either way.",
        "I woke up and the sun was bright, birds were chirping outside.",
        "I think I've been in my hometown so long, I wouldn't dream of moving anywhere else. It's just home to me now.",
        "I was content when I found out I passed a class in college",
        "I feel quite content with my life. I've seen everything and done everything. I just want to sit back and enjoy life in the countryside far away from cities.  ",
        "I've been quite pleased with my family lately.",
        "My family was never rich when I was growing up.  But I've got very fond memories of my extended family in that small house because their company was worth more than diamonds",
        "I used to want more kids, but I think I'm happy with my family size for now.",
        "On my birthday, I was able to kick back and have a couple beers with my family and friends. It was a good birthday.",
        "I finally got an interview! I have been applying for jobs for months!",
        "Last night I had the chance to finally lay down in my bed and read a book after a long work week. It felt so good.",
        "I finally paid off the car.",
        "Paid off all my debt. Took 10 years.",
        "Just got finished jogging and I'm feeling really tired, but I have a sense of achievement, too.",
        "I'm in a current situation with my mother where I am not feeling as caring as I used to be. This is because of how she acted towards me when my father was in hospice and watching him suffer through his last days.",
        "Doing pretty good at work today. Feeling like things are going my way.",
        "i feel like my life is coming together finally or else i am learning how to cope with the stress ",
        "I think my life is going great now compared to before.",
        "Had a really good spaghetti dinner tonight. Just relaxing and getting some work done now. Feeling pretty accomplished today.",
        "i wanted a large tv like a 65 inch but i was happy with the 42 inch my wife got me",
        "After 40k in credit card bills and a mortgage, I finally paid it all off.",
        "I think I'm quite happy working from home now. It didn't go too well the first time.",
        "I had some Big Macs and Taco Bell gorditas. They were delicious.",
        "Heading to the buffet after completing a ton of work.",
        "Just paid off the house last month. It's so nice not having to worry about mortgages.",
        "I think my life is right where it should be.",
        "I finally got to go to the bathroom after holding it for 3 hours. Work is crazy busy sometimes.",
        "I love laying in my bed in the morning",
        "Today was such a fine day that I went to the park. It felt nice reading my book in the sunshine.",
        "Once i went to a all you can eat buffet by myself. It was so bad to do but i was so happy all the food i ate.",
        "After a long, grueling day at work, it is nice to just kick up the feet and watch some Netflix.",
        "Just relaxing here with a cold Dr. Pepper after a long day of work and a hot shower. It doesn't get much better than feeling the air conditioner breeze flowing on your clean body, feeling accomplished.",
        "I feel like I have a really great relationship with my wife lately.",
        "I am ok making average money in my life.",
        "I went to the store looking for jeans and found a good pair.",
        "I am so thankful for my humble life",
        "It is nice to have a roof over my head",
        "I played FIFA with my friend and won against him this past weekend",
        "I'm pretty happy with my new job. It doesnt even pay much",
        "I felt very content last week. I was on a boat in the sunshine.",
        "I recently had a nice meal.  It was Italian food, my favorite. ",
        "I have always been a laid back person.  I never get too worried about anything.",
        "feeling at peace right now with life ",
        "i farted infront of a pretty girl in a train once",
        "I am content right now, I have a girlfriend, a good job, and a good group of friends",
        "Last night I was laying with my husband and daughter and I felt so relaxed. It is what life is all about.",
        "i am so happy with things right now ",
        "I am happy with my current position at work even though everyone is struggling to get posted for an international assignment I won't",
        "I got to sit down and play my favorite video game with my girlfriend last night. It was so relaxing.",
        "I was happy and felt calm when we went and saw a concert my brother wanted to go see. It just felt right",
        "Today I woke up to a rain storm outside. It was so calm and peaceful as opposed to my screaming alarm. I felt like it was going to be a good day as I rolled out of bed. Rainy days make me feel a-ok and ready to enjoy my day.",
        "I am so glad i could affrod a 65 inch tv, i use to have a 19 incher for years",
        "I an normally very relaxed, happy, and laid back.  Everything in life just seems right!",
        "I am felling so chill right now since I have most of my bills paid",
        "I don't have a car anymore but I am satisfied without having one. I don't drive a lot anyway and everything I need is in walking distance.",
        "I don't have a car anymore but I'm perfectly fine with a bike now. Everything I need is pretty close to my house.",
        "I am so reieved to be working from home full time now",
        "I felt happy the day I got my new job back in May. I'd been out of work for several years and it had really been weighing on me. Even though it's only a part-time job I've since been motivated to start earning in other places too.",
        "I think my daughter got the best pre-k teacher this year.",
        "I finally have enough to buy a new computer.",
        "I got $20 worth of Taco Bell. I haven't ate all day.",
        "I am very happy with my girlfriend.",
        "I felt good and normal going to my brothers wedding. It just felt nice to know he was going to be happy",
        "I have lived in the same area my entire life and worked at the same place for 10 year. I am perfectly happy and in no need of change.",
        "I went camping the other week, and I was so happy to not have to worry about the troubles of the world for a while. It was therapeutic, honestly. ",
        "My mom came over to visit last week. She was very helpful around the house. She really took care of all of my needs.",
        "I just got a new tv today. I think I picked the right one",
        "I am at a great point in my life right now.",
        "After one of the longest days of work i had i was so happy that i didn't have to work for 2 weeks after. I am so happy with myself.",
        "I was just happy and calm when we stayed at a cabin last weekend. I felt like I was home",
        "I went to the park yesterday and read a book under a tree. Felt so good to relax for awhile.",
        "Going to a dim sum place after work. Haven't had some in a while.",
        "I have never cheated on my girlfriend.",
        "I am satisfied with my gains so far. I hit the gym only 2 times a week but I am ok with that.",
        "I'm perfectly fine with being single at the moment. It gives me a lot of clarity and time to self-reflect.",
        "I am just a chillin here on a Saturday night.  No work to do.  Just me and my dogs.",
        "I am pretty thankful to have family living close",
        "I am perfectly satisfied with having no car. Everything I need is within walking distance.",
        "I felt very happy last night when my new dog was running around playing. I didn't think she knew how to play and would always be stuck to my leg and worried.",
        "Today has been uneventful but, I got a lot of errands done.",
        "I am happy to relax on this fine day",
        "About to get off work, I think I got a lot done so future me won't have to stress out.",
        "Going to the lake after work. Can't wait to see all the dogs and just relax.",
        "Oh man. I just got a ton of Taco Bell. Going to find a movie and chown down.",
        "The weather outside is great for this time of year.",
        "I got to play hours of video games after a tough week of work last night. It was so refreshing.",
        "I think this my new job is the best one I've ever had. I'm never going to quit.",
        "I am lucky to have a roof over my head",
        "I got to go read my favorite book at the park yesterday. It was so relaxing.",
        "I didn't have a vacuum for a day and it has not been good for awhile. I got a new vacuum tonight and WOW, nice to finally have a clean floor!",
        "I just accomplished one of my biggest dreams and I feel like things are just perfect right now.",
        "Sometimes I love just sitting around doing nothing.",
        "I went to an Italian restaurant earlier for dinner.  It was pretty good.",
        "There's nothing like being in your house after all your relatives have left after coming over for a long weekend visit. It's nice to see them, but once the frenetic energy is done with and you can kick your feet up... it's rewarding.",
        "I saw some family members today, and it felt good to seem them after so long.",
        "I had a nice night in and just relaxed.",
        "i stayed in watching netflix last night",
        "i watched netflix for hours last night",
        "I'm on a week long vacation from work. It's quite relaxing!",
        "I sat at home watching netflix all last night",
        "I spent a long day planting the garden. At the end of it all I was happy with what I had accomplished and felt good about myself.",
        "I finally am comfortable with my life. I am happier than I have been in awhile.",
        "I was happy when I got to go asheville last weekend. It was just calm",
        "I'm drinking a great cup of coffee and I don't have any major plans for the day other than relaxing.",
        "I have been feeling so pleasant and happy lately.  Things in my life have just been going perfectly.  ",
        "Such a quiet and relaxing Sunday.  So calm and so peaceful.",
        "For this year, I received my vacation benefits for 10 days. It was good time spent",
        "I have 2 working arms and legs. I am so thankful for not being handicapped in life.",
        "I had a crazy week with 4 big events and I'm so happy to be at home relaxing in the air conditioning today. ",
        "I had a pretty relaxing afternoon. Sat outside and enjoyed the breeze while watching my kids play.",
        "I am feeling just fine today. I woke up and had some delicious coffee and chat.",
        "I am having a nice afternoon on my computer here, having some nice chats with people.",
        "I've been working a new job for the past month. I can finally afford a nice new apartment. ",
        "I really have nothing to complain about. I have a roof over my head, a good job, and a wonderful family. Life is good!",
        "One time I looked up a new recipe to cook and it went pretty well. The steak that I made was tasty, and it was a good experience. ",
        "I think after I pay off the mortgage, I'll be pretty happy in life.",
        "I'm finally done drawing this character for a contest. I think I'm happy with it now.",
        "I am fine with eating salads and sandwiches on this new diet. I think it is going to work.",
        "When I look at my wife I know I have everything I could ever ask for.",
        "I didn't overeat like I usally do. I hope I can always do this.",
        "I was taking a walk in the park and it was really peaceful. I was just thinking about how great my life is. ",
        "Today I was relaxing in the sun all day reading a book. I've never felt better.",
        "I got to the go the mountains last week. It was just very calming",
        "When i ate thanksgiving dinner last year",
        "I've got a wonderful family and can do the things I enjoy. I don't think I can ask for more in life.",
        "I feel like everything is falling into place for me. I am so happy",
        "I barley graduated and got a job in the bank. Also, my dream girl told me she been wanting to go out with me.  ",
        "I just retired and feel truly happy for the first time in my life.",
        "life is good",
        "I'm very satisfied with my new home",
        "Resting in my bed in the morning is a great feeling.",
        "This may be bad but I am so happy my kids are going back to school. I love being home with the quietness during the day.",
        "I wake up every day and go to work.",
        "I learned about Neurofeedback today. I feel somewhat happy about learning about it. Renewed.",
        "Had a great weekend!",
        "I am feeling lonely but settled because things are peaceful. ",
        "When I stayed home sick with the flu, my wife let me stay in bed and took care of me.",
        "I went on a bike ride tonight after work.  No one else was on the trail and I was very relaxed.",
        "I am lucky to have a decent paying job",
        "Spent the day yesterday just hanging out with friends",
        "I just had a pretty good meal at the Olive Garden.  I would say I am satisfied.",
        "Just found out I'm not getting a promotion at work that I was up for. I'm kind of bummed to not be moving up in the company that I work for, as I really like everyone here, and the company itself, and what we do. But I'm satisfied knowing that someone more deserving than me got it, and that they still see me as worthy in the long run, and that I still get to enjoy my current situation.",
        "I have a C average but still graduated with a degree.",
        "I arrived in San Diego yesterday and got to read a book under a palm tree. It felt really nice.",
        "I've been married to my wife for 20 years. I couldn't ask for a more happy life.",
        "My car gets me where i need to go.",
        "I really needed a D on this test to pass the class even if that is a bad score. I got exactly the score that I needed so I was satisfied.",
        "eating my favorite meal makes me happy.",
        "I really wanted to get an A in this computer science class that I took. Instead I got a B but that's good enough for me.",
        "I gifted a new laptop to my dad. I feel satisfied and glad now.",
        "I felt like this weekend was fine. I got to relax",
        "I am content with my life right now, I have a girlfriend, good friends, and a great family",
        "I'm almost ready to get into a more peaceful mode, I hope.",
        "I am very happy with my girlfriend.Having her move in has been great.",
        "A friend was telling me about a good local barbecue place a while ago so I decided to stop by. I thoroughly enjoyed the selection of food and sauces.",
        "i have a beautiful home, might not be the biggest on the block but i'm happy with it",
        "I have a bunch of food in front of me and not even hungry anymore.",
        "I am very satisfied with the way things are at work",
        "with life in general right now ",
        "I'm happy that I can take care of my family's needs better than I used to.",
        "I have a wonderful husband and two sweet kids.  I'm feeling so much better from a horrible autoimmune flare.  Life is good!",
        "I bought my truck and it's a standard truck.  But I enjoy it, and it makes me happy.  I don't need anything extra.",
        "One night I made myself a bowl of popcorn and some dessert. I then watched a movie on TV while eating this meal.",
        "Life is so good right now. I have everything I could possibly need. Food, shelter, housing, and family makes me happy.",
        "It's raining right now after high humidity and heat in the UK which, while it isn't much compared to other countries, is short-lived so we don't have much time to acclimatise. I'm so happy it's cooling down.",
        "I am just feeling generally happy to have what I need in life right now and to be healthy.",
        "I'm content with my family life right now.  Nothing too crazy has happened in awhile.",
        "I gave up dieting a long time ago, and I'm far happier and losing weight slowly.",
        "I am feeling this way now, my life is wonderful.",
        "I am feeling this way now in my life. I am so happy.",
        "I finally moved out of my home, because the neighbors are so annoying.",
        "I love being able to sit out on my porch in the rain with a good book.",
        "I've been with my wife for 30 years. I don't know how I got so lucky.",
        "I was happy to relax over the weekend. I was content",
        "I just got married, and I feel like life is perfect.",
        "Was feeling lazy today, and for the most part I had decided I wasn't going to go running, that since i had done it yesterday, I could skip today. Managed to change my mind and exercised anyway. I feel good that I kept up my routine.",
        "I spent my afternoon in a hammock reading my favorite book. The sun was shining and I couldn't be happier.",
        "lifes going good right now",
        "im happiest when i eat my favorite meal.",
        "All these days I was struggled commuting by public transport. Recently, my spouse gifted me a motor bike. Now I feel peaceful and relaxed while travelling.",
        "Yesterday I let my kids play on their waterslide while I sit and watched.",
        "I just barely passed my math class. I was ok with not getting a high grade",
        "i turned 29 the other day. i'm pretty happy with everything i've accomplished in my life thus far.",
        "I'm a 35 year old man who has never had a girl friend. I haven't even kissed a girl. I used to worry about it, but now I've just learned to accept it.",
        "I have a memory of my Grandfather and I fishing on a lake. We didn't really catch anything, but I still have good memories of it.",
        "I am so happy. I finally got used to the single life and it is awesome",
        "Somewhat happier today because my bank account was in the negative but I wasn't charged a fee. I was able to settle it quickly today. Phew!",
        "I am feeling this way with my life now, it is wonderful.",
        "I am happy with my life right now, everything is going okay for the most part",
        "I got to go to the park and read a book under a tree. Felt nice after a long week of work.",
        "I quit a 80k job for a 20k job after paying off the house.",
        "I finally paid off my car and my house.  Its such a relief and life with my family couldn't be simpler now.",
        "I got some fast food today and it was sooo good! I don't eat it often..but junk food tastes nice now and again.",
        "I went to the park the other day. It was so relaxing reading a book under a tree.",
        "I just ate a granola bar with a bit of chocolate in it. I feel happy and full.",
        "When I think about my life I feel like I finally have it together",
        "I stayed in watching netflix for hours today",
        "I am ok with the job I currently have.",
        "I felt very content recently. My Aunt sent e a parcel full of candy and chocolate and the sun was shining.",
        "I am content right now. The sun is shining.",
        "The sun is shining and I have lots of chocolate",
        "My  mother made me a large meal and I ate it all.",
        "I went to Mcdonald's for dinner earlier.  I was satisfied with the meal.",
        "I went to the Olive Garden for dinner.  I was satisfied with the food.",
        "My fiance took a new job about a year ago, and he would eventually get his own work vehicle after the 6 months of training. After that long time of him having the car all day I am happy that his training is over and he gets his work truck and I get the car back!",
        "The week has been going better. No big upsets, no drama. I hope it continues",
        "It is a GOOD day, money is okay, paycheck day and there is peace! I was not looking forward to this day all week but now it's peaceful, so it's great!",
        "I'm in a good place in my life now.",
        "My average in College was a C. As the saying goes, C's get degrees",
        "I was tired when I got home from work yesterday so I just sat on the couch for the rest of the evening and watched tv.",
        "I started a new book, and I like it. I feel like I made the right choice, and I'm happy with the book.",
        "My website that I designed is turning out great.  I'm pretty content with my design.",
        "Pretty laid back day at my house, got all my errands ran and now I'm just chilling.",
        "People are always telling me I should buy a new vehicle, but I'm perfectly happy with my old 1995 pickup!",
        "I ended up with a dog that was originally adopted by a friend. She was so affectionate I felt alright with the world when loving her.",
        "i enjoy the life i have with my husband",
        "I just had to move out of my house, but I think it is for the best.",
        "I got to relax over the weekend and do some reading. It was nice",
        "Although I'm poor and not where I want to be, at least I have a roof over my head, and food.",
        "I got to relax today and sleep. I was off of work",
        "Although I don't currently have a regular full-time job, I'm happy that at least I can make some income.",
        "I am pretty happy with how my life is going these days, there is not too much to complain about",
        "I am pretty happy with my life right now, there is not much to really complain about",
        "I went to a friends house to hang out tonight. Nothing special but it was nice",
        "I got sit on the patio and read comics all weekend. It was calm",
        "Just came home from the buffet. Oh man, I'm stuffed.",
        "I took my kids to play at the park the other day and I was content while watching them.",
        "I had such a nice dinner, I feel great!",
        "I just had a meal at Chipotle.  I was quite satisfied with it.",
        "It felt so nice to go to the park yesterday. First time I've got to kick up my feet in a while.",
        "I have worked the same job and lived in the same apartment for 12 years. I am in no hurry to change that.",
        "I have cleaned the whole kitchen yesterday. I had been planning for days and did finally",
        "I am ok with my current job for now.",
        "I just ate at Taco Bell. I was satisfied with my order.",
        "I perfectly happy being single for now",
        "M daughter lied about running the dishwasher like I wouldnt notice",
        "The sun is shining and the world looks good today",
        "I had a fulfilling meal at my parents house. ",
        "The sun is shining and everything is fine",
        "I recieved my paper back from class yesterday. I got a C on it. I didn't work very hard on that paper so I was satisfied with my grade.",
        "so happy i don't have to live in an apartment anymore. a house is so much more free",
        "so happy i got a new car ",
        "I finally got my physical this year. Been putting it off.",
        "This summer i have been able to have my daughter stay with me. While we have not done anything particularly special it has been a great time for use and we are both fairly happy. We enjoy just spending time together and relaxing. We have been able to bond a great deal these past few months!",
        "Just walked my dog 2 miles and now we are just chilled out, relaxing on the couch.  It's been a good day!",
        "I was sitting at work looking over expense reports. I felt very calm while doing this because I enjoy working with numbers.",
        "At our last family Thanksgiving gathering, each of us took turns saying what we were thankful for. It brought us so much closer together as a family, and that evening I feel so content and warm. It was very special to all of us.",
        "Spur of the moment, my sister and I grilled outside. No special occasion, but we watched the sun set and ate grilled hotdogs and it was just nice.",
        "I had a good day at work, now i'm kicking back and watching TV for the rest of the day.",
        "My baby napped for three hours today, which is unusual.  I got so much done.",
        "I think I am done having kids now. Three is a good amount for me",
        "I am happy with my life now, I have a good girlfriend and friend group",
        "My friend just went and bought a big tundra, but I'm super happy just driving my little tacoma.",
        "We just moved our family into a new house and finally finished unpacking, are all settled, and getting into a schedule again.  I'm so happy and love being able to relax.",
        "I am feeling this way with my life right now.",
        "I'm going to have a sub after work.",
        "My daughter just came into the world this past weekend.",
        "I am feeling this way with my life right now, I am so happy.",
        "Everything is alright these days",
        "I am feeling this way in my life right now, I am so happy.",
        "I am feeling this way in my life now, I am so happy",
        "I am feeling this way in my life now, I am so happy.",
        "Finally getting this leg brace off next week.",
        "My husband and I have been married 22 years.  Our daughters are 15 and 18 and life is pretty peachy.",
        "lifes just awesome right now , im happy",
        "I am happy with my weight.",
        "Ive just been hanging out with friends and playing games this past week, its been nice",
        "It has been such an awesome week",
        "I am good with what kind of car I drive.",
        "I needed a B to keep the GPA that I wanted. I got a B exactly which wasn't that great but I was still pretty happy.",
        "The sun is shining adn  have no plans today",
        "The sun is shining and I have the day to myself.",
        "I have recently got a new offer from another company but i do not want to move since am so comfortable with my current employer",
        "I had a meal from Wendy's earlier.  I was satisfied with my meal.",
        "The sun is shining and I ahve no plans today",
        "I ate at the Olive Garden earlier.  I was impressed with my meal.",
        "I have a good career and financial stability.",
        "I watched a movie that I didn't really want to see.  My son made me watch Player One.  It turned out to be a decent movie and I was content.",
        "I had a meal at the Cheesecake Factory.  I was satisfied with the food.",
        "at this point in my life i needed nothing more.",
        "I just ate an entire pizza.",
        "Waiting for my pho delivery.",
        "such a beautiful day out and its my day off.  Just sitting on the deck with some ice tea in hand.",
        "I was calm today. I sat on the patio read.",
        "Got a lot done this week, made good money, got things I needed, some I wanted and still saved up! No big upsets, it's been a good week!",
        "I felt pretty nice today. Just sat on the patio and relaxed",
        "I had a great two weeks with work. I made enough to even get a few things I wanted and to save up! I love it when those things happen.",
        "I am happy I don't have neighbors close to me. Its so quiet at my house",
        "I had such a nice dinner, I still feel nice and full!",
        "The time my mom and I went on vacation to montreal. We saw a hockey game.",
        "Whenever I return to home from outside, my pet shows his love extremely. I forgot all my tired and get brisk in evening.",
        "When I was sitting on the beach I was in heaven ",
        "I was laying with my wife feeling liek I had it all.",
        "im happy with life currently",
        "Seeing the latest economic numbers with lowest unemployment rate in more than a decade, i am hopeful of Trump's policies",
        "what i have is enough for me, i don't bother about other people's stuff",
        "I had a meal at Chili's last night.  I enjoyed the meal if I must say.",
        "After being on this Earth for 32 years. I can honestly say that I'm finally happy with the person I've become. THrough jobs, divorce, kids ettc...I'm happy.",
        "We spent a day at the park. It was so nice and relaxing. Being in nature just makes me happy. ",
        "We took the kids to Lion Country Safari. It was so nice to see them play and have fun. ",
        "I had a nice big breakfast... I feel good!",
        "I just ate breakfast and did all my chores. Now I can relax for the rest of the day.",
        "Yesterday my kids played on their waterslide while we grilled some food. I was so content watching them play.",
        "I was watching a great movie last night, all snuggled up while drinking hot chocolate. It was so relaxing!",
        "My diet seems to work for me.",
        "Yesterday I did nothing but sit outside and read a book.  I was completely relaxed all day",
        "I'm pleased with how this weekend turned out, my family didn't cause me too much stress when they came over.",
        "I frequently curl up with a good book to relax. It can be so peaceful.",
        "I went to Krispy Kreme the other day and got some donuts while the hot light was on.",
        "I won the lottery last week. I got over a million dollars. Now I don't need any more money for the rest of my life.",
        "I'm enjoying a lazy Sunday afternoon.",
        "I'm pretty happy with how my shed turned out.  It was the first time I built something.",
        "I got a house, a dog, a job, and food. I don't need anything else in life. I am so happy as things are.",
        "My life is so good. I have everything I could want. ",
        "I love lazy Sundays. I'm off work and it's just a good time to relax.",
        "Kicked my feet up at the park today and read a book. Life is good right now.",
        "I have a new sweet dog who was abused and her little puppy. I am happy about it as it's nice to have a little baby around again to love on.",
        "I slept in this morning. I was more than okay with that",
        "After 8 years of dating, we're getting married.",
        "I helped my neighbor mow her lawn. I barely have the energy to mow my own.",
        "I love my job. I have been at the same place for several years now. I am very pleased with the way things are going.",
        "My life is going great. There is nothing I would really change right now.",
        "Got a bag of candy I'm polishing off. Diabetes be damned.",
        "i love the rain",
        "I'm looking forward to going home and relaxing on the couch.",
        "I was able to go buy a dog bed today and a few others things I needed/wanted. I love that! I haven't always been able to do that.",
        "I'm pretty good right now in life, couldn't ask for anything more.  I'm very low maintenance. ",
        "I am content with my life right now, everything is going well for the most part",
        "I am happy with my life right now, everything is going well for the most part",
        "I'm pretty happy where my life is right now.",
        "I just celebrated my 35th wedding anniversary and I have never been happier in my marriage!",
        "Times are tough but with my family, life is good.",
        "My life is going great right now. I have everything I need and couldn't ask for anything more.",
        "I went to the park and read a book yesterday. It was my first day off in a long while.",
        "I felt content when I finally quit my job and decided to go my own way in life.",
        "I went to Panera Bread for dinner.  I was quite pleased with the meal.",
        "I went to the park and read a book today. First time in awhile I had a free day to myself. It felt really nice.",
        "I have lost 4 pounds in the last month after regularly visiting gym after work. I am truly satisfied with my results so far",
        "Moving my grandmother to an assisted living facility from her independent life has been such a transition for the whole family. Seniors can be stubborn and its been stressful to help her feel at home there and not hate it. Yesterday after visiting her however, she actually is looking more happy to be there finally. ",
        "I ate some homemade ice cream the other day. What a wonderful treat.",
        "I barely passed my english class. Only needed a C so thats fine by me",
        "Making decent money with my new job, enough to afford to pay off all of my bills and put some into savings at the end of the month. I guess this is what it's like being an adult. Kind of weird to be on such a stable track for once",
        "I ate at my favorite restaurant earlier and was feeling better than ever afterwards!",
        "I just had a nice lunch... i feel good",
        "My life is pretty good right now. I have a great family, a good job, and a nice place to live.",
        "I am a man of simple taste.  Even if I were filthy rich I wouldn't think twice about going through a McDonald's drive thru if I was in a rush to get somewhere.",
        "I've been working at my job for several years and I'm very comfortable here. Not sure if that is a negative or positive thing.",
        "I'm off work and at home and relaxing. My day is finished.",
        "I didnt do anything over the weekend and I was okay with it. I just got to relax",
        "I've got a good job, my cat and lots of books. I am pretty happy.",
        "Just me and my cat living the life.",
        "I'm really happy with my life right now, I don't know if I want to add kids to it",
        "I went to Applebee's for dinner tonight.  It was a decent meal it I must say.",
        "this job offers me everything I need in life!",
        "Sitting outside watching a storm arrive on my back porch I felt quite at ease with the world!",
        "I feel good. Everything finally seems to be working out.",
        "I really wanted to get an A in one of my classes. Instead I got a B which is fine but I was a little upset.",
        "I am very satisfied with great customer service.  I really feel as a consumer that you should be catered to.  I always leave satisfied when I go to ChickFilA",
        "My son's at school and my daughter's napping. I'm so relaxed.",
        "My friend just bought a really nice new house that he can barely afford.  bUt I'm super happy with my humble abode",
        "I've been trying to diet forever, but at first I was suffering. Now, I've finally gotten to where I can make healthy lunches that I still want to eat, and don't feel like I'm starving all the time.",
        "I'm looking forward to relaxing and watching TV once I get home. I've got no chores to do today.",
        "My life is just great right now. I couldn't ask for anything more.",
        "Before I used to be complacent and settled for my mediocre life.  Now I'm always striving for better",
        "I am so pleased with the way things are right now. I see no need to change anything.",
        "Going to see my long distance girlfriend this weekend, and we're going to have a movie marathon. I only get to see her every so often because of the distance. I'm excited",
        "Ive been in this relationship for a few years and its nothing special but im happy with where we are at.",
        "I am really happy with life right now.  Things just seem to always go my way!",
        "I drank wine and ate my favorite dish after a long tiem",
        "Laying in my hammock near the beach watching the ocean. Having a drink.",
        "I finally got some food today. So happy.",
        "I won a pen in a raffle last week, it's ok I guess.",
        "I've been married to my wife for over 20 years now. ",
        "I think I'm ready to start my own restaurant now.",
        "I had some ice cream after a hard day's work today. It felt so refreshing.",
        "I am happy with my current employer. Even though am getting a new job offer.",
        "I am ok with coming in third in my race.",
        "I got all of my housework done. For the rest of the day I am satisfied to just relax and do whatever I want.",
        "I was able to find some Blue Bell ice cream on sale the other day.",
        "It was a very busy week for me, but now that the weekend is here I'm looking forward to relaxing and watching some good movies.",
        "Last night I was watching a really great movie with a bowl of pop corn with my hubby. I was so comfortable.",
        "I recently renovated my home. It's so relaxing to have all of the work done and just enjoy the new space we worked so hard on!",
        "We're finally settled in one place after moving around a lot.  It's so nice to be able to put down roots.",
        "I love walking my dogs on these late summer mornings. It's still cool, the sun is shining, and I still have two more weeks off. ",
        "I am always satisfied with whatever i have",
        "We went over my grandma's house for the holidays. I loved being with my relatives. The cooking was divine. I felt so happy. ",
        "When my dog greets me at my door",
        "My life right now is so great, I would not change a thing. I have a great family and financially we are very good.",
        "I made a big pot of Vegetable soup. After eating a big bowl I was completely satisfied and just wanted to nap in my chair.",
        "Last year my girlfriend asked me if I was ok with how life was turnig out for us. I stop and thought about how things use to be what we had hope for and how things are now, I looked at her smiled and replied I \" I am \".",
        "I am so happy, my son has just got into med school!",
        "The first night I finally moved into my new place was very nice. I finally had my own spot, to myself, and the means to afford it comfortably.",
        "I just finished my last exam and am very relieved to be finished!",
        "I recently moved to the city of my dreams and I couldn't be happier.",
        "House is paid, job is doing well.  I feel at place and all is good.  Happy with life.",
        "Having my own house to live in makes me feel very good these days. It's a place I can call my own.",
        "Whenever my son is going to stay with his grandparents overnight I get really excited for a short break. As soon as he's gone I almost feel lost and bored! It's always nice when he comes back home and we snuggle and I can just play toys with him. Him being home with me makes everything right in the world.",
        "My neighbor promised to give me his properties just for me to agree to be his girlfriend , but what I have is enough for me",
        "im just sitting here with my cat in my lap and thinking about all the money in my bank account. life is good",
        "It was my first day at work teaching high school kids and my only goal was not to make a fool of myself. So I of course, spelt two words wrong AND tripped over my stool.",
        "On Saturday, I didn't have anything that I needed to do. So, I was content to go to the park and enjoy nature.",
        "I've been pet sitting for my mom, and my wife came over to stay with me for the weekend. It was so nice just to have her with me.",
        "Everyone in my hometown seems to want to move away but not me. I'm happy right where I am!",
        "My girlfriend and I are finally in a place where we can just be together without even speaking.  Sometimes it's nice to just be in the same room",
        "I was okay with moving to Texas even though I prefer the midwest. Cold weather makes me happy.",
        "Right now I have my cat at my side, a movie on TV, and rum in my glass.  Can't ask for anything more.",
        "I finished my first 60 mile running week this Sunday.  It felt really great to just sit around doing nothing after a long week of exercise.",
        "Recently I was sitting outside relaxing with a drink in my backyard and just felt quite at peace with things and enjoyed the nice weather.",
        " I went on vacation, sat on the beach and read a really good book all day long.",
        "I am so happy, I just won the lottery! ",
        "I at tell I was stuffed tonight",
        "Last year I spent a week in Mexico hanging out on a beach.  I felt really at peace and happy.",
        "For my birthday present this year, my boyfriend got me a new fridge I've never been happier with a birthday gift in my life.",
        "I just ate a huge meal that I prepared myself",
        "I feel most content drinking coffee early in the morning on my back porch",
        "When I got my dream job I felt like I got everything I ever wanted in life. I finally felt content and happy with everything.",
        "I've been eating pizza almost every day lately and I'm satisfied with it. I have no shame.",
        "i am satisfied with my current life.",
        "I've started doing yoga recently and I have felt so great about myself, feel way healthier!",
        "after quitting school for two years I am finally going back",
        "This is the last week before kids go back to school. They're currently in a short camp and I finally get some peace and quiet at home.",
        "Last night I got myself all set up to watch some movies. Had popcorn and a blanket and my favorite animal. Felt nice to just veg.",
        "Getting cleared after having 7 surgeries I felt so relived and relaxed. ",
        "I was satisfied when I finally graduated from technical school.",
        "The other week a barista at a coffee shop i frequent remembered my order before i even spoke.",
        "I sat in a hot tube and it was nice and relaxing",
        "I accomplished a great deal of work today.",
        "The other night, my husband and daughter went to the fair. I had spent the whole day cleaning the house, so it was nice to be alone and relax. I took a bath and read a book.",
        "I am very content with y success in life. I was able to achieve my goals at the age of 20. ",
        "Finishing all my work and wrapping-up the day gives me the feeling of being at peace with the world.",
        "I've done so many wonderful things in my life. I feel like I have accomplished everything I wanted and am at peace.",
        "I'm happy with my life at the moment. I have a wife, kids and a dog who I love very much.",
        "I really enjoy working at dairy queen. The pay isn't great but it gets me out of the house. I feel like its meaningful.",
        "Yesterday, everything seemed to go my way. I spent a lot of time just reading and enjoying the day. You could say I was content.",
        "I watched the movie Ponyo with my kids last night. It was quite wholesome and we all liked it.",
        "I went to a new restaurant and was pleasantly surprised by the food. It was better than I expected. . ",
        "I spring cleaned my whole house. Then I sat and enjoyed a book.",
        "getting married",
        "I feel so at ease when my husband is home with me. I feel so safe",
        "My wife got us a super comfortable recliner, and its so comfy I almost never want to get out of it.",
        "ive finally got married",
        "new apartment. family and friends i love. yeah, this is the good life.",
        "I just finished eating a fantastic meat loaf. I've been cooking a lot lately and am pleased with my results. ",
        "Things are going well right now. I feel like I'm in a spot in my life where things are falling into place",
        "I was recently promoted at work",
        "yesterday I made the bed with new sheets and comforter. Last night I was pretty tired and decided to try out the new bed and watch my shows. Omg, those sheets were so comfortable I fell asleep in the middle of my show.",
        "When we won our football leauge",
        "Just moved to another state with my girlfriend. I thought i would be miserable, but I ended up really feeling comfortable here.",
        "Came home tonight to a nice cooked meal, and some of my favorite snacks. Girlfriend said I needed it.",
        "I was supporting Real Madrid in UEFA cup 2017. And I was very much pleased when we won the cup",
        "After I bought my house I felt happy about my life.",
        "I came home from a long but productive day at work and just chilled with my cats. ",
        "Work and family life are running smooth and I am so content right now, everything is going well",
        "I feel very satisfied with life right now. My friends and family are healthy, and I am doing good in my classes",
        "I was thinking about my life. and i decided things are pretty good for me",
        "We went to the mountains to hike.  It was very peaceful and nice to be in nature.",
        "For the first time in my life I am financially secure.",
        "We just had our third kid and I think I'm good with just these three.",
        "I have a wonderful family and my health that has been horrible, is finally turning around with my hard work.  I am happy with life.",
        "Was able to negotiate the rent of my apartment back down to a better rate, after they had raised it for the new year. I was kind of worried I'd have to find a new place, but now I don't have to move anything and go through that annoying process.",
        "I just got home from a vacation and feel super relaxed.",
        "After a long week at work, it is so nice to just be relaxing at home tonight.",
        "I'm pretty satisfied with all the house work I got done today.  Yard is mowed and the house is clean!",
        "My life is going pretty good right now. I have a great job and a wonderful girlfriend.",
        "I'm pretty happy with the way things are going at this time",
        "My mom made a large meal of my favorite dish.",
        "My ex and I went to Branson a few weeks ago. It was so much fun!",
        "Can't complain about anything. I have a roof over me head, a great family, and a decent job. Life is great for me right now!",
        "I finally graduated and feel relaxed and OK.",
        "Spent a day binge watching shows on netflix",
        "I got a lot of vacation time this summer from work, so I felt good.",
        "I went to the Olive Garden for dinner tonight.  I was pleased with the meal.",
        "I worked hard on my yard sale. I was quite pleased with the sales and knew that there was nothing else I could have done to make it more successful.",
        "Living at home with my parents. I'm in no rush to move out.",
        "I paid off all my bills. Its such a great feeling.",
        "I am ok with my current money situation.",
        "I have seemingly gotten everything in life that I have wanted or needed.  I am quite happy with how things have turned out.",
        "I'm very happy with my home life. It's almost ideal.",
        "I love waking up late on the weekends and just feeling like everything's great!",
        "I got a very good grade on my final exam, Looking forward to going shopping.",
        "I love watching my kids play outside. It's so relaxing.",
        "I sat on the porch last night and relaxed. I was okay with that",
        "I am going to sit on the porch tonight and read comics. Its simple but relaxing",
        "I am so lucky that I have been able to keep things afloat after my roomate left. I am pretty happy.",
        "I was very nervous starting my new job a few months but, but I've really gotten the hang of things. I'm very comfortable here now.",
        "I love to just lay with my daughter and look at her while she sleeps. I couldnt imagine being anywhere else or doing anything thing else. ",
        "These days I'm waking up happier with my life than I was the day before.",
        "We were living in Hawaii. We were only a couple of blocks from the Waikiki beach. We had enjoyed the life there with some good friends.",
        "This weekend was very stressful at work, but I have been able to relax during the weekend and read good books.",
        "I'm having a pretty good day today. Got a lot done that I needed to do and now I'm able to relax for the rest of the day.",
        "Just last night, I sat on my back porch with my wife, my children, and my guitar.  I was just strumming along and enjoying the time with my family.  My God has been good to me.  Life truly is good.  ",
        "I am feeling this way right now with my life. I have a wonderful family!",
        "I am very satisfied with where my life is right now.",
        "I have a great job that allows me to stay at home. i love it",
        "I had a very nice walk with my dog. It did not pull on the leash at all and I feel very relaxed.",
        "I am so happy with my life. I have a wonderful husband and some pretty awesome kids",
        "I am pretty happy with my life right now, it is going pretty well overall",
        "I'm finally able to afford decent health insurance for once in my life. Not only does it feel good to know I'm covered for some unexpected bad stuff, but I can actually go to the dentist and optometrist and keep up with my teeth/eye health for once.",
        "I have a great job, and an overall great life",
        "I finally have a job and paid off my student loans. ",
        "Anytime I am laying in bed watching TV and playing on my phone I am perfectly happy with life especially if my fiance is home.",
        "I am feeling this way right now with my life. I am so thankful and happy."
    ]
}