{
    "threshold": 0.8,
    "seed": [
        "I look out for all my students, if they are struggling, I take however much time they need to understand.",
        "I felt caring when I had to pick up and take care of my ailing cousin. His stomach felt bad and he was vomiting all over the place. I helped clean him up and gave him some medicine to make his stomach go back to normal.",
        "My daughter hit her head the other day. she was sad. ",
        "when i offered to work extra hours to make up for bills ",
        "My neighbor's kid just lost his eyesight. The whole family is devastated.",
        "I always donate my change when I shop at my local drug store. Makes me feel like I' doing something good.",
        "My cousin just got out of a 7 year relationship. Turns out she was cheating for the last 3 years.",
        "My Aunt had an emergency and dropped her son with me, I took care of him.",
        "I was caring when I helped someone move out of their house",
        "I loved my dogs so much. But one dog i loved was Watson and he lived til he was 18. He was the one thing i cared about in this world at a time.",
        "There are 2 cats that come by my home every night. I leave food out for them.",
        "It was really hard when my mother-in-law passed. I tried to be there as much as I could for my wife.",
        " I remember how well I was attended to by the nurses and doctors at the hospital when I was a patient",
        "My mom was sick when she went on vacation. I wish i was there to care for her. I am feeling so depressed right now",
        "My nephew dropped his ice cream on the ground and started crying. His older brother gave him his ice cream.",
        "There was a wild or ferril cat that hung around my house for months. I fed him and took hi to the vet to be neutered. Instead of releasing him, I kept him. ",
        "When I lost a huge sum of money",
        "Looking after my young neice",
        "I felt cared for when I was a child and my parents took me shopping for school clothers. ",
        "I love dogs as they are so caring.",
        "Last week I had a new person start working with me. That person is really nice and interested in the job. I've helped him learn about his functions and how to perform as well as he can.",
        "I'm not much of a people person; but when it comes to my dog, I would do anything for her.",
        "I dreamed that I had took in a family of cats. It made me feel good.",
        "I just waiting to carry my little boy. The love towards my wife is become more and it tends to uncountable now!",
        "when i took my daughter to get her shots, i made sure she had her doll. ",
        "My friend adopted a really elderly dog. I'm so proud of her.",
        "When my dad got sick randomly, I went into care mode. I made sure he was going to get all the help he needed",
        "When my son was born.",
        "I feel bad for the kids in my neighborhood. Their parents are trash.",
        "I was at a retail store and encountered a lost child.",
        "My daughter had her heart broke because her boyfriend broke up with her. It breaks my heart because I love her so much and would do anything for her.",
        "One time i saw a puppy get dropped off at the side of the road. I picked him up and took him home. He's 13 now and a happy pup.",
        "I always donate my change to charities at the store.",
        "Some kids are not as lucky as mines. I always donate their old things instead of selling them",
        "I found a stray cat and took it home. He was sick and I nursed him back to health.",
        "I want to rescue an animal. I Think I would give it a good home.",
        "I'm really proud of my mom because of how she's stepping up to help my brother raise his children as he struggles to do it alone",
        "I am helping my father as he has gotten older.",
        "I always let other drivers cut in front of me if there is a huge line behind me, show some love right?",
        "I really hope for peace one day. For our kids.",
        "I hope my daughters are having a good day at school today.",
        "I really care about my brothers, our bond is closer than most I feel like",
        "I worry about my parents in their old age.",
        "Visited my grandma, and she is still as loving as can be. Her cooking is wonderful.",
        "I am heading to the goodwill later to donate some of our old belongings. ",
        "My friend lost her job. I've been buying her groceries trying to help out.",
        "My friend fell during a race, and everyone in the race stopped to help her.",
        "My brother has been terribly ill, I'm taking him to his doctor's appointment tomorrow but I'm concerned.",
        "Even though I wasn't actively a part of my little cousin's childhood I still feel protective towards her.",
        "I feel so bad for my husband.  He is getting a lung transplant.",
        "One time my friend was telling me about his dog dying. He took it real hard and still wasn't over it after weeks had gone by. It just sucked seeing him so hurt.",
        "The new addition to our family was just born this weekend.",
        "Just adopted a dog. We're gonna pick the little guy up this weekend.",
        "I tried to help my neighbor when she brought home her new baby. Even though I didn't like her",
        "I made an elaborate dinner for my Moms birthday to show my appreciation for her.",
        "My mom takes care of me so much. I feel like she is Mother Teresa!",
        "My mother is litltle sick lately. So I bought her an unexpected gift.",
        "I spent more time than usual grooming my dog. She was so appreciative and you could see how much she loved it!",
        "My dogs are the most important thing in the world to me.",
        "I really love my wife.",
        "I am the caretaker of my grandmother.",
        "I love to watch my neices",
        "I just love kids I think they all deserve a good home.",
        "I remember finding this baby bird having fallen from its nest, and placing it back. I felt really good afterward",
        "My grandmother has Alzheimer's. I've been visiting her in the nursing home. I've been helping her remember things.",
        "I felt like I had to watch over my dad when he got sick. I just needed to make sure he was going to be okay",
        "i saw a beggar on the road and she was pregnant, i wanted to take care of her child",
        "I found a lost kitten and I took it to my house and cleaned it up and adopted it.",
        "I enjoy going to my Grandmother's house and helping out with chores and cleaning.  If feels so good to help her out and make her comfortable.",
        "I volunteer at a local animal rescue.   We get some dogs in there that are in poor health.  We once had this old chow come in that was so matted that he had maggots eating away his skin.  I knew he wouldn't make it so I sat on the ground next to him and comforted him despite the maggots crawling on the ground.   I pet him and told him that I loved him.  In that moment I felt very caring because that poor dog deserved some type of love at the end of his life.  ",
        "I take care of my grandmother who lives with me and my family.",
        "I'm considering leaving my wife for my nanny because she seems more interested in my than my wife ",
        "I spent many years taking care of my grandmother. I cherish those memories.",
        "in my family was innocent to all things but i should be protect and trained by to live at causal about to our society",
        "I love my wife so much.",
        "My daughter is having trouble with band this year.",
        "I spent today helping a friend of mine who  is going through a really tough time right now.",
        "I felt very caring when I got this new dog in who has been abused. She deserves a lot of care.",
        "I bought extra school supplies for kids who might not have them this year.",
        "I love seeing the kids play outside in the summer. It wasnt safe last year",
        "I cared about a lady today who was concerned about her child in daycare. I went above and beyond my work to get a message to her about cameras",
        "when i took care of my mom when she was dying ",
        "I saw an old man riding around in his scooter on the road! I felt so bad.",
        "felt caring when my child was born",
        "The students looked so cute registering for school today. I hope they all had a good summer",
        "I really care for my girlfriend, she is so sweet",
        "My moms friend had a son that passed away the other day from Cystic Fibrosis. The last time I saw the friend was when she was pregnant with this child (her only child), but my mom felt we needed to appear at the viewing anyway because of the bond they did have 16 years ago (when he was born). So instead of sending flowers we went and took flowers. ",
        "I found out my baby had failure to thrive and I devoted all of my time to healing him.",
        " I stayed home from work today because my son was sick",
        "Its been almost a year since my granny passed. I iss her so much.",
        "I always donate my old things to the less fortunate rather than selling them.",
        "I felt very caring about a friend when he was  worried if he would be liked because of his weight",
        "My sister was a little bit depressed, so I bought her gift to cheer her up.",
        "I had my baby cousin over the other day and he looks so cute and fragile. I had to be careful not to hurt him",
        "My friend just went to the hospital last week after having a heart attack. I'm really worried about her and hope she's ok.",
        "I've been taking care of my sick sister for the last week. She has a really bad fever and it's very difficult for us.",
        "I am blessed with a very good woman",
        "At my job, I care for young children and it means a lot to me. ",
        "At my job, I have to look at many patients.",
        "My grandma was very sick and unable to get around very easily. I decided to go stay with her so that I could take care of her until she was better.",
        "My son had his wisdoom teeth pulled today.",
        "I love when my niece visits. She is such a cute little toddler. I treat her just like my own children.",
        "I helped a lady put her groceries in her car the other day. She needed it. ",
        "So yeah.. I am taking care of my mother now.  Fun stuff.",
        "I love spending time and helping oout my grandma",
        "My aunt had just lost her husband and was very upset. I decided to go stay with her for a couple weeks and keep her company.",
        "I feel very compassionate towards someone I know with a mental illness and how they need a permanent place for a home.They do not treat me very well a lot but they have never had a good home and aren't capable of living on their own.",
        "Last night my new dog finally played! She was so starved and abused but she is so young! I didn't think she knew how to play or was just very docile but she took of running with my boxer when he ran and even mouthed him in play!",
        "I am thankful I get to babysit for my nephews",
        "My mom lost some of her teeth in a car accident and full coverage car insurance NEVER covers them. I got her some fake moldable plastic teeth that will help her feel confident until she can afford teeth. They cost a FORTUNE.",
        "I spilled soda on my laptop, and my friend brought me one from his work to use.",
        "My elderly neighbor lived alone with her dog. That dog was her best friend and companion. She just had to put the dog down recently and has been so sad. I decided to surprise her with a new dog that I found at the shelter.",
        "I really enjoy looking after defenseless animals.  All of our cats are rescues!",
        "I am going to be a class mom this year. I care so much about the little kids",
        "My sister and I watch each other's children while we work",
        "My grandma broke a fingernail yesterday. I took her to the ER, but turns out she is fine.",
        "My daughter and I found a sweet little bird that was hurt yesterday, sitting outside our door. We are trying to give it water and help it heal. Its so pitiful and helpless.",
        "My Mother was ill. I was very worried about her condition. ",
        "I just felt like I had to take care of my dad when he got sick. I just had to make sure he felt better",
        "it was nice taking care of my sisters dog the other day",
        "i loved watching my sisters dog the other day",
        "i loved it when i watched my sisters dog",
        "The bird sin my neighborhood all gather on my fence if I haven't feed them that day. I feel very protective and cannot help but take care of them.",
        "I love my kids so much. I want them to live with me forever",
        "My mom and I were talking about atarting a non profit that helps kids get clothing and other essentials.",
        "I've been really sick, and my cat has been taking care of me.",
        "I am taking care of my sister when she get out of the hospital",
        "My dog isn't feeling well",
        "I deeply love my wife",
        "I visit my grandma every week.",
        "Once I gave a homeless man my lunch, he needed it more than me.",
        "I found a stray dog last night and took him home with me.",
        "I once nursed a puppy back to health",
        "I always try to put myself before my dogs. I love them so much!",
        "I felt like sharing a story about last week for me. I found a kitten on the side of the road and took it to my house.",
        "I was at the park today. I saw some ducks waddling around with each other!",
        "I love looking after my grandma!  She is 94 and it makes me feel good to help her in any way I can!",
        "I visit my grandmother at the seniors home every weekend. She's getting old so I like to spend as much time with her as possible. ",
        "I am feeling warm and fuzzy today. My girlfriend called and told me she would be on the visit.",
        "It was so nice to see that my friends had my back. My spouse recently left me and my kids. My friends brought food over and even babysit while I ran errands.",
        "I rescued a puppy from the pound and brought him home to my son",
        "We did a behind the scenes tour at a local zoo.  There were new born baby otters.  I so wanted to just put one in my pocket and take it home.",
        "Met with my friend who I haven't seen in 4 years. Feels like we never left each other.",
        "My grandma is very kind. She always make cake for me. Yesterday I went at her place and this time I made a cake for her. When I saw her happy face I felt that I was really very kind to her.",
        "I worked at a soup kitchen to help the less fortunate. I really enjoy helping those who can't help themselves. ",
        "I cooked my wife dinner because I love her",
        "i liked taking care of of my sisters pet the other day",
        "I just got a new dog recently and I have really found myself enjoying looking after it.",
        "I recently adopted a dog and have been enjoying taking care of it.",
        "I took care of my sick cat over the weekend. I just cared for him as much as I could",
        "I watched a documentary about puppy mills and and organization getting them rescued.  I was very moved",
        "I cared for my grandfather the last few months of his life.  We both enjoyed the time we spent together",
        "My grandmother is moving into a retirement community in town after 30 years of living in another state.  I can't wait to be able to visit her all the time!",
        "I feel very protective of the new dog I got in. She was very abused and is just a puppy! She is so docile, and was so starved, I can't help but feel extra protective of her.",
        "when i took care of my mom when she was sick ",
        "i loved taking care of my sisters bearded dragon the other day",
        "I make sure to make my wife dinner every night.",
        "i feel so bad for my husband.. he is on the list for a lung transplant.",
        "I just adopted this rescue dog.  He's a sweet and timid little dachshund missing one leg. He's precious. ",
        "My best friend's dog died and she has been really upset. I brought over some pizza and movies to cheer her up.",
        "I love being able to be home for my kids ",
        "My sister has been down in the dumps lately after a breakup. I made her come over to watch funny movies and eat popcorn and pizza to get her mind off of it.",
        "i saw a kid crying at the store that he wanted something, so i got it for him",
        "My darling companion of 5 years died yesterday, I feel all alone",
        "I want my family to do well!",
        "i saw a kid crying at the store.",
        "I feed and water my dogs every day.",
        "I really love my dog. He is so dependent on me for nurturing.",
        "I cared last week for my girlfriend. She was sick",
        "I had to care for my friend last week. He was going through a breakup",
        "i love my dogs, i make sure i take good care of them first before anything or anyone else",
        "I feel bad for those who cant afford the necessities in life.",
        "There was this lady who wrote in our local facebook group for my community, saying that she was on her last 3 diapers until Friday. We all pitched in and got her several boxes of diapers!",
        "A close family member fell ill after being laid off from her job. I hated to see the difficulty she had supporting herself and trying to pay medical bills, so I had to help.",
        "when i took care of my brother when he broke his leg ",
        "I was outside walking one day. And then I found a kitten on the road.",
        "The friend of mine is visiting. They are needing me to help them through a tough time.",
        "It's almost time for my daughters to be home from school. I hope they have had a nice day.",
        "Last month I donated some amount to a charity. I feel that I am very kind.",
        "She is as nice as mother Theresa",
        "it felt good to care fo my sisters dog",
        "I took care of my car this weekend. He was a little sick",
        "I feed the birds that come to my home everyday.",
        "I saw a video of child abuse today and it reminded me of the abuse someone I know went through as a kid. It made me feel more compassionate to them..as I see how that could warp you as an adult.",
        "I keep seeing a little black and white kitty running around who is hungry. He won't let me catch him yet but I am trying! ",
        "I looked out for my brother this weekend. He was sick",
        "Collecting toys for needy kids",
        "i loved takin care of my sisters dog last week",
        "I keep all of my stuff animals.",
        "when my girlfriend got sick",
        "seeing a little kid crying at the store i decided to ask what was wrong",
        "I really love my mother",
        "I really care about my community and it's growth.  It's slowly growing and attracts good people.",
        "i loved taking care of my sisters bearded dragon",
        "One of our friends just got a call that her child was not at school.",
        "I took care of my brother this weekend. He was a little sick",
        "I have recent.y become an animal activist. They are more than just animals and pets.",
        "My daughter had a sore throat last night.",
        "My girlfriend's close friend died recently. She could barely function for a week. I stayed with her the whole week and took care of her.",
        " when i took care of my wife when she was stressed ",
        "I'm taking care of my grandma for last few days. Since she become aged, she is in need of other's help.",
        "My grandfather was diagnosed with cancer recently. I have been visiting him every week and spending time with him",
        "I recently got a dog. We adopted her from the shelter. She was so shy at first, clearly had gone through a lot, but within the month she was all over us!",
        "I have always been a fan of pets. I love taking my dog out for walks and stuff",
        "I just love little kids. I think I am going to become a teacher",
        "I always try and predict the needs of my family.",
        "I really care for my family, they mean a lot to me",
        "When it's quiet around the house, things feel peaceful.",
        "I felt very sad for someone I know who has a mental illness and works so hard sometimes to get better..but then other times they destroy it  all. I felt very compassionate for them today though ...as here they are working hard again.",
        "I found a bird with a broken wing in my backyard. I took it inside and fed it food and put a splint on its wing until it felt better.",
        "My girlfriend cooked for me all week while I was sick, although she had to work and go to school.",
        "My neighbor broke her  leg. I checked in on her everyday until she was healed helping in whatever way she needed me.",
        "I am sending my daughter to school with extra supplies this year. I know sometimes there are kids that don't have everything",
        "I used to babysit my little brother all the time.",
        "I looked after my baby cousin last week.",
        "i enjoyed taking  care of my sisters pet bearded dragon",
        "My wife is such a caring woman",
        "saw a lost kid at the store ",
        "I want to stop feeding my sister's cat but i can't because it's so adorable",
        "Mom's birthday",
        "I was sitting on a plane next to an older man, who was telling me about how he had just visited his father, but that it was sad because he has dementia and didn't remember him anymore. I was trying to comfort him, mostly because I worry it will happen to my dad, too.",
        "I am feeling very empathetic to someone this week who sometimes I just want to run over! lol They are mentally ill and the mood swings can be a bit much and seem intentional.",
        "My daughter was sick. I love her, so I took care of her.",
        "When my doughter was born I knew she would change my life. Being with her everyday brings me such joy",
        "I love helping out my mom when she's sick.",
        "I went and hung out with a friend over the weekend. He was having issue with his wife",
        "My wife's grandmother just moved in with us.",
        "I took my cat to the vet this morning. I felt like I had to do anything to make him feel better",
        "My cat passed away last week. The people at my office have been so nice about it. They actual got me flowers.",
        "I feel these 2 cats everyday, and they always hiss at me.",
        "I couldn't afford my textbook, and my roomie made copies of the pages for me.",
        "A lady in my church is going through a hard time, I want to help her out however I can.",
        "I bought some groceries today for someone I care about that is HARD to care about sometimes. But they are trying really hard to change..and while it's too soon to tell..I felt very compassionate towards them today.",
        "i loved taking care of my sisters pet",
        "helping a stranger with car trouble",
        "I just love babies. I wish they all could have loving homes",
        "I saw a homeless man sitting on a bench near McDonald's and not a single person even paid him even mind. I felt bad so I ended up buying him a hamburger.",
        "I really love my new girlfriend. I will do anything for her.",
        "i loved taking care of my sisters pet last week",
        "i loved taking care of my sisters pet the other day",
        "Once I gave this homeless guy a slice of pizza.",
        "when i took care of my daughter after her shots ",
        "My moms dog has some big tumors and I have been researching how to shrink them. He is a bit old to go under surgery and I haven't seen many modern meds work so good on me or animals.",
        "I was at the zoo one time. I monkey was chewing on a banana peel like it was hungry.",
        "I often pick up stray animals that I see on the side of the road and bring them home. You should see my back yard! It's a zoo!",
        "I feel very motherly toward my cat",
        "This lady at my work is so sweet, and no one there seems to like her.  I feel so bad for her.",
        " love my neices and nephews like they are my own children. I do the same for all of them",
        "My dad brought me some guacamole he made.",
        "i loved taking care of my sisters pet ",
        "my co worker took out his back",
        "My friend had to miss a concert, because I was sick.",
        "A few months ago I broke my wrists. I had so much family support, it made me very happy.",
        "I work at a an animal shelter. It's so nice taking care of the animals. ",
        "Made some dinner for my mom's birthday",
        "My mom has been lonely with my dad gone. I go and stay the weekend with her at least once a month now to make her feel better.",
        "It is my mother's birthday this weekend. I really want to surprise her with a gift because I love her so much.",
        "When I had to take care of my sick brother who had the flu, during this time I had to watch over him and make sure he was taking his medicine and take his temperature constantly.",
        "I got a kitten and he was sick for a week so i nursed him to health",
        "I have a wife that can carry the burden of the whole world on her shoulders",
        "I look after my sister whilst my parents were away.",
        "Dogs a re so caring and lovely. ",
        "Sometimes I feel like a dad to my best friend.",
        "I found a terribly beaten dog on the street.",
        "l loved taking care of my sisters pet",
        "I care about most poor people.  But I have more sympathy for those who are actually trying to improve their situation, than those who are just looking for a handout",
        "I loved taking care of my sisters pet",
        "I watched my friends dog for her. She was going through some things so I wanted to look after her and her dog",
        "I am helping a friend that has lost his job recently.",
        "My sister lost her job recently. I am trying to help her.",
        "My best friends' mom has lung cancer.  It's so hard to know how exactly to help her deal with this, so I just try to be there to listen.",
        "My father in law was diagnosed with pancreatic cancer.  I tried to help take care of him, but we did have to bring in hospice.  They are some amazing people.",
        "I never really imagined what it would be like to be a parent.  Then I became one and it is definitely like watching your heart walk around outside of your body.",
        "I love to have pets. There is a new arrival in my home who's name is Tom. I feel like occupied.",
        "My wife is very nice to everyone she meets",
        "My mother was getting older and my father died a few years ago. I never intended to have to take charge of her wellbeing but I'm happy I was able to do it.",
        "My dog just had major surgery to fix her broken leg. I know that no one else would take proper precautions to make sure shes ok than me.",
        "Recently my cat went missing and we were unable to find him for a couple days. Eventually we found him locked in somebody elses shed and hadn't eaten or had a drink in 2 days. I took him inside and made sure he was okay and gave him plenty of food and water to help make sure he got what he needed.",
        "My baby has a new tooth coming in, so he was up in the middle of the night last night.  We snuggled til he could go back to sleep.",
        "i got a kitten from the street",
        "My mom is the best. She is so nice and wonderful. ",
        "I care about my brother a lot but I think he is started to hang out with the wrong type of crowd.",
        "My daughter fell and really hurt her knee. I had to comfort her.",
        "My father in law was diagnosed with pancreatic cancer over 18 years ago now.  I tried to help care for him, but it was too much and hospice had to be called in.",
        "My youngest daughter had a cold.",
        "My wife was sick recently and I spent the day taking care of her.",
        " loved taking care of my sisters pet",
        "I've been taking care of my daughter who has a cold today.",
        "I felt bad for my friend. They were going through hard times so I payed for their dinner",
        "My daughter fell on the sidewalk yesterday and skinned her knee pretty bad.",
        "I like to volunteer at the local animal shelter",
        "My mom and dad went to abroad. So my sister is helping me to go school and she is taking care of everything in our home.",
        "Taking care of my friends cat while they went on vacation. ",
        "I bought my partner some socks today. He hasn't been that good lately but he is trying to be better and I know he needs socks.",
        "I recently volunteered at a homeless shelter. It's been one of the most rewarding things I've ever done.",
        "I got my mom some temporary teeth. It is insanely expensive to get one tooth put in, so this should help her until then.",
        "i really enjoy spending time with my husband",
        "I found a stray kitten outside the pizza place the other day. I brought it home to give it some love.",
        "My brother came home sick today. I gave him some medicine and want to make sure he is going to be okay",
        "I wanted to how my brother I cared about him. So I bought him a new jacket",
        "My friend was diagnosis with cancer. I am trying my best to help and support him.",
        "I volunteered at the animal shelter this weekend. It breaks my heart to see all those unloved animals.",
        "My sister just had surgery last week. She is still in a lot of pain so I am staying with her to help out with her kids and housework.",
        "My brother got into a accident. He got a kid and family. I need to look after his family as well",
        "I volunteer at the animal shelter as much as I can. I love helping the dogs and cats.",
        "I really hope my dog feels better, she has been sick this past week.",
        "My little doggie had a seizure the other day",
        "I can't even explain how much I care for this cat I have, it's like my best friend!",
        "My son is sick so I am taking him some soup.",
        "Girlfriend forgot her lunch, about to go bring it to her. It's going to seem like I'm doing something really nice, but I wasn't doing anything important anyway. Would rather her not have to inconvenience herself since she's at work",
        "I'm caring for my daughter who has a cold.",
        "I can start to see my mother showing early signs of dementia. I feel really helpless about it, since it shows how vulnerable they are. I try to help with small things, but it's sad knowing I won't be able to slow down the effects of it.",
        "I found a little kitty on the road. It was a homeless one.",
        "I always take care of my little brother, I am very protective.",
        "My boss has cancer, so I'm trying very hard to work extra to make things easier for her. ",
        "I was on my way home and I saw a little cat! It was so cute I just had to take care of it!",
        "I am going to look after my friends dog tomorrow. She is going out of town, I love her dog",
        "My girlfriend is the best.",
        "when i see old people on road, i  want to take care of them",
        "My partner has some work related problems lately. I am trying to give her emotional support by taking her out to distract her from work",
        "I finally got my dad's birthday present",
        "I really want all the kids I teach to go on to big things in life.",
        "My friend was sick the other day and I made her soup. She said it made her feel better.",
        "I am going to help my friend move to his new home.",
        "When my friend was having some financial issues, I loaned her some money.",
        "My mother was just recently diagnosed with cancer. I had her move in with me so I could look after her",
        "I was walking home from the store and I saw a little cat trying to cross the road. So I stopped and helped it along! I felt so good!",
        "Everytime I see little boys teasing/flirting with my 14-yo cousin I post up on her status and tell them to F**K off and they get scared every time haha...I'm not trying to be mean but someone needs to protect her",
        "My friends mother died last week. I stayed at his place for a while to chill and make sure he was ok.",
        "My neighbor had her home broken into last week and was scared to stay by herself after the robbery.  We let her stay with us for a couple of nights.",
        "My friend got evicted out of his apartment. I had to take in his 2 dogs who are just the cutest.",
        "I really like my brother. We are really good friends. ",
        "A Groundhog made his way under my deck and had it's babies.  We were going to call animal control but I decided to wait instead.  After a couple weeks the family left on it's own!",
        "I spent time with my daughter. I took her out for a special ice cream treat. We spent a lot of nice time together and I love her so much. ",
        "My sister's been going through some hard times, so today I baked her a big pumpkin pie. She seemed like it put her in a better mood.",
        "When one of my coworker was at the hospital, I went multiple times to visit him.",
        "My friend brought me some pizza, since I'm working late.",
        "My dog saw this cat being chase and scared the other dog away.",
        "My little sister is 19 years old and still gets scared to stay home alone at night. When my parents go put of town, I let her stay with me.",
        "I have so many birds and cats coming to my yard. I'm going broke buying food for them.",
        "Sometimes it feels like I have more people around me that want to drive me like a horse rather than love me as a son.",
        "My wife is on a business trip right now. I miss her quite a bit but I know she works these kind of jobs to help provide for our household and I greatly appreciate it. I love her so much.",
        "I remember when my grandma was sick and all of grandchildren would take turns helping her and keeping her company.  I though it was a sweet experience.",
        "I am a nurse and I take care of people in the last stage of their lives. ",
        "My nephew was so sweet and adorable. I just wanted to hug him and spend time with him. He was the first child in the family for a long time, so it was special. ",
        "Dog greeting me at the door whenever I get home",
        "When my son was born I'd never felt so much concern for another person. I would move mountains for him.",
        "When my friend told me she was unable to have kids, I wanted her to know I was there for her. It must have been such a hard thing to go through, I could not imagine my life without my beautiful little boys.",
        "My grandma was diagnosed with dementia. She recently moved in with my dad. I stayed with them for 2 months to help care for her.",
        "I took the kids to visit the residents at the Veterans Home. We made some special treats to take to them.",
        "We saw a driver throw out a little kitten out of a window We picked up the kitten and brought him home. He's been out pet since then and is a great cat.",
        "My mother has been diagnosed with diabetes, so I have been taking care of her diet.",
        "My grandmother became sick recently so I have taken some time off work to nurse her.",
        "My mom has been really struggling lately since her dad, my grandpa, passed away. She really took care of him a lot and it's been hard for her. I try my best to do things to cheer her up even though I live far away.",
        "i care about my wife and i always want the best for her",
        "I have been the one taking care of my grandmum since she fell sick ",
        "my cat was passing away and i had to make sure he was comfortable as he went",
        "My son had a bad day at school and I was really concerned about him.  I made him his favorite dinner and talked with him about what happened.",
        "My friend had a long hospital stay, and I spent a lot of time there with them.",
        "When I was 15, my family adopted a little sister.  She's just about to start her last year of high school, and it's been really cool to see her grow up into a young woman.",
        "I worked in a nursing home while I was in nursing school.  I have sense gone back to the home to visit my old patients to check in on them",
        "I felt like I was doing a good deed when I opened a door for a few elderly people. I think it is good to help your elders when you can!",
        "Looking after my grandfather whilst my grandmother was in hospital",
        "I recently took in a small kitten I found in a shelter",
        "Once in JR High, this kid kept throwing apples at birds until he hit one.  He broke a bird's wing, and a teacher and I took care of it until it was better.",
        "one time I saw an abandoned dog so I took him in and bottle fed him until he was way better to be adopted.",
        "Recently I've been driving my friend's mom to and from the hospital for her chemo treatments. My friend is in the military and she can't drive so it's about the only way for her to get there.",
        "My daughter just got a new bunny that she rescued from the bunny rescue. She loves to hold it and watch it run around.",
        "My friend has been diagnosed with cancer recently but I have been helping her out by paying her visits everyday",
        "I volunteered to babysit my neighbor's children.",
        "My family is one of the best on earth, I feel proud to have such a wonderful family",
        "I wanted to make a difference in an abused or neglected pet so I went to a local animal shelter.  I adopted a dog and she is doing well.",
        "I'm helping my grandmother clean her house next week, I love helping her",
        "My friend was losing her home and I let her stay with me for a few days",
        "My neighbor recently had a baby. I made sure to cook her a ton of food and buy everything she'd need to eat and drink for a few days at least. Her family was very grateful and I felt good being able to help out in such an easy way.",
        "I am provide for a family of 8. It's tiring but rewarding",
        "My husband was recently sick and I felt awful for him, so I did everything I could to make him feel better. He requested soup and a back massage.",
        "I had a friend that really took me to heart, I missed him.he was always there for me",
        "When I met my girlfriend she had a 5 year old son. I think of him as my very own son these days and love him dearly!",
        "We just welcomed a new puppy into the family. I love him already he has been such a great addition, I love looking after him.",
        "The other day I saw a kid at the park fall off his bike. He looked like he was in a lot of pain.",
        "My child was sick and I had to make sure they got enough fluids and cuddles. ",
        "My dog seemed to be depressed. I thought maybe he would feel better if I gave him a bath. He was so happy afterwards.",
        "When I had my child, I felt like doing nothing but protecting her. ",
        "My son got his first ear infection last week.  He was so miserable.  He perked up after the antibiotic kicked in.",
        "when I had found a dog roaming the neighborhood and i got him and keep him until i found his owners.",
        "Me and my partner adopted a dog and grew to love it like our own.",
        "I had to help my best friend prepare to put her old dog to sleep.",
        "I was sick and my girlfirend took care of me",
        "My mom called just to see how i was doing",
        "My neighbor is always giving us things. She bakes us brownies which are delicious.",
        "I felt very sad kind of when i helped homeless people find a place to eat.",
        "My daughter always hugs me before I leave for work. She's so nice and thoughtful.",
        "My colleague is waiting biopsy results. I am worried for her. ",
        "i had to leave my kids with my grandma ,my hubby and I went to Bahamas for the summer holiday",
        "I had a good friend who just lost their child to leukemia.",
        "I found a dog lying in the middle of the street today. I took it to the vet to see if it could be helped. I am still waiting to hear back from them. Even though it is not my pet, I still care for it.",
        "Yesterday i was training a new employee at work. I have only been at this job for 5 months so i know what its like to be new and felt responsible for getting them started right.",
        "I work as a Paramedic and so I run on many different patients each shift. Each patient I run on, I always try to treat them as if they were my grandmother. ",
        "My nephew was having problems with his girlfriend. He came to me to ask for advice. I smiled on the inside when he asked because I could relate to what he was going through. I was giving him advice that I knew would protect him from heartbreak. ",
        "Some ducks that visit my back yard had babies. I left them some extra feed to help them.",
        "My mom was sick and I took a couple days off work to take care of her.",
        "I've been pet sitting for my mom, and one of her cats has really warmed up to me. She is very sweet, and I love making sure she's happy.",
        "A close friend of mine recently told me he was filing for divorce. I've known him and his wife for decades, so I'm concerned for them both.",
        "i like tending to my kitties",
        "When my father died, I had to help my mother with everything. And the outpouring of help was amazing.",
        "I volunteer at a local rescue.   We had an extremely abused dog come in that kept having strokes due to his fear.  But despite that fear he let me sit with him and he even gave me some kisses.  I fell in love at that moment",
        "A friend of mine paid for my fathers cremation. I have never been so happy.",
        "I offered to take care of my friend's dog while she was on vacation ",
        "I needed someone to walk my dogs. My friend volunteered, and did not even asked to be paid.",
        "I came across a homeless person today.  I gave him some food and money.  I asked him about his story also.",
        "I went to the dog pound and i loved every animal. I couldn't believe how horrible life can be for animals.",
        "I came outside yesterday to discover a baby bird on the ground out of his nest, I just couldn't leave without helping the little guy back in",
        "My puppy fell off the couch and hurt his paw.",
        "My sister let me take care of her dog whilst she was away.",
        "I take my family to the local soup kitchen to volunteer a couple saturdays a month and we really enjoy helping.",
        "My husband was sick with a really bad cold. I took care of him the whole time he was sick. ",
        "My sister fell ill a few weeks ago. I went to her house and made sure she had everything she needed.",
        "I love my girlfriend a lot, we have been dating for almost 3 years now!",
        "My sister's husband is going to be out of town all weekend. She hates being alone. I invited her to stay with me while he is gone.",
        "My cat was sick for a couple days when i first got them",
        "I love my cat. he is so sweet.",
        "when my dog had puppies",
        "My wife got the flu yesterday. I ended up staying home to make sure she was ok.",
        "I love my mom so much.  She has taken care of us kids really good!",
        "I had to babysit my new born nephew. ",
        "I saw a little girl that looked like she was lost in the mall. I took her to one of the stores so they could call security. Her mother found her and thanked me for being so concerned.",
        "seeing a kid cry in a store",
        "I recently had a daughter and i have never felt so amazing.",
        "I bought my fiancee a big cake for her birthday and I hope she likes it because I love her so much.",
        "I wanted to do something to show my Mom some love so I made her a dinner of all of her favorites. I made extras for the freezer so she would be able to enjoy them again.",
        "I was there for my brother when he was sad about his girlfriend leaving. I comforted him.",
        "I was walking alone one night and a puppy started following me. It was so cute. I didnt know what to do.",
        "I really have feelings for my new girlfriend.",
        "When my grandmother got ill,i was spending my whole summer with her and helping her.",
        "My grandma is 93 and needs a lot of assistance with everyday tasks.  I try to look after her as best as I can.",
        "I love my two daughters very much, they make me proud.",
        "When I stayed up all night taking care of my daughter because she was teething, and comforted her. ",
        "I love seeing happy couples that have been together for decades. I want to be so lucky.",
        "I have to take my cat to the vet later today. I just want him to feel better",
        "One of my coworkers recently lost her daughter. I felt very bad for her and bought her a bunch of things and I make sure to take her out to dinner once a week to take care of her and make sure she's okay",
        "Even though my friend is an idiot and gets himself into trouble I still look out for him",
        "I just had a son and i feel like a dad for the first time in my life",
        "I read a story about a duck that was a mother for 76 ducklings.  So sweet.",
        "I found a kitten in some bushes, I took it home, tried to find the owner. No one claimed her so I took her in.",
        "I have rescue some dogs that were on the street and help them find a new home.",
        "I recently had surgery for a kidney stone.  I am so thankful for my wife who took such good care of me after the surgery.  I was under her care for two weeks, but she was so considerate to all my needs.  ",
        "I really enjoy my job as a caregiver. While it doesn't pay that well, it's very rewarding.",
        "When my grandma was in hospice I spent every day with her until she passed.",
        "I felt this way while caring for patients in the Emergency Room.",
        "a while back ago I found a tiny baby kitten and decided to take it in and bottle feed it",
        "I have such a great family. I'm so glad they get to stay home with me",
        "I found a stray dog today and decided to rescue it.",
        "My friend lost her father so I fixed her up some food for her and her family to help them out",
        "I care for my girlfriend a lot, we are very close",
        "I sheltered an injured owl and nursed him back to health ",
        "My boyfriend took me to a cat cafe today because he knows I like cats",
        "My future father in law is awesome at making sure I have everything I need and I try to do the same.",
        "I felt this way while caring for patients at my previous job."
    ]
}