{
    "threshold": 0.8,
    "seed": [
        "I recently went surfing and surfed waves everyone else was afraid to. I was the man,",
        "I had no issues helping a lady with her computer problem.",
        "I just got home from a day on the beach surfing the waves of Hurricane Chris. I did what others could not!",
        "I had an exam last week that determined my promotion. I knew that I would ace it.",
        "I had studied for an exam for severl days. I was very confident I would ace the exam",
        "When I was 18 and I got my first tattoo",
        "i am going to the dance and i won the prize.",
        "I went for a job interview.  I had studied so hard and researched the company for weeks beforehand.  In the interview it was great because I could answer all the questions with ease.  I was very proud and felt on top of the world when I left.  Half an hour later I got the phonecall that I got the job!",
        "I had a math test last week and I knew I would ace it.",
        "I got the new girl's number at school.",
        "I have a presentation to give and I think I will do well.",
        "I applied for a job as manager at the store I was working at. When I interviewed they really liked my answers.",
        "I had to take a work related placement test.  I think I did extremely well",
        "I studied very hard for my ESL certification, and was sure I would pass the test going in.",
        "i have an exam next friday",
        "I know some things about this life, and have no doubts about it.",
        "I bet my cousin that I could beat him at a game of basketball.",
        "i feel i will do well on my test next week",
        "Got a haircut today. I am a beautiful man.",
        "I felt really self assured when i stepped into my job interview the other day. i was totally prepared as well",
        "I always make sure to assure myself that i am going to win before i get on to go to an interview. It is important to feel that way for me.",
        "lost a lot of weight before a wedding I attended",
        "My most recent job I was approached by the company I used to work for and they were trying to lure me back. I felt really good about it and was able to negotiate a great salary.",
        "I had a test today and I'm pretty sure I aced it. I studied all night for it!",
        "I remember applying for my job in the government.  I felt pretty good about it!",
        "I'm about to ask someone that I like out on a date. I'm pretty confident that she will say yes.",
        "Got a new kilt and I look amazing in it.",
        "I am going to have a great day today! I feel good and I am standing tall.",
        "Last week during a presentation I knew I was going to do well.  I had spent weeks learning the material.",
        "I asked my boss for a raise. I'm pretty sure that I'll get it.",
        "I had to take my cerification test for medical assistant, i studied day and night for months!",
        "I recently got the courage to approach a potential client and set a rate for work that is way higher than what I normally charge. I guess I was just feeling good and knew I do good work!",
        "I have a performance review coming up at work. I'm really sure that I'll receive a glowing review, and possibly a raise.",
        "recently i appeared for job interview in tesla",
        "I went into an interview for a job and I went over everything days before so I knew what to say.",
        "I damn certain sure this time round i will pass my statistics retake exam.",
        "i have an exam in two days and i am very excited",
        "I start my new job in 2 weeks a little nervous but I am self assured I will be just fine. ",
        "I decided to go fishing last week, and did my research on the lake and weather conditions.  I was confident that we'd catch something that day.",
        "Today I had an interview for an online teaching position and I nailed it! I'm pretty sure I'm going to get the job but I'm a little nervous.",
        "My oldest is leaving for college next week I'm scared for her to go into the real world but I am positive she will be ok in the end.",
        "I was very well prepared for my law exam.",
        "I believed in myself that I would pass the GED test.",
        "I have been on several dates with this girl and I feel Im going to ask her to be my gf. Im sure she will say yes. ",
        "I was always nervous to cut my hair short. I finally convinced myself to do it. Afterwards, I felt great about myself! It looked great and I felt like a whole new person.",
        "I have an exam coming up and I have studied all week for it. I'm feeling really good about going into it.",
        "I am sure I did very well on my test.",
        "I have a test coming up in a few days. I know that I'll ace it.",
        "I recently spoke at a conference. It was a little nerve-wracking but I was really excited and felt great as I knew that I knew my speech front to back without needing to practice too much.",
        "I did a walk-a-thon  last week was so happy I finished it before the walk I was un-assured I would finish but I did. ",
        "I am almost sure I fixed my broken computer today.",
        "I'm sure I will pass my law exam.",
        "I know I got this job at Kroger, I am just waiting on the conformation. ",
        "I feel I am strong at my work",
        "I always felt very strong in unfamiliar situations.",
        "I was one of the three finalist for a job promotion at my job. I felt very positive about my chances as I had more than double the experience of the other two candidates.",
        "I use to dance when I was younger and I'm going to start back to just have a hobby for myself a little me time I am positive it will go great.",
        "My girlfriend just moved in. I feel really confident that this is the right move for the next steps for us.",
        "Went to the Barber today. I'm one beautiful man.",
        "I have a interview Monday for a higher position at my job I'm more then positive I will get the promotion.",
        "I usually can stand up for myself  in any situation, including the one that happened yesterday.",
        "I walked into a room to take a test for work. I wasn't worried though. I knew I would do well since I'd studied so much. ",
        "I was sure I would do good on this exam coming up. I studied so hard for it. ",
        "I took up running and I started seeing a huge improvement in my cardiovascular endurance. I felt so certain that I would hit my 5km goal in no time!",
        "One time I was really sure that I was going to ace a test because I studied all night",
        "confident with my abilities",
        "Me and my girlfriend have been dating for 3 years now. Im going to ask her to marry me and I have no doubts she will say no.",
        "I have a test next week and I'm feeling really good about it. I studied so much over the last week.",
        "at the interview tomorrow",
        "I am learning how to do day trading and did my first trade and I won!",
        "i am up for a promotion at my job. I positive I will get it.",
        "I am ready for my law exam",
        "I studied all night for a test. I think I can pass it, even though I was sleepy",
        "When I gave a best man speech at my Dad's wedding, I knew that I was going to do well and make everyone laugh",
        "I took the quiz like a man. I wasn't scared at all.",
        "I remember how very strong I felt when I proposed to my wife that she would accept and make me very happy",
        "I am learning how sew my own clothes. I am studying hard and I think I will be able to make my first outfit!",
        "I interviewed for a job.  I know I gave great answers to their questions and walked away feeling like I had the job.",
        "I went to a wedding the other night.  I had on a beautiful fake tan, new dress, and some cute heels. I felt so amazing. It's been a LONG time since I felt like I wasn't a slob. ",
        "I remember the feeling I had when walking into a room to take a very important exam, without being worried because I knew I was prepared. ",
        "My dog has been really sick this past week but after going to the vet I truly think he will be just fine.",
        "I got so many compliments on my new haircut last week. I felt great.",
        "She read the speach out loud",
        "I am as sure as the sun will rise tomorrow that I will get this job promotion!",
        "there is a promotion at my job, I think I am going to get it.",
        "I spent hours reviewing notes and job materials to prepare for some trials for a job that I had applied for. I was so ready, and I ended up getting the job!",
        "my abilities, worked on kmeans algorithm ",
        "I play guitar as a hobby but I hardly ever play in front of other guitarists.  I only feel comfortable doing it if I know those around me can't play as well or at all.",
        "i just delivered the best project at work",
        "After my interview for a promotion at work, I am almost positive I have the job. My boss told me I nailed the interview and I have much more experience than the other candidates.",
        "I took on a speed bike course recently that was above my skill level. I was a little scared but I've been practicing quite a bit and feel good about my bike skills these days!",
        "I have fixed up house to the best of my ability. I feel very certain that it will sell very quickly.",
        "I studied all night for my final exam",
        "I work at a library cataloging materials and other coworkers often come to me for help. When they do, I feel like I am an expert giving out advice on cataloging--even though I'm far from an expert."
    ]
}