{
    "threshold": 0.8,
    "seed": [
        "I never expected to fail my final exams,that is a major blow for me.",
        "last month i was very disappointed because my brother did not attend my birthday party",
        "i was disappointed when my son brought home his first F",
        "I didn't get approved for my dream car, it was a real let down at the time.",
        "I drove out to the park but my buddy cancelled.",
        "We went out to eat for my brother in law's birthday but we had to leave before it began because my son got upset by people",
        "I just hired four new people to work for me. Two all ready quit because the job was just to hard for them.",
        "My brother told my girlfriend I cheated on her.",
        "I did not get the job that I wanted. I'm upset",
        "I was planning to go biking this weekend but it rained all day.....",
        "My son is never here anymore.  He is growing up and going out with his own friends.  This is extremely healthy, but I certainly miss him and want him to spend more time here.",
        "Im feeling a little bit disappointed right now because the forecast said itll be raining and cloudy today, instead its +30c and sunny with not a single cloud in sight",
        "Dove down to the coast to surf. N waves",
        "I went in for a doctor appointment that I had been waiting for, and it did not go well or anywhere near expected.",
        "I recently had a fun day out with my son. But when we got home, his behavior turned horrible! I was not happy.",
        "i was upset sitting in traffic yesterday",
        "I was upset when my friend forgot to invite me to dinner",
        "This weekend was going to be my 1st weekend off in two months. Well not any more I have to work,",
        "I failed my exams in the last sitting",
        "I went to a used car lot to check out a potential buy.  I was very non-plussed by what I saw.",
        "The only thing that can bring you down is you.",
        "i felt let down by girlfriend when she moved away from my place without consulting with me.. i was feeling blue",
        "I did all this nice stuff for my son.  Then when we got home he threw a temper tantrum at naptime.",
        "i was upset i woke up so late today",
        "I checked out a used car that seemed like it was a good buy, but up close it turned out to be awful.",
        "my car had a accident recently",
        "i lost $100 cash somewhere.  I have looked everywhere and i can't find it",
        "I was so down when I found out that the sale for tissue was all gone.",
        " I remember I was waiting for a video game to come out. When it finally did and I got it, it wasn't as good as I thought it would be.",
        "Just did my budget. It's going to be a rough two weeks. Maybe I'll loose some weight.",
        "This week my work offered to let me work an extra day. I thought great overtime. Nope they plan to send me home every other day to even it out.",
        "I went for a job interview. I got the job offer but they offered me less money then I all ready make. ",
        "i didn't get to see my favorite character when i went to disney world.",
        "I felt let down by my girlfriend when she decided to move some money out of our joint account. She never told me about that.",
        "i am sad that i won't be able to buy a new car.",
        "When I was a kid I really wanted to go to disney but my parents couldn't afford it so we never had the chance to go",
        "I had a big fishing trip planned for last weekend. It ended up raining all weekend, so I didn't get to go.",
        "I was suppose to go on vacation last month with my family. I ended up catching the flu and couldn't go with them.",
        "My son failed a really important test. Now he might not be able to graduate, and I'm really disappointed in him.",
        "I was working hard, hoping to get a raise after over 6 months of extra work and doing a great job, but it didn't happen. My boss kept me at the same pay.",
        "I got passed over for a promotion at work. The guy that got it was qualified, but I really wanted the job.",
        "I had spent ages organising a lovely romantic weekend away for me and my husbands 10th anniversary.  I had a whole spa day organised, then a great concert that night, to class dinner, everything organised.  I had also booked my parents in for babysitting for the weekend.  I was so excited as we never spend any time alone together.  However the day before we were due to go my 2 year old daughter woke up covered in spots.  As the day went on she got more and more, with a roaring temp and we realised she had chicken pox.  She got a pretty bad dose of them and of course wanted no one but her mum and dad so are weekend away was not to be.  I was so devastated but hey, kids always come first.",
        "I lost out on a job promotion",
        "I knew a friend once, I always though that he would become somebody good, but I was wrong.",
        "I bought a lottery ticket and did not win anything",
        "I was so hungry for lunch today I ordered panera through uber and they took over a hour I was so upset with the services.",
        "Imagine,i started working out two months ago,only to weigh myself and i have gained some weight.",
        "I am so sad I have no pierogies.",
        "I am sad my cousin is moving away",
        "I was one of three people in the running for a promotion at my job. I ended up not getting the job and a person with less experience got it.",
        "My friend and coworker hasnt been showing up to work.  I try sticking up for him but its getting hard with him coming in once or twice a week.",
        "I'm in the middle of shopping for a house. One of the houses I really like was just taken off the market. ",
        "I love mystery boxes in games. Unfortunately I usually don't get anything good out of them and feel bad for a second. But I love the excitement of opening them.",
        "My sister lives in Utah. We had planned for her to come visit but her work would not allow her to take the time off.",
        "I barely passed my finals",
        "My older brother always makes promises he can't keep. Recently, he said he was going to bring me out to sushi for my birthday, but he always postpones it.",
        "My son was caught cheating on a test. I really thought we raised him better than to do such things.",
        "I recently ordered something online, and expected it to arrive last week. It's still not here!",
        "I got passed over for a promotion at my job last week, even though I had more experience than the other people that applied.",
        "I was trying to buy a piece of property that had came up on the market, but someone put in a offer quicker than I did and it was sold already.",
        "I worked really hard with my daughter last year to learn her multiplication facts. I gave her a quiz last week and  she failed.",
        "I waited three weeks for something I ordered online to get here. When it finally got here, the box was terribly damaged and the item was broken. I was so let down.",
        "I got a call back from the job interview I went to the other day. Unfortunately, they didn't hire me.",
        "A friend was supposed to meet me for lunch.  He ended up not showing",
        "I was turned down for the promotion I applied for today. ",
        "I felt that type of emotion during my work",
        "I entered this contest and wrote a story and put a lot of effort into it and I didn't win.",
        "I've been putting off my exam studying by being productive in nearly all other areas of my life. As upset as I am in myself for procrastinating, I'm pretty proud of what I've been accomplishing.",
        "I remember the first time when I realized that people can lie. ",
        "I worked really hard to get into a program that I wanted to be in. Unfortunately, it was too difficult for me and I had to change majors; I was pretty upset with myself.",
        "I went to my nieces performance last night and she placed 5th place. I was so sad about this.  ",
        "I bought a bunch of dumbbells, and a workout bench but I've barely used them. I don't feel too good about myself.",
        "One time I bought a scratch lottery ticket and I didn't win anything!",
        "in myself",
        "I'm really disappointed in my son's actions. He was caught cheating on a test the other day.",
        "My cockatiel is feeling sick. I think she might die soon. I wish there was something I could do.",
        "i thought I was going to get a promotion. I found out I did not get it",
        "I wanted to finally finish my dad's Father's Day gift.  However, I didn't have everything and didn't get it done.",
        "I was a bit upset when my parents could not visit me this weekend.",
        "My younger sister who is 14 years is pregnant with her 16 year boyfriend. Arrrgh!",
        "I was upset not to get a response back from a company that I applied for a job at",
        "I was disappointed with the score i got on my final exam. I really expected more.",
        "I had a great weekend with my son.  We did a ton of fun things but at the end of the weekend his attitude changed and he didnt want to listen at all.",
        "I felt very bad when my boss did not approve of my work. It just makes me more motivated to work harder.",
        "Last week my kid said some really mean things to me, I thought I raised him better.",
        "Oh, I am so sad that my family could not come and visit me. I miss them all so much. Why is life so busy for everyone these days?",
        "I just got a new haircut, lets say this, I do not like it.",
        "working hard but  feeling like not going anywhere",
        "i am sad because my brother failed me",
        "A project I worked really hard on completely bombed. I was sure it would be awesome and it was a total flop, I was so let down.",
        "My wife and I had found the perfect house to buy, it fit us perfect. Someone got a bid in before us and ending up getting the house."
    ]
}