{
    "threshold": 0.8,
    "seed": [
        "I was holding my son over my head, playing with him. A few seconds after doing so, a gush of throw up hit me in the face. ",
        "My downstairs neighbors always lets their dog poop in the middle of the street. It's so gross!",
        "I don't like it when people talk with their mouth full of food.",
        "i shared a taxi and the man was ogling at me",
        "I left some aluminum foil with egg leftovers on my counter for 3 days and came back to maggots.",
        "My dog got into the trash and it was gross.",
        "My neighbor neglects their dog.",
        "I saw a dead possum in our trash it was pretty gross",
        "I was so grossed out when I saw someone vomit.",
        "Some lady cut in front of me in line at the supermarket yesterday.",
        "When I moved into my house, I had a cockroach issue. I don't like bugs so it was not fun to deal with",
        "I just went past a fish market, and the smell was overwhelming. ",
        "i was extremely disgusted when a close friend of mine threw up on my baby. he was really drunk at a party we were at",
        "i was so grossed out to see someone vomit in the streets last night.. i think he was drunk",
        "i felt sick after eating too much ice cream last night",
        "I went to a restaurant and ordered some pizza.  When I received the pizza, a cockroach crawled across one of the slices",
        "I was cleaning out the refrigerator and I found a bowl of something that went bad.",
        "Few days ago my room smelled like a bathroom I even had to get incense.",
        "I felt sick when a friend drunkenly threw up on me. I stood there speechless for a moment",
        "I was so grossed out when a friend of mine threw up on my dress at a party. I was stunned",
        "My friend once threw up on my face at a party.. I was so stunned and grossed out",
        "the sewer backed up into our house",
        "The other morning I got up and without looking, I stepped in warm cat puke on the floor. I was thoroughly grossed out.",
        "I just pulled a container out of the fridge that has been in there for months. When I opened it, I was disgusted at what I found.",
        "I get so mad when I watch shows about animal shelters and see how many people abuse animals.",
        "I found a hair in my pizza, and now I can't eat.",
        "i was so grossed out when a friend of mine threw up on me at a party. i stood there not knowing how to react for a moment.",
        "I ate eggplant for the first time, and I hated it.",
        "I was so grossed out when this friend of mine threw up on me. We were at a party and he had too much to drink.",
        "Somehow I had a fruit fly infestation in my apartment the other day. I think it's because I had some old vegetables I didn't throw away. It was gross.",
        "My cat peed on my bath mat yesterday. I didn't realize it until I stepped out of the shower today and it was already wet.",
        "My avocado went bad this morning!",
        "Yesterday there was a beetle in my cat's litter, it was so gross. Later I found a similar beetle burrowing into a hand towel in the bathroom. I threw it in the garbage.",
        "the neighbor's trash can had blown over and there was garbage all over the road",
        "I went to pizza hut and the worker didn't wash her hands I was so sicken I just walked out.",
        "the driver was sneezing horribly",
        "My milk went bad",
        "My roommate wouldnt wash any dishes.  The sink would be overflowing.  He also wouldnt rinse the food off so it we constantly had flies/rotting food smells in the kitchen.",
        "I saw a mouse run across my kitchen.  I hope I can catch him at some point",
        "One time I saw poop smeared all over the public restroom",
        "I was grossed out when I saw someone vomit outside a bar.",
        "My roommate leaves leftovers in the refrigerator for a ridiculous amount of time",
        "There were maggots all over my buildings garbage bin this morning. I got one on my arm as I passed by. So gross.",
        "last week i visited a restaurant  and i found a insect in the burger which i ordered",
        "I was appalled at the way my friend approached me last night.",
        "I saw this youtube video of a guy eating a jellyfish and it was one of the most surreal things ive ever seen.",
        "I found some mold growing out in the garage.  It took awhile to clean off",
        "I was getting ready to make a sandwich, when I discovered that the bread that I was going to use has mold on it. Gross!",
        "My neighbor keeps letting her dog use the bathroom off the balcony. It smells awful and looks so trashy, I'm so grossed out.",
        "Went out to eat the other day with my boyfriend. I actually witnessed our waiter pick his nose, wipe it on his shirt, and then carry out someone's drinks from the bar. It was gross.",
        "I am completely grossed out this bread was molded that I just got from the store today.",
        "I went to a restaurant and when they brought my food out it had hair in it I was so sicken and upset.",
        "I stepped out of my door this morning and right into an unpleasant surprise that my neighbor's dog left. It was so gross.",
        "I just caught a guy picking up used chewing gum and he put it in his mouth.",
        "A friend of mine hadn't taken out her garbage in weeks. There were so many fruit flies around it, I felt sick to my stomach.",
        "what i saw online today",
        "I found a roach in the my house today",
        "The manager at the store was very rude and mean to the employees. I cant believe what I saw and heard!",
        "My roommate left leftovers in the refrigerator for a week. The dishes were moldy.",
        "My buddy drank way too much at a party and puked all over my favorite jacket. I felt so sick I thought it was going to be my turn next.",
        "One time I went into the public restroom and saw poop smeared everywhere! Ew!",
        "the world",
        "I bought a sandwich the other day and found out after a few bites that it was moldy! It was so awful.",
        "my pet dog just pooped all over my rug. She never did that before.",
        "I was grossed out when I saw someone vomiting at a bar.",
        "i hate when i see people cheating on each other ",
        "My Parents tried to make me eat some gone off food once, It made me really ill ",
        "My dog was chewing on dead frog. So gross!! I hope it was not poisonous.",
        "Recently moved into a new dorm and when i entered the kitchen was a total mess. Month old pile up of dishes and dried up food on the stove.",
        "My mother-in-law offered to babysit our kids about a month ago.  When the day finally came, she acted like we had never asked her.",
        "My dog went number 2 in the house in the middle of the night and ate some of it.  The next morning it threw up everything and it was the worst smelling thing I think I have ever smelled.",
        "I used to have a boxer puppy that was so sweet and adorable.  HOwever,   He was young and during the potty training stage he would poop on the floor and then eat it.  I could smell it but not see it anywhere.",
        "I found out that my neighbors eat turtle meat. How gross!!!",
        "My roommate cooked some foul smelling meat in our apartment. I almost puked. ",
        "My dog eat other animals poop. I have seen them eat goat, duck and cow poop. I hope they don't get sick.",
        "i was drinking a glass of milk. When i put the glass back down, a fly was swimming in the milk",
        "vomited all over the couch",
        "my brother is sick and he puked in front of me",
        "In the 6th grade, a bird pooped on my back during lunchtime. I had to rinse my shirt and wear it for the rest of the day, seeing as I had no spare shirt to wear; I felt so sick.",
        "My neighbor sits out on his balcony naked sometimes. It's really awkward and I'm grossed out by it.",
        "I went out to eat at a restaurant last week and got up to go to the restroom. As I was walking by the kitchen, I watched a cook drop a piece of chicken in the floor and put it right back on a plate. We left right after that."
    ]
}