{
    "threshold": 0.8,
    "seed": [
        "Had to wait in line forever to check out at walmart , horrible",
        "I was getting in a Taxi and noticed someone had thrown up in the backseat.",
        "I saw a snake outside my apartment today",
        "My friend called someone a bad name.",
        "I am disgusted that the criminal got away.",
        "There's been a big white wolf or coyote coming in my yard lately. I am afraid it will kill the neighbors cats. ",
        "I am so disgust at Donald Trump.",
        "By mistake, I saw an image of a car accident. I was disgusted.",
        "I feel this way everytime I see my brother's girlfriend. She's a racist disgusting human being and I feel sick everytime I see her. ",
        "Most people in the 90's loved Michael Jordan, but he always beat my favorite team in the finals.",
        "One of my favorite restaurants that I frequent weekly was just shut down by the health department.  I can't imagine how gross the kitchen must be!",
        "Hillary Clinton makes me sick.",
        "My sister in law refuses to ever take her boys to the doctor.  There have been times they have been really sick and she just will not take them.",
        "I try not to judge people. And I've never been a saint. But having a naive 15-year-old female cousin gives me some kind of protective inclination to bust up any kind of pedophile or rapist if I get the chance",
        "I hate it when my dog jumped on the table and started wolfing down my child's birthday cake. I had spent four hours preparing the cake only to see it disappear in 30 seconds!",
        "Seeing a naked man run through my neighborhood.",
        "Ive seen my cat vomit on the stairs, it was really wet and made me nearly sick.",
        "I went to a 4th of july music festival and a mother had her 6 year old daughter dressed in a leotard and paraded her around, it was horrible.",
        "I saw my neighbor pick his nose and then put it in his mouth.",
        "I watched the testimony of Peter Strzok earlier today before Congress. Such abhorrent arrogance and ungodly show on his part. It was not easy to stomach in.  ",
        "I felt disguusted when I saw that people like to eat bugs. ",
        "I had escargot on a ctuise once. It wa the worst.",
        "Once I was getting dressed and a lizard was on my shirt, I think reptiles are gross and disgusting, I screammed out. YUCK! It was now on me.",
        "Every Sunday I have to take the trash out to the road. I feel an overwhelming sense of disgust every time I lift up the lid and a swarm of flies appears.",
        "My mother didn't cook her chicken all the way through at dinner the other night.",
        "I was talking a walk in my neighborhood, and accidentally stepped in some dog poop, yuck!",
        "I ordered some chicken from a nearby restaurant the other day and it almost killed me.",
        "MY neighbors are akways leaving trash on our stairwell.",
        "My husband and I were teens and had moved in to this crappy cabin a friend had offered us for cheap. We had to clean out the kitchen, full of old food and dishes rotting in the sink and fridge from the previous inhabitant. There were maggots, it made me want to vomit. ",
        "I once witnessed a friend of mine get so drunk he punked on me. He was so grossed out i had to throw up to which ended up being out a car window.",
        "There were black olives on the pizza I ordered yesterday. YUCK",
        "My friend just dumped his girlfriend for a prostitute.",
        "I ordered a hamburger from a restaurant and it was raw in the middle.",
        "Went to a restaurant and saw people eating live squid.",
        "i saw a dog pee in front of my door. yak",
        "I was disgusted the way the cavs owner treated Lebron during his two stints with the team",
        "I was disgusted when I saw a fight in high school that ended with someone cracking their skull open a bit",
        "I once was at a party and I saw a person throw up all over another person. It was so gross!",
        "I was disgusted when I saw someone bleeding during a fight, their head had been cracked",
        "My brother's dog pooped upstairs, and I didn't see it, and ended up stepping in it...",
        "I was disgusted when I saw someone get their head cracked open during a fight",
        "My new SUV was hit in the parking lot yesterday",
        "I ordered wings yesterday and they put seasoned salt on the fries. Terrible",
        "Went to a restaurant where people were eating live squids.",
        "My dog vomited on the carpet yesterday.",
        "Last night, I ate three 250 count bags of pizza rolls. I was filled with so much regret.",
        "Last night, I had to dumpster dive for my dinner because I am so poor and penniless. It was a low point in my life.",
        "Yesterday, I saw a woman in the bus that her lollipop felt on the floor. She took the lollipop, clean it, remove a hair that was on it and put it back in her mounth.",
        "Sitting next to my baby brother who's two-years-old, and he's just ripping farts. Really wish I didn't have to stay with my parents during the summer while college is out.",
        "This lady at the store was yelling and hitting her toddler the other day when I was shopping.  I was appalled at what she did.",
        "I was shocked to see how many hotdogs they were eating at once. This has to be a sin...and a waste of food!",
        "I went out to my car yesterday and found a dead possum at the end of my driveway. It was revolting.",
        "i am so annoyed at President Trump",
        "I saw a video of a burger at wendy's crawling with spiders.  The guy had eaten half the sanwhich before he saw the spiders.",
        "I am sick that I send Obama money for his campaign.",
        "Today I ran over some roadkill on the way home.",
        "I really can't stand when people in customer service have attitudes.",
        "I saw my friend projectile vomit on the rollercoaster. The smell still haunts me...",
        "I feel disgusted by people who litter on my property",
        "I found a snake in the yard two days ago.",
        "when i stepped in dog poop outside barefoot ",
        "I spit in my coffee cup this morning and it had leftover coffee in it too. I totally forgot and drank it!",
        "I saw a piece of dried poop in my closet that I had no clue about. My dog sure is sneaky.",
        "Yesterday I drank water from the lake yesterday because I was so thirsty. It was nasty.",
        "Neighborhood kids keep egging my car!",
        "One time I watched as my cousin touch his infected toe and then stick his fingers right in his mouth. It was already nasty enough, but then he started touching things that everyone else uses. I don't understand some people.",
        "My best friend's husband cheated on her with his sister in law!",
        "My best friend found out that his wife had an affair with his brother.  I am beside myself right now with anger.",
        "I went for a walk yesterday and stepped in some dog poop.",
        "I ordered mcdonalds today from uber and it was terrible.",
        "I was sickened when I heard that my friend had been fired. They did not like the fact that she was gay",
        "I went to the worst restaurant ever today. I saw a mouse inthe kitchen.",
        "I feel like vomiting when I walk into a public restroom and it smells like manure. Some people haven't had a gram of fiber in their life",
        "I fed my dog a new dog food and he puked ALL over my house!",
        "I was walking home from work at night when I accidentally stepped on a dead rat. I almost puked myself looking at it.",
        "How can people eat human flress?",
        "I watched a news report about the mistreatment of animals. The behavior of these people is something I can't stand.",
        "I am disgusted with many people in my country. They voted to leave the EU.",
        "I left my car to my cousin and when I got it back, it was filled with used diapers. ",
        "I recently saw someone eat a week old tuna sandwich.  I wanted to throw up.",
        "I saw a person being obnoxious and horribly racist to someone and could not stand it! I",
        "I recently saw a baby who vomited on his mother.  I was so grossed out by it.",
        "I recently watched a hot dog eating contest.  I was sickened by what I saw.",
        "i saw this bum poop on his matress once and covered it with his blanket",
        "when i found cockroaches in my apt ",
        "I found a dead bug in the kitchen today. makes me wanna burn the whole house",
        "Not gonna lie I'm a Millenial and I'm pretty disgusted with 70% of my generation.  Specifically the men, trying to shirk off male duties to women and always playing the victim...bunch of Beta boys who watch too much porn and make too many lame excuses about their sad lives grow the hell up boy",
        "I remember the first I got pooped on while changing my kids diapers.",
        "I heard in the news earlier today about a dog that was left in a crate on the ocean during rising tide. I was so upset and sickened.",
        "I am so embarrassed at Trump.",
        "I was very hungry the other day so I ate some chocolates that were on the table, as I was unwrapping them I was so excited! But as soon as i put them in my mouth i was grossed out! There were ants inside!",
        "I tried to make a new dish last night for dinner, but when it tasted to gross I had to throw it out.",
        "I am irritated at people who smoke near me at work. It turns one into a second hand smoker",
        "Someone made a huge mess in the microwave in the break room and didn't clean it up.",
        "I was walking along in the park. And then I took off my shoes and two minutes later I stepped in a gigantic pile of dog poo!",
        "I'm appalled by the current state of our politics in America.",
        "I had to take out the trash last night and the bag busted open on the way to the road. The smell was so awful.",
        "The internet is failing a lot, I feel bad about that.",
        "My jacket was stolen.  Ugh",
        "So I saw a guy at the gas station yesterday and he was over 40..listening to nasty rap and of course he got out to use the free air pump then just THREW it on the ground.",
        "I was disgusted by a lady who left her young daughter in the car yesterday while going in with the older child.",
        "I ate a restaurant this morning and had soup. Their Sriracha bottle looked like it was 1000 years old and I wanted to vomit.",
        "I have a co-worker who's totally incompetent that makes more money than I do.",
        "I procrastinated and didn't do the dishes for a couple days now. I think fungus started to grow on some of the old food, so nasty!",
        "My dog loves to hide whenever she has to poop or pee. So I always find hidden treasures around my apartment and boy is it gross!",
        "My garbage bad broke and spilled all over the bed of my truck.",
        "I got my burger with millions of onions on it today when I specifically asked for no onions. Im allergic.",
        "I think surgery is so gross.",
        "A toddler was eating something that he took from the floor. His mother was not paying attention to what he is doing.",
        "my ex roommate refused to clean",
        "I took out the trash yesterday and the bag burst all over the ground.",
        "I can't believe they put onions on my burger today I hate onions.",
        "I ate at a restaurant this morning and the Sriracha bottle looked like it was 1000 years old.",
        "I went out to dinner at a fancy restaurant with my husband the other night. It was a perfect experience until I had to use the restroom and realized how gross and dirty and smelly it was. It made me lose my appetite. ",
        "Police never show up here. It definitely upsets me",
        "I am very irritated at how my junior colleague never listens to instructions",
        "The ladies bathroom was so gross. Someone left a dirty diaper in the sink.",
        "I saw a man eat a 3 foot burrito the other day.  It was the grossest thing I ever saw.",
        "My wife just confessed that she cheated, im irritated at her behaviour",
        "I was walking home through the park last night when I saw a homeless man sleeping there. He looked and smelled like it had been months since he cleaned himself off atall.",
        "Seeing that you bought a white color when I asked you to buy green irritates me",
        "Yesterday I saw a mother beating up her kid. I couldn't believe it!",
        "Found worm in my candy",
        "I had the Taco Bell breakfast for the first time today. It was terrible.",
        "I felt awful when my I saw a man beating a dog on the sidewalk.  The poor dog was bleeding and I stopped to help him. But it was too late.",
        "My brother ordered a pizza with ham and pineapple on it. It was so gross. I couldn't watch him eat it.",
        "I was almost hit head on by a driver who was texting.",
        "I had eggs for breakfast this morning. I don't think I cooked the eggs enough and the yolk was raw, I felt like vomiting.",
        "I remember having escargot on a cruise. It was the worst.",
        "I was super grossed out when I left some noodles in the sink last night and today there were maggots. Welcome to summer.",
        "I was totally grossed out by a guy who threw his nasty cup of something out the window on the EXPRESSWAY. It hit out windshield and yes he threw it out on purpose.",
        "I was eating at the Mcdonalds when someone who smell very bad sat behind me. The smell was so bad that I was going to throw up.",
        "I ordered McDonalds today on UberEats. It was terrible.",
        "I took out the garbage yesterday. The bag exploded as I took it to the street. It was so gross.",
        "I was so grossed out to see my ex",
        "My co-worker farted in her cubicle adjacent to mine. It was so gross.",
        "Took the trash out last night. I saw a herd of cockroaches at the bottom of the bin. It was revolting.",
        "Saw a big ole rat when I was taking out the garbage today. It was gross.",
        "I changed my baby's diaper for the first time today. It was nasty.",
        "There was hair in my soup, and the owner wouldn't take responsibility.",
        "I was at the beach one time walking by the pier and I saw a diaper floating in the water.",
        "I have to deal with an entitled person lately and I can't stand it. I can't bare to be around that attitude you know?",
        "We were having a big family gathering and dinner today, and one of my nephews, who's four, wasn't feeling well. But his parents kept trying to force him to eat something anyway, and were being short-sighted. Well, the poor fella ended up puking onto his plate and ending everyone's appetite.",
        "Learned earlier today that I had been drinking all day out of a cup that had been used earlier by someone who has bronchitis. I'm hoping it's not too contagious... Why can't people properly clean and put things away so I don't confuse dirty dishes with clean dishes!",
        "The other day I accidentally stepped in dog feces.  I was really grossed out.",
        "I am so disappointed on Trump.",
        "I am so piss off at the Democrats.",
        "i got cat hair in my food today",
        "I was on a date a very fancy restaurant the other night. My $30 salad had a hair in it!",
        "I saw a dog eating a dead bird on the ground. It was really gross to see.",
        "I saw someone putting mayo on their ice cream.  It was really nasty looking.",
        "My cat vomited on my shoes today.",
        "I went to a restaurant and I found a hair in my pizza.",
        "I helped a friend move his grandparent out of their house the other day. They were apparently full blown hoarders. I was appalled at the condition of the house and its contents!",
        "My dog just threw up.",
        "I found a spider crawling on my bed.",
        "I was disgusted when I saw a really big spider, I hate those things",
        "I felt like vomiting when I saw a little boy at a restaurant drooling while his parents did nothing. He was eating but his drool and snot from his nose was leaking into his food!",
        "I just heard a horrible story on the news where a mother murdered her child.  This made me so upset and disgusted!",
        "I recently tried going vegan, but I REALLY disliked a lot of the dishes I tried.",
        "I ate at a restaurant this morning and their bathroom was beyond gross. It was weird because the eating area was squeaky clean but their bathroom was the opposite.",
        "One time I ordered a submarine sandwich. When it finally arrived to my house, I took three bites and found a long hair in the middle.",
        "I was eating a sandwich one day. And then after putting some of it in my mouth I realized the bread was very hard and old.",
        "i ate a food at a restaurant and could not finish it",
        "I was eating Chinese food recently. I felt a crunch in my mouth. I realized I had just swallowed a cockroach. I was appalled!",
        "I stepped in some dog poop walking in my neighborhood the other day.",
        "There was a dead animal on the road that, even when notified, the city would not remove for 4 full weeks.",
        "A sick kid threw up on me in school",
        "I once found a dead mouse in my shoe",
        "I was cleaning out my refrigerator and found some out dated food. It was absolutely repulsive. ",
        "Pizza hut ruined my pizza,  I specifically asked for no black olives. Yuck",
        "A kid I went to school with is in jail for harming a puppy!",
        "While hiking I found a dead deer with maggots eating on it.",
        "I tried escargot this summer on a cruise. I don't know why but I will never have it again",
        "I went into the bathroom at work today and someone had clogged it.",
        "We were at a family gathering, and my relatives were in town for the weekend and we were saying our final goodbyes before they headed back home. My nephew stood up in front of everyone and farted. He's 11... He should be able to know better. I cringed,.",
        "my friends post made me disgusted",
        "I ate half a sandwhich before realizing the bread was moldy.",
        "Went to Jack N The Box the other day, and there was a long gray hair in my burger.  Grossed me out so badly I didn't even eat dinner.",
        "I saw my neighbor litter the driveway with some chocolate bars he ate. What a irresponsible person",
        "I can't believe I let my boyfriend order the pizza for us. Nine years and he doesn't know what I like on a pizza?",
        "I ordered a half pound of turley and the lady at the deli gave me roast beef. I didn't notice until we got home. It was terrible",
        "Kids in my neighborhood put dog poop on my front stoop!",
        "I stepped in gum someone spit on the sidewalk.",
        "i had to deal with a lady and her 2 daughters that had lice",
        "I saw a man pick his nose and eat it.  It was absolutely gross to see.",
        "I went on a walk yesterday and stepped in some dog poop.",
        "i had to assist a mom with two daughters who all had lice",
        "I was riding the train today, and some guy just had an open wound, practically gushing blood. He didn't seem to really mind and everyone else seemed to just be unphased by it. I guess that's city life for you.",
        "So I went in the fridge and way in the back I found a container that was in there for a looooong time.",
        "I went to a restaurant for mexican food with my friend and she had a roach crawl off of her salad.  It was horrifying.",
        "I can't believe what Donald Trump said at his last rally.",
        "Last year my grandmother died. I was really very shocked.",
        "My friend put vinegar on his ice cream sundae.  It looked really gross.",
        "My dog pooped on my head yesterday. Never felt so disgusted.",
        "Took the trash out the other day and the bag burst open. Never felt so disgusted in my life.",
        "I love corn dogs but today I was given one with a por hot dog in it",
        "I at 20 footlongs from SUbway the other day. I felt as disgusting as Jerry did prior to his Subway commercials.",
        "My cat vomited on my shoes today",
        "I had some well done steak today. It was awful",
        "My cat vomited on my shoes the other day",
        "I had ordered a sandwich and there was a hair inside of it! I was grossed out!",
        "my  cat vomited on my carpet today",
        "Tasted eggplants.  Ew.",
        "The Hotel room had roaches",
        "My cat threw up on the floor today",
        "I get irritated anytime I see people treat animals badly",
        "My girlfriend broke up with me and told me that she wasn't ready for a relationship. I was so upset when I saw that she had a boyfriend only days after she broke up with me anyway.",
        "I feel disgusted when I see or smell any form of thing with bad odour.",
        "My girlfriend broke up with me and I was pretty okay with that, since she said she wasn't ready for it. Then I saw she had a boyfriend right after that so she really made me upset.",
        "My subordinates refused to obey simple work instructions",
        "At work, the men restroom was flooded because of a clogged toilet. It was so bad to see. I wanted throw up.",
        "Last week, I saw a toddler taking dirt from the floor and putting it in his month. His mom was not paying attention. It is so bad to see.",
        "I was pretty sickened last week when I saw a dead animal on the road. It was a rabbit",
        "I found a hair in my food while eating dinner last night.",
        "Women's restrooms always look so dirty.",
        "I bought some off brand water.. It tastes so bad",
        "My noyfriend made us breakfast for the first time. It was terrible. He ruined my food",
        "So I have this neighbor who lives down the street who walks her dog without a leash. It is so annoying and its some kind of pit mix dog and it scares me that she has him off leash. I also found poop in my yard and I'm prestty sure it was from that dog! ugh!",
        "I remember eating at my ex's moms for the first time. Everything was awful. I couldnt swallow it",
        "1",
        "One day I went to make a sandwich, mold was covering the entire loaf of bread",
        "I saw a cochroach in my living room last night.",
        "My brother recently confessed that one time, when we were kids, he spit in my orange juice.  Apparently he was mad at me for some reason.  He kept the secret for over 15 years.",
        "that the neighbor lets her cats use the bathroom outside my window ",
        "Last week a couple days after getting groceries I was looking for my childs other shoe in the car. It was then that I discovered a carton of eggs that my fiance forgot to get out of the car with the rest of the groceries!!! I was soo grossed out. ",
        "I was riding my bike the other day and passed an armidillo on the side of the road.  There were flies and guts everywhere.",
        "My cat vomited on the couch tofay",
        "My cat vomited on the couch today",
        "I have been cleaning and organizing the house all day.  I had a bunch of trash in a huge bag and while I was walking up the basement stairs, it burst open and everything went flying back down.  ",
        "I lost a cornhole tournament this weekend, and my team choked, very frustrating. ",
        "the way people act towards our country is disgraceful",
        "When I was walking around my neighborhood I felt something drop on my head. I reached up and realized a bird had did its business on me. I was revolted!",
        "I saw a guy picking his nose in his car a stop light the other day.",
        "getting under cooked food",
        "I was eating at a restaurant today, and some lady started cutting her toe nails. What was she thinking? Everyone could see what she was doing.",
        "I saw a guy put chocolate syrup on a hot dog.  It was really gross.",
        "I hate the smell of dumpsters.",
        "Left my book bag outside overnight. I live in the south where there's lots of palmetto bugs (cockroaches). Went and got it this morning... it was filled with the things!",
        "My friends had a big party last weekend. Someone threw up in the hot tub, so we had to clean it out.",
        "undercooked food",
        "This little kid dripped snot on my head",
        "I had to take out the trash yesterday and the bag burst. Never been so disgusted in my life.",
        "I had to deal with some truly terrible customer service reps today. They MIGHT own the company but be disguised as support..however they were SO snotty and rude..I don't understand how anyone ever uses their software!",
        "I saw a rat running down the power line behind my house.",
        "One time I stepped into the bathroom at a bar and there was vomit all over almost every surface. I ran out of there as fast as I could.",
        "I was at a theme park over the weekend and someone threw up right in front of me.  It was so gross",
        "I put my garbage out on the side of the road and raccoons had gotten into it,",
        "when i stepped in cat poop ",
        "I had been craving a burrito all day and my sweet boyfriend brought me one after work. I took a bite and found a hair in it!!! ",
        "I was on a carnival ride earlier. A young lady in front of me puked all over all the riders!",
        "One time my cousin had an infected toe. He touched his toe with his hand and then stuck his finger in his mouth. After that he opened the fridge and touched other things with the same finger..",
        "i was driving down a back road to work and there was a dead skunk",
        "I found a family of rats living underneath my balcony. We tried to scare them away but they almost attacked me.",
        "Last time I had to clean my bathroom, the toilet was nasty.",
        "My daughter hides food under her bed,",
        "I was at a restaurant tonight and watched this man eat 5 plates of foods from the buffet.  It was gross.",
        "I was at a bus station and a woman was sitting in the bus station. A homeless person came close and started peeing.",
        "I was eating lunch at school today and some lady next to me just let the biggest fart rip I've ever heard. I mean, couldn't she at lease have gone to the bathroom or a more private place for that?",
        "I had a pizza at target today. It was terrible",
        "I was eating out last week and found several hairs in my food.",
        "I watched my little brother poop his pants",
        "I once had to clean out my grandfathers old closet.",
        "Why would anyone ever eat pees?",
        "getting raw food",
        "I felt disgusted when  was watching a TV program last night. The presenter was eating live squid.",
        "A guy in a TV programme last night ate a live squid!",
        "baby son pooped all over the bed",
        "I was disgusted by a show last night. The guy ate a live squid",
        "I rented out my house and when I came back it was filthy.",
        "I saw a man put honey on his lasagna.  It was really gross to see.",
        "I went to a park over the weekend where I used to go when I was little and I was sad to see how dirty it was",
        "I was watching a TV show where people were eating cockroachs. I wanted to throw up.",
        "At work, I saw a coworker pick their nose and eat it.  It was so nasty.",
        "My partner left her dishes unwashed after having dinner yesterday. I was very frustrated",
        "I once Had a giant gash on my leg.",
        "I was walking on the sidewalk and came across a rotted deer corpse. I was sick to my stomache when I saw it",
        "I was walking in the yard. All of a sudden I slipped and almost fell. I had stepped into a gigantic pile of horse dung!",
        "I found a long grey hair in my sand witch this afternoon when I went out to lunch.  It was gross.",
        "I was with my uncle the other day and he wanted to watch a Discovery TV show I wasn't familiar with so I said okay. It was Dirty Jobs. It was so gross, you couldn't pay me enough to do those jobs!",
        "I was at the store shopping the other day and when I went into the bathroom, someone had had an accident and the bathroom was a mess.  It smelled so bad.  I thought i was going to be sick.. It was gross",
        "I ordered McDonalds with the new delivery service. The food was disgusting and had a hair in it.",
        "Someone sneezed on me at the bus stop.",
        "I am disgusted when I watch the way the Cowboys run their team, they let so many bad people play and make decisions",
        "I felt pretty sick when I saw a dead animal on the sidewalk. It made me feel bad",
        "I don't like people kiss their dogs on the mouth. I find that disgusting.",
        "There was a dead fly in my jello.",
        "Went to put in an order today at the drive thru..and someone stuck their GUM on the speaker...Seriously? Why can't people clean up after themselves. When did society become that entitled?",
        "I took the trash out the other night and the bag burst all over me. Never felt so disgusted.",
        "I saw a snake eat a frog, it made me sick.",
        "I saw a guy put whipped cream on his taco.  I was really grossed out.",
        "Saw roadkill on my way home from work today. It was so nasty.",
        "I accidentally stepped in dog feces today.  I was really grossed out from the smell.",
        "My dog pooped in my floor today. Then I stepped in it and tracked it all over the hosue",
        "Our daughter got roto-virus when she was a baby.  The diapers she created were ridiculous!",
        "I order chicken from a new place and it was terrible",
        "my cousin used to purposely pee in the bed",
        "Someone vomited in a public restroom",
        "I had a nasty foot fungus ",
        "My dog threw-up all over my bed. I can't believe it. ",
        "The renters left my house in a mess.",
        "I was walking home yesterday and there was a rat that ran past me. I felt like vomiting after seeing that",
        "My friend left the house in dirt.",
        "I had to use a public restroom",
        "stepping on dog poop",
        "I went to a fastfood. Before ordering, I found a dead cockroach on the floor.",
        "I was pretty sick this morning. I was even throwing up",
        "Last week I saw my best friend break his leg. I was sick to my stomach when I witnessed it.",
        "I was in a coworkers cubicle trying to get some information from them and realized he had the worst body odor I have ever smelt.  It was repulsive!  I couldn't believe he didn't realize it!",
        "Smacked a fly on my desk earlier. Was really happy that I finally killed it.. noticed it was really big.. looked closer to see why.. and it had lil babies crawling out of it onto my desk! Didn't feel like eating lunch after that",
        "I fly landed in my cup of coffee this morning",
        "I found a hair in my sandwhich at lunch.",
        "Have had this roommate for a year. Decided to renew lease with him. Been pretty good so far.. except he has a problem remembering to flush the toilet--no matter whether it's #1 or #2. Getting kind of old.",
        "i can't stand going to the bathroom at work after someone else.",
        "When someone at work ruined our project and wasted my time it made me incredibly angry. I don't understand people who are just miserable and like to ruin things on purpose.",
        "The other day I was at a restaurant and when I got my food it had a hair in it! I was so looking forward to eating it and WHAM! A big 'ol hair!!!",
        "I rented a house on the beach this summer. It was so dirty that I could stay. There were cockroachs everywhere.",
        "I watched the discovery channel and saw this show on bugs. It was really gross. ",
        "I saw a guy scratching his behind on the train this morning.",
        "I seen a little kid picking their nose and eating it today while I was on the bus. I almost threw up.",
        "I was on the way home yesterday riding a public transportation bus when the guy sitting next to me starting picking out his boogers and flicking them!",
        "Today I saw the world's biggest cockroah",
        "The dog puked on the carpet and then ate it's own puke",
        "Every time I meet a girl on Tinder and she starts to like me, things go bad. She just finds a better looking guy and drops me.",
        "Someone dropped a bunch of french fries on the ground and then ate them",
        "I watched a TV show last night. The presenter ate a live squid.",
        "I saw someone eat an insect on tv, it was alive and still kicking",
        "my cat vomited on my rug today",
        "I made the mistake of going onto a risque website one time. I saw some grotesque stuff that really grossed me out and I never went on there again.",
        "I saw someone take something from the trash and eat it right in front of me",
        "I watched a show where a guy ate a live squid",
        "I saw someone put chocolate on their nachos.  I was so grossed out.",
        "my cat vomited on my shoes today",
        "My cat vomited on my shoes",
        "I saw a man eat a handful of roaches.  It was so gross.",
        "Once my friend cute his arm wide open at work.",
        "I got a puppy for my birthday.  I took him outside to potty and found him eating the neighbors doo.",
        "my buddy threw up all over my car.",
        "My friends wife left him in the middle of the night. I feel sick for him",
        "Even more upset then I already was that the dog I rescued was not only starved but starved AND pregnant.",
        "We homeschool our girls and our oldest did a high school biology class last year.  She had to dissect several things and I could not watch.",
        "i can't stand to go the bathroom at work after someone else",
        "I opened the back door to let my dog out and a giant roach tried to fly in the door.",
        "I saw a giant flying roach on the front porch.",
        "When we moved into our new house, our cat found a field mouse that had gotten inside.  She was playing with it and there was blood all over, it was so gross.",
        "My neighbors wasted a bag of doritos on the stairs and just left them there. What a jerk",
        "I took my trash out a minute ago and stepped in dog poop! It even went between my toes!",
        "I ordered chicken from a new restaurant. It was still pink",
        "I ordered a pizza tonight. It came with anchovies on it!",
        "my little brother has the worst smelling farts.",
        "i found an old banna peel under my bed.",
        "I found some heavily expired milk in the back of the fridge at work and it was super gross.",
        "I saw a TV show wheer a guy ate a live squid",
        "Donald Trump makes me sick.",
        "I really do not like the free education law.",
        "I watched  tv show the othre day and the presenter ate a live squid",
        "The Air BnB people left my house in a mess.",
        "The airplane smelled like it had not been cleaned.",
        "After coming home from vacation, there was a horrible smell in the house. I realized I had forgotten to take the trash out before leaving and food had been rotting in my house",
        "In garage, there is a lot cockroachs. We all complained to the landlord but he is doing nothing.",
        "I left some food in the microwave while I went on a trip a while ago. That was such a bad move,",
        "Olives are just gross.",
        "When I was a kid, I sucked a spider up through a straw.  It must've been living in the strong in our kitchen cabinet.  I've really, really hated spiders since that moment.",
        "I can't stand a messy kitchen, but my roommate is a pig. I can't stand how messy he is!",
        "I was disgusted to find out my best friend's husband cheated on her.  I feel bad for her.",
        "when i see vomit i almost want to vomit",
        "I found a fly in my salad at McDonalds. I was grossed out!",
        "We're cleaning up/renovating a home that was lived in by a man with dementia. It was disgusting! There were silverfish and diapers piled up in a corner.",
        "I spent a week away and when I got home I realized I have left the milk on the counter.  It smelled awful.",
        "I could not accept less than the best in service delivery",
        "My girls had to take biology last year.  They dissected a frog and I could not stay in the room, that thing was gross.",
        "I took a bus trip to Philadelphia today. It seemed like they hadn't ever remembered to actually clean the bus. The floors were all sticky and there was a bad smell permiating the entire bus.",
        "I'm tasked with cleaning up the bathroom every day at the end of my shift, well last night someone decided to put so much toilet paper in the toilet that it became clogged and overflowed everywhere.",
        "My dog pooped on the rug today. I was so sick when I had to clean it up.",
        "my cat vomited on my carpet",
        "I took out the trash and the dumpster just smells vile. It made me almost throw up it was so gross this time.",
        "My dog pooped on the carpet today. I feel so sick about it.",
        "my cat vomited on my rug",
        "My cat pooped on the rug today. I was so sick.",
        "I was irritated when I find out that my girlfried was cheating on me",
        "My apartment had been flooded by my neighbor who lives a floor above me. What an irresponsible person",
        "it was horrible seeing a dog get hit by a car the other day",
        "At work I have to take out the trash, and today one of the bags busted on the way to the dumpster. It was so bad! The smell was terrible.",
        "I was recently walking down the road and I saw somebody drive past and throw a bunch of rubbish out of their window. I don't understand why people do it.",
        "When my brother was suspended from high school awhile back, it made me sick.",
        "In science class I had to dissect a frog. All the blood was gross.",
        "I left my adult son home for a few days and just came back to a sink full of gross old dishes. The whole house is a mess!",
        "My friend is being catfished. He's even said he will marry her. She's sending him money she really needs. ",
        "I am deep cleaning my kitchen as fall arrives and wow, I pulled out my fridge and found this caked black dust bunnies and grease gunk.",
        "The burrito I baught from the vending machine was expired.",
        "Sometimes my boyfriend cooks, and the food tastes pretty gross",
        "My son peed on me the other night.",
        "I went to a restaurant's bathroom today for lunch and it was absolutely disgusting.  Looked like it hadn't been cleaned in months.",
        "I ate some bad meat this morning. It made me really sick",
        "I had cereal for breakfast this morning. It was a brand new box, but when I poured it into my bowl, there were several little live bugs in it.",
        "A fly landed in my drink while I was grilling some chicken for dinner outside.",
        "I just cleaned out under my bed in order to do a bedroom make over and there was so much dust and old stuff under it. ",
        "I was in a hotel and there was a hair in the shower drain.",
        "I am watching this show on netflix. These crminals are something serious.",
        "I was sitting at work the other day and suddenly a giant cockroach ran across the floor.",
        "I cleaned out my basement and found that some mice had made a home in some boxes. There was mouse poop everywhere!",
        "I stepped in some dog poop when I went on a walk yesterday, ugh.",
        "I hate when people dip tobacco and then spit it everywhere. I stepped in it barefoot outside when I was checking my mail.",
        "I got a job as a pooper scooper.",
        "I went to visit this appartment that I want to rent. The appartment was totally different from pictures. It was very dirty.",
        "My daughter decided that she would make dinner one night.  She decided to make breakfast for dinner and she's got a bit of a creative side.  We ended up with alfredo sauce on our eggs - it was not good.",
        "I have an outside cat that I let come in every so often. She ended up pooping on my floor.",
        "Some dude on the bus farted right next to me today.",
        "I get so down on humaity sometimes watching true crime shows",
        "I tried eggplant the other day.  GROSS",
        "I have lent money to friend of my friend. Hope he will pay me back!!",
        "My dog pooped on the rug yesterday. I was so grossed out.",
        "I found a hair in my lunch.... let's just say my hunger went away quickly",
        "I ate 10 pizzas all by myself yesterday. I felt so sick with myself.",
        "I saw myself doing jumping jacks in the mirror with my shirt off, ugh.",
        "I saw someone blow their nose into their shirt.  It was super gross to see.",
        "Someone lit a bag of poop on fire on my neighbors sidewalk last halloween.  The smell of it is something I won't soon forget.",
        "I'm disgusted whenever I go over to my sister's house.  I feel like she hasn't cleaned it in months.",
        "The cafe down the street used to be my favorite place to eat. They recently failed several health inspections.",
        "I saw a man eat an entire tube of toothpaste.  It was beyond gross.",
        "Ate some fried eggplant the other night",
        "I took a sip of milk at work and it was sour. I was really sickened by it.",
        "A woman passed gas right in front of me at the mall. I was really grossed out.",
        "I saw this guy dump a pile of garbage from his truck on the freeway. It was so messed up and dangerous for other drivers.",
        "Yesterday I saw a guy not wash his hands after using the restroom.  It was really gross behavior.",
        "Neighbor threw their trash all over their yard.",
        "I was in the city last week, I saw a homeless man picking through the garbage. I was mortified",
        "Had lunch with my friend for his birthday.  Not feeling too well now.",
        "Yesterday I went to the garage to look for some tools and I found a dead rat.",
        "I stepped in some dog poop while taking a walk the other day, ugh.",
        "i had to clean up an overflow toilet.",
        "My cat peed on the carpet while I was at work.",
        "I just saw a naked man running down the street. It was so gross.",
        "I stepped in bubble gum in the parking lot at work.",
        "I had planned on cooking a steak tonight but, I found it turned rotten when I came home today.",
        "I came home from work and my dog had pooped on the floor. it was gross cleaning it up",
        "I have so many ants in my kitchen, no matter what I do, I can't get rid of them and they are everywhere.",
        "I am repulsed by my neighbor.",
        "My dog pooped near my bed right before I was going to sleep.",
        "I saw a woman blow her nose into her shirt.  It was very gross to witness.",
        "I ran over a possum today. It was so gross.",
        "I swallowed a fly today. I was so grossed out.",
        "I ran over a dead deer today on the road. I was so grossed out.",
        "someone missed the dumpster and there was trash all over the parking lot today",
        "I ate 20 pizzas today. I never felt so disgusted with myself.",
        "I ran over a skunk yesterday. I was so grossed out.",
        "One of my classmates asked me to copy my homework and submit as his own. Can't stand such a shameful behavior",
        "I saw a man put mayo in his milkshake.  It was really gross to watch.",
        "Donald Trump really disgust me.",
        " my cat vomited on my rug",
        "being served raw food",
        "When I was a kid, I saw my cousin break her arm. It wasn't an unnoticeable break either, her arm was mangled and disfigured. It was insane.",
        "Anyone I hear Hillary Clinton talk, I feel sick to my stomach.",
        "Anytime I go to Mcdonald's I never order and feel sick.",
        "I saw this guy dump some garbage on the side of the road. It was gross and totally wrong to do.",
        "I was siiting beside a girl on the transit bus and she expelled gas  and it stunk so bad that the person on the other side of her vomited , 5 minutes later she had the nerve to try and flirt with me and tried to get my phone number",
        "I opened a corn on the cob and there were worms in it. I hate bugs.",
        "I saw a kid with boogers caked on his nose at the grocery store and his parents weren't doing anything about it.",
        "I came home from vacation and my fridge was rotting.",
        "I found out that my girlfriend was cheating on me with my friend.  I cant look at either of them right now.  Im sick",
        "I went out to eat at what used to be my favorite restaurant last weekend. The service was terrible and the food was gross.",
        "I ordered a meal from a restaurant yesterday and it had a hair in it!",
        "i walked in to the bathroom at work after someone used it ",
        "i hate being around negative people and situations",
        "I had the most horrible lunch yeterday. It was at my favorite place to eat too so I'm even more upset. ",
        "I left some bread in the fridge and it got all moldy.",
        "I have a coworker sitting next to me that has very frequently his finger inside his nose.",
        "I woke up this morning to TWO spiders on my bed.  I have no idea how long they were there.",
        "I took a bite in to my burger and there was a tomato. I hate tomatoes.",
        "I tried eggplant once.  Never again!",
        "I just had my air conditioning system cleaned out because it wasn't working right.  Wow, the junk that came out of it was awful.  The owner before me never used filters.  ",
        "At work, there is a coworker that smell terribly bad. I can't breath.",
        "I hate olives and the other day I was eating a salad and there was one in there :(",
        "When we lived in an apartment, we had a lady with a dog above us.  She would always let the dog out on her deck.  One day it peed and it poured down onto our deck, our grill, and everything!",
        "Tried eggplant the other day",
        "I can't believe my neighbors left trash all over the steps. I dont get it",
        "I went to a buffet today and ate wayyyyy too much",
        "I cannot stand my sister in law.  I'm literally sick over how she treats her boys - she says she loves them but my mother in law raises them, clothes them, feeds them, shelters them.  All so she can go get tummy tucks, boob jobs, etc..",
        "I ran over a pile of garbage last night. I was so grossed out.",
        "There is an old man who always comes in my restaurant for a glass of water and napkins. Todaay i saw what he uses the napkins for. I witnessed him using them like q tips to clean his ears, I wish i hadnt seen it!",
        "My roommate hasn't washed the dishes in weeks. I am so grossed out.",
        "I ate some bad egg salad earlier this week. I made it myself so I thought it would be fine, but it made me very sick.",
        "I went to make a patty melt today and my bread was rotted. It was really nasty.",
        "I spent 2 hours helping my daughter on her homework. found out today she never turned it is and won't receive credit for turning it in late. What a waste of time.",
        "My husband's cat pooped and peed in the bathtub today. Why.",
        "I just ate the most disgusting thing ever! ",
        "I went to empty the trash outside and the can was covered with maggots.",
        "I was eating some food at a restaurant when I found a hair in it. I didn't NOT want to eat any more!",
        "My 1 year old smeared poop on my leg after taking her diaper off.",
        "I had some carryout food yesterday and I don't think it was properly cooked. It tasted great going in but not going out this morning.",
        "I was babysitting for someone I didn't know very well. When they brought the baby in the car seat, cockroaches crawled out of it. Gross!",
        "I was attending an event at my sons school. A child came running toward me and threw up all over the floor!",
        "i stepped in my neighbors dogs poop",
        "Someone once illegally used my credit card. They made a few charges on it. ",
        "I got spayed in the face with wound juices",
        "My dog got sick last week and was vomiting alot. She vomited in the living room and it stuck so bad I almost vomited trying to clean it up.",
        "I accidentally had expired milk today and it tasted gross",
        "Bleh, I just had the worst food ever. I almost puked after I ate the rotten cheese burger I was given at McDonalds. ",
        "First time I ever went to a traditional Japanese cook-house I couldn't believe to variety of food. Moreover, I couldn't believe the variety of food that was still moving...",
        "I walked in on my girlfriend and she was picking her nose hairs out in the mirror",
        "I had been friends with Mary for awhile now, but never been to her house. She invited me over for dinner and I had no clue she was a hoarder.",
        "I watched my kitten kill a roach the other day and eat it. It was so disgusting.",
        "There are a couple barn cats that live on my property. One of them always tries to get inside. He always brings dead mice to the front door and leaves them there. It's very gross!",
        "I went shopping at a new store and bought all of my meat for the week.  When I got home I realized it was all expired.",
        "One of my cat's pooped on the tv remote.",
        " I went to this restaurant one time and when my food arrived I started to eat. That's when I noticed a piece of hair in my sandwich. I was totally grossed out and lost my appetite.",
        "I am very disgusted by seeing people eat live worms",
        "I was irritated when I was at the airport and someone cut in line. They only saved themselves about 30 seconds.",
        "i went to a local restaurant",
        "I got bar-b-cue from a place a month ago. And it literally tasted like they got it out of a dumpster. It was the worst experience ever. ",
        "When I was 17, I held a neighbor's baby and she puked all over me.  It wouldn't phase me now but at the time it was terrible.",
        "I was walking barefeet outside and stepped on an earthworm",
        "I saw a couple homeless people walking completely naked.",
        "One time, I told my friend who lives outside of city limits that she could bring her recyclables to my house since city recycling isn't offered where she lives. She said she didn't want to because it would be too much work for her.",
        "I went into a local pizza place a while back. After ordering I noticed a working spit in someones pizza that wasn't mine.",
        "I found a dead racoon in my shed. I must have been there for a few weeks",
        "i just stepped on a hairball",
        "I went out to eat one time, and had a huge hair in my food. It was baked into a ravioli.",
        "I have been trying to keep my car running perfect. I am failing.",
        "I was in my attic because i smelled something. turns out we had a dead rat up there",
        "We got a new rabbit. He isn't litter trained yet and he went to the bathroom on the rug. ",
        "My son had an ingrown toenail so I took him to the podiatrist today. It was so gross. It was all red and infected and I watched while the doctor dug out the toenail.",
        "I saw the grossest food at my friends house. It was molded beyond belief.",
        "My Airbnb customers left the house smelly and dirty.",
        "I saw a documentary on people on death row. It is disturbing some of the sick things people do.",
        "My dog got sick last night but I didn't hear it.  I only realized it after I stepped in her throw up when I got to the top of the stairs this morning.  I almost threw up myself!",
        "My dog got sick all over the floor. The smell was foul.",
        "I came home from a business trip and found food rotting in the fridge with mold growing on everything and fruit flies swarming around. bleh.",
        "I found a hair in my food while eating at a restaurant with my boyfriend",
        "My trash can is super gross. I almost puked opening it up.",
        "I was holding my brother's newborn earlier today... I held them up a little bit, with them facing down at me, and they puked all over me. Pretty cool. Can't get the smell of baby vomit out of my nose.",
        "I came home to a huge pile of dog poop, it was absolutely disgusting.",
        "I saw a grown woman pick her nose and eat it earlier.  I was so grossed out.",
        "The airplane smelled like it hadn't been cleaned for months.",
        "I am not happy with how the Eagles played yesterday, it was not good",
        "I ate deep fried eggplant.  YUCK",
        "I went into the bathroom and saw that my roommate had forgotten to flush the toilet.",
        "I saw a cook today not wash his hands after using the restroom.  It was so nasty to see.",
        "when my food wasnt cooked right",
        "my cat vomited on my rug the other day",
        "I was watching the news on social media and there was a terrible story on animal abuse. The kind of people that do this just make me sick.",
        "When I came back from my vacation, I was horrified when I found that there is a rat in my garden.",
        "I was travelling India last year. I came across a man lying on ground with his face covered in blood and flies in his mouth.",
        "My neighbors just got a new puppy.  I saw the puppy eating out of the cat's litter box.",
        "I had a contractor come do some repair work in my bathroom, but and when they looked in the walls, it was covered in black mold.",
        "I was at the grocery store the other day, waiting in line to check out. The person in front of me was very old and having trouble working their card. The cashier was very rude and condescending.",
        "I was walking outside and I stepped into a pile of dog faeces",
        "I went out to eat at my favorite restaurant last night. There was a hair in my food!",
        "I bit into a peice of chicken yesterday and it was still pink! I almost threw up",
        "My toilet backed up in my house last weekend!  I was so grossed out!",
        "I tried my mother in law's cooking for the first time the other day. It was the worst thing I've ever tasted.",
        "I saw a guy at the mall wearing a cut off tank top like you used to see in the 80's except he was 400 pounds.",
        "Yesterday something was smelling awful in the kitchen and after a lot of search it turned out that it was some eggs that have rotten over the counter.",
        "Something smelled really bad at work the other day. We found an old moldy rotting sandwich in a coworkers desk.",
        "I was at a restaurant and I got a hair in my food! I was appalled! ",
        "I walked into a public restroom. I quickly walked when I saw that all the toilets had overflowed and the floor was covered with brown stuff.",
        "Last night I was in the basement and I saw a huge roach crawl under the washing machine. I shrieked because I hate bugs. Roaches give me the creepy crawlies!",
        "Someone broke into our new home, and I felt this way as a result.",
        "I found some old rotten sweet potatoes hiding at the back of my refrigerator.",
        "I saw a guy smack his wife the other day at the store. i was very furious by it",
        "I saw the grossest thing on the bus the other day. This guy left a sandwich and it was so moldy.",
        "My brother cut his arm falling. The wound was quite scary looking,.",
        "for some reason someone left a bunch of dead fish next to were we park our boat",
        "My husband and I went out to a real nice restaurant for our anniversary and i looked down just as I was fixing t take a bite out of my lobster and there was a nice long piece of hair"
    ]
}