{
    "threshold": 0.8,
    "seed": [
        "My dog passed away of bone cancer. She was such a special dog. ",
        "My 32 year-old son died of a sudden heart attack. I was with him. the day before.",
        "When I found emails between my ex wife and the person she was sleeping with behind my back.",
        "I was on my way to work when i witnessed a child hit by a vehicle",
        "I brokedown when I got a bad news",
        "I feel devastated that I might be doing this work incorrectly. I don't know if it will hurt me.",
        "I lost my dog to bone cancer three years ago.",
        "My dog passed away.",
        "My girlfriend broke up with me.  She did this right before my birthday",
        "My dog passed away and it was really hard.",
        "A friend who I regularly saw had to leave the state for work.  It's sad I'll probably not see him again",
        "I was diagnosed with stage 4 cancer.",
        "i was fired from my job.",
        "I was filled with despair when my grandma died. She was always the one i relied upon.",
        "The worst phone call I ever got in my life was when my dad was put in hospice. We were told he only had a few days left.",
        "My cat that I had since she was a kitten passed away. She was only four years old. I was completely crushed.",
        "My mom called about a year ago to let me know she had cancer",
        "I'm losing my home",
        "I have received news that my brother has died. I am beyond devastated.",
        "I'm devastated by my mother's death",
        "i was heartbroken when my dog died last month. He was always by my side as long as i remember",
        "I was so heartbroken when my dog passed away last month.. She was my childhood dog",
        "I was heartbroken when my dog trevor passed away last month. I shut myself off from the outside world for days.",
        "I lost my job a few years ago due to cut backs, they weren't making enough money. That job was everything to me.",
        "Our family dog passed and my mom was so wrecked it hurt her really deep.",
        "A good co-worker of mine lost his job.  It's a shame because I enjoyed working with him",
        "I will never forget the day after my 28th birthday. It already was raining and thundering that morning and the news that came after shocked me. ",
        "My mother died",
        "My dog just died in my arms",
        "I went through two floods in Missouri only a couple years apart from eachother.    During the first one we lost our whole house.   All that was left was the foundation.",
        "We have a doberman for over 8 years. He passed away last spring. It was a hard time for our family.",
        "My dad died of cancer in 2012.",
        "Last year, heavy rainfall caused my basement to flood. I lost all of my childhood photos as well as many irreplaceable things from my past.",
        "Our dog passed away after 8 years of having in the family.",
        "Recently found out that one of my best friends from back home died in a car accident. I don't even know what to say to her parents, I haven't been able to call them with condolences.",
        "I got laid off from a job I used to really, really love. It worked out though, toward the end I found myself really hating the work and the company. But it still hurt.",
        "I am still in shock after my house caught on fire.",
        "My house burned down today. I am still in shock.",
        "I am so upset I lost everything in a flood yeaterday.",
        "Last month we had record rainfall in our area. The river down from my house flooded so bad, it flooded my home and destroyed everything. It sucks having to start from scratch again.",
        "I won a pair of tickets to go to Rockfest this summer. Unfortunately, none of my friends could go and so I ended up staying home instead.",
        "My neice and I were distraught because she worked so hard to get into nursing school and didnt get in.",
        "My friends and I had spent all day troubleshooting a new PC build that we had just completed. It turns out that the motherboard or processor were defective, and we had to deconstruct it to send those pieces in for a return. It was so frustrating.",
        "Today I had a patient who found out she could not have babies. She has been trying for 6 months now.",
        "Woke up last week on saturday morning to find my car had been stolen. I was horrified, completely in shock.  I use my car for work and also for my family so I was completely overcome with emotion.  Luckily my husband was there to calm me down.  He did all the practical things like contact the police, my insurance company etc and infact they were able to provide me with a courtesy car the next day.  My insurance company will pay out in a few weeks and I will replace it but at the time it was just such an awful experience to wake up to.",
        "the episode didnt come out",
        "I've known my best friend since I was 4 years old.  When he joined the Air Force he moved out of state and I was really upset when he left.",
        "My wife's cousin was sent to the hospital and was placed in a medically induced coma with  something having to do with his lungs",
        "Right after buying a brand new phone I dropped it and shattered the screen. I barely had any time to use it.",
        "I was upset when I failed my math test.",
        "My dogs attacked my baby goat and she died.",
        "I had a pitbull that I loved dearly named Lily.  My boyfriend left a candle burning one night and left the house to go to his sisters.  Our house caught fire and lily died.",
        "Something terrible happened. I discovered I have cankles",
        "My new car was extremely damaged in a road accident last week being my very first car,i;m shuttered.",
        "There was a race I should have won.",
        "One time a build a tower of cards that was over 8 layers tall. It fell when someone walked by",
        "I came home one day to my cat, Muffins, dead.",
        "when my Grandparents died, I was extremely upset for a few months.",
        "I was hoping to get an interview for a position and was told I would at least get that chance.  However, the recruiter didnt look at any internal candidates and by the time it was reported they had already hired someone from the outside.",
        "I am so hurt that my baby goat died. My dogs were playing to rough and killer her. Man I should have stopped it sooner. It is all my fault. :(",
        "I was absolutely so sad when I found out that Paul Walker died. I loved him in the Fast & Furious movies. I recently saw a trailer for a movie about his life which brought back all the sadness I felt when i found out all those years ago!",
        "I lost the ring my best friend gave me before he moved out of country.  He had it made just for me and I am just absolutely heartbroken over it.",
        "i just lost my pet dog. I do not know what to do.",
        "I felt very sad when i found out that my mother had lung cancer 6 months ago",
        "I made a stupid mistake at work and I got fired. What am I going to do?",
        "I dropped my iPod touch on the bathroom floor. The screen shattered and I went for over a month without music.",
        "i was sad to see my favorite tree had been broken in the storm last week",
        "Last year in the spring, we got record rainfall and my basement got flooded. Many of my childhood things and photo albums were destroyed.",
        "i destroyed my laptop the other day",
        "lost league of legends game",
        "Our puppy got out of his leash and ran toward the busy road",
        "I was driving down the highway when I saw a car in an accident. It seems they hit a cow! Oh my!",
        "I found out my cat has terminal kidney failure. I really don't want to lose her.",
        "I received horrific news from a best friend recently. They had tried to commit suicide. It was very hard to hear but thankfully they are getting the help they need.",
        "I was so upset when I had to put my dog down last month.",
        "During my first year in grad school, I had a basement apartment that flooded. All of my possessions were utterly destroyed. It took several months to replace the items that I could -- but I can't help to remember the things that couldn't be replaced."
    ]
}