{
    "threshold": 0.8,
    "seed": [
        "One of my friend didn't keep this promise he made to me.",
        "Yesterday, I was really craving Dairy Queen. So, I got in my car and went to grab some Blizzards. When I got there, they were closed. ",
        "I was disappointed by my manager when he told that I will probably get my promotion next year (not this year)",
        "My texted me happy birthday yesterday. My birthday is today.",
        "I'm sad that game of thrones is ending. Great shows should last forever like the simpsons.",
        "One time I met a girl from Tinder and I really thought we were hitting it off. We met up and had a great time, but then she ghosted me right afterward.",
        "My friend took some of my money without asking. When they confessed I wasnt mad, just disappointed.",
        "Once, I tried hard to update my CV as per the job description and applied for a good position, however my CV didn't even pass the screening level.",
        "I studied really hard for my annual exam but did not get my desired grade. it left me very disappointed in myself. ",
        "My boss called to tell me that I would be receiving a package the next day, and that I should call her before opening it.  I was really hoping that it was a special award that my company gives to deserving employees, but it turned out to be some personnel paperwork that she needed to go over with me. ",
        "I applied to a very interesting fellowship last year at the NNSA. I had applied the year before that and had an interview and wasn't given the position. This time I thought for sure I was going to get it but I didn't even get an interview. I was so sad. ",
        "I was turned down an assistant training position at work. For the past 4 years I have scored higher than the actual head trainer on this test. ",
        "I was so let down when i didnt get the last job i applied for.",
        "When my father didn't show up for my Soccer game i wasn't happy with him. He rather of sat in a SEARs and watch TV where he forgot he had to get to my game.",
        "Every year I'm so excited about Christmas.  And every year I'm not able to get all the things done that I want to.",
        "When a friend did not come to my moms funeral and lied to me about why, it just really disappointed me. Its something that still makes me upset.",
        "I am so disappointed on my son.",
        "I failed my Calculus exam despite having studied all nights. It was heartbreaking for me",
        "I did all my best to be the winner of the music contest. But a very poor performance won it",
        "When I was a kid one of the things I wanted most was a remote control car. My older brother had a job and told me if I get all A's on my next report card, he would buy me the car. I was encouraged to do good in school for the reward. My report card came and my lowest score was A-.",
        "I was upset when I found out I didn't get the job I applied for. I thought I had done so good on the interview!",
        "Once I applied to a job and interview only to have the job canceled.",
        "I saw a mother spanked her 4 years old son so hard that he felt on his face ",
        "When I heard the new Fallout game wasnt a standard rpg I was quite surprised and sad",
        "I won't be able to go to  Jamaica next weekend, after all.",
        "1",
        "I was sad when the truck I wasnted had been sold",
        "I went to court recently and the other party didn't show up again. What a waste of my time.",
        "I'm mad I didn't hit my max bench of 350lbs at the gym. Need to start eating healthier",
        "My brother was coming back from a trip. I was expecting from him to bring to me a gift.",
        "I was at work, and i came home to my wife cheating on me with another man.",
        "My AC went out",
        "I accidentally left a very important document at home that I needed. It made me look bad in front of my boss",
        "my friend did something bad to me ",
        "I failed a science test early on in high school. I was just ashamed at how I did",
        "I procrastinated on turning in a paper for a college class, and she ended up giving me a D for the course overall.",
        "when i didnt paint the house the right color ",
        "I was disappointed when I saw how much the Eagles tickets cost for their opener, I really wanted to go",
        "I was looking forward to one of my favorite shows coming back on and it was cancelled.",
        "My family has fallen on hard times. We got to the point that we couldn't catch up on our car note. One day the tow company came and hauled it away. I felt really let down and didn't know what I should do.",
        "I was a little upset when I didnt get to leave work early",
        "One time I went to an interview for a really competitive internship with a great company in my field. I thought it went great and that the interviewer and I had a great conversation, but it turned out I didn't get the internship. ",
        "I spent $60 on a new hyped up video game that I ended up hating.",
        "I am so annoyed at president Trump.",
        "I was upset when my friend skipped my mothers funeral. He lied about it too",
        "I was disappointed when I opened my lunchbox today. Not what I wanted to eat.",
        " I was disappointed when I opened up my toybox today. Nothing to play with.",
        "Last night, I tried cooking a salad. I was disappointed once I learned that salads weren't meant to be cooked.",
        "My father was caught cheating on my mother. I was really mad but overall i didn't want to talk to him.",
        "I tried baking a pepperoni cheesecake last night. It tasted awful.",
        "Went to Hawaii for vacation. Kinda felt like it was a waste of money.",
        "I was disappointed in others for passing a dog up that needed help.",
        "I ordered pants online that I was sure would fit, and they ended up not fitting.",
        "My daughter is such a pain sometimes. She doesnt take anything seriously.",
        "My dog peed all over my new, fresh, funky socks yesterday",
        "My son failed his physics exam yesterday. So disappointed.",
        "The dentist isn't able to fix my teeth for the price I thought he could.",
        "My son just graduated from high school. He should have graduated last year, but didn't to what he needed to do to finish. I was so unhappy with him.",
        "I just expecting a win from Croatia. But France did it. Though I'm not a fan of either. I just expected Croatia.",
        "not getting the importance that i deserve",
        "Was supposed to hang out with my friend after work but turns out she has to work late.",
        "I missed the sale on a laptop I've been wanting for work.",
        "I just grounded my son for a long time. He got in trouble for shoplifting at the mall. The police called me to come get him.",
        "My ex didn't show up to court. I missed work to be there.",
        "I was very ashamed when I found out I got cheated on. It really just took all the energy and hope out of me.",
        " I I failed my physics exam yesterday. I was so disappointed with myself.",
        "I was expecting rain today because of the weather channel. Sure enough, it didn't rain.",
        "I was let down by the movie. I was expecting much more.",
        "No one rsvped to my birthday party.",
        "When my girls were younger and playing softball sometimes I couldn't make it to all of their games.",
        "I was hoping to join my family for dinner but seems like I'm stuck at work.",
        "I worked on this project for so long, but it turns out my job doesn't even want it done anymore.",
        "Found out that I apparently filed my taxes wrong a few months ago, and now they want me to make up for what I should have paid, plus interest. I should have paid more attention or asked for help from someone I guess",
        "The new movie I just saw was not great. I expected so much more.",
        "I really hate that they couldn't squeeze a few more seasons into game of thrones.",
        "I had to pay a late fee on my car taxes because I procrastinated in paying them on time. I always put off important things because I feel too scared to do them for some reason. Not sure why I keep making the same mistakes.",
        "I just found out my state is last in education in the entire country.",
        "My partner refused to go on a double date with a college friend i had and her partner",
        "Everytime I buy a lottery ticket, i never win.",
        "I can't believe my ex won't just move on.",
        "I watched a movie that looked really good on the trailer but I didn't like it at all.",
        "My daughter failed her last exam and didnt tell me. I couldnt believe it",
        "I was disappointed not to get a job. I interviewed for it but didn't get it.",
        "I feel really let down because I ordered some vitamins for my dog on eBay and they never showed up even thought they were supposed to have been shipped.",
        "Last week was my birthday and I didn't get not one present.",
        "My coworker gave me a very poor standard of work",
        "I maxed out my credit card last holiday season, i dont usually do that",
        "I was really looking forward to the softball tournament this weekend.  It looks like not enough teams signed up to have the tournament.",
        "I had been studying so hard for a test and was very confident going in. I ended up not doing well at all. I hope I can retake it.",
        "when i failed the test at school ",
        "I just replaced my headlights in my truck and one of them went out inside of a week.",
        "I went to buy a new book that I really wanted. When I got there, the store was sold out. ",
        "I am so mad at my boss these days.",
        "After spending so much on my brother's tuition fees overseas, he still ended up becoming a musician without popularity :(",
        "I was disappointed when my bf fell off the wagon and started acting up again. He went back to his old life for a moment.",
        "When I did not win a bonus at work, I was a little sad. I guess I expected to do better.",
        "I was pretty let down when I didn't get a good raise",
        "I was not happy when I didn't win the award.",
        "I've been a bit down about work being slow this summer.",
        "I've been let down my whole life by my parents.",
        "I was disappointed with the new Mario Tennis game, it did not live up to my expectations",
        "I was looking forward to hanging out with my friends but looks like I'm stuck at work.",
        "I have a day off tomorrow and my throat is starting to hurt.",
        "I've been waiting for a story to finish, but the author passed away.",
        "I can't believe my ex didn't pay his car note and had the nerve to ask me for some money. He has a gambling problem.",
        "I took a test last week and failed miserably.  I am frustrated at my performance.",
        "I went to Mcdonald's and they totally messed up my order.  I am so upset about it.",
        "My friend borrowed a good sum of money from me, but I guess he doesn't feel that paying me back is a priority. It makes me sad to know that my incoveinence isn't important enough.",
        "I didn't get to see Mission Impossible yet. My girlfriend made other plans when we were supposed to go see it together.",
        "I was hoping that my friend could make it to a special concert, but she cancelled on me last minute.",
        "My son did not get A grade in math",
        "I really needed a 34 on the ACT to get a big scholarship and I tried so many times. In the end, I got a 33 many times.",
        "One time I heard my friends were going on a trip and I really wanted to go. I didn't get to because there was only enough room for all of them.",
        "I caught my wife red handed cheating on me I feel so bad",
        "I entered a writing contest. I was really hoping to at least final in it, even if I didn't win, but I didn't. I was sad. ",
        "I applied for a job recently and put loads of effort into polishing my CV. I really wanted the job because the salary was really good. I felt like the interview went really well but obviously not because I didn't get offered the position. ",
        "in myself for losing my temper with my child ",
        "I didn't save up enough for a vacation this year.",
        "when i lost my money at the store. ",
        "I am mad at trump",
        "I was mislead by a worker who wanted to undermine my work.",
        "My friend never got back to me about our vacation plans. I wonder if he doesn't really want to go after all?",
        "I promised my friend to pick her up after work but I totally forgot. I just left her at work and now I feel like I let her down immensely.",
        "I told my kids to go tobed last night. They still wont get up now",
        "My son has always been really good in school. Last semester was different. He failed 2 classes!",
        "One of friend didn't come to my birthday party.",
        "I was disappointed in someone last night when they chose to ruin all the trust built up over something stupid. It just happened over nothing because they were cranky.",
        "Just found out my friend failed an important exam because he was out partying the night before and didn't get much sleep.",
        "I was really disappointed when my boyfriend moved away",
        "I was expecting some help from a coworker but he didn't keep his word. Before, I held him in high esteem. Not anymore.",
        "I am sad some people I like are such bully's to others. It's a real big turn off.",
        "all my bills hit at the same time , leaving me practically broke",
        "There was a laptop on sale but by the time I got to the store after work, it was sold out.",
        "I am very sad my best friend didn't come to my wedding.",
        "I was so let down at work the other day.  I was expecting to get a large bonus, but actually received next to nothing!",
        "I was looking forward to eating cake when I got home, but turns out someone ate it.",
        "My mom and grandma were supposed to come visit and backed out at the last minute.",
        "I preordered a New Tesla 3 last fall and have still yet to be contacted about when we will get it.  Tesla is such a let down for us right now!",
        "A guy cut us off in the car today and almost made us get in a car accident. I don't understand why people can't just try to drive to not kill others. It's not a joke.",
        "I didn't ask the girl I like to the Prom and I really wish I had.",
        "I planned for a great vacation, then someone at work got sick so I couldn't go. ",
        "I felt a little let down when I had to leave work ",
        "I was saddenned to see Lebron Go",
        "There was supposed to be a party this weekend, but it got cancelled.",
        "I was sad when my brother missed my birthday. I wanted him there",
        "I was supposed to be going on vacation, but one of my coworkers quit suddenly.",
        "I can't believe I am still going to court. My ex is the worst.",
        "I can't believe I am allergic to cats.",
        "I got demoted at work last week.  I feel really upset about the situation.",
        "i was not happy when i couldnt leave work on time",
        "I was expecting so much more from the movie but it sucked! Never again am I having my expectations so high for a movie..",
        "Once I planned an entire trip, went to book the flight and it was sold out.  All of the other flights were double the price of what I was going to book so I was unable to go.",
        "I felt sad when I found out that my friend had crashed my car. It was a pretty new car and then kablam, crashed..",
        "I bought new flavor of coffee today from Starbucks. I was so shocked at how bad it was. I'm never going to try a new coffee flavor.",
        "I have a crush on this person, and I dont know if they like me, and I dont want to ask and be rejected.",
        "When I didn't make the AAA baseball team, I had tried to hard all year. I got cut in the beginning.",
        "I had booked a trip to Paris for me and my spouse but she fell and broke her leg about 6 weeks before we were supposed to go. We had to postpone for 6 months. ",
        "I saw the new Jurassic Park movie the other day.  It was such a let down for me. ",
        "I bought a lottery ticket the other day. I was so confident I was going to hit the jackpot. I was crushed when I found out I didn't win!",
        "I had to cancel my Labor Day vacation because I have to work.  I'm very disappointed.",
        "I thought I won a lot of money in a lottery, but I was just reading the ticket wrong.",
        "My friend decided to lie about cheating with another girl when he was confronted with clear evidence. It made me sad to know that I'm friends with some people like that",
        " I applied for a job that would allow me to work at home because I suffer from Lupus. I didn't end up getting it so its a bummer.",
        "i was saddened when i couldnt get out of work on time",
        "I was sad with myself when I quit the basketball team. I just thought I would last logner",
        "I was sad when my team lost last week. I wanted them to win so much",
        "I was hoping to go out with my friend's this weekend, but it was raining all weekend.",
        "My daughter stole liquor from my cabinent",
        "My out-of-town relatives are visiting, and there was on relative whom I really enjoy speaking with, that I didn't get to hang out with much while they were here. I won't get to seem them for a while, so it kind of stinks we didn't make the most of our time this weekend.",
        "I cooked a meal for family and it came out horribly.",
        "My high school friends decided to gather and have dinner together. They did not even bother to invite me",
        "I can't afford the dress I want for a wedding.",
        "I am sad that someone I know chooses to not take ahold of their life and have a better one. They continue to just destroy it and it's very hard to see when so many would kill to have their life.",
        "I've been applying for new jobs but, I haven't found one yet",
        "I always forget my password to important sites. I try to use the same thing but I always end up resetting and having to use something else.",
        "I had plans to go see a new movie with my sister but she had to cancel. I was really looking forward to our night out.",
        "I am disappointed by Nintendo, they announced a direct but only for one game, when they usually announce many new ones",
        "I was disappointed in the new Mario Tennis game, but it was not the biggest letdown",
        "I was very much confident about my career earlier. After a few years of my degree, I'll lose the hope.",
        "My a/c went out and I called a repairman. He was not able to fix the problem.",
        "My favorite pizza joint went out of business.  I am so angry about it.",
        "I asked my brother to bring me a gift from his trip. He didn't bring anything.",
        "My sister stole the money from my wallet.  I am so mad at her!",
        "I studied really hard for an exam and felt prepared for it when it was time to take it. When I got the exam back I did worse that I expected to.",
        "I got very upset when France won the world cup. Croatia should have won!",
        "My friend recommended me a restaurant. I went with my wife to try it. The food was terrible.",
        "I wanted to go to the beach this summer, but I'm not going to get off work like I thought.",
        "i went out to my garden and found my tomato plants had blossom end rot",
        "I was hoping to get my water heater fixed today. The plumber never showed up.",
        "My mother promised she would see harry potter with me.",
        "i felt disappointed when my favorite restraunt was closed",
        "I told my kids to clean while I was gone and the house looked worse than before I left",
        "My dog pooped on my prized family heirloom. I was so sad.",
        "My cat vomited on my shoes the other day",
        "On my tenth birthday, I was expecting to receive a new bike. However, all I got was a lousy pair of socks ",
        "I thought i got a job but didnt",
        "I really wanted to get an A in this one engineering class that I was in. Instead I got a C and felt quite bad about it.",
        "I was pretty sad when my friend canceled on me last weekend. I was looking forward to hanging out",
        "I'm not able to go to Disney World.",
        "I was pretty sad when a girl canceled out date last week. I was looking forward to it",
        "I am so angry against my manager. I was expecting to go with him in work trip to New York but he went alone. I had him in high esteem before.",
        "Someone ran into my car.",
        "when my child lied to me ",
        "My friends canceled my birthday dinner.",
        "I always have the highest hopes for my boyfriend and his work. When he found out that they weren't going to give him a raise because he left early too many days, I was extremely disappointed. ",
        "I interviewed for a new job but, didnt get an offer.",
        "My daughter failed an exam and tried to hide it from me. I am so upset",
        "i hate my cats pee on the carpet, the smell is so hard to remove",
        "I was sad when I didnt earn the promotion. I thought I was the more qualified candidate",
        "I found out that the vacation I planned for had to be cancelled. My friend got sick and is not able to go with me.",
        "I am very upset today. The work raise that I been working on was taken away from me. By my arch enemy worker colleague!",
        "when i went to the store and they didnt have the ice cream i had been wanting ",
        "I found out that after 10 years at my company, they're laying me off indefinitely.",
        "I applied for my dream job last week. I just found out today that I did not get it.",
        "Recently I had a meeting at work where I discovered that someone else's decisions caused me to have a heavier work load.  It was very disappointing.",
        "the braves had a big series this week, and started off with a loss",
        "I was disappointed to hear a very close friend of mine from work is switching his shifts.  We won't work together anymore.",
        "i was hoping to be able to go visit family soon but i don't think it's going to happen",
        "My daughter wasted her plate of spaghetti all over the rug. She was pretending to be a waitress",
        "MY best friend lied to me the other day. She didn't invite me out with her friends",
        "i ordered pizza with my husband and it was totally underwhelming",
        "I am basking in my new found love even though my parent seem to see things differently",
        "I finally got around to watching the Black Panther movie.  It was a real let down for me I I don't get what all the hype was about.",
        "it was disappointing when i didnt get the job i applied for ",
        "Upset with my neighbor who used to like animals..and IDK if he is on drugs or has a mental illness but he acted like he was going to hit the dog I had to rescue off his porch...He balled his fists and I had to run over there and get her.",
        "When I didn't get the promotion that I had worked hard for, I felt this way.",
        "I was in the middle of golf and it started hailing.  I could not finish my round",
        "I was sad when my brother canceled on me last week. He was busy",
        "My brother was supposed to help me with my chores. He didn't.",
        "I always though my father would come home.",
        "Super upset with a company I thought was trustworthy.",
        "When my employer lied. ",
        "Once I planned a trip to see the solar eclipse with a friend. The day before we planned on leaving my friend said she couldn't get off of work. I ended up having to watch it on TV.",
        "I studied really hard for my final. I thought I passed but ended up failing. Now I have to take it in the summer.",
        "I was hoping to go to the park with my daughter. I hurt my foot and couldn't go.",
        "I expect a lot more from my friends.  They're intelligent and highly capable people...but I feel like they're not living up to their full potential",
        "every week i have a laundry list of things i need to get when i get paid. then pay day comes and it's gone in a second.",
        "I lost my favorite pocket knife",
        "I cooked myself a nice plate of eggs and ham and when I added cheese on top I didn't notice the cheese had gone bad.",
        "something i ordered online didnt fit me ",
        "I was in line for a promotion at work but i just found that I didnt get it. I feel quite sad",
        "I had tickets to play, but they canceled because the actress got sick.",
        "I felt this way when I did not get the promotion at work that I worked so hard for.",
        "came home to find my leftovers gone",
        "My son stole 50 cookies from the cookie jar tonight. His behavior really let me down.",
        "I lost my favorite shirt.",
        "I am not happy I didn't get to buy a new car.",
        "Last month, I got C in one of the important exams. I was every upset on myself.",
        "My dad was supposed to com and hang out with my kids and I this week. He didn't show up again.",
        "I never won the lottery.",
        "Me and this girl on Tinder were going really steady. Then out of the blue she flat out ghosted me.",
        "I was let down when my friends didn't come to my birthday party.",
        "I really was let down when my Dad forgot to pick me up from school.",
        "I was disappointed once when I had been promised a boat trip but then couldn't go because nobody had a license to drive the boat.",
        "i ordered something online and didnt get what was ordered",
        "My son dropped out of college ",
        "My daughter doesnt attend her classes",
        "I am sad ACDC will be touring this year.",
        "i was sad when i couldnt leave work early",
        "I got a hamburger earlier and they forgot to put cheese on it.  I was so upset about it.",
        "My doctor made wrong diagnosis multiple time. I can't trust him anymore.",
        "My friend canceled on me for a concert last minute.",
        "I was helping my brother study for his final exam. He did study diligiently every day with me. But then when he actually took the test he failed it! I was really upset withhim",
        "I got to work the other day all excited to work with my friend.  Turns out he got moved somewhere else at the last minute.",
        "I gambled away a large chunk of money my grandmother left to me when she died. I thought I could put down most of it and double it, and pay for my college. I thought it was a sure thing, and now I have none of it.",
        "I was recently talking to a loan officer about getting pre-approved to buy a home.  I was hoping this person would be great, as my realtor highly recommended them.  I was disappointed that the meeting didn't go well. ",
        "I'm pretty laid back.  The only time I'll be upset at someone is if they talk a big game but don't live up to it",
        "I ran out of my favorite makeup and can't afford to buy more.",
        "I was counting on a loan from  the bank and I just found out I cant get it.",
        "My son just is 17 and a junior in high school. He just told me of his plans to drop out of school.",
        "I don't know why some people waste their talents and life. They complain when they have things good and still aren't happy when it's bad?",
        "I had a really great job interview. I thought I did well but they called and said I didnt get the job.",
        "I didn't get selected for a leadership training class at work.  I feel so let down by my work!",
        "My family and I were finally getting to go on vacation for the first time in 5 years, but we had to cancel because we all got horribly sick.",
        "I'm pretty bummed how my cake turned out, I had high hopes for it.",
        "I was excited about taking a weekend trip with my boyfriend, but we had to cancel at the last minute. I'm pretty bummed about it.",
        "I was supposed to go to Busch Gardens last weekend , but it was raining and we had to cancel.",
        "I studied really hard for my test last week. I found out today that I failed.",
        "I was supposed to go on a trip over the weekend, but I didn't go. I missed my plane.",
        "It was a bad weekend. My girlfriend broke up with me",
        "I was a little down over the weekend. A girl canceled our date",
        "Sad that people have to make others days crappy. Why can't there just be peace?",
        "I am upset with Nintendo recently, they have not had a direct in awhile",
        "Got pizza and the toppings were really sparse.",
        "i played in a cornhole tournament over the weekend. i had a really good feeling about it. unfortunately we didnt win.",
        "I was going to have dinner with friends today, but I was stuck at work.",
        "My girlfriend said no, when I asked her to marry me.",
        "We were supposed to go to the beach, but it's raining all weekend.",
        "I was a little sad when i didnt win the lottery yesterday",
        "The hot dog I got doesn't taste as good as it used to.",
        "i was sad when i didnt win the lottery",
        "MY daughter had me buy the supplies she wanted and not the ones on the school list. I can't believe they did that.",
        "I overslept on my kids first day. I feel terrible",
        "My son cheated on his test yesterday. Never been so let down in my life.",
        "I lost my credit card this morning and someone charged 100 dollars on it.  I am so upset.",
        "I've been waiting a long time for our church to be able to hire me as the admin.  Unfortunately they still haven't been able to do so.",
        "I am sad I didn't get to see Taylor Swift in concert.",
        "I didnt ge ta job I wanted",
        "I had to take a licensing exam for the state. I thought it was going to be super easy so I didn't study at all. I ended up failing the test and feeling very frustrated with myself because of my lack of efforts.",
        "when my son lied to me ",
        "My close friend promised me to meet last weekend to have a dinner together. But after calling him several times, he did not respond to me or called me back at all",
        "My work wouldn't give me the bonus that was promised.",
        "I thought I would get to meet my brother for lunch today. He had to cancel at the last minute, which made me sad.",
        "was so unhappy the cavs did not win the finals last year",
        "It has not been so hot this summer, i wanted real hot weather to go to the beach",
        "I was disappointed with some coworkers lately.",
        "I didnt win the lottery last night. I feel so let down",
        "I found my daughter sneaking on her computer late last night. I have warned her about that",
        "I went on a job interview where I thought I did really well. They called me today to tell me I did not get the job.",
        "I wish I could have visited my family this weekend. But I have a big project to work on.",
        "Last weekend my friends and I went away on holiday and two of them got belligerent drunk and completely ruined the night.",
        "I'm upset that my kids don't listen to me.",
        "I bought headphone cords and didn't realize how short they were.",
        "My daughter has been lying to me for a year about my old tablet. I know she lost it somewhere but she won't admit it",
        "We were going to the lake for a weekend getaway since we haven't had some downtime in forever and then we got sick instead. ",
        "i was sad when i didnt get the day off ",
        "I took a thrid trip to the grocery store hoping to find good clearance items this week like I normally do. However I didn't find anything! Super disappointed. It's not been a good week to get clearance stuff.",
        "I worked all day and came home to the whole house a wreck.  My husband had the whole month off and he didn't clean one bit of the house or make dinner.  ",
        "I felt this way when I didn't get the promotion at work that I worked so hard for.",
        "So I bought a lotto ticket this week.  And yet again, I lost",
        "the chargers are poised to have a great season, yet we keep having injuries during the preseason",
        "I ordered a new watch on the Shopping Channel that looked amazing. It looked like real gold and had diamonds inlaid in it. When it arrived it looked completely different and looked cheap.",
        "I had a tire blow out on my a few weeks ago on my way to work. I got reprimanded for being late.",
        "I recently noticed how much weight I gained over the past year and I just feel like I really let myself down.",
        "I did't get the promotion at work that I worked so hard for.",
        "I seen an awesome sale for Black Friday last year, and was just about to buy a new gaming system. When I put in the online shopping cart it said they were all sold out. I wanted that system so bad!",
        "I felt this way when I didn't get a promotion at work.",
        "if the braves dont win it all this year im going to be bummed",
        "I expected a good hike for this year. but i was let down by my manager",
        "Someone hit me in the mouth and I lost a tooth.  I am so upset over it.",
        "We were ready to buy the house from my omther in law, but we had to wait another year because she signed a lease.",
        "I found out my son has been bullying kids at school.",
        "I should have gone to Florida",
        "It took an hour for my pizza to get here.  I am so upset by the slow service.",
        "I constantly feel disappointed at myself. ",
        "I bought a lottery ticket last week thinking I would win big.  Needless to say I am still working today.",
        "The lottery ticket I bought last night did not win.",
        "i was sad when i couldnt go home on time",
        "We were supposed to go swimming today. The weather was bad though so we canceled",
        "i really wanted to get pregnant but month after month it didn't happen",
        "I was a little sad with the weather today. We had to cancel plans",
        "I didn't get a job I interviewed for.",
        "I found out a very simple part to my lawn mower is VERY expensive from all the mower parts places. I was angry because it is literally 5 times the price that it is online from all kinds of stores. I just don't get why they are charging $65 for a little plastic cord???",
        "i was saddened to see i didnt win the lottery",
        "i hoped that my supervisor or director would acknowledge my hard work",
        "My brother is not coming home this weekend. I am a little upset about it",
        "I really wanted to go to the waterpark today. We couldn't go because it was thunderstorming.",
        "I was really looking forward to camping, but now it is going to rain, so I won't go.",
        "When I got my mark back on the english test. I had scored a 40%.",
        "My pet dog died soul. It feels like i lost my soul",
        "I was counting on my brother to pick me up from school, he never showed.",
        "I was expecting a higher grade on my last exam, but unfortunately it was lower than I had hoped.",
        "my daughter failed me ",
        "My favorite football team lost yesterday.  I am so upset about it.",
        "I was hoping to go to this wonderful writing contest. I signed up and everything. Then circumstances changed and I had to cancel. I felt so bad that I wouldn't be able to go. ",
        "I was going to try to have a party for my sister.  It turned out that my dad wasn't going to be able to make it as he was out of town.",
        "I had my air and heating guy come over for a routine check on the system.  He told me a need a new air conditiioner",
        "I was going to make breakfast and dropped the egg carton on accident... all the eggs broke. ",
        "I was let down in trying to pay a bill today.",
        "My brother got married to a wrong person",
        "Today was supposed to be a fun day with the family.  Unfortunately our plans were changed because my husband is sick.",
        "I recently bought myself a new jacket I wanted for a while only to get it in person and not like it.",
        "I'm disappointed in my new car, it has already broken down twice and now it's in the shop!",
        "I'm disappointed with how my garden is turning out, everything is either dying or being eaten by rabbits.",
        "I requested money for my hospital bill,i was promised ,but on getting there that fateful day,i was no happy!",
        "I was expecting my favorite show would get renewed. I just heard it was cancelled. I am so upset. Now I have nothing to watch.",
        "I really wish I had been able to finish that project yesterday.",
        "I really thought the new Star Wars movies would better but they are not. They are so aweful!",
        "I thought I was going to get this really great job after the interview, but they called me to tell me they had hired someone else instead.",
        "I planned a picnic with a friend and it rained. I was upset that it ruined our plans.",
        "I really wanted to get an A in physics. I was pretty sad when I got a C instead.",
        "I could not get my lawn mower to work. I have to order a bunch of parts now and it's a bummer!",
        "I was disappointed when i got fired from a project in my company",
        "My second vacuum I ordered from a company works good but the metal pole is not working right. Super upset as this is the second issue I have had.",
        "Girl I asked out said \"no\"",
        "I tried a keto pizza yesterday and it was awful. It tastes like a THICK corn flour tortilla. Just really gross! Sad as it cost a pretty penny even on clearance",
        "I had an interview at a job I was excited about, but they never responded after the interview so I don't think I got it.",
        "i was a little sad when i couldnt get off from work last week",
        "I wish the weekend had been longer.",
        "when i spilled my coffee ",
        "I expect my son to get pass in the exam. But he didn't. I feel bad for him.",
        "I'm an aspiring actor and I have yet to land any large roles. I've been grinding for two years now.",
        "I just got word that I did not get the job I really wanted. I thought the interview went well too.",
        "When I was a kid, once or twice they had these people come to the school to sell yoyos. I saved up to buy a really expensive fancy one, and low and behold; it was just a yoyo.",
        "I'm disappointed with my new tablet I got, it bugs and restarts like every 30 minutes.  Might need to take it back.",
        "i was sad when i had to miss my sons game",
        "the cops were looking for my brother yesterday",
        "I was hoping to have meatloaf for dinner. My kids wanted chicken instead so I didn't get to have the meatloaf.",
        "When I got a bad mark on my math test. I got a 40%.",
        "I tried to get concert tickets to see my favorite band. I was to late and they sold out. Im a little bummed about that at the moment.",
        "I might not make a trip at the end of the month. It makes me feel pretty bad",
        "Last month, I was very upset because of my ex girlfriend. She left me for another guy.",
        "When I was cut from the soccer club. It was my final year of being eligible.",
        "I cant believe my daughter is already procrastinating. school just started",
        "I went to the grocery store and they were out of my favorite cereal.  I was quite upset about it.",
        "My best friend left me alone at the bar while I was drunk. I expected her to call a cab and make sure I got home safely, but instead I was left alone with a random stranger.",
        "I was so let down.  I did not get any presents for my birthday.",
        "We had planned on a beach vacation this year, but it was not to be.  Unfortunately the condo we rented had a fire and burned to the ground and we didn't have time to find another place.",
        "My dog pooped on the rug today. Never have I been so let down.",
        "My son stole a car from an elderly man today. Never have I been so let down.",
        "I'm disappointed in how my brownies turned out.  They are so mushy!",
        "I had bought several raffle tickets at work to win a gift card to a restaurant, but I lost out by one number! I felt kinda sad over it.",
        "cold french fries",
        "I expected a hike in my package. But I didn't get it. It makes me sad.",
        "Sad that my partner is not making as much progress as he should be.",
        "The garbage men had trash strewn all over and they just left it- It fell out apparently when they were throwing trash in the truck. They just don't care about their job.",
        "when i didnt get to go with my family ",
        "I was trying to go a week without eating any sweets, to improve my eating habits. Didn't even make it three days before I started indulging. It gets nerve-wracking. Maybe I'm putting too much pressure on it.",
        "i just spend 470$ to fix my car and it's broken again",
        "I was really counting on that check in the mail today.",
        "I was so sad when I heard my favorite TV show was canceled. I don't have anything to watch now. I hate when they do that.",
        "I spent a good bit of money upgrading my computer and for a new game I was excited for. The game turned out to be pretty boring.",
        "I just received a call from the job I really wanted. They said they went with a different candidate. ",
        "I thought my kid was doing great in school. Then I found out he failed one of his classes. He really upset me by not telling me he was having trouble.",
        "I went on a job interview last week. I thought it went really well but I just found out I did not get the job.",
        "When I went home, my dog didn't recognize me anymore",
        "I was supposed to get a new car this week, but the dealership called and told me that the car wouldnt be here in time and I wont be able to get it",
        "So we're moving soon, but our chicken coop isn't gonna make it into the trailer. : (",
        "One time, I was given a drink to try out and it looked red so I thought it was a strawberry shake. But it turned out to be a vegetable drink.",
        "I got an ice cream cake for my birthday and it was really good. It was rather big so we had plenty left over we kept in the freezer. My husband took it out to defrost it enough to cut it while I wasn't home and totally forgot about it and it all melted. I was upset.",
        "i was sad when i didnt get this weekend off",
        "I'm always bummed when I use a clever one-liner from old pop lyrics...and nobody gets it",
        "i was sad when i couldnt get the day off",
        "I was hoping to meet my friend this weekend that I hadn't seen in a long time, but he had to cancel suddenly.",
        "My electric bill was 350 dollars this month.  I am so upset of how expensive it is.",
        "I took a test the other day and thought I did really well. I got my grade back today and I failed.",
        "The weather for tomorrow has me a little down. Its going to rain and I wanted to go hiking",
        "I went on a date tonight. I was a little upset with how it turned out",
        "I was supposed to go out to dinner with my family tonight, but the restaurant was closed down.",
        "I'm upset I didn't get the promotion at work I wanted",
        "I wanted to buy some egg rolls from the store, but they no longer sell my favorite ones.",
        "my friend get back with her ex-boyfriend its really sad",
        "I don't like people that take the HOA too seriously",
        "I did not get the promotion this year. I feel down",
        "After all this physical therapy I still didnt have my foot strength.",
        "I can't believe I dropped my phone on the way to going to buy a phone cover.... I hadn't even had it for more than 2 days",
        "The way our major parties are behaving toward each other is very hopeless picture to imagine. So sad for our country's political discourse",
        "I did not get to go to out with my friends last night. I was too busy so I had to stay home instead",
        "I  woke up this morning and found my truck had a flat tire.",
        "I purchased a washer/dryer combo at Lowe's and it came with dents",
        "My best friend didn't invite me on a road trip last weekend. They went to a nice beach and I have no idea why he didn't call me.",
        "I couldnt believe that I asked my girlfriend to marry me and she said no.  I was heartbroken",
        "I rented Thor: Ragnarok recently and was really let down.  It just wasn't what I expected.",
        "My friend won a contest at work that we were both going for.  he won a free trip.  i wish i won",
        "Last weekend I had a plan to go to the springs with a couple of my friends and camp out. We ended up not going at all because the weather got really bad. I was really upset because everyone took off work and we probably wont be able to all get together like that again this summer.",
        "I asked this girl that I liked out on a date and she said no.  I was sad that it didnt work out",
        "my boss has been taking advantage of me being a hard worker",
        "I meet with my boss today thinking I was getting a raise. Turns out they just wanted to talk with me about a client. ",
        "i really want to lose weight but keep just binge eating.",
        "The garbage collector did not take my trash today.  I am so upset about it.",
        "My cat ran away from my house after school. I felt lost without her.",
        "it makes me feel so sad when i fail at something",
        "Before signing the contract, the landlord made promises that he will do some reparations but he never kept his word.",
        "When I didn't make the high school hockey team. It was my senior year.",
        "The time I got chocolate cake instead of vanilla cake on my birthday. I hate chocolate.",
        "I was up for promotion this year. I lost out to another coworker. I really though I had it.",
        "We were supposed to go on a mini-vacation for labor day but we had to cancel it.  My mother in law is sick and in the hospital and my husband doesn't want to leave her.",
        "I had been told at work i w as likely to get a promotion in the next few weeks. It has been almost two months now and I am not happy",
        "My favorite restaurant closed down. I'd go so often after work.",
        "We were supposed to go out of town for labor day.  But we had to cancel, our daughter needs surgery on her ankle.  She fell off her horse.",
        "My son cheated on his math exam today. I've never felt so let down.",
        "In the past month, i had three interviews for a job. None has called me back. I think i am just an incapable individual",
        "I worked all day on slow cooking a pot of pit beef and it tastes awful! I don't even know what I did wrong I followed all the directions.",
        "I really though I was going to be accepted in med school, but I wasn't, and now I don't know what I am going to do with my life.",
        "I woke up this morning to find that my well trained dog pooped on the carpet sometime in the night. He must have really had to go!",
        "My friend moved away to Brazil. I was really hoping she'd stay here.",
        "I tried a new slushie flavor tonight. It sounded very good but it wasn't. Such a letdown.",
        "I saw Stephen King on his book tour last September for his new novel, The Outsiders. He was giving away 100 signed books but they were just randomly handed out. I unfortunately didn't get one which was a bummer.",
        "Years ago, we were trying to buy our first house and the financing fell through.  We had to switch lenders and it took another six months to find a place.",
        "I found out I didn't get a job I interviewed for.",
        "My son broke a very special toy that his pawpaw gave him.",
        "My friend had two dogs. When she moved for a job, she just took them to a shelter instead of taking them with her or trying to find homes for them.",
        "This sounds weird but I've been training my cats to do tricks and to go to the bathroom in a toilet. At first they took to it but now theyre devolving back to their old tricks. It's getting messy.",
        "I was so sad growing up. I always wanted a horse, but never got one. ",
        "I felt sad that I was not asked to be the bridesmaid at a close friends wedding",
        "In the 8th grade, my friend and I sold the most chocolate bars in our entire school. Our prize ultimately ended up being a pair of New Balance shoes. $1150 in sales, for a pair of $25 kids shoes, each.  ",
        "I am so disappointed in myself, I promised I would help my mom buy groceries and completely forgot! ",
        "I proposed to my girlfriend and she said no. absolutely disappointing and devastating",
        "I did not get the promotion I wanted",
        "I had finally worked up enough courage to go get my hair colored professional. I wanted a light brown and it ended up being so blonde that I was embarrased to even leave the shop.",
        "I found out my son cheated on all of his highschool homework. ever single thing",
        "I applied for a loan to buy a house from the bank but didn't get it. This is so disappointing.",
        "I asked one of my longest and best friends to be in my wedding. She agreed even though we live so far away. Suddenly she dropped off the face of the Earth and I haven't heard a word from her since. ",
        "I tried using a new grocery shopping service call Shipt.  I was excited at how it was going to make my life easier.  But they arrived late and didn't get the right things that I ordered.",
        "I was so excited to see a brand new movie that just came out, then my babysitter cancelled and I couldn't go.",
        "I ordered a sandwich from KFC the other day and I told them no pickles. When I bite into it there are pickles.",
        "I ordered a pizza last night and realized they forgot to put the bacon on the pizza. I was not happy.",
        "I took my car into get serviced and it ended up costing twice what I had budgeted. I'm going to be short again this month. ",
        "I wanted to go to Georgia but my trip was cancelled",
        "I'm always excited when Taco Bell has a new menu item, but I was a little let down buy the nacho fries.",
        "I am frustrated when I try to get online but my wifi is not working or it works so slow that I can not open any video.",
        "I thought we we're going to be able to close on a new house recently but it didn't work out.",
        "My close friend said he couldn't visit us for thanksgiving last year. It was such a let down for the whole family.",
        "I didn't get the promotion I was going for, even though my boss said it was virtually guaranteed.  I went through three different interviews over two months.",
        "I went outside to harvest vegetables from my garden. I discovered that animals had gotten to them first.",
        "my close friend stole from me, so upset",
        "I was not happy about the Dallas Cowboys 2017 season.  I was hopeful they would have a storybook season. But non football related situations stopped this from happening. ",
        "I bought a 50-50 raffle ticket at the fair the other night. My number was one away from the winning number.",
        " I had been craving krystals for a while now. And when I looked up how to get to one, I realized it was a local thing and the nearest was hundreds of miles away.",
        "My dog actually bit someone the other day.",
        "My best friend from childhood came into town last week.  We were supposed to get together for dinner one night, but she bailed at the last minute.",
        "I found out I did not get the promotion at work today. im really bummed about it",
        "ive been waiting on a call that never came",
        "I applied for a promotion at my job but didnt receive it.",
        "I went on a game show once. I hoped to win a lot of money! Though I had fun, I ended up losing and just got the consolation prize. ",
        "My mother was trying to help my father and she ended up hurting him more than helping.",
        "My son was charged with possession of drugs.",
        "My roommate promised he'd clean up his half of the apartment while I was away on vacation. I come back to the same old, same old. Dirty, smelly, and uninhabitable. Wish I didn't have to be stuck with him for another year.",
        "I was going on a weekend to the lake but ended up getting sick. ",
        "I got a bad mark back on my math test. I had studied hard.",
        "I tried following a recipe for vegan cookies and they turned out horribly.",
        "I'm very disappointed in the pizza I ordered.  It was pretty much burnt with no toppings!",
        "My old dog and cat keep fighting",
        "When I found out my son decided to drop out of college.",
        "I accidentally bounced a check today.  I am so upset I did that.",
        "I am not happy with how the Eagles played yesterday, they lost to the browns of all teams",
        "I paid a lot of money for this new printer and it doesn't work",
        "I tried to buy a newspaper this morning but it was sold out. I am so upset I couldn't get one.",
        "I was so let down by a film I watched recently.",
        "my friend cancelled on me last minute",
        "got the wrong order",
        "in my self for failing so hard",
        "I wanted a friend to help me to move to my new apartment but he didn't help.",
        "I was really pulling for England during the world cup. Bummer they lost.",
        "Terrible day today weather wise.  Softball tournament is cancelled due to the rain.",
        "I invested some money I had saved up for years in the stock market. I lost it all in one week.",
        "I thought my best friend was going to be able to visit me this summer, but it turns out he can't take the time off from work right now. ",
        "I was promised a cuddly bear from build a bear and then my friend backed out.",
        "My son had been doing really well in school. Lately he has been slacking off and not turning stuff in.",
        "I failed my accounting class over the summer. I now have to retake it setting me back a little. Im a little bummed out.",
        "I went to the casino to eat yesterday and got so caught up in gambling I didnt get a chance",
        "I watched the new Black Panther movie last night.  I was a little let down by the story though.  It needed more development.",
        "I felt let down by the Patriots when they lost to the Eagles...but I had to give them props since they were the underdogs",
        "My kid lied to me yesterday.",
        "I went to the gym today to register with a promotion were I was supposed to get 1 free month.  But it turned out the promotion was expired.",
        "I recently found out my grandfather has cancer. I was so sad to hear the news. He is a great guy and doesn't deserve it.",
        "I was waiting for a friend to bring some food to the party and they never showed up. I was really sad and we had to go get it ourselves",
        "I felt this way when I didn't get the big promotion at work I worked hard for. ",
        "I saw a movie the other day that i was stoked about. it wasnt good at all",
        "I went to go get a snack from the kitchen and realized my kids ate them all.",
        "My friend went back to drugs.",
        "I had to cancel on my friend tonight. It made me feel bad to do it but I was tired",
        "It was my birthday and i just knew my dad was gonna get me a car for my 16th. I couldnt believe it when he got me a mercedes.  what a piece of crap, I wanted a Mclaren",
        "I got a bad mark on my math test. I should have studied harder.",
        "I'm a little sad that Summer's almost over.",
        "i went to see this play and it was kinda bad. we did no enjoy it at all",
        "My teenager son almost got kicked out of school when he was 16, for getting caught with tobacco. It was his 5th offense"
    ]
}