{
    "threshold": 0.8,
    "seed": [
        "when i had to say goodbye to my dad",
        " I was devastated when the Falcons blew the Super Bowl.",
        "I let my cat out for the evening , the first time I left her outside at night and she didn't come back. ",
        "i was devastated when my favorite world cup team was knocked out of the tournament. ",
        "When my grandmother passed away I was so sad. I was only 13 years old",
        "My dad accidentally got into rat poison and died.",
        "My car broke down when I was travelling to work and I missed a very important meeting regarding my promotion. I was devastated.",
        "I let my friend borrow my car last year and I got a call later that night that he crashed it and totaled it, man I was crushed by that experience.",
        "One night, i hugged my wife and told her i loved her.  I went to work and got a big raise.  I rushed home to tell her.  When i got home, all of the furniture, my wife and kids were gone.",
        "My friend who I grew up with recently died. It was tragic and unexpected",
        "My apartment was robbed..",
        "My daughters little dog passed away about 4 months ago.  She was only 6 years old, but had an autoimmune disease and it started attacking her red blood cells.",
        "I loved watching \"Sons of Anarchy\" and had only got through Season 2...when my friend ruined everything and said they were all gonna die at the end.  I was sad and horrified",
        "When my mother passed away randomly, it really hurt me.",
        "I remember when I got into a really big fight with my roommate and she kicked me out and I had to move back into my parent's house.",
        "My Grandmother passed away and it was really hard.",
        "I am devasted.",
        "When i failed one of my college courses i felt so terrible",
        "I was planning to attend classes this summer. It broke my heart that they want me to pay 1000 out of pocket.",
        "I felt so upset because of the damage caused by the hurricane to my town last year",
        "I recall there was a time when great misfortune fell upon me - it actually happened this morning. I stubbed my toe when getting out of the shower and I was absolutely devastated that my toe's feeling were hurt ",
        "When I found out my aunt had a heart attack and died alone, it devastated me. I was not sure what to do with myself afterwards.",
        "After the house fire we had last year I took me and my family a long time to get back to normal, it was a very trying time",
        "I just ran out of financial aid for school. I don't know what I'm going to do.",
        "I was looking to adopt a dog and found one that I loved. By the time I was ready to adopt and get to the rescue shelter, somehow else had adopted the dog.",
        "When my relationship ended it was very hard.",
        "I am so upset.  I found out today that I did not get the job.",
        "When my aunt passed away, it was just bad. It was the worst thing to happen to me at that point",
        "My neighbor's house burn down. We can't find where the cats went.",
        "My father died after an illness and I felt as if I could not go on.",
        "A tree branch broke off the tree in our backyard yesterday during the storm. It hit our roof and I am just lost for words.",
        "I was shocked when Lebron left the Cavs again",
        "I am heartbroken that Lebron left for LA",
        "the day i lost my father ",
        "My 23 year old cat is missing. I have had her since I was a little kid. She has been gone for a week.",
        "My cat is sick, I don't know what to do.",
        "I lost over $10,000 in an investment.",
        "When my aunt passed away randomly, it hurt. It was just so random it killed me",
        "I was sad to see Lebron go to the Lakers",
        "I think I'm goin to be in school forever.",
        "My grandmother, who raised me, just passed away unexpectedly.  I don't know how to process this!",
        "Me and my sister were yelling at each other then my brother came up to us. He ended up telling us he found grandma dead on her bed downstairs.",
        "Promotion results came out today and I wasn't chosen for the new job.",
        "I was devastated to find out my cousin passed away in a tragic car accident.",
        "My friend's mom isn't doing too well.",
        "About four years ago, my apartment was robbed. I discovered the state of my apartment. Everything turn over, any object that had some value was taken. I was totaly destroyed.",
        "My car was broken into.",
        "One time I was doing a really important art project for a contest and I had put in 8 hours of work into my piece and then my mom ripped it.",
        "My laptop was destroyed when my toddler spilled water on it. I was so upset because I lost all of the baby photos that I had stored on it. ",
        "I just broke up with my boyfriend of 8 years. I am beyond distraught.",
        "I applied for a job online. I didn't get approved.",
        " I was devestated when I lost my grandmother, we were very close",
        "I was devestated when my grandmother passed away, i was unsure what to do with myself for a long time after",
        "My beloved tabby/calico mix cat, Callie, was out in our yard sunning and playing. A stray pit bull came into the yard, caught her and shook her like a rag doll, and killed her.",
        "My cat recently died. I had her since I was 5 years old. She was 23. I feel so lost and lonely without her.",
        " I just learned that I field my final exam. I was planning on taking the summer off but now I have to take the class over instead.",
        "I was driving the other day and a little turtle was in the road. I turned around and went back to get him before he got ran over and didn't make it. Ugh. He got hit and smashed that fast before I could get him",
        "when my dog died ",
        "My house flooded with all the rain!",
        "The first time I heard that Steve Irwin had died I couldn't believe it...he was like my childhood hero.  It was such a tragedy, the guy gave so much to the world ",
        "I was so sad when my mom passed away. I did not expect it",
        "I was so sad when my aunt passed away. It came out of no where",
        "My cat was run over by my uncle. He din't tell me until a week later.",
        "I bought a very difficult puzzle from my local hobby store, spent hours on building it only to drop it when I was about to put it in a frame. I was so dumbfounded",
        "My brand new car was hit in the parking lot.  The driver took off without leaving a note.",
        "I couldn't believe it when a rock bounced off the car in front of me and cracked my windshield. I am so frustrated at the moment.",
        "My friend was diagnosed with throat cancer last year. She didnt live long.",
        "Someone spray-painted my car last night, wrote some curse word. I have no idea why, since i have no enemies. I don't understand how people can treat others like that.",
        "I dropped my favorite coffee mug that was given to me by my grandmother who passed away.",
        "I can not believe my friend died last week.",
        "I cried for a week when I found out my wife has a miscarriage.",
        "My girlfriend broke up with me. I can't believe it, I'm so hurt.",
        "My car burned down in a fire. ",
        "when my daughter broke her tooth ",
        "My car burned down.",
        "I think I have a coyote or wolf running around my area. I think it killed a little beaver that lived near the creek  near my house.",
        "I was devestated when my grandmother passed away, I still am not over that",
        "when my car caught on fire",
        "When my grandmother passed away I destroyed.",
        "I recently suffered a miscarriage. It was the worst thing I've been through.",
        "I lost my friend in a car accident. It has been very sad news.",
        "I am so sad these days.",
        "My dog I've had since I was a kid died a few days ago. It really hurts to think about",
        "My neighbors chopped down a tree in my front yard while I was away from my house. I felt so angry and upset.",
        "We had a little chihuahua pup that had an auto-immune disease.  She had a great life for 6 years and then passed away a few months ago due to pancreatitis.",
        "I broke my ankle!",
        "My ex husband died last year and even though we were divorced I took it very hard because we were very close. ",
        "When I lost my dad, it really hurt me. It was just so random",
        "when i found out my dad died ",
        "I lost my wallet at the store yesterday. I go there all the time. I can't believe no one turnes it in.",
        "I was very sad to hear of my friends passing",
        "I yelled at my mom, because I was sleepy. I feel so bad.",
        "Our fence fell down. It's going to cost so much to get it fixed.",
        "I tried to get my estranged mom to speak to me, and she got mad and insulted me.",
        "I couldnt believe i didnt win the lottery yesterday!",
        "My dog passed away last month. I am so sad about it.",
        "My favorite horse, Gracie, died the other day. I've had her since I was a child so it's very hard to take.",
        "My pet hamster was eaten by a pit bull.  I can't handle this sadness.",
        "I was in complete shock to receive the news of the demise of a bosom friend",
        "There's a wild fire let loose in my areas ,it gutted several houses ,mine inclusive. It was ...",
        " i was crushed when i saw my dog had gotten out",
        "I am very sad these days.",
        "lost my cat whisker he was the best pet i have ever had ",
        "My wife and I decided to get a divorce.  I feel absolutely defeated and distraught because of it.",
        "MY favorite restaurant is closing this weekend. I am distraught!",
        "My son and I went to the beach and had a near death experience.  We almost drowned as we got sucked in to an under tow.",
        "I have been feeling really sad, recently lost my 23 year old niece.",
        "Our family reunion was a disaster this year.",
        "I lost all my money in my bank account due to fraud. I am so broken...",
        " I was in despair that someone ruined everything over nothing. They continue to ruin their life and everyone's around them. Self destruct.",
        "My aunt died.",
        "I saved up my money for a long time to buy my motorcycle. I was able to get it after 4 years of saving. I crashed it last week after only 2 weeks of owning it.",
        "i was schocked when i had to go home early",
        "I was totaly destroyed when I found that my wife took all the money that was in the bank account and left me.",
        "I was shocked when i wasnt approved for time off the other day",
        "My laptop broke, and I lost all the information on it.",
        "I've owned 3 birds in the past 10 years and my 3rd bird just died last night. I didn't realize how much it would crush me. They were my buddies.",
        "I found my gold fish floating at the top of the fish tank dead last week.  I am absolutely hurt over it.",
        "I met a girl on Tinder and we seemed really into each other. We started dating shortly after and then she dumped me like 4 days in.",
        "I am so sad that my uncle died.",
        "I found out that my favorite tv show got cancelled.  I am so sad it happened.",
        "I felt so bad when my friend's new puppy passed away. He got really sick and died within a few days.",
        "My dog since childhood died a few days ago. It was heartbreaking, and it made me very sad",
        "Two weeks ago, I found my home totally flooded. I felt totally destroyed.",
        "i was crushed when i wasnt able to leave work the other day",
        "I was devestated when my grandmother passed away, that was a very sad time for me",
        "i was shocked when i couldnt go to the game i bought tickets for",
        "My grandmother died and it has really taken a toll on our family.",
        "There was a storm last night and a tree fell onto my roof. I think I need to get the roof re-shingled and I am lost for words...",
        "I was driving along today. And then I crashed into a parked car!",
        "I was in a bad place when my dad died. I just felt lost",
        "my brother got sick and passed with no warning",
        "My hamster died when I was a child,  she was my best friend.",
        "I was so hurt when my aunt passed away. No one expected it",
        "I lost my ipad the other day. I can't believe it. I think it was stolen",
        "My mom lost her battle with cancer.",
        "My dog was ran over yesterday after sneaking outside.",
        "I found out that my girlfriend has been cheating on me.  I am so hurt right now.",
        "I have to put my dog down.",
        "When my grandmother passed away, I was so heartbroken, I was not old enough to be prepared for it",
        "On the day on September 11, 2001, Life was never the same after",
        "My friend died in a helicopter crash.",
        "When my grandmother passed away, I was devestated, I hated it so much",
        "I saw my ex-girlfriend on a date with my best friend.  I am so hurt right now.",
        "My new car was robbed last week during the night.",
        "Recently heard that my father was laid off from his job. He's retirement age anyway, but I felt bad for him, as that must have been, at the very least, slightly humiliating. He's been a hard worker for 40 years, and has done well to support the family. But I do worry for him in the short-term.",
        "After working at my job for over 2 decades, they're closing down.",
        "I dropped an entire bag of fresh shrimp on the ground today",
        "My sister was not paying attention and she let the dog run right past her and out the door. We can not find him and I don't know what to do!",
        "Me and my girlfriend at the time were really going steady. Then randomly she broke up with me and started dating this other guy.",
        "A flood hit my house. The entire house is destroyed now.",
        "I was so hurt when I heard my friend's puppy was stolen. I couldn't believe it.",
        "I really wanted my last relationship to work out. But instead she basically just ghosted me and moved on.",
        "I was devestated when my grandmother passed away, I was not prepared to deal with that",
        "when my house caught on fire. ",
        "I made plans for my dream vacation. I had been looking forward to this trip for over two years. I broke my leg and was unable to make the trip.",
        "There is always a fight when my family gets together. We aren't even having a big thanksgiving this year",
        "My storage unit burned down and I lost several precious momentos",
        "I had to put my dog down today.",
        "I just got laid off from my job! I am floored! This will destroy me!",
        "Last week I dropped my brand new phone. The glass cracked and now looks terrible. I was so upset about it.",
        "I could not find my favorite handkerchief that my grandfather gave me. I am afraid I lost it. It means so much to me since he has passed away.",
        "I can not believe Stan Mikita died.",
        "seeing all those fires in california is terrible",
        "I loss my grandfather. He was very sick",
        "My Grandma just passed away.  Its been a brutally tough time.",
        "I recently lost my pet turtle. I think he may have escaped my yard. I am so sad I miss him terribly!",
        "I was sad when my cat died. He was so sick",
        "My wife told yesterday that she doesn't love me anymore and she want a divorce. I felt totally destroyed.",
        "My softball team just lost the season championship by 1 run in extra innings.  I am so disappointed.",
        "I cried all night when I found out Trump won the election.",
        "Yesterday, I came home early and I discovered my wife cheating on me. I felt totally destroyed.",
        "Someone I know was nasty to me again after trying to build trust. It really just crushed me because it's again another chance they took advantage of.",
        "It really hurt me when my brother moved away. I could not handle it",
        "I dropped my moms anniversary cake on the way into the party. I had ordered it weeks agao",
        "It really hurt me when my parents got divorced. I never thought it would happen",
        "My car broke down right before I was about to go on a road trip. I took it to the garage and they said it will take weeks to get the right parts.",
        "I just found out my childhood dog had to be put down, I'm wrecked!",
        "I was pretty sad when my grand dad died. It was not expected",
        "I lost my grandmother's wedding ring.  I am so hurt about it.",
        "I made kimchi and it turned out pretty bad.",
        "My little pet bird accidentally flew out the window.",
        "My girlfriend dumped me today. I am so sad right now.",
        "I had an argument last week with my wife. She told me that she want to divorce and that I am not the father of our son. I felt destroyed.",
        "My brother got hit with a DUI the other night. His wife said that was the last straw, as she was tired of his drinking. She kicked him out and now he's living with me. I feel so terrible for everyone involved, especially because they have two kids.",
        "i was crushed when i didnt win the lottery",
        "My cildhoos puppy died of cancer.",
        "My father was recently in the hospital with a chronic heart failure. I thought he was going to die. Thankfully he pulled through and is recovering.",
        "MY best friend is leaving her job. We have worked together for ten years",
        "I found out in the last year that both of my parents have dementia.",
        "When the Las Vegas Shooting happened, I was so emotional and sad. I hate when stuff like that happens",
        "My pet cat passed away. She was 15 years old. I am very sad about it.",
        "I just lost my job. I've been working there for years and was so close to qualifying for retirement. I can't believe they did this after all these years.",
        "My cousin died in a car crash.",
        "i took a pregnancy test just to find out it was negative",
        "I was hurt a lot when I was passed up for a full time position I wanted at my company",
        "MY best friend is moving away. I can't believe it.",
        "I wrecked my car and have no way of fixing it. My life is over.",
        "I was heartbroken when my grandmother passed away, I did not know what to do",
        "I worked so hard on this project, but my professor said it was horrible but didn't want to fail me.",
        "My little sister didnt get accepted to college ",
        "I worked so hard this semester, but I overslept for my final exam.",
        "I rent with arnb to a young couple and I found my home totally destroyed. They even took a dump in the living room.",
        "my favorite Toy from my childhood broke.",
        "Someone was killed outside of my apartment once. IT was a hard thing to see",
        "We won the big match we had been preparing for.",
        "I can not believe my friend died in a car accident last week.",
        "A tornado went threw my house.",
        "I lost my favorite bracelet a few days ago... I have looked everywhere",
        "My wife is going to divorce me.  I am so sad about it.",
        "My sister got into a bad car accident.  I am so sad that it happened.",
        "food was ruined",
        "I was flying to see a relative, and my flight got delayed because of weather! Once I got on it and flew to the next airport, I missed my connection because of the first delay. Now I have to stay in the airport all alone, overnight, sleeping on the ground like a dog.",
        "I was planning on meeting up with my father for the first time in a few years since we had a falling out. We had a tentative meeting to see each other at the end of the week, but he's already canceled. ",
        "My heart is broke. My wife has left me.",
        "My sister just lost her baby at 18 weeks along.  We are all grieving and I'm trying to support her in any way I can.  Being a mother myself, I feel so depressed and sad for her.",
        "I thought I was going to get a raise at work for all the hard work ive been doing.  But now Im not and i dont know how im going to be able to afford some of my new bills",
        "I crashed my favorite classic car.  I've had it since I was 16.",
        "When my dog died last year, it killed me. It was so random",
        "I was pretty sad when my brother moved away. I was going to miss him",
        "I just bought a new $1000 computer and it crashed after the first week. I ordered it from a website in Japan and it will cost a lot to return it. ",
        "Asked my crush out, and she said no.",
        "I found a text message on my wife phone. She is cheating on me.",
        "My pet rock rolled away yesterday. Never have been so distraught in my life.",
        "a younger guy i used to work with passed away this week",
        "My daughter's dog was diagnosed with pancreatitis.  She didn't survive unfortunately and I'm still having a hard time getting over it.",
        "my cat just died, I had him for 10 years",
        "I am still in awe that game of thrones is ending. It is my favorite show",
        "We tried to have kids for a long time.  Unfortunately each pregnancy just resulted in miscarriage.",
        "I am sad that they closed my favorite restaurant.",
        "When I received my rejection letter from the college I applied to",
        "When I found out my parents' schemes with the family and it's money",
        "being cheated on",
        "I found out my cat left me.",
        "I just found out my wife of 10 years has been unfaithful to em.",
        "I saw my girlfriend with another man.",
        "My pet rabbit got run over by a car a few weeks ago, i loved her so much",
        "I can not believe that airplane crashed. I cried all night.",
        "I saved up for so long to buy my car. 5 days after I got it, it was totaled when someone hit it in a parking lot.",
        "My mother was just recently diagnosed with cancer. I am just so sad and upset right now",
        "I went on a great job interview last week that I thought went really well. I just got word that I did not get the job. I dont know what I am going to do now.",
        "Still so sad that robin williams passed away, he was my hero growing up",
        " i was so angry what i heard what cosby did, as a child he was such a hero to me",
        "Watching my house burn down after getting my family out. It was such a cold and bitter night.",
        "I came home from work.. and opened my mail up.. and you won't believe what I got in the mail.",
        "I was totally disappointed today.  No one remembered my birthday.",
        "My husband was in a car accident a couple of years ago. A woman pulled out in front of him on the highway. Unfortunately a woman we knew was in the vehicle and passed away. We were so upset.",
        "I lost a pair of earrings my grandmother had given me. I wanted to wear the to her funeral but couldnt find them",
        "I was heartbroken when my grandma passed away, I was not equipped to handle that",
        "I had my wallet stolen today.",
        "My dog just died. It was the worst thing that ever happened to me. ",
        "My wife just told me today that my vasectomy failed, if you know what I mean.",
        "My father in law was diagnosed with pancreatic cancer when our daughter was just 9 months old.  He passed 9 months later so never really got to know her and never met our other daughter.",
        "i was crushed when i wasnt able to go to vegas as planned",
        "My partner and I had a very fierce argument last night. She left the house and I do not know if she will ever come back",
        "I was looking forward to a picnic on Sunday, but I'm gutted it will be raining.",
        "We tried for a long time to get pregnant.  Unfortunately all of the pregnancies ended in miscarriage, it just wasn't meant to be.",
        "My husband told me last year that he wants a divorce.  Not real reason IMO, just said that he's unhappy.",
        "I was really sad to hear that my friend's little dog passed away. He was a good dog.",
        "My uncle died last year",
        "Me and this girl from Tinder seemed to really like each other. Then out of the blue she ghosted me hard.",
        "My dad died last year",
        "I totally thought that I aced my final and got an A in the class. Instead I failed it and got a C in that class.",
        "I went and applied for a new teaching position. I went through 3 different interviews and I just knew it was mine. I got a phone call 3 days later that they hired someone else.",
        "my dad died last year",
        "My mother needs a liver transplant.  I am so sad thinking about it.",
        "My girlfriend dumped for my best friend.",
        "I found out my dog has cancer today.",
        "My uncle died in a car crash yesterday.",
        "My dog just died. I am so sad. ",
        "I was crushed when i didnt win the lottery",
        "My friend's home is being foreclosedo n.",
        "I was keeping my savings at home in safe. My house was recently robbed. The safe is gone also,",
        "My friend is moving away. I am pretty sad about it",
        "I crashed my car. It was my dream car and I loved it so much.",
        "My daughter had the sweetest little hamster.  One day she went to feed it and it had died, she was crushed.",
        "My cat ran away from home. I'm starting to think he'll never come back.",
        "I lost a hundred dollar bill today",
        "I am so sad Anthony Bourdain died.",
        "I really am sad that the boat sunk last week.",
        "i was crushed when i didnt get the day off",
        "I was so sure I had gotten the job that I went out and told my family that it was mine and then the phone call came that it wasn't",
        "My cat I've had for over 15 years who went through college, kids , my divorce with me had to be put down recently.",
        "My car caught fire",
        "I woke up really wanting some coffee... turns out my coffee machine isn't working. What a morning",
        "My gold fish past away.",
        "My dog ran away from home.",
        "I had been fired from my job that I had for almost 4 years. I do not know what to do now and not much savings I have to live",
        "My husband forgot to let our dog back inside when I was at work. The dog got attacked by a coyote.",
        "Seven years agas the biggest wildfire in Texas history. I lost almost everything",
        "My dog just died. I'm in shock. ",
        "My sister lost her house due to a fire. We are all pretty much in shock and very sad. ",
        "My world was turned upside down when my husband received this medical diagnosis",
        "I was so upset when my dog destroyed the model airplane I was building. He thought it was a toy and chewed it all up. Now I have to get a new one.",
        "My dog pooped on the rug. Quite sad that she destroyed it.",
        "I've been working for the same company for 10 years and managed to work myself up to a solid, well paying position. I was just informed that the company is going to shut down and lay everyone off. I have no idea what I'm going to do.",
        "Someone close to me passed away recently in a freak car accident. He was young and doing great academically. It hurts so much.",
        "i was crushed when i saw someone had taken my lunch from the fridge at work",
        "i was crushed when i didnt get approved for a day off last week",
        "My mom, who's in her 60s, lost her best friend today, who passed away. She was one of the only friends my mother had, and I feel sad for her since she lost a connection to her childhood and past. She seems really lonely.",
        "We just lost everything in our basement in a flood.  We had torrential rain all week long..  ",
        "I was devestated when my grandmother passed away, I could not handle that at all",
        "i was crushed when i saw my dog had gotten loose",
        "when my brother got jumped",
        "When my aunt died a few years ago, it really hurt me.",
        "Me and my wife have been to have a child for the past year. I just learned last week that I can't have kid. It is terrible.",
        "Last week I performed badly in the annual presentation. I felt ruined.",
        "When I got rejected to my dream school. I put in so much work to the application.",
        "i was crushed when i had to work last weekend",
        "i was crushed when i couldnt get out of work on time",
        "The high school I went to is being torn down for a condo.",
        "My cat ran away and had been missing for over a week. We just found out she had been hit by a car.",
        "I got a really bad headache and it ruined my whole day",
        "Today we found out at work that they are closing the business down. This is horrible",
        "My best friend moved away to another city.  I am so sad she's leaving.",
        "I stubbed my toe in the shower. I was so shocked and hurt.",
        "after the entire semester of hard work, I found out that I failed the semester.",
        "I just got word that I did not get the job I really wanted. I feel crushed.",
        "I just purchased some brand new shoes. Then I let my friend use them and they brought them back with some type of poo on them!",
        "I failed my entrance exams again.",
        "I dropped my football trophy and is shattered allover the ground!",
        "My puppy died very suddenly a year ago. I still feel so terrible. I miss him a lot",
        "My cat just died. I don't know what I will do without him.",
        "I was so sad when my pet iguana died recently. Izzy and I were best friends. We had such a good time together.",
        "In previous job, I was laid off. I felt like everything around me was failling apart. I felt terrible bad and cried.",
        "I just heard back from my Doctor and I need surgery.",
        "My sister died in a freak accident, my heart is broken.",
        "i was crushed when i didnt get the weekend off",
        "When my friend canceled on our trip last month, it really hurt me. I was looking forward to it",
        "My 8 year old German Shepherd had hip dysplasia.  He was my best friend.  I loved him so much",
        "I was completely down, when i heard my father died in road accident",
        "When I looked at one of my bank accounts I realized I lost all my money. I found out it was stolen and there was no way to get it back.",
        "passing of my mother",
        "my little brother is going to jail!",
        "My dog got run over by a car today. I've had her for 10 years.",
        "my cat died last week",
        "I met this girl on Tinder this one time. She was really into me but then she randomly denied the hell outta me.",
        "I met this girl on Tinder and we really hit it off. Turns out she was crazy and led me on for a while and that made me upset.",
        "I cried the night I found out my girlfriend moved.",
        "My brother died, my heart is in pieces.",
        "I met this girl on Tinder and we really hit it off. Then she randomly ghosted me and it made me really upset.",
        "I am so sad about the bridge collapsing.",
        "I planned a trip to go to Hawaii But due to volcano eruptions i had to cancel.",
        "My cat jumped up on the mantle and destroyed my mothers old vase. I am so distraught because that vase is over 50 years old.",
        "When I found out I was betrayed...there is almost no worse feeling besides losing someone.",
        "My little brother go in a car crash over the weekend. I was so upset",
        "When I was much younger, I fell in love deeply in love with a woman, with whom I wanted to spend the rest of my life. After three months of being with her she left. She told me she didn't love me, even though she had told me she did and even went so far as to deny she ever said she did. ",
        "I tried applying for college online because I need the financial aid and I don't have enough time to complete enrollment.",
        "I put a deposit down on a dog, but it died before I could pick it up.  I was so sad.",
        "I was so upset when my girlfriend broke up with me.  I was so in love with her.  What can i do to get her back",
        "I remember when I was a child and I was told that I would need glasses in order to be able to see the whiteboard in the classroom and do good in school. I was so upset because I felt that the glasses made me look ugly. I was so upset. However, my classmates really made me feel better about it.",
        "The rain flooded my farm.",
        "I came home from vacation and found some stuff was stolen",
        "I was on a scientific mission to mars when a massive sand storm hit.  Yeah my crew thought I was dead, and they left me behind.  Really sucked.",
        "My mother died yesterday it was just so sudden. I am just a mess right now and can't believe it's happening.",
        "My ex wife and I got a divorce a couple years back. Hardest thing I have ever gone through.",
        "i was crushed when i couldnt get the day off",
        "I was heartbroken when my grandmother passed away",
        "The chain on the necklace my boyfriend gave me broke and I lost the pendant. It was so beautiful and I  can't find it anywhere!",
        "I lost my work ID card yesterday.",
        "I was heartbroken when my grandmother passed away, it still hurts me a lot",
        "I was heartbroken when my grandmother passed away, I am still not over it",
        "I was heartbroken when my grandmother passed away, I still am not over it",
        "My stepmom called today with some bad news.  News I was not expecting at all.  It seems that my father had a stroke.  He's only 64!",
        "When my car would not start the other morning, it was pretty sad",
        "i was crushed when i didnt get out of work on time",
        "I thought my life was over when my dog died.",
        "I lost my wedding ring, I am so sad.",
        "I couldn't pay my rent. I am homeless.",
        "I am sitting at home drinking whole milk and eating a tub of peanut butter. I get a call from my main man, Nitro Dubbs. \"World Peace is cancel\" \"No\"",
        "When I was moving I put my stuff in storage. My unit got robbed of all my antiques and precious things.",
        "My spouse had a brief affair last year. It ended and we are still together. ",
        "My heart sank when I heard my favorite teacher from elementary school passed away.",
        "A bad storm with a tornado almost went through my town, I was so scared",
        "We have to make an expensive car repair.  This is coming just after finding out our roof is finally kaput.",
        "I was broken when i heard a bad news from my office",
        "I dropped my chipotle after being hungry for the whole morning",
        "I am going through a breakup, we were together for five years I am heartbroken",
        "My mom became very ill and was in a lot of pain. She had to be hospitalized.",
        "I worked so hard on the science project I was so upset when I didn't get first place. I thought I deserved it!",
        "Once I pulled into my drive way and saw that my dog was off the chainand had gotton out of our yard. Something told me to get the dog and put it back on the chain our it was going to end up ran over , well I didn't listen and sure enough my dog was hit by a car shortly afterward and was dead.",
        "One night, my cats were playing and chasing a fly. All of a sudden one of them started acting weird. Then he died. He wasnt even a year old.",
        "I am so devastated we lost out house to the forest fire. ",
        "My grandfather passed away, and when I found out it had already been several weeks after the funeral happened.",
        "My mom passed away",
        "I was devastated when my wife filled for divorce 2 years ago. It came out of nowhere and really rocked me to my core.",
        "My uncle died last week,  I loved him so dearly",
        "my cat's an outdoor cat that i let out to have fun, and i just found out he was run over by a car yesterday",
        "I was so mad when I came out of the salon with different hair color than I asked ofr",
        "I once got a terrible score on a test that was important to my final grade in the course",
        "My cat died a few weeks ago. I'd had him for more than a decade.",
        "My husband lost his job. It was 3 weeks before christmas.",
        "Last year my grandmother passed away. It's still hard to cope with.",
        "I found out a friend of mine from high school passed away.",
        "I just found out my husband has been cheating on me last week.  I already told him it's over, and that we can't come back from this.  ",
        "My AC went out a month ago. I just knew it had to be the summer.",
        "I just found out I didn't get into the college I wanted to.  I'm really disappointed",
        "When i left my money on the bus",
        "I was horrified when my dog died a few weeks ago. He was one of my best companions!",
        "My brothers wife left and took the baby. We haven't seen her since. ",
        "There was a small kitten that was hanging around my house.  My neighbor brought it in from the heat, but didn't know how to care for cats and it end up passing away. ",
        "I had a car accident. I can't walk any longer.",
        "I was heartbroken when I got pregnant and the father of my future baby beat me. He went to jail and we broke up.",
        "My fiance died when I was 18",
        "Our family dog died recently, it was really hard on the family.",
        "I got pantsed in PE class once. The other 8th grade girls decided it would be fun for me to lose my pants while we played dodge ball. I was so embarrassed.",
        "When my father was diagnosed with cancer, I was so devastated for him. It broke my heart to see him in pain.",
        "I was going through a hard time and my dog died unexpectedly. It was a great shock. ",
        "i was shattered by the news.",
        "A tornado siren went off 10 years ago, my family was in the basement when it hit. It destroyed our home and our car.",
        "A 10.2 magnitude volcanic eruption shattered my neoghborhood.I lost a fortune!",
        "The dog I grew up with died a few years ago suddenly. He was quite old, but it was still a shock. I don't live near home any more so my mom had to call and tell me. I was extremely sad about it.",
        "My grandma was diagnosed with stage 4 cancer. I didn't know what to do..",
        "I lost a loved one last week, I felt like I was loosing my breath",
        "My father died about a year ago. I still have trouble when I remember seeing him dead in his bed.",
        "My car of 13 years, a trusted vehicle, was totaled in an accident. I loved that car so much it had been through a lot with me.",
        "I found out recently that my school processed my financial aid paperwork improperly. So I won't be able to attend school this semster.",
        "When my dog Buddy died, I was horribly upset.",
        "once I bought a new dress to wear on a date. I decided to wear it before the date and spilled wine on it. Had to find something else to wear.",
        "My puppy just died",
        "I was ad when I found out what the hurricane did the Caribbean.",
        "When i found out that my investments had lost more than half of their value i was crushed. It felt bad losing my hard earned money.",
        "My stepmother just died. I am very sad ",
        "i planted some beautiful flowers and rabbits came and nibbled on them last night. ",
        "A student I teach was in a house fire. He lost his home and all of his belongings",
        "I was so lost after our family experienced the most recent round of flooding. It was horrible and continues to be .",
        "My younger brother was hit by a drunk driver and lost a leg we are all devastated",
        "Last week, when I was in the meeting, my boss got an acute heart attack. I was very shocked. He is very young and now he is in coma.",
        "I had a day where my grandfather and father both died in the same day.",
        "My small dog lunged and killed a baby bird that had fallen out of its nest.  I know it was his instinct, but it was rough to watch.",
        "I lost my job last week.",
        "I applied for a job and thought I was going to get the position. They called and told me that the position had already been filled. I was devastated. ",
        "I recently lost my grandmother. She had stage 4 liver cancer. It was a hard thing to deal with. ",
        "I dropped an antique tea cup and it smashed. It was my grandmother's so I was sad.",
        "I have two uncles and they both died within three months of each other",
        "My dog Koko was with me ever since I was a little kid, and when he suddenly got quite sick and we found out he had cancer it was very difficult for me and my family.",
        "Probably the worst time of my life was when my second marriage ended. It lasted over 20 years and much of my life and plans for the future were intricately bound within that relationship.",
        "took my cat for a walk and he got lost",
        "I just wrecked my brand new car!!!",
        "A clsoe family friend recently died in a car accident.",
        "I'm so so sad. My cat that i had for 15 years just died. ",
        "I went to the grocery store, while at the cashier I realized I could not find my debit card.",
        "many years ago, as a child, i was woken up by my mom to the news that our dog had gotten out of the house and was hit by a car. he didn't survive.",
        "I had a cat who lived to be 19 years old.   She was one of the best things to happen to me.  I still feel her loss",
        "My mom gave me her old car but I didn't realize the trunk leaked. I had put my dads memorabilia in the trunk and it rained. almost ruined everything. ",
        "Our dog got out of yard one day and he was hit by a car. He was like one of my kids.",
        "I studied hard to pass my final and the class, but when the time came for me to take the exam, I completely forgot everything and had to guess for most of the test. ",
        "my kids gold fish died",
        "After Hurricane Irma hit my town, I walked through the empty streets and saw windows shattered, trees on the floor, and debris everywhere",
        "My dog got ran over last week and I have had her for 13 years and raised her from a pup. I loved her very much and it felt like I was going to die when my husband called me at work and gave me the news it just felt like everything was gone and I wouldn't  be able to go on.",
        "I thought I was going to get married. But my fiance just broke off the engagement. ",
        "My house was destoryed in a hurrricane. we had to rebuild",
        "The first time I took the SAT my score was so much lower than I thought that I paid for a class after a week of depression.",
        "I had my hopes up to win a sweet contract I bid on.  They chose someone else for the project.  I really wanted that project.",
        "My father died last week.",
        "I felt really bad when my dog died",
        "I just bought my first new car last week.",
        "My pet snake died",
        "I had to put my ferret to sleep last week.  I am so hurt just thinking about it.",
        "We just had a house fire one month ago. We lost most of our things and our dog, Pudges.",
        "The college rescinded my admission offer",
        "I had written a 20 page paper for a class. Before I could save it the computer crashed and lost all of my work.",
        "when ever i lose my losing streak on a arcade game i feel bummed",
        "My old cat is very sick and we have to put her down next week. She is 23 years old.",
        "Roommate just walked in on me while I was... trying to... \"feel good\" if you know what I mean. So awkward. My door doesn't have a lock, either. I told him to not come in, and he just kept coming in!",
        "I'm a really awkward position. My best friend is cheating on his girlfriend, and my own girlfriend is telling me I need to speak up and reveal his secret. No idea what to do, and I'm disappointed in my friend, too.",
        "My grandmother died and i feel absolutely horrible.",
        "my uncle died last year",
        "I'm torn up, my dog had to be put down today because of old age. Ruined my day.",
        "I failed my final exam for math last semester. I all set to graduate but now I have to repeat it. Its horrible.",
        "I was so excited when I got my brand new motorcycle a week ago, but yesterday I crashed and totaled it.",
        "My flight got cancelled and I missed my son's birthday.",
        "grandermother passing",
        "I was so sad when my pet hamster died recently. We were best friends and I miss him so much. I cry every day and think about all the good times we had together.",
        "I was planning a vacation soon, but due to an emergency at work, all vacation time was cancelled.",
        "I lsot my job and my girl friend broke up with me. Everything is falling apart.",
        "My favorite fish died :(",
        "I had to take my dog to be put to sleep a few days ago.  I was so hurt having to do that.",
        "My dog died and I was just heartbroken. I got her when she was a puppy and she lived to be 20 years old.",
        "couldn't deliver the work project on time",
        "My brother mark passed away. He died in a car crash.",
        "I lost my cat last week. I am so sad.",
        "I lost my job last week!  It is horrible and has completely destroyed my plans for the future and my finances!",
        "Both of my parents have dementia now. They don't usually know who I am anymore.",
        "When I lost my parents, when they both passed away within a year of each other. ",
        "I went to the mall with my niece, suddenly she started to cry, she lost her purse with her money.",
        "I lost my entire paycheck at the casino last night. I dont know what came over me",
        "My cat passed away the other day. I've been so distraught over it.",
        "When I tore my perennial tendon I was frustrated and very upset that I couldn't lift weights.",
        "I was just informed my grandma has cancer.",
        "I have been trying to get a car but my credit is so bad, I tried to repair it but to no avail.",
        "I was driving down a local highway yesterday when someone suddenly pulled out in front of me.  I crashed my faithful 1993 Corvette!  I am SO heartbroken!",
        "I was in an occasion and received a call that my friend is dead ",
        "I came home from school. I found out my dog was run over by a car.",
        "I applied for a different position at work, and I didn't receive the promotion.",
        "About a year ago I lost my grandmother to cancer. I was really close to her.",
        "I was wearing my favorite white shorts out to eat. I accidentally sharted. ",
        "Our little chihuahua was diagnosed with an auto-immune disease.  She got pancreatitis last August and then passed away in February.",
        "My dad past away when  I was 13 years old. It happened so quickly, it was horrible to go through at such a young age",
        "When I found out my brother was moving when I was younger, it really killed me. I was going to miss him so much",
        "I got really upset when I got home today and my cat pooped on the bed.",
        "I was so hurt when i found out a friend of mine lost his brother",
        "The hurricane violently ripped through my neighborhood. ",
        "My storage unit burned down and I lost several momentos that cannot be replaced",
        "I didn't get the promotion at work that I had been working so hard for.",
        "I didn't get the promotion at work that I worked so hard to get.",
        "I recently found that I was adopted. I felt terrible bad."
    ]
}