{
    "threshold": 0.8,
    "seed": [
        "Last week, I was watching the world cup, and watched croatia win from russia",
        "When I was little and I found out that we were going to the amusement park . ",
        "My wife and I took a 3 week trip to New Zealand last year.",
        "I was going to see the new Marvel movie. On the way I got really pumped up.",
        "I get to go out today after work! yay",
        "Today is my birthday and I am going to party this weekend!",
        "I'll get to go on vacation tomorrow. Been working really hard to get things clear up so I can enjoy myself.",
        "to go to a concert. ",
        "When the Falcons won the game I was excited.",
        "I am ready to go to a amusement park with my son.",
        "My wife and I are going on vacation next week. We're satying in a cabin in West Virginia.",
        "I texted one of my old buddies from years and years ago and he not only responded, but we met up for lunch yesterday and had a great time! Now we're gonna hang out again on Sunday and I'm so pumped!",
        "I am excited for football season.",
        "I am ready for hockey season.",
        "I am excited for the baseball playoffs.",
        "I am excited tomorrow is my birthday",
        "Can't wait for my vacation to Las Vegas tomorrow",
        "I am so exited about the coming world cup final.",
        "I decided to I would buy a few lottery tickets. My luck is normally not all that great. I scratched the 3 lottery tickets I bought and won $50,000!",
        "I went to a new restaurant with friends I hadn't seen in a long time.",
        "I felt this way when my father bought me a Super Nintendo for  my 9th birthday. We were very poor so it was unexpected!",
        "I remember when I won my first Starcraft match.",
        "I was so excited to go to Universal Studios in Orlando this summer!",
        "I am ready to visit Fenway Park.",
        "After living in my home for 19 years, I'm remodeling my kitchen! It's so much fun to pick everything out!",
        "When i was younger i wanted a new computer so bad. I didn't have good parts and the computer was so slow. When i got the new computer i was ecstatic. ",
        "I'm going to a drink and paint party tomorrow. It should be pretty fun!",
        "I was promoted to a managerial level in my company",
        "I am exited about the world cup final.",
        "When I was a kid I asked my parents for a dog for Christmas. I remember waking up early Christmas morning and hearing a whimper from the Christmas tree!",
        "I finally got my dream car,hard work pays ! ",
        "I will be going on my first cruise in Feburary.",
        "My husband and I had been wanting a camper for about 1 year. Last week we finally found the camper of our dreams and now have our first camping trip planned.",
        "When I was accepted to college, I got to travel there and search for an apartment. My family and I took a plane there and I was ecstatic. I love riding in planes and going to see my college just made it more fun and interesting.",
        " am going to see my cousin this weekend its going to be fun",
        "I am really excited.  I am going on vacation next week and I haven't had one in a long time.",
        "I just won the best write in my state for the third time. I am feeling on top of the world ",
        "Going to California for the first time.",
        "I am going back to college in August and last year I stayed in the freshman dorms. This year, I'm staying in this super nice, brand new facility and I can't wait!",
        "I remember when I bought my first car, it feels just like yesterday.",
        "I had been looking at Black Friday adds for weeks and found an awesome deal on a tv. The store only gives out so many so you have to be almost first in line. Like the first 20-30 people get them. I was running a little late but I still made it in time and got the tv!",
        "Im really happy and ready for the start of my next year of uni.",
        " I got credited by my brother. he paid me some huge amount he has been owing me in the past at the time that i needed it most",
        "I met Elton John at one of his concerts because I brought him flowers to the stage.",
        "My spouse and I agreed that at the beginning of next year we'll officially move back home to Texas. I have been waiting for us to make the definitive decision.",
        "My brother and sister in law are coming to town next week. I can't wait!",
        "I will be travelling to Europe on September",
        "I get excited the day before Christmas.",
        "I was excuted when I finally finished high school",
        "I was very happy  lastnight",
        "I'm going on vacation in 3 hours! Super stoked!",
        "I was excited to visit Disney World for the first time!",
        "The day I got the email saying I had been accepted into my university of choice was amazing",
        "I got to go and see my favorite comedian live in concert. I was really looking forward to this.",
        "Tomorow, I am starting a trip of six months to visit different country. I am so happy and I cannot sleep.",
        "I won a $2 lottery ticket.",
        "I bought a new car a few days ago. It's really sleek and fun to drive",
        "I applied for a promotion. I hope I get it.",
        "Last weekend I took my daughter to Catalina for the first time. I was so elated to take her camping and see the experience through her eyes. I bought all of the items for smores and a cute pink coleman sleeping bag. I told her about campling and showed her a couple cartoons. I obesessed and planned out everything we would do.",
        "Got a raise at my job. Now making 20k more.",
        "I love dogs and yesterday I got to watch a friend's puppy for a week while they were on vacation. He was adorable.",
        "I was really excited when my daughter came home from college to visit me.",
        "I was excited when I was accepted into graduate school",
        "Excited when the Lakers got Lebron.",
        "I was excited when my parents got me a car as a graduation gift",
        "very recently i got back into cooking. i've always loved it and it makes me so happy. i recently made some jerk chick philly cheesesteaks and seeing an idea come to life right in front of my eyes was so exhilarating.",
        "I get to visit my long distance girlfriend in less than a week!",
        "Even though I've had lots of dating success I still get pretty stoked when I get a text back from a really attractive girl I didn't expect to hear back from...I just do a good job hiding it",
        "The first time my brother was coming home from college really made me happy. I could hardly wait",
        "I got happy when my brother said we were going on a trip. I was happy",
        "I am positive about my next vacation.",
        "I was happy when i found my dog",
        "Next week I will be going on a road trip with my girlfriend. I can't wait!",
        "A new piece of workout equipment I ordered just came in. I'm really excited to try it out.",
        "I cant wait for the final season of game of thrones",
        "I was happy when my dog returned!",
        "Yesterday, my girlfriend threw me a surprise party.",
        "My friend bought me a ticket to see my favorite band Saturday night. I cannot wait.",
        "I have a two week vacation coming out and I'm really excited about it.",
        "I'm excited for the upcoming UFC this weekend. I already ordered the PPV and am so ready!",
        "I am excited to try a new diet.",
        "I am excited for the new super smash bors game coming out soon",
        "I am excited for the new super smash bros game coming out for the nintendo switch soon",
        "I am very excited to play the new pokemon game coming out for the nintendo switch soon",
        "I am so excited to get away for a bit",
        "I finally made reservations at the beach for next month for a family reunion. Can't wait to get away for awhile.",
        "I had been planning a trip to Europe for months and finally got all my tickets and hostel reservations. It was such a rush to realize it was actually going to happen.",
        "No matter how sad or hopeless I feel at times, there's no better feeling than the euphoria of unexpected cash coming your way...either from hard work or good luck, I'll take it",
        "When i was little i got a new game boy when i was told i wasn't getting a new one. Family friend bought me a new game boy was so nice of her.",
        "I got happy when I knew I was going to six flags. I could not wait",
        "I got contacted about a new job this afternoon",
        "I'm going to an amusement park tomorrow for the first time and I can hardly wait!",
        "I am very excited to try a new lip stick and I found it for a good price.",
        "Just watched the trailer for Black Ops 4. This girl games!",
        "I can't wait!  I am going on a vacation to Rome, Italy in a couple weeks!",
        "I can't wait for the new evil Spiderman movie called Venom. It's going to be sick!!!",
        "I got a brand new computer",
        "Tomorrow I am going to a Nascar race with my family. I am so stoked.",
        "My friends planned a surprise party for my birthday. ",
        "I am so hopeful for a bright future",
        "I just got a new golf club and I can't wait to try it out!",
        "I am so excited to go to the water park!",
        "I was thrilled to find out that I was finally having a daughter. It was the best feeling in the world and  couldn't wait to finally have a little girl.",
        "I'm going to Las Vegas on Friday! I can't wait!",
        "I got a new puppy!",
        "I can't wait to go on vacation!",
        "I feel excited that the new footbal season is about to start. I own a team in spain and want to see them do well.",
        "There is a concert coming to town and I can hardly wait to see it.",
        "Finally got promoted  after 4 years, I'm now in a manager ",
        "My father bought me a new luxury car.",
        "I can't wait to go to the amusement park!",
        "when i found out good news in 1 day ",
        "I am excited for the new super smash bros game coming out for the switch soon",
        "I have received a response from a company that I had applied for a job. They are inviting me for an interview",
        "im going on a cruise in december",
        "I used to be overly enthusiastic if a girl gave me any kind of attention, which scared them away...it's funny how now that I'm a more apathetic person girls find me attractive. Human beings are weird",
        "I will be going to New York in a couple weeks to visit my best friend. I have not seen her in almost 5 years. I have been saving up for this trip for a long time. I can't wait!",
        "When I was eight my parents got me a dog for Christmas.",
        "I am finally going on my dream vacation to Tahiti!  I can hardly wait!",
        "I can't believe my luck! I won $250 on a $1 scratch off ticket. I really needed that money too!",
        "I just found out that my supervisor approved a pay increase for me starting next week!  It was completely unexpected and I am elated!",
        "I just can't wait for this weekend.",
        "My baby learned how to sit up today!",
        "I had simpler tastes as a younger kid.  I was enthusiastic and content with the littlest things, like trips to McDonald's after Sunday Mass followed by walks on the beach and window shopping at the mall.  I guess that comes with growing up poor but I'm thankful for it because these days I'm a minimalist and can still appreciate the beauty in the small things.",
        "I just found out I am pregnant! I am ecstatic about this news!",
        "I've felt excited two days ago about moving to my new house.",
        "I am really looking forward to this weekend. I am going to my little nephew's surprise birthday party! He will be so thrilled about it!",
        "I am going out of town to the casino this weekend and can not wait for a little fun",
        "My girlfriend and I are going to San Diego this weekend! I am so hyped!",
        " My boss just gave me an all expense paid ticket to paris to enjoy my annual leave and im happy",
        "arranging for a condo at the beach",
        "I am super excited to finally get some new perfume today. It's hard when you're poor.",
        "I'm happy that I'll be going swimming this weekend.",
        "I am excited I get to go to the thrift store and get some nice clothes this weekend.",
        "I am excited to EAT today lol. I am on keto and back to fasting.",
        "I was super excited when I got my new phone! I saved up for a few weeks for it.",
        "to go to disney land ",
        "I can't wait for the new Venom movie to come out! I'm a big fan of Tom Hardy!",
        "I finally thought my dog how to sit and give me her paw. I felt very accomplished and happy!",
        "I finally got to see my favorite baseball time team play in person. It was a dream come true.",
        "Last year I got to see one of my favorite singers in concert. I had seen him before but I was really looking forward to this time because I was taking my children.",
        "I am really looking forward to fall already ",
        "I am ready for my prom.",
        "I went to go visit my sister in Vegas. Leading up to the trip, I was counting down the days, shopping for clothes to take, and making plans.",
        "I purchased a new truck today.",
        "I just found out that I got the job I have been hoping for. I just graduated college in the spring and was hoping for this job.",
        "I cannot wait for the new super smash bros for the nintendo switch",
        "I'm waiting for my friend at the airport. We've been waiting to go on this trip for a while.",
        "I'm going to see the show \"Kinky Boots\" on Broadway tomrrow night.",
        "My dad is coming into town. Haven't seen the guy in 5 years.",
        "My friend is at Chipotle getting me some burritos.",
        "I can't wait to get out of these work clothes and into my sweats",
        "I get to take my teenage daughter shopping for school clothes. This is going to be fun",
        "I start my new job as a social worker in one week! I'm a little anxious about it because I don't want to mess up, but also it feels good to finally be able to put my education to use (and make a living, of course).",
        "My birthday is tomorrow and I am having a party. I am so stoked!",
        "I am going to meet up with a special friend I haven't seen for  years",
        "I can't wait until this weekend! Saturday can't come any slower",
        "I am throwing a surprise party for my sister next week. I cannot wait to see how she reacts!",
        "We are going to disney world for christmas!",
        "I will go on vacation next week, so I am very stoked about that!",
        "I am back to work tomorrow. I am happy to go back to work.",
        "I will finally be getting a new phone soon, and I can't wait because my old one is almost dead.",
        "I'm excited to plan a surprise party for my boyfriend",
        "I got my promotion, I am more than happy today",
        "I am so happy. I start my new job today. I can't wait to go start my day.",
        "Took my daughter to the Animal Kingdom for the first time, I think I was more excited than she was.",
        "I ordered a really nice new car and I am just waiting for it to be delivered. I can't wait!",
        "Could remember the feelings of the Christmas season",
        "I was excited when my dad took us on vacation every year. ",
        "We are planning our first cruise.",
        "I could not wait for Christmas last winter. I was going to see family for the first time in awhile",
        "I am getting married tomorrow. I am so stoked!",
        "I am buying a car tomorrow. I am so stoked!",
        "My parents are taking us on a cruise next year on Spring Break. It will be our first. We can't wait to go.",
        "I can't wait for the movie Venom to come out! It's going to be awesome.",
        "I am excited for the new Spider-man movie. It comes out October 5th and it has one of my favorite actors, Tom Hardy!",
        "I can't wait to start my new job soon, it's going to be awesome!",
        "a was offered a promotion at my job",
        "I found 5 packs of gluten free cookies on clearance at my grocery store yesterday. I am a simple person, stuff like being able to have a bunch of cookies that are good for me and so cheap excites me!",
        "the ufc fights are gonna happen tonight",
        "Going to try out this new restaurant tomorrow. Heard some great reviews.",
        "Bumped into this girl I used to have a crush on in High School.",
        "I'm babysitting my brother's dog in 2 weeks.",
        "Going to New York with some friends next weekend. I've never been.",
        "I am so excited I will be able to take a trip",
        "I'm headed off to college soon. This is so scary.",
        "I am thrilled!  I just found out that I'm pregnant!  Its my second child and I've been having trouble getting pregnant again.  It was such a surprise!",
        "I have my soccer game tomorrow. I am so pumped that I can't sleep.",
        "About to open a restaurant with my friend. I hope it goes well.",
        "Im having movie night with my toddlers tomorrow. They like good movies.",
        "I am going on a cruise next month with my friend. I have been saving up for this for so long. I have never been on a cruise before. I cannot wait!",
        "I am so excited for this semester. I got all of the classes I wanted.",
        "My new neighbors just moved in, and they are around my age. Hope we can be friends.",
        "I'm going water skiing next weekend. It's going to be such a breather from all this heat we've been getting lately.",
        "Just moved and there is a pier near where I live.",
        "MY new laptop is coming monday. I got exactly what I wanted!",
        "Next week, I am going to Las Vegas! I can't wait for it!",
        " Its my birthday tomorrow and my husband put together a huge party for me. I'm so excited about it that I may not be able to sleep tonight!",
        "The piano I ordered is coming in next week.",
        "I can't wait for this weekend.",
        "i went to disney world with my family last week",
        "My mother is coming to visit me and I am so happy.",
        "i got invited to a texas trip the other week.",
        "My baby's first birthday is next week! I have been planning this day since before she was born. I cannot wait!",
        "i got invied on a trip with my friends last week",
        "I will meet some friends this week and am very happy about it.",
        "My wife bought me a fine birthday gift",
        "My mother once suprised me with a vacation",
        "One of my favorite actors is doing a singing gig locally and I am going to get to go see him. I can hardly wait.",
        " I am really looking forward to the new movie.",
        "i was upset when i couldnt go home on time",
        "i was happy when i won the lottery!",
        "I am so elated. I am going on a vacation tomorrow.",
        "I'm about to book a vacation to Barbados and I can't wait!",
        "I can't wait until Halloween. I love scaring the little kids who come to my house, muhahah!",
        "I am excited about meeting with my friend today. We haven't seen each other in so long!",
        "I get to take Monday off! It's the first time in a while I've had a free day so I'm very happy about it",
        "I'm going to take a trip on a cruise ship next weekend.",
        "I can't wait for Halloween! I love everything about it like the candy and outfits!",
        "I'm looking forward to my cousin's future! She is almost done with med school and is getting married soon!",
        "I played the lottery last night and guess what?",
        "My grand mum bought me a gold watch as a birthday gift,  that really made me happy",
        "We made plans to take our girls to Disney.  We told them we were going to the beach.  It was a big surprise for them and I think I was as excited to see their faces and they were once we got there.",
        "I finally got the new video game I had been saving up for. I played it for two days straight. It was the best game I ever played!",
        "Only 3 more days until I go on vacation. I am so ready for the beach! I can't wait.",
        "I went to the Disney land last summer. It was a thrilling experience.",
        "I get to visit my family next week. I am so stoked. I have not seen them in forever!",
        "I get to take a cruise in a few weeks. Finally, all my preparation has come to fruition",
        "A new amusement park is going to open near me. I won't have to drive an hour to the nearest one anymore.",
        "I know it's August. but I can't wait for Halloween. It is so close!",
        "I'm going to meet my long distance girlfriend next weekend!",
        "I'm going to try out the new Japanese restaurant that just opened up next weekend.",
        "I was so happy when I found out I was going on a trip last weekend. Its going to be fun",
        "i cant wait for this friday!",
        "I can't wait for the release of the new Super Smash Brothers game.",
        "Just recently started a new job for higher pay. Can't wait to see my paycheck!",
        "I am so excited for my next birthday. Im turning 35",
        "my friend go a new job",
        "i was excited when i got to leave work early",
        "I am so looking forward to the next season of Stranger Things. I can't wait to see how eleven uses her powers. I love the show so much!",
        "I am going to visit my friend in France next month. I cannot wait!",
        "i was happy to see that my vacation time was approved at work",
        "The first time I met my long distance girlfriend i was very excited ",
        "I have had it happen twice, when I found out I was having a baby girl. I love my girls",
        "Next week my brother is coming to visit me. I can't wait to see him. We haven't seen each other in a long time.",
        "My boyfriend surprised me with flowers today.",
        "I'm looking forward to going to Colorado for my new sister-in-law's wedding reception! ^_^",
        "I'm turning 21 in three days!",
        "I am so looking forward to the next Star Wars movie. I can't get enough of them. Star Wars is my favorite movies of all time!",
        "I just bought plane tickets to Las Vegas for this fall.  I have never been and I am very happy about it",
        "Vacation is soon!",
        "I am going to visit my best friend next month. I haven't seen her in 4 years.",
        "I bought a new gun and i can't wait to go to the range!",
        "I won a lottery",
        "I was going on vacation with my boyfriend of the time for the first time out of the country. The first night of the cruise, he told me that we would be swimming with the dolphins on our trip which has always been my dream. That evening, he also asked me to marry him.",
        "Just got a house for 10k. It's really broken down, but I hope it'll be nice after we fix it up.",
        "I won $200 on a lottery ticket.",
        "I am so happy.  I met the nicest guy on Live Chat.",
        "Well the world famous rally is upon us.  I am headed down to see all the motorbikes.",
        "I'm going on a long train ride tomorrow! From South Carolina to New York! I'm just going to see an old college friend for a couple of days, but I'm just as pumped about the train ride, because I've never been on one before! They seem so peaceful and charmingg.",
        "We are going to disney world this year!",
        "My friend sent me a package from Germany. i had no idea what was inside.",
        "I am really happy when I see the Mile 22 trailer.",
        "I got a call from the animal shelter, and they found my dog! She went missing on Friday.",
        "Nephew plays football this year",
        "There's a new computer cafe about to open up near me. Would love to make some new gaming friends.",
        "I'm going to building a gaming pc. This is my first time.",
        "Two more days and my baby starts pre k. ",
        "I am going to Hershey Park tomorrow. I am so stoked!",
        "I got invited to a trip last week and was super  happy",
        "I'm going to Six Flags tomorrow. I am so hyped!",
        "I am looking forward to my vacation.  I can't wait!",
        "waiting to hear if i got a job or not.",
        "I can't wait to go paint balling this weekend.",
        "I was so thrilled to get concert tickets for a surprise show. It will be so fun!",
        "My favorite pizza place is back in business.  I can't wait to eat there.",
        "A new client signed my project. I excited to start the project. That's my biggest project since I started the company.",
        "i was invited to a trip last week",
        "i cant wait for my son to start first grade soon!",
        "I'm going back to college in a few weeks. I get my own room in this really new, nice place so I'm really looking forward to it.",
        "I am really looking forward to my new job.",
        "I am so thrilled about the new shark movie coming out. I got early tickets!",
        "Next week, I am getting my new car. I can't wait to have it.",
        "School starts back up next month and I am looking forward to it.",
        "I had my first date with my crush tomorrow, I wasnt nervous at all.",
        "I was pretty happy I got to hang out with friends this weekend. It had been awhile",
        "I could not wait for the weekend. We were going kayaking",
        "I am really pumped up!  I get to go horse riding this weekend with my family!",
        "Svhool is in two days. I have never been more happy",
        "I am really hype for the upcoming super smash bros game in december",
        "ON the first day of Highschool I walked in with a huge smile on my face",
        "I had been working lots over the past weeks but was finally able to go on a vacation to the Caribbean and get some relief from stress.",
        "2",
        "I was anticipating the first day of school for a few days. It was going to be the first day in High school",
        "My friend was telling me how she recently bought tickets to a festival at a discount and she offered me to purchase a ticket from her if I'm interested. It would be my first festival.",
        "I just bought a new boat. The seller told me all about it. It is the best boat in the state!",
        "I'm going on my first cruise!",
        "My credit score has always been pretty awful since I made some mistakes when I was 18. Its starting to recover and it makes me feel so good!",
        "I'm planning to go to Costa Rica next month! It will be my first time, I can't wait!",
        "This Friday a video game comes out that i get EVERY year.",
        "I'm excited for my birthday coming up! I will be seeing friends I haven't seen in awhile.",
        "I can't wait for this weekend because I will finally get to go to the water park.",
        "I can't wait for date night. It relaxes me.",
        "I am ready for the weekend, I get to go see my favorite band.",
        "the birth of my twins",
        "I'm really stoked for this weekend since I will buy a new laptop finally. ",
        "i cant wait for this weekend!",
        "Strangely Iw as super excited to eat my pizza tonight. I don't get to have it very often, so I look VERY forward too it when I can.",
        "i was glad to see i was able to get on time today",
        "I have felt this way while waiting to go on vacation.",
        "My son will be born in December.",
        "I am pumped for this weekend.  I am going to the lake for a 3 day weekend.",
        "I was really excited to hear that my son was playing in a band!",
        "I'm excited for Red Dead Redemption 2 to come out.  Even though it's a couple months away",
        "I won the opportunity to go up in a hot air balloon. Wonder who I should take with me.",
        "This week end, I am moving in my house that I bought. I am so happy.",
        "The Lakers got Lebron James.  I can't wait to see him play.",
        "I could not wait to see a game last weekend. Its all I cared about",
        "Maroon 5 is coming into town. I've never seen these guys live.",
        "I've got lasagna in the oven. I hope it turns our well!",
        "I am going to the fair this weekend!",
        "I so happy when my mom got me a cake last week. It was a nice gesture",
        "I am having a bonus this year. I am so happy. I can't wait to see on my bank account.",
        "I am going on vacation to Disney World in 2 weeks.  Im ready to go and cannot wait",
        "I am going to Disneyland tomorrow!",
        "I ordered a new video game console online. I am checking the tracking info like 4 times a day!",
        "I'm going on a guided fishing trip in september.",
        "I really had a fun time at our county fair a couple of days ago.",
        "Im leaving to go on vacation this weekend. I can not wait. It has been too long since I have had time off.",
        "Its me and my fiances anniversary next month and keeps dropping hints about what hes getting me, and I have no idea what it is because I have not told him I wanted anything. Its puzzling but makes me eager to see. ",
        "im getting a new fridge tomorrow ",
        "I just won $100 on a scratch. I can not wait to go cash it in.",
        "I won a car in a contest recently. What an awesome feeling!",
        "My daughter just got accepted into Headstart. I'm thrilled.",
        "I am finally going to see the new Jurassic Park movie this weekend!  I am super pumped about it!",
        "My 30th birthday is soon!",
        "I just purchased the Oculus Rift virtual reality system!  I can't wait to get it and try it out!",
        "I'm pretty stoked for the release of my EP.  I'm sitting on 7 songs and refining the song structure.  But I feel like a lot of people will dig it",
        "Rally time; time to jump on the motorcycle and go cruising!",
        "I am so hype for the new super smash bros, are you a fan of the series?",
        "I am super excited for the new super smash bros game, do you like the series?",
        "The most beautiful thing in the whole world have just happened to me ",
        "I finally get to go on vacation next week. I am so stoked. I have been looking forward to it for a long time.",
        "I'm finally meeting my online girlfriend in person next weekend.",
        "My friend just transferred to my school. I'm so happy.",
        "I'm taking my kids to Six Flags this weekend! It'll be a surprise for them!",
        "I'm really stoked to go the movies this weekend with some friends.",
        "I can't wait for the final season of game of thrones. IT is the best show ever",
        "I can't wait for our next reunion. We are going on a cruise.",
        "I am so happy for date night. We had to cancel the last few.",
        "Two days left before school starts.",
        "I found twenty dollars in my pants!",
        "kids first day of school",
        "I am excited for the new football season to satrt",
        "I get to go to the beach this weekend, so I am very much looking forward to it.",
        "nothing compares to how happy today",
        "bought and built my first pc",
        "going to see my favorite band",
        "Up extra early today, I couldn't sleep. I am starting a new job today.",
        "i cant wait for friday!!",
        "My girlfriend is visiting after a long time.",
        "I leave on vacation in 2 days! Can't wait",
        "word are not enough to express how happy I am about my new car",
        "The day I found out I was pregnant with my second child",
        "I have been waiting for my union members points to come in the mail so I can get two free movie tickets. Ive been wanting to see the new Jurassic Park movie and can't wait!",
        "Friday is movie night. My kids always pick the best movies. I can't wait.",
        "Going to some mma fights!",
        "I am super excited to try a few new supplements I have learned about.",
        "I'm not a greedy person.  But I'm always pretty stoked if I get some free cash.  It gives me peace of mind to know that my bills will be paid and I have one less worry in my mind.",
        "I am going on a cruise next month with some friends. I cannot wait!",
        "am so joyful after i received a special gift from my spouse",
        "I'm looking forward to my daughter's Fall concert.",
        "I get to see my favorite band tonight. I have been following them for 10 years and this is the first time I get to see them. I cant wait.",
        "I can not wait for tonight. I get to start my 2 week vacation!",
        "I'm moving to the beach in 6 months and the anticipation is killing me!",
        "I'm really pumped to get my new treadmill and get to exercising.  Need to get back in shape.",
        "i might be taking a trip to see my family within the month or within the next 4 monhts.",
        "I'm picking up my new puppy on Saturday!",
        "It might sound strange, but I am looking forward to returning to work after my vacation ends soon.",
        "I am so happy to rekindle my relationship with my parents",
        "My birthday is this weekend. Me and some friends are going on a camping trip. It is going to be a blast. I cant wait.",
        "I am looking forward to the weekend. We are going to a baseball game",
        "I am so ready for the weekend.",
        "I am so pumped for the new Super Smash Bros game, it looks amazing",
        "I am looking forward to this weekend. We are going to play videogames",
        "I am super pumped for the new super smash bros, it looks amazing!",
        "I am so excited for all the good games coming out this tear!",
        "We went to a rodeo last month. I was very thrilled and I enjoyed a lot!",
        "I am super hype for the new super smash bros, it looks so so good!",
        "I'm going camping next weekend. It's finally stopped raining.",
        "Going to a gaming tournament. Never been.",
        "I am so full of anticipation!  School starts on Monday!",
        "i cant wait for the weekend!",
        "i cnat wait for my vacation to start next week",
        "I can't wait until I get paid. I am going SHOPPING",
        "My birthday is tomorrow . I am so hyped!",
        "Tomorrow is my birthday! I am so stoked!",
        "I can't wait for saturday!",
        "gonna try out a fried twinkie ",
        "I am excited for a new season of this is us",
        "My best friend is coming to visit me tomorrow.  I can't wait until she gets here.",
        "I am so ready to go skydiving this weekend. ",
        "my cruise vacation is in a week.",
        "I am looking forward to the weekend. The new soccer season starts",
        "I just got the job that I applied for, and a sign on bonus",
        "I cant wait for the football season to start",
        "I cant wait for next week!",
        "I participated in a dance contest at my school last month. I practiced hard for the competition. I ended up winning the competition!",
        "My high school reunion is this weekend so I am stoked.",
        "I am taking my first ever trip to California next week. I can't wait to go! I've heard so many great things about the place!",
        "I'm planning on going to a party with my girlfriend after work. It's supposed to be a lot of fun! I can't wait to go!",
        "My grades are coming back this week and I can't wait.",
        "I'm going out of town next weekend without the kids. I can't wait!",
        "I was pretty happy this morning. I got to workout again",
        "I get some great supplements tomorrow in the mail that I think will really help a lot of my health issues. They are real food type powders and seem to help a lot of people!",
        "I am going on vacation next week. I cant wait. It has been forever since I have had a proper vacation.",
        "I'm happy that it is almost Fall, my favorite time of year.",
        "My sister is arriving from abroad next week. She went there 2 years back. I'm eagerly waiting for her.",
        "I was cooking some food recently. I made a hard to make recipe and it worked!",
        "My friend is coming in from out of town today.",
        "I received this email yesterday saying that I have unclaimed money and all I have to do is verify some information to receive it. I confirmed the validity of the email and it turns out to be a substantial amount of money.",
        "I can't wait til I get to try my new Jet-Skis out on the lake.  They will be fun.",
        "I am excited.  School starts Monday and I am working in an alternative school.  That makes it more exciting.",
        "saw the new doom trailer",
        "The weekend is finally here, woohoo!",
        "I'm happy about a promotion I'll be getting in February.",
        "I'm excited for the plums on my plum tree to ripen",
        "I got my new vacuum today finally! I couldn't wait to open it up! First new vacuum I think I have ever gotten.",
        "Two more days and the kids are gone.",
        "i was happy when i got the day off",
        "i was happy when i saw i got the day off!",
        "i am going to a concert on sunday. i cant wait!",
        "i am going to a concert sunday and i cant wait.",
        "So stoked to go to the beach in a couple weeks!!",
        "i am going to a concert on sunday and i cant wait",
        "i was happy to see my dog had returned home",
        "I am going to the Taylor Swift concert.",
        "I am going to see Taylor Swift.",
        "i have a great wife and i am so thankful for her",
        "My husband is going on a fishing trip with some of his friends in October.  I'm actually looking forward to it - just some time with my girls doing girl stuff!",
        "Can't wait for sunday! Finally going to the beach. It's been forever",
        "I'm moving to New York soon and I can't wait. I plan on doing a lot of sight seeing when I first arrive.",
        "Beach vacaction coming up wooot!!!",
        "My friend got some concert tickets for the weekend, and I am really looking forward to joining her.",
        "I published my first research paper and it was accepted into scientific journals!",
        "I'm going to Disney World tomorrow! Finally!",
        "We packed up the girls around 4am one morning and headed out on the road.  We ended up at Disney that evening, they were so surprised.",
        "Going to an MMA show tonight!",
        "I can't wait to see The Weeknd in concert tonight.",
        "I went to the perk to meet with a friend I havent seen in a long time",
        "I'm excited about teh Spanish football season starting soon",
        "English premier is started this week. I am just so eager for the new season",
        "my heart cannot contain my joy to know that I can carry my grand child",
        "I can't wait for college to start up. I'm living in a big 4 person apartment and I'll have my own room and all that.",
        "I'm going camping with my buddy in a couple weeks and I'm pumped.",
        "I get excited around men and not sure if I might be gay",
        "All of my online packages finally were delivered.",
        "I've been waiting to hear news about a job I interviewed for last week and I just got the phone call that the job is mine.",
        "These days nothing gives me more unexpected joy than find free money or new financial opportunities",
        "i cant wait for monday!",
        "I really like superhero movies. I'm so excited for the next Marvel movie to come out!",
        "These days I'm always feeling on the verge of something awesome about to happen.  I don't know what it is it must be the winning streak I'm on these days",
        "i was happy to see that i have next week off!",
        "I am getting a new cat tree tomorrow, it finally went on sale. One I have wanted for a long time that I see in my pet store! I am not happy unless I get something 80% off or more.",
        "I am looking forward to tomorrow. We are going kayaking",
        "I'm always stoked for money making opportunities ",
        "Got seasons pass to an amusement park.",
        "I'm getting all worked up for fall, it's my favorite season.",
        "Super excited about some moisturizer I am getting tomorrow. It seems like I can't ever find the right one for my skin so I am hoping this works.",
        "i cant wait for next week!",
        "I'm getting married next weekend!",
        "I am looking forward to tomorrow. I am going to church with a friend",
        "I am looking forward to next week. I am going to be off of work",
        "When my dad bought me tickets to a music festival. I got to travel to Montreal.",
        "I won $200 tonight",
        "My daughter's ballet company is going to perform in Atlanta in a few weeks. They will be performing for the families at the Ronald MacDonald House near Scottish Rite. I cannot wait.",
        "When I won a hundred dollars on a scratch off ticket. I felt very lucky in that moment.",
        "When my mom brought me home a puppy. I had always wanted one.",
        "When my dad got me a new pair of skates. I feel so lucky.",
        "when i ever i work with the fastest co workers im happy",
        "im gonna move to a different state",
        "I am about to invest in cryptocurrencies after having saved enough. So thrilled for its potential to grow",
        "I can't wait to go on vacation this fall.",
        "I'm taking my daughter to the zoo for the first time tomorrow.... I can't wait!",
        "Tomorrow we are invited to a pool party at our friend's house. So much hype for this event I have",
        "its almost october ",
        "I am off too London, Meeting my friend after long time",
        "I am ready to go to the baseball game tomorrow.",
        "I was releasing a creation of mine online. It was a labor of love and a long project. I couldn't wait for the world to see it.",
        "I am so ready for the weekend to end, big Monday for me.",
        "I finally received word from my dream college that I was accepted. All the years of hard work FINALLY paid off.",
        "I signed up for a cruise! I haven't been on one in so many years and am really looking forward to it. ",
        "I won tickets to a show I really want to see! I can't wait to go in a few weeks.",
        "My friend flew into town this week and I get to see him again after 4 years! I can't wait to see him",
        "I can't wait for the new Super Smash Brothers game to be released, it seems like a lot of fun.",
        "I'm so ready to go home. I can hardly wait!",
        "I'm so excited to see my sister today, it's been 6 months!",
        "I'm taking a trip to New York for the first time! I am looking forward to it!",
        "I am going on a cruise to the Bahamas next month. I have been waiting for this for so long. I cannot wait.",
        "I'm excited to try out my new 4-wheeler, haven't rode one in years!",
        "Next week I'm finally going on vacation! I feel like it has been forever.",
        "I'm excited to have next week off from work.  I'll have lots of time to relax and get things done!",
        "My mom and dad are flying to come visit me! I haven't seen them in an awfully long time. I miss them!",
        "I can't wait for kids to start school tomorrow. They have been driving me crazy all summer long!",
        "really pumped for the broly movie",
        "I'm getting a new phone soon. I've wanted one for ages and I'm looking forward to it.",
        "My birthday is tomorrow. I am so happy!",
        "When a new exciting game comes out!",
        "I am going on vacation next week.  I cant wait.  I really need time off from work",
        "I can't wait for my new laptop to arrive.",
        "I recently got accepted into a prestigious film school.",
        "Gonna hit the buffet after work. It's gonna be good!",
        "I got approved to adopt a dog!",
        "I cant wait for my trip next week!",
        "The time my mom got me a puppy. It was a husky!",
        "I have a family reunion coming up soon. I can't wait to see my relatives that I hadn't seen in a while.",
        "I go a new car and was happy.",
        "One more month and I get to go on a vacation to the beach!  Its been 5 years so I'm chomping at the bit!  Yay!",
        "I am leaving for vacation at the end of the week. Its all I can think about right now.",
        "I was much surprised to receive a hike in my salary.",
        "Super happy to have a new puppy in the house. It's been a VERY long time since I have taken care of a newborn puppy!",
        "I'm excited to play the new World of Warcraft expansion today! It should be really fun!",
        "The new wow expansion just launched.",
        "I'm excited for school to start and for the kids to get out of my hair for at least some of the day!",
        "I am going to be pretty happy and joyful next week thinking my next trip. We are going to asheville",
        "I have free time today to play some video games",
        "I am looking forward to next month. I am excited about the nfl",
        "I am excited for the next football season, the Eagles could repeat, who knows",
        "I am looking forward to the end of the month. I am happy about football officially starting",
        "i was happy to see my package arrived in the mail",
        "The time my stepdad got me and my brother a dog. I wasn't expecting it.",
        "I got pretty happy and joyful yesterday. We were going to see a movie I had wanted to see",
        "I start my new job tomorrow. I am so ready to be doing something new. ",
        "i cant wait till next week",
        "When i got a great mark on my math test. I studied hard.",
        "I hate the house we're in, but we found one we really like.  We're putting an offer down probably tomorrow!",
        "When my mom enrolled in school after 25 years. She is studying nursing./",
        "Going fishing this weekend!",
        "i felt that way when i got a new job",
        "I am having a new car delivered on Friday.  I can't wait!",
        "There's a new cute girl on our volleyball team.",
        "MY son is getting evaluated wednesday so he can start school early.",
        "I can't wait for Friday to get here!",
        "I can't wait for this weekend....VACATION TIME, BABAY!",
        "I am getting a promotion in the coming month. All the hard work paid off!!",
        "Leaving for Florida in a couple weeks",
        "About a week ago, i bought myself a brand new Samsung Galaxy S9. The phone is amazing and has met all my expectations",
        "I'm excited to start on a new website design tomorrow.  Our company landed a big deal with a local car dealership!",
        "My birthday is tomorrow. I am so stoked!",
        "My brownies are almost done!  They smell so gooood!!",
        "I start my new job tomorrow! I have never been so hyped!",
        "I'm excited for tomorrow morning! I have a big presentation at work and I think my boss will love it!",
        "I bought a few $3 lottery tickets at the store just for fun one night knowing I probably would not win a thing. I won $50,000 to my surprise!",
        "My favorite bakery is making donuts in a few hours.  I can't wait to get some.",
        "I am going to a concert later tonight.  I can't wait to go.",
        "When I got to quit my terrible customer service job. It was so uncertain until the very last moment. When I finally did, it was the happiest I had felt in a while.",
        "I was thrilled to have the opportunity to attend a concert by 91-year old Tony Bennett last April.",
        "Going to an amusement park later in the week, before college semester starts back up. A little scared to get on roller coasters since I don't like heights, but kind of pumped to feel the adrenaline rush and feeling of accomplishment after doing something scary",
        "I'm ready for Fall.",
        "I'm going on vacation tomrrow and i'll be gone  for the rest of the week.",
        "Am getting bonus from office. cant wait for it",
        "I am starting a new job today. I was told plenty of great things about it",
        "I bought a new recliner the other day. I am very happy to have a new one.",
        "I finally saved up enough money to take a trip to Alaska to see the northern lights. ",
        "I am going to go see a band I have wanted to see for a long time. I had tried in the past but it just hadn't worked out.",
        "I'm pretty stoked about this business idea that just came to mind.  If executed right my friend and I could make a ton of cash",
        "I am about to go on vacation to the beach! I am so ready!",
        "Im leaving for vacation next week! I havent been on a proper one in a long time. I cant wait.",
        "I am leaving for a three month trip overseas. I cant wait to leave. Its all I can think about.",
        "When I was a teenager I wanted nothing more than an XBOX 360.  Now I don't even play video games",
        "I can",
        "I get married in 3.5 weeks!!!",
        "My wife surprised me with football tickets. I cannot wait to go this season!",
        "I am so ready to go to the Yankees game tomorrow.",
        "I am already looking forward to the weekend. I am getting a new tattoo",
        "I have been working to lose weight for 4 months now and just weighed myself! I'm 30 pounds down!",
        "I cant wait to go on vacation next week. Its going to be so much fun.",
        "I'm getting me some of that Costco $10 large pizza this weekend.",
        "I can't wait for the new Super Smash Brothers game to be released.",
        "I am so stoked because next week I will finally go on my first cruise. I have been waiting a long time for it. My whole family is meeting on the ship!",
        "waiting for the birth of my new kid",
        "This mexican place now has a bakery. Can't wait to try some Mexican sweets.",
        "A new skating rink is being built. Should be done in time for Winter skating!",
        "I cannot wait for the end of the month. My brother and I are going on a trip back home",
        "Gareth Bale played his best in the champion's league final. I was thrilled after I watched his game.",
        "I am chose for the top 5 employee in the company. We are off to seminar with top management. I can't wait for it",
        "I'm so ready for fall to come around, I love layering and scarves",
        "my sister is having her first baby",
        "I want to go to a concert this weekend, it's a singer I liked a long time ago",
        "I am going to a concert this weekend.  I can't wait to go.",
        "I was getting my nose pierced tomorrow!",
        "i finally got to go on vacation",
        "Next month we are finally taking a family vacation. It's been so long, it seems!",
        "I was outside playing with my dogs earlier. Throwing the ball around, they got so playful and ran around as fast as they could!",
        "We leave early tomorrow to Disney World, Woohoooo!",
        "I am so ready for the Life Is Beautiful Music Festival.",
        "I am planning a birthday celebration for my wife. I am really happy to surprise her with all her family and friends to celebrate her birthday.",
        "going on cruise for the first time",
        "I am so ready for my birthday party.",
        "going to visit my brother",
        "I am looking forward to camping with my friends! It will be a great time.",
        "On Monday the new World of Warcraft Expansion released. I was waiting for months with anticipation!",
        "I feel enthusiastic that I have good things coming my way.",
        "I am finally going to be able to afford my new piercing soon. I have been wanting it for a while.",
        "I got off work at 10am today!  Time to head to the beach.",
        "Im am starting my new job on Monday! I cant wait to get started.",
        "Planning to go travelling around the world",
        "I'm really psyched because my brother just asked me to be his best man. I can't wait for the bachelor party!",
        "I am going back to school. I never thought I would. I can't wait",
        "I have a really awesome beach trip coming up next week. I cant wait to take some time off of work.",
        "I am so hype for the new super smash bros",
        "Love getting the cheat codes to life when I least expect them.  Makes me more pumped about my future",
        "Just got my tickets for Halloween Horror Nights.",
        "I went to the circus one time. I saw some elephants and also played some games.",
        "I am so ready to go on vacation. I leave next Friday for the beach.",
        "Waiting for my cake to done. Gonna be yum yum yum!",
        "There's a new restaurant opening up. I'm going to apply for a job there.",
        "I'm always happy to come home to see my dogs",
        "I'm graduting in the winter.",
        "I am so ready for the first UGA football game.",
        "Going to the beach this weekend",
        "My second year of college starts in a few days and I can't wait to begin!",
        "Beach vacation coming up!!",
        "My daughter will turn 16 next month and I cannot wait!  We are giving her a new to her car that we've been working on for almost a year now!",
        "I am going to bungee jumping this weekend. Can't wait for it!!",
        "I have a hot date this weekend!",
        "My husband and I were engaged for a year and a half. The day of our wedding was quickly approaching. I was so ecstatic for the day to be here! ",
        "I get to go whitewater rafting this weekend. I used to go all the time when I was younger but haven't been in many years! I hope it's a lot of fun.",
        " am so excited about my friends party",
        "I'm going to ride in a race car for the first time!",
        "my son is starting kindergarten in 1 week",
        "I've been abroad for a while traveling but soon I'm going back to the US!",
        "I received a gold necklace on my birthday last year, I was so happy",
        "I'm so ready to go camping this weekend! I'm all packed up and we are heading to the beach for the weekend.",
        "I found a new gym!",
        "I've been saving money for a while now. I almost have enough money to put a down payment on a home.",
        "I rember when the Avengers 4 movie got released in the begging of summer . I could not wait to go and see it . i thought about it ",
        "They're putting up a new playground near my house.  I'll be able to walk there with my son.",
        "I realized I got my birthday off from work and still payed for it!",
        "I can't wait to finish my degree so I can become a nurse1",
        "I'm going to Ireland next month for 8 days. I have never been, I can't wait!",
        "School starts back in 2 weeks.  I'm really looking forward to meeting my new students.",
        "im so excited my birthday was this last weekedn",
        "We just purchased a new car. Its so fancy. ",
        "I'm going to a concert this weekend for one of my favorite bands.",
        "Our son is in the Army and stationed in another state. He will be coming to visit us next month on his leave.",
        "A couple years ago I worked really hard and was able to buy my first new car. Have had used cars but never was able. That was a great day.",
        "my son is coming to visit ",
        "I am going on a vacation soon and can not wait.",
        "Going up to Pikes Peak in a few weeks for the first time since moving to colorado. Over 14k feet of awesomeness. ",
        "I was ecstatic at the opportunity to attend a Diana Krall concert in June. She played all my favorite songs. ",
        "I won a Starbucks gift card in class recently.",
        "My spouse bought me a diamond necklace for my birthday.",
        "My PS4 just arrived in the mail.",
        "We became zoo members for the first time.",
        "I can not wait to go out to eat with my new girlfriend.",
        "A new pizza joint is opening up here.  I can't wait to go eat there.",
        "next week ! ",
        "i go on vacation",
        "Florida vacation coming up!",
        "My wife just told me she won tickets on the radio!",
        "I will be travelling to South America next month.  It will be an opportunity to know such great and different places.",
        "I am super pumped for the new super smash bros, I hope it is as great as it looks",
        "I should be getting the latest model phone, I cannot wait. It is getting close to my birthday.",
        "I haven't seen my son in 2 years since he left for the military. He told me he is coming to visit me for my birthday. I can't wait.",
        "My 4 year old gets to start preschool in a week. ",
        "My best friend is coming visit me. I cant wait to go out and party. It has been too long.",
        "I am going on a trip with my best friend next month. We are going to vegas! I cannot wait.",
        "I am eating at my favorite restaurant next week. i can not wait.",
        "I'm really looking forward to starting my new semester next week. I'm really looking forward to it.",
        "Football season is almost here. i cant wait",
        "This sounds weird, but I'm excited because I'll have some free time tomorrow to do some deep cleaning on my apartment. It's been messy since I've been gone most of the summer. I want to get it clean before school starts so I can enjoy it being fresh during the semester.",
        "I will be taking a trip to SE Asia next week. I cant wait.",
        "I am going to the cinema to watch the new blockbuster movie.",
        "I've never had a lust for life like I do these days.  I literally wake up every day stoked that I'm living my dreams and can't wait to see how much money I can make",
        "Next week, I am going in work trip to New York. I can't wait to go.",
        "My mom is coming to visit and i can't wait!",
        "I am getting to go to my favorite cupcake bakery and I am feeling this way.",
        "I just bought my first house.  I get to move in next week."
    ]
}