{
    "threshold": 0.8,
    "seed": [
        "I'm overly excited today because will be flying outside the country for the first time tomorrow.",
        "I was super stoked when I saw my first paycheck from my new job!",
        "My family adopted a puppy and then I had to play soccer. I couldn't wait for that game to be over",
        "The new season of Better Call Saul will start next month. I can't wait to see what will happen. ",
        "I can't wait for tomorrow,we are going to Barbados for vacation as a family.",
        "I have just won the lottery!",
        "I can't wait to watch the world cup finals.",
        "I was very happy to see my brother",
        "I passed my license exam last month, I was so happy because the exam was difficult",
        "You have to be happy in order to live long",
        "I was so ready and anxious to see Taylor Swift in concert.",
        "I get to see my dog this weekend!",
        "I was going to Sea World for the first time. I had never been there before.",
        "Found 100 bucks on the street today next to my car.",
        "It was Christmas eve and I couldn't sleep. I couldn't wait to see my daughter's face when she saw her toys.",
        "I have just finished a movie, and I feel very energized.",
        "My friends were coming over for a game night and I hadn't seen them in a while.",
        "Man I was so stoked to get my new paycheck",
        "I just ordered a really cool tablet yesterday! i cant wait for it to arrive",
        "im getting stoked for the weekend",
        "I got hired at apple.",
        "i am so excited i get to go to disney in october!",
        "I was so thrilled to see Robert downey junior the other day. He was so awesome and nice",
        "I got a gift card to a restaurant I've been wanting to try for a long time.",
        "My brother got out of prison.",
        "going on vacation soon",
        "Going to a friend's wedding.",
        "My husband and I closed on our first house. I am thrilled for this new adventure!",
        "I remember my first time going to a theme park and riding a roller coaster.  I'd been planning on the way not to ride on any but being there quickly changed my mind.",
        "I remember when I was younger waiting Christmas Day to unwrap presents.  There were a lot of things I wanted that year.",
        "I randomly won a gift voucher for completing a survey",
        "Won a $120 gift certificate",
        "I really can't wait for tomorrow. ",
        "I have plans so go to the beach with my wife for a week next month.",
        "I'm super excited to move",
        "I am so thrilled about Lebron joining the Lakers. Finally something to get us all riled up!",
        "I am going out to dinner with my wife to a place we haven't been to since I proposed to her. I cant wait.",
        "A new game that I've been looking forward to is coming out soon. I've been saving up money for it, and I can't wait!",
        "I'm getting a promotion at work! I've been working toward it for a while now, and it has paid off!",
        "Recently we decided to rescue another kitten. We were so thrilled to be adding another furry member to our family and save a life.",
        " I was starting a new job and so thrilled to be doing something different. I'd been at my old job for 6 years.",
        "im stoked to go see some old friends tomorrow night",
        "I started back at my old job recently. A lot has changed but I was also really looking forward to it as I love the work.",
        "I have a fun weekend coming up, and I'm really looking forward to it! I haven't had much fun lately so I can't wait to enjoy myself.",
        "I recently hit a $200 scratch off lottery ticket.  The ticket was given to me by a friend.  I was super stoked.",
        "im stoked to go to the park later today",
        "i am happy about the beautiful weather today",
        "We go on vacation once a year as a family. When the time gets near and we have all of our stuff together I am normally looking forward to it.",
        "I start school in 2 weeks I am so ecstatic to get back in college.",
        "I remember that I couldn't wait to go on vacation last year. ",
        "I was super psyched when we got our puppy about 6 months ago the kids couldn't wait for me to bring him home and he is so much fun and very cute",
        "My wife and I having been saving all year and finally are going on vacation next month. This will be our first vacation together.",
        "I took my kids to Disney world last week for vacation they was so enliven. ",
        "A friend of mine is coming to visit.  We're going to have a lot of fun when he arrives",
        "Next month my wife and I are going on vacation. It's our first vacation since we got married.",
        "The day I got accepted into nursing school was the best day of my life. ",
        "My girlfriend is moving in this weekend",
        "I'm going to the movies tonight",
        "Earlier this week when I got my yearly review I found out I got a raise and will hopefully at some point be able to take over the helpdesk.",
        "School starts back up next month. I am excited about my classes.",
        "I am so thrilled I will be closing on my first house next month for me and my family. ",
        "My friend that has been out of the country for a year is coming back and we get to hangout again. I'm really looking forward to it.",
        "I have not seen my mother in 2 years since I been busy with school and work. Im overjoyed about it. ",
        "Once, I went camping with my family. We saw many animals and a beautiful creek. It was a happy time.",
        "After 3 years of college, this year will be my last semester until Im done! I cant wait!",
        "I can't hardly wait to go concert tonight!",
        "I can't wait to go to my brother's wedding.",
        "I was so happy that I finally got to leave retail and get a better job.",
        "Next month my wife and I are taking our first vacation together. We have been saving a long time for this.",
        "The day we finally found our rotty pup and got to go get him.  That was one of the most joyful days in my life and I just could not wait.",
        "I scrapbook and am years behind.  I am a stay at home mom, my son just started all day school, so I plan to scrapbook.",
        "I'm looking forward to visiting a friend over the weekend.  We'll have lots of fun together",
        "I'm getting a new bike soon! I'm really looking forward to it.",
        "This week my wife and I are going to buy our first brand new car. We have been saving and working on our credit so we could get a good interest rate.",
        "My girlfriend moved in this past weekend.  I am really happy to start this next chapter of my life.",
        "Tomorrow can not come fast enough. I am going on my first cruise. ",
        "I am looking forward to going on vacation in october! i need a vacation ",
        "Yesterday was my birthday, and my girlfriend had a surprise planned for me. It was a birthday party with my best friends, and she got me some really cool gifts!",
        "I won two tickets to go to a music festival last summer. I was able to see some of my favorite punk rock bands with my older bro and a few of his friends, it was radical!",
        "I am going to Chicago in a couple weeks.  I havent been in a while so I'm really looking forward to it.",
        "Today at work was my review and I was happy because the doctor has been complimenting on my work.",
        "I get to start my vacation starting Friday. I cant wait!",
        "I can't even fall asleep waiting to go on our vacation. ",
        "I got my bonus coming up on this paycheck. I have been saving money for a new car and I think I can finally get one!",
        "My brother and a bunch of our friends planned to go to a 15-person cottage in July. I could not wait for all the fun and games we would experience!",
        "One time I won a stuffed animal from the claw machine!",
        "I'm so ready for football season.",
        "School is starting back up soon, I can't wait to see all my friends again!",
        "i'm going on a holiday in two weeks and i can't wait",
        "I am getting a new car this week! I can't wait to smell the new leather seats!",
        "next week my vacation starts. I am really looking forward to it",
        "We recently went on vacation, and we were the only ones on the water one of the days.  We could really fly around the lake and enjoy ourselves!",
        "I am going to a beer dabbler this weekend.  It has been a really busy last couple of weeks so it should be awesome to drink and not worry about anything.",
        "I am going on a trip to Peru to visit Machu Picchu! I can't sleep because of the anticipation!",
        "5 days eft",
        "I am very happy that my popsicle business is finally thriving! I have worked so hard on it for many years.",
        "With all the money I've been saving up, I should be able to purchase an Oculus Rift Virtual Reality system soon! I'm so stoked to try VR!"
    ]
}