{
    "threshold": 0.8,
    "seed": [
        "I locked my keys in my car about a week ago. It was 95 degrees outside and I was at the store getting groceries.",
        "I went to a really nice dinner for my husbands work. Right before we went in I used the restroom and didn't notice that I tucked my dress into my panty hose and I walked past almost the whole room to walk to my seat. ",
        "I left the bathroom with a bit of poo in my pants once. I was in 3rd grade and so ashamed when everyone smelled it.",
        "I was at work and the butt of my pants tore.",
        "I was on lunch and my coworker made me laugh. I pee'ed my self.",
        "my classmates took a video of me sleeping in class",
        "There was a time, I fell down in the mall, it felt so devasted that day",
        "I feel down in front of my students during games.",
        "I accidently wore two odd shoes to work yesterday.  I had a really early start and I was half asleep getting ready.  I just grabbed two pumps and put them on.  When I got to work one of my male colleagues pointed out my mistake!  One shoes was plain black while the other had a little pink and black bow at the front.  I was mortified though my colleagues thought it was the funniest thing ever.",
        "I am making plans for the weekend with some friends, they want to do something that costs a lot of money, which I have saved for a few months to do. It is supposed to rain and I can't afford to do that and something else in the event it rains.",
        "I accidentally left my wallet behind.  Specifically, I left in the bathroom and had to go back",
        "Somebody walked in on me using the toilet yesterday.",
        "We were recently at a concert and my son had an accident.",
        "I arrived at church just as everyone was leaving. Turns out the power had been off and my clock was wrong.",
        "We were camping, and I thought everyone was outside.  I accidentally opened up the bathroom door on my step-daughter.",
        "I knocked on a closed bathroom door and no one responded. But, when I opened the door, someone was using the bathroom. ",
        "One time I knocked some things off a shelf. I could feel my face turning red. ",
        "We were visiting my husband's grandma and she asked about the rain hitting us. I thought she meant on the way to see her, but she didn't.",
        "My pants feel down when riding my bike.",
        "Went on a first date, did not realize I had BBQ sauce on my face most of the date.",
        "There was one time in grade school when I went to the bathroom and the fire alarm went off.  I had a hard time buttoning up my pants and had no choice but to walk out with my class holding my pants together.",
        "I was embarassed when I wore two different pairs of socks to work.",
        "i felt shy when i dropped my groceries in the parking lot",
        "i felt dumb when I lost my receipt",
        "For mother's day, my son had to fill out a paper in school.  He put on there several times mommy says a lot of bad words.",
        "I accidentally dropped my phone in the toilet.  Surprisingly, it still worked",
        "Went on a first date. Turned out I had chocolate on my face half the date.",
        "Sometime the thought that come into my mind make me red.",
        "had food between my teeth",
        "TSA made me pull down my pants at the airport yesterday.",
        "I accidentally sent an email to a coworker saying that I was frustrated with her attitude. I wanted to dig myself in a hole.",
        "I fell in the grocery store I felt my face turning red in front of all those people I was so ashamed.",
        "falling up the stairs",
        "I made a mistake at work. It was something simple that I overlooked, and it embarrassed me in front of my coworkers.",
        "I kept laughing at myself for falling down",
        "My pants fell down in public",
        "My car got soaked from the rain I sat in my seats and got my pants wet and had to walk in the gas station I was ashamed it looked like I wet myself lol.",
        "I sat in something wet and didn't know it. Walked around all day with a wet rear.",
        "I just found out that I've been walking around all day with a hole in the back of my pants. I can't believe that no one told me.",
        "I lost a really important document at work. I'm afraid to tell my boss about it.",
        "I just went to get an oil change the other day, and after I dropped it off, the mechanic said I didn't need one for another 1,000 miles. Felt like such a fool.",
        "Once I went to the employee breakroom to complain about an annoying client to my coworkers, and when I left I saw she had been sitting outside the door the entire time where she could hear. It was humiliating and I felt so bad for her.",
        "I recently sent an email I shouldn't have after a night of drinking. I woke up in a panic after and hoped it was a dream but nah, I really did send the email. I feel so foolish.",
        "Once on my way to work I slipped getting off the bus. I just laid there on the ground until the bus drove away. I wanted to hide in a cave forever.",
        "i dropped my grocery bag in the parking lot and it spilled everywhere",
        "i forgot my friend's birthday date",
        "I felt very unpleasant last week when i fell to the ground my first time skateboarding",
        "The first time my girlfriend slept over I farted on her leg while we were sleeping.  She knew it happened but didnt say anything.  She doesnt know I know.",
        "One time when using the public restroom, I had toilet paper handing from my shoe",
        "I was playing a board game with some friends and I ended up spilling my drink all over the table by accident. ",
        "I  done a presentation at work and as I got up to speak I farted.",
        "In high school, I fell down the stairs in front of my crush. I was really embarrassed.",
        "I spent ten minutes looking for my car keys while my friends were waiting for me and they were in my pocket the whole time.",
        "i dropped my groceries in the parking lot",
        "I used a public restroom. Afterwards I walked around the store. I had been walking around with toilet paper stuck to my shoe the entire time!",
        "Sometimes when I am out in public, my son throws a tantrum.  Every now and then he uses curse words and he is only 5!",
        "I was walking in the grocery store and found what I need on the top shelf. I climbed the bottom shelf to reach and I knocked a lot of the product down.",
        "I accidentally left my phone at a restaurant.  I was able to get it back before it got stolen or lost",
        "I accidental peed in my pants today. ",
        "I don't think I can walk into the local grocery store again.",
        "I can't show my face in the bank ever again.",
        "I was walking through walmart and noticed people staring.  i went to the bathroom and to check my clothing and i had a huge brown stain on my rear! i sat in chocolate, i was moritified.",
        "i spilled coffee on my friend's laptop",
        "I was walking on the job site last week and talking to a coworker when I stepped into a hole that I didn't see. I ended up falling and spilling my coffee all over me.",
        "My favorite football team lost their preseason game I talked so much smack before the game for them to loose I feel so ashamed lol.",
        "I walked around our area seminar for the job with my shirt inside out and pants zipper down it was so awkward when several people brought it ti my attention.",
        "Today at work I addressed a male as Mrs. since the first name was Frances. My face turned red as he walked up to doorway. ",
        "One time I was at the grocery store and I accidentally walked out with a item without paying for it",
        "i lied to my mother today ",
        "I was at the store today and I dropped a jar of pasta sauce. It shattered and sauce got all over the floor. ",
        "fell down on the stairs and my pants fell out",
        "I called someone by the wrong name earlier today. I met them a long time ago and I guess it didn't stick properly in my brain.",
        "My son decided to drop his pants and pee in our front yard when the neighbors were out the other day.  That was a bit surprising.",
        "I was ashamed when my dog started barking loudly when I was away.",
        "yesterday i notice people were laughing behind me, when I finally got to my desk, a coworker pointed out that a postage stamp was stuck to the back of my head",
        "One time I was in the office with my shirt off cause the thermostat was messed up.",
        "I got really drunk on my birthday this year, and couldn't remember what I did. It was very awkward meeting my friends the next day",
        "I was walking in the snow and I accidentally slipped on some ice in front of a bunch of people.",
        "I can recall a time where I was very drunk at a wedding and I walked into the womans rest room and my face went so red I couldnt stand it",
        "One time in high school I sat in chocolate sauce at school.",
        "I was in a rush this morning and I dressed my self in stained clothes. I feel so dirty today. :(",
        "When I was in high school there was a senior I had a crush on...I was a sophomore. I ended up asking her out and got rejected but later in college we actually became pretty good friends.",
        "The other day I was with my husband shopping.  We were having a great time..until he passed GAS. It was so loud. And it actually smelled horrible.  People were staring at us! He didn't care, but oh man. I wanted to run and hide.",
        "I was at the grocery store yesterday and I kept sneezing.  I thought walking through the garden section must have irritated my nose or something.  Next thing I know I look down and my nose is bleeding like crazy!",
        "Once in Kindergarten, a pair of my underwear got stuck in my shirt and fell out in the middle of the classroom",
        "at work I kept on hearing people laughing behind me, when I got to my desk, my coworker pointed out a postage stamp was stuck on back of my head",
        "I used the restroom at a nice restaurant and I had toilet paper stuck to my shoe and didn't know it until I left. ",
        "I once called my girlfriend's mother mom by accident. We were only dating for a few months and I felt so awkward but she just laughed it off.",
        "i was super late for my meeting on tuesday",
        "My high heel broke in the cement the other morning and I had to wear them all day at work. Not a good day!",
        "Last week, I went to sit in my desk chair at work with a full cup of coffee and completely missed my chair and landed in the floor. My boss and a couple coworkers were right there as I hit the floor and spilled coffee all over my shirt.",
        "One time I slipped on a banana peel",
        "Leaving the bar the other day with my boyfriend, I totally tripped and fell on the step just outside the door and scraped my knee. So humiliating.",
        "A lot of my behavior as a teenager was embarrassing in retrospect.",
        "I drank a lot and told my girlfriend that I would definitely sleep with her best friend if she was down to do so. I made a huge mistake, and felt very ashamed the next day.",
        "I once almost ruined my husband's masters thesis presentation. While he was giving his presentation, I had a bad coughing fit. He--and everyone else--stopped to make sure I was okay--and then he couldn't focus on the rest of his presentation!"
    ]
}