{
    "threshold": 0.8,
    "seed": [
        "one time when I was in preschool, I had to write on the board. when I got up, my pants fell down in front of the class, that embarassed me",
        "I ripped my pants on bourbon street the other day. Luckily I was wearing a long shirt.",
        "I went to the grocery store the other day. I shopprf got sn hour then realized I had left my purse home.",
        "I went swimming in the pool and some of my extensions came out in the water. No one saw but me.",
        "I am embarrassed when I forgot my lines in the play.",
        "I lost my keys at work and looked stupid searching for them.",
        "I slipped while carrying a tray of coffee. I got it all over myself.",
        "When I was in preschool, my pants fell down in class. I was laughed at a lot",
        "One time i was at a party with friends. I for some reason thought people were driving in my car to the next place. Then ended up they weren't going in my car and i felt embarrassed yelling at them.",
        "I was once really embarrassed on a date with a girl. I tripped and fell flat on my face!",
        "I had to give a speech at work and I completely forgot what I was saying. Everyone started laughing.",
        "I broke my coworker statue",
        "I was embarrassed when I fell at school.",
        "Some so-called friends sent me anonymous love-notes in middle school.  When I found out it was them doing it and not an actual boy, I was very very upset.",
        "I ripped my pants during the school play.",
        "When I was 5 I almost drowned in front of over a hundred people.  I was this little chubby Asian boy flailing around in big shorts...and I was in the medium end of the pool..couldn't show my face the next day",
        "I am embarrassed becauseof trump",
        "Once in elementary school my skirt ripped in front of the whole class and I was so mortified. I even asked my teacher for help and she didn't want to help me!",
        "Me and my partner were in disagreement in the shopping mall and everyone was watching us",
        "By mistake, my wife during dinner yesterday said to your friend that we hiking the same day that we were suppose to go with them visit a city.",
        "I had a big argument with my mom over who lost her glasses because I knew that I didn't do it. Upon thinking about it more, I'm actually the one that lost them.",
        "It was really icy outside one day at school and I was walking to lunch. Even though I tried really hard not to slip on the ice, I did and people stared at me while I got back up. I cringe when I think about that.",
        "I am so impressed by how a very unknown country in soccer like Croatia got to world cup final.",
        "Once I sent embarrassing drunken text messages",
        "I tried to make small talk with a woman and she ignored me.",
        "Just the other day, I was quite embarrassed at work. I was wrapping up my lunch and talking to a coworker. I must've been talking to her for about 5 minutes before she said I had food on my chin.",
        "I tripped my first day of high school in the gym with people around. It was a little embarrassing for me then and there.",
        "Someone at the store called my name.  I introduced them to my husband and used the wrong name!",
        "I once was walking down the stairs (not paying attention) and ran into a glass wall right in front of everyone",
        "One time I wore my pants backwards to work.",
        "My dad took me to a golf championship, the PGA that came to my home town last May. All the famous golfers you see on TV were there and I tripped down a hill in a dress!",
        "I misspoke some words out in public and lots of people heard.",
        "I was in such a hurry after waking up late. I had to rush getting ready. When I got to work I realized that I still had on my pajama pants.",
        "I went grocery shopping he other day. I didn't realize I had left my wallet until it was time to pay.",
        "I farted in front of the school last week. ",
        "I walked into the wrong class on the first day of college",
        "I was embarassed when I was in school and my pants fell down in front of everyone",
        "The first time I went on a date made me feel very awkward",
        "I always make plans to go out with y friends when my kids are gone. I just lay around though.",
        "I was in a group chat last night and forgot to turn off the cam, when I left the chatroom.",
        "I was using the bathroom on a train in rome. I didnt lock the door properly and a woman walked in on me. She laughed.",
        "I bought a exercise bike and it just sits in the corner. I wish I had the drive to use it",
        "So I was at work today, wearing some slightly tight jeans, since they're slim fit, and I bent over and they split. Just like in the movies. I meant people could see my undies...",
        "I slipped on the invisible puddle in the aisle and did the splits in front of many people. I was so humiliated.",
        "I fell down a flight of stairs at a college football game in a skirt. Everyone laughed at me.",
        "I wet my pants in class. I wish I could have gone home early.",
        "i pooped my pants on a ride at disneyworld a few months back, it stunk up the place but no one suspected me",
        "I let out a loud fart while eating lunch with my coworkers moments ago.",
        "I was singing to some old school Britney Spears. Didn't know my coworkers were still around.",
        "I lost my wallet at the airport once when I worked there. It had my down payment for a car in it.",
        "Went to the store the other day and put lipstick on before going in and when I got back in my car, my front teeth were covered in lipstick. It looked horrible.",
        "my zipper was down all day. No one told me so that was bad",
        "I parked my car and got out. I forgot to put it to park mode so when I got out it was moving on its own for a little bit. I was so ashamed.",
        "Saw a friend at the grocery store and introduced her to my daughter by the wrong name.",
        "I was so embarrassed.  I farted while I was out on a date.",
        "I forgot to bring my towel and had to run naked out of the common shower area to the locker rooms.",
        "Yesterday I forgot to flush the toilet at work. I felt so weird and anxious about it.",
        "I forgot to order my daughter books for school. Now she is gonna start with out them.",
        "When I was jogging two days ago, I fell flat on my face after tripping over my feet. Someone saw me and I felt so stupid. I turned around, looked at them, and said, \"You didn't see that,\" and then just kept on jogging.",
        "I was really embarrassed when I forgot my speech",
        "One time I fell down the stairs at school in front of a big group of female students.",
        "I paid $1 less on my light bill than I was supposed to and my lights were disconnected. I feel so dumb",
        "I was mortified when my jeans ripped ",
        "I went to the store with no money today like an idiot.",
        "when my daughter had a meltdown in the store ",
        "I farted in front of a pretty girl",
        "yesterday after work i decided to walk to the store to get groceries and it started raining.it rained on me and  i was very wet by the time i went got to the store ",
        "Once I was at summer camp minding my own business when someone ran up behind me and pulled my pants down.  I was humiliated.",
        "I was running late for work last week and forgot to finish getting dressed. After seeing everyone was looking at me funny, I noticed that I still had on my pajama pants.",
        "I had taken my son with me to Walmart , he wanted a toy I told him no , He laid down in the middle of the floor and started screaming , you talk about embarrassing ",
        "I was eating lunch at work and spilled some juice all over my pants.",
        "I was out shopping the other day when I tripped over the shelf in the aisle.  I was beat red.",
        "My supervisor yelled at me in front of all my coworkers! It was not funny to me!",
        "I was shopping the other day and was convinced the cashier had over charged me. I confronted her and finally asked to speak to a manager because I did not feel that I was getting any response. The manager proved to me that I was wrong.",
        "I was giving a presentation at work in front of upper management the other day.  I forgot what I was talking about, started sweating and turned bright red!  It was horrible!",
        "I had to borrow a friends suit to a wedding we were attending because I forgot to pack mine and it fits terribly!",
        "I forgot to zip my pant after using the washroom and I walked into a meeting with top executives from my head office",
        "My social anxiety acted up and I failed at doing basic math in my head when paying the cashier and looked like an idiot!",
        "I lost my bathing suit top in the ocean.",
        "I left my purse at home",
        "I was at the store the other day and I bumped in to a wine rack and knocked over a bunch of bottles, and people were staring which was so embarrassing. ",
        "I felt embarrassed when I went in too the store with my clothes dirty",
        "when i spilled water all over myself at school and looked like i peed my pants ",
        "I used the mens bathroom once because the women was crowded and left my purse inside. They called my name over the intercom system.",
        "I was sad when my dad got arrested. It was a shameful feeling",
        "I voluteered to cook dinner at my parents for their anniversary and alost burn down thier kitchen. ",
        "I forgot to pay for a soda I opened in the store the other day. Security followed me to my car.",
        "I've got something I'm really ashamed of.",
        "I once accidentally called my girlfriend by my ex-girlfriend's name.  I couldn't believe I made that mistake.",
        "when i forgot my wallet! ",
        "I used the bathroom at a grocery store and had to poop really bad. I commenced pooping and starting humming a song and didn't realize there was a person 2 stalls down from me.",
        "I was mortified when my pants ripped while getting out of my car",
        "A little random but when I was a kid I wanted the new Hulk movie that came out. I went to the store and I picked out the DVD and begged my mom to buy it. She did and I went home to play it on the TV. Turns out I bought the old 1980's version and I was so disappointed!",
        "I was playing baseball recently and failed to catch the ball, which ended up smacking me right in the face. I just wanted to run and hide!",
        "I had to fart in a meeting room and it ended up being really loud.... and there was a lul in the conversation so everyon eheard it.",
        "I just called m ex instead of my new boyfriend. Oh my gosh!",
        "I let one rip during dinner just now.",
        "I once put our fishbowl in the window so that she could get some sun while we were gone all day.",
        "I asked a girl out for dinner today, and she turned me down while a lot of people overheard.",
        "I usually wear my pajamas when I drop my son off at school since I don't have to get out. One time, I got pulled over and the officer made me get out of the car. It was not cool.",
        "I was digging my nose thinking I was alone.",
        "I was on a long walk and couldnt get home on time to get to the bathroom.",
        "On the way home on my bike, I couldn't hold it in any longer and I... went to the bathroom on myself. #2. It was horrible. I had another mile to go before I got back to my house. So much to clean up. I felt so mortified!",
        "I got up on stage and completely made a fool of myself",
        "I ran a red light yesterday and got stopped by the cops. It was very traumatizing.",
        "One time, I was in the elevator with a couple people inside and I accidentally let out a fart. I could not wait to get out of there!",
        "I accidentally ran into a glass wall at work. I'm so ashamed and guilty at myself",
        "Once I went into a store only to realize that I had on two different shoes.",
        "Walked into an eatery and the waitress yelled at me for ordering pizza",
        "I farted in front of my relatives.",
        "I can't face my wife, I had a child out of my one night stand",
        "when my child went to the bathroom in her swimming suit while in a public pool. ",
        "I fell down the stairs outside of my apartment. My neighbor came running out to see if I was okay. I was",
        "When I fell in front of a large group.",
        "I feel like an idiot I ran up and hugged the wrong person at the grocery store... I thought it was my friend Beth",
        "When I went to work the other day I kept hearing people giggle when I walked past. I couldn't figure it out until my supervisor called me in his office. Turns out I have a giant rip in the back of my pants!",
        "I am mortified.  I was going to the bank and tried to open the door.  I kept pulling and pulling until I realized I was supposed to push.  Unfortunately, a bunch of people saw me.",
        "I walked to the store the other day and half way there some one told me my dress was tucked in my undies",
        "My old neighbors were so nice. I gave them my wifi password.",
        "I hated being tagged in photos from the weekend",
        "I went out yesterday with a shirt that had a huge hole in the back. I didn't notice until a stranger pointed it out and I was so humiliated.",
        "I can't believe I left my phone in the car last night",
        "I farted down a grocery isle thinking I was alone, but someone was standing right behind me and smelled it!",
        "My pants fell down while at church today.",
        "I fell out of my chair at work during a meeting.",
        "I said a very bad joke during a lunch with my coworkers. I felt so stupid.",
        "I remember calling my teacher mama in front of the entire class.",
        "I threw up on the bus yesterday. I was so mortified.",
        "My son used to throw fits when he was in elementary school when I was dropping him off for school. I didn't know what to do and always hated that other people saw it. They probably thought I was beating him.",
        "At dinner with my friends, I choked on water and coughed it up all over the food.",
        "I left my wallet and home and went grocery shopping. What a nightmare",
        "I was playing with football with my two nephews, just throwing the ball around, and I threw the ball too high and hard for my younger nephew. It sailed past him and nailed the neighbor's car behind him, and left a dent in the door. I felt so stupid having to go up to their house and tell them what happened...",
        "I walked to an apartment and it took me a while to realize I was in the wrong apartment.",
        "I had to dance in front of everyone at the wedding and I can't dance well.",
        "One time in high school it had just snowed and I was being careful not to slip. Despite that, I slipped and everyone looked at me.",
        "I can't believe I forgot my girlfriends name.",
        "dropped my pants in a store",
        "I don't like dancing in public.One time I did and at the end of the dance the stranger I was dancing with asked me to let him lead next time.",
        "I was at the pool yesterday.  When I got out, my shorts slipped down to my ankles.",
        "I am embarrased because I was just going to get coffee and when I left the shop I slipped and fell..",
        "I left my house today with a shirt that had a hole in it. I didn't notice until a stranger pointed it out and I was so ashamed!",
        "Ok.. So I will admit it. I pee'd my pants the other day.  At work..",
        "One time I dropped my lunch tray at school when I was walking by a girl I really liked.",
        "I was so ashamed when I realize I left the house with two different shoes. I didn't have time to go home, so I had to hide my feet all day.",
        "I was texting someone and then I accidentally sent a message to the wrong person.  It was pretty embarrassing ",
        "Whenever my family gets together we always argue. It is so annoying, especially when we are eating out. I feel ashamed of the silly arguments.",
        "I left my phone at my friend's place. It's unlocked, and I hope she doesn't go through it.",
        "I once farted really loud in class.",
        "I invited my friends over for dinner and burned the garlic bread. ",
        "I went to the grocery store the other day and filled two carts, but left with nothing. My card was declined and I don't know why.",
        "I once walked around all day with toilet paper on my shoe.  I couldn't believe my luck.",
        "My friends asked me to go out with them, but I had to decline it because I have to save money for bills.",
        "I was embarrassed when I realized my zipper had been down all day at school. It was sad",
        "I stole alcohol from my dad and got caught, I'm ashamed.",
        "It was awful. I had a piano solo with a band that I joined and we play all over the place. Anyway, I bombed it and forgot a section so skipped forward and fumbled with the notes.  Crushing.",
        "At a office party, I tried to invite a female coworker for a drink. She rejected me in front of everybody. I felt bad.",
        "i got super late to work",
        "One time I was wearing my shirt inside out. I didn't notice until I got to school and someone made a comment. I felt so dumb!",
        "I accidentally spilled my coffee on my date a few days ago. It didn't end up going so well...",
        "There was this one time in during gym class in school where we had to play volleyball and someone on the opposing team spiked the ball in my face. The ball came crashing down and I had a bloody nose and swollen face. Everyone was laughing at me. It was horrible.",
        "I forgot my wallet in the car and took like 200 dollars worth of clothes to the counter at macys",
        "I walked around my office with my dress shoved in my underwear!",
        "I asked a girl on a date and got turned down last night.",
        "I accidentally tripped while walking into a restaurant and there was a bunch of people around.",
        "I was walking my motorcycle out of a parking spot a couple of weeks ago and accidentally laid it on its side.  I felt humiliated, especially since there were a bunch of people that saw me drop it.",
        "I was walking down the hall at school and slipped and fell.",
        "I went to the movies and let out a giant fart while I was walking past some people to my seat.",
        "I was walking in the grocery store and i fell and slipped in some spilled milk. ",
        "I wasn't feeling well but didn't get enough warning and I didn't make it to the bathroom in time.",
        "During gym class today but pants split wide open. Everyone in the class could see my underwear.",
        "I was dancing at a wedding this weekend and I split my pants.",
        "I sneezed a buger on my crush",
        "I was eating a hot dog at school. I started laughing and almost choked in from of the entire school.",
        "I couldn't get into my car in the parking lot the other day and something was wrong with the lock, so I called a locksmith out to open the door and then realized, it wasn't my car. I wanted to crawl into a hole.",
        "Last week was so hectic. One day, I left the house in my pajamas and did not realize it until my daughter pointed it out when I came into her school to drop off her project.",
        "There is nothing worse than not having any clothes clean for work. I had to wear my yoga pants since I forgot to do laundry.",
        "I was chatting with this girl who I thought liked me, but she thought she was testing my friend.",
        "I once kept a deathnote book in which I wrote down how my friends died from the anime deathnote. When my parents found it, they thought I was a sociopath.",
        "None of my friends liked the joke I made last night. I felt quite sheepish.",
        "i tripped in public the other day",
        "My socks always smell.",
        "I was young and dumb so I really liked this girl in my class. Because of this I decided to ask her out over Facebook and her friends were with her and saw that I did that.",
        "I get embarrassed very easily.",
        "My pants had a tear",
        "I was pretty ashamed when my mom got arrested.",
        "when i forgot who someone was when they said hello ",
        "I poured way to much vodka in my drink last night. I gagged u front of everyone.",
        "When I first started working out at the gym, I dropped a weight on my foot. It was so embarrassing.",
        "I'm really ashamed that i've gotten so far behind on my bills.",
        "I spilled my drink all over the table and myself TWICE at a restaurant. ",
        "I walked to school one day. When I walked in I had two different shoes on",
        "I've been living in a state of being self conscious about myself for years.",
        "I once had to have teeth pulled, and I was given some crazy pill to take before coming to the appoinment because I hate dentists, and it made me act all funny. My mom video taped it and it is so funny but like stinks people saw me acting like a hooligan!",
        "Today I was at a store and thought I saw my friend at the checkout, so I was yelling her name over and over and trying to get over to her.  It turned out not to be her and everyone was staring.  ha ha.  My face was so red.",
        "Back when I was in school, I pooped in my own pants, in front of my friends. I felt mortified and I was red faced!",
        "I just hate it when I go to work and realize once I am there I forgot to put my pants on. It's a good thing I always keep a spare set in my office.",
        "I was so embarrassed when I left my keys in the car door at work.  ALL DAY!",
        "As a lawyer in order to prove my point that my client forgot his car and mistakenly enter someone else's car I had to leave my zipper open after going to the washroom",
        "I went downstairs to pick up my food delivery and I forgot I was in a nightgown.",
        "I passed gas during the meeting today. I think everyone heard it.",
        "I was pretty sad feeling when I tripped out in public. It was not good",
        "I was swimming laps one time, and didn't realize that you could see directly up my shorts from behind. I only found out weeks later after my girlfriend told me.",
        "I ripped my pants at work.",
        "I misunderstood what someone said to me at work today. I thought they said something offensive, and I reacted immediately. It turns out they said a different word. I felt mortified and kept apologizing profusely.",
        "I passed gas in the middle of church.  I am so ashamed of myself.",
        "I gave a presentation once and inappropriate images showed up on the power point.",
        "At dinner the other day I spilled a whole glass of water all over the whole table and on myself.  The whole restaraunt looked over at me.",
        "I went to the store down the street and slipped in front of the cute worker there. I dont think I can go back. She laughed.",
        "I was at the coffee shop the other day and spilled my drink all over me. I did it in front the cute girl that works there to make things worse.",
        "I left my house for work and when I got there I noticed I was still wearing pajama pants!",
        "I accidentally peed on my pants a little bit when I was at the restaurant last weekend. My belt buckle moved in front and it splashed everywhere. I had to try and dry myself off using the air dryer. ",
        "After ;long time played soccer, i could neither run nor kick the ball as i used to be",
        "I once was at a high school football game and I was walking on the bleachers. As I walked, I tripped on the string of my backpack and fell. Everyone sitting above saw me fall and started laughing at me.",
        "My teacher saw me cheating on a test. He then told me to bring my test to me and told me I failed in front of the whole class.",
        "I was training with my crew in front of a lot of people.  I thought I would try a new trick to throw a ladder.  I ended up dropping it and made a loud noise that every one looked at.",
        "I let out a nasty burp at work yesterday. I felt so mortified.",
        "I mistakenly hugged another girl instead of my girlfriend.",
        "I once called the wrong person dad.",
        "Apparently I forgot to wear a belt today and I think that for half of the day everyone could see my underwear!!!",
        "I accidentally tucked my skirt into my pantyhose at work today! Everyone say my underwear!",
        "I went shopping today and tried on a cute dress. I walked out to look in the big mirror and the dress wasn't pulled down all the way.",
        "I ordered the wrong size of  dress that was arriving the day I needed to wear it",
        "I always get questions wrong in class!",
        "I pooed in my pants.",
        "I was in the middle of a speech and I farted. I turned red and ran out of the room.",
        "I was embarrassed on my first date.",
        "I was embarrassed on my first date. ",
        "I farted in front of a lady in the train.",
        "My first date was terrible. It was very awkward.",
        "I dropped an expensive glass of wine at dinner with my parents.",
        "How bad can it get, I paid so much for my son's education and he still failed",
        "I accidentally passed gas in front of my mother in law.  I was so ashamed doing that.",
        "I went on a weekend trip last week. I forgot to pack underwear. So I had to go the whole time without underwear. I felt so awkward!",
        "I fell asleep at work yesterday.  I am so ashamed that it happened.",
        "didnt zip my zipper",
        "Why do I have to explain to everyone about my preferences?",
        "I accidentally spilled coffee on my pants yesterday.  I was so ashamed to do that.",
        "I was at a work dinner and I wanted to help open an expensive wine bottle. By mistake, it fell. I felt bad about it.",
        "There was this party that my best friend was throwing for a mutual friend of ours because she was moving away. I totally accidentally spilled wine on their light colored carpet. I was mortified because so many people were there, if it had just been my friend then I probably wouldnt have been such a big deal to me. ",
        "I dove into the pool this past weekend and my swimsuit fell off! Everyone was staring and laughing at me",
        "I was in the grocery store and my 3 year old blurted out, \"Mommy, why is that lady so round?\" I was mortified.",
        "I totally forgot my brother's wife name the other night at dinner, I was pretty embarrassed. ",
        "I was at a sleepover when I was younger and I peed my pants while I was asleep.  When I woke up everyone was laughing at me.  It was traumatizing as a kid.",
        "i was walking in to work and i slipped on some black ice",
        "I accidently hit my friends car parking this morning. I felt shame a bit",
        "I had to give a presentation at work that I really prepared for. But when I began it I forgot everything that i had planned on saying.",
        "I walked in on my friend coming out of the shower.",
        "I went to register my daughter for school and brought literally no paperwork. I stood in line for nothing",
        "at a restraunt without my wallet",
        "I wore miss matched flip flops today not thinking I would get out of the car. I was wrong",
        "I was walking through the lobby at work and tripped over the rug. Everyone saw me and I could tell they were holding back laughs.",
        "I let out a rip roaring fart in the office today. Never felt so mortified in my life.",
        "My dog passed gas during my party. Everyone thought it was me.",
        "getting drunk with friends ",
        "I can't believe I bought a car that was a lemon. what a waste",
        "I once blurted out an answer in class, only to find I was completely wrong.",
        "When I accidentally called my PE Teacher Mom",
        "I spent the whole day with the fly of my pants unzipped and didn't even realize it.",
        "My first date was terrible as I turned up late and sweaty.",
        "I stuttered in front of the investors. ",
        "I had a dream where I was at school like a kid again. Only I had no clothes on!",
        "I forgot my words when giving a speech.",
        "I invited my boyfriend's parents to a cookout out my family's house recently, and completely blanked on their names when it was time to introduce them to my family. ",
        "I spilled tea over myself at dinner with my in-laws.",
        "when i spilled coffee all over myself in the parking lot ",
        "thought someone was talking to me",
        "I had to give a presentation at work the other day. I forgot to bring in the slides for the presnetation so I ended up having to try to do it with no materials. That was such an awkward experience.",
        "I spilled water on myself in the office today. Looked like I peed my pants.",
        "I farted loudly at Jc Penny last weekend and the cashier heard me, thought she wasn't there ",
        "I forgot to put up the food last night and now we will have no leftovers",
        "I hugged a girl thinking she was my girlfriend.",
        "Well I have outdone myself today.  I was giving a lecture with my pants unzipped.",
        "I was at work and I meant to send an email to my boss and instead I accidentally sent it out to my whole company. I cant believe it did that",
        "I went to work with some serious bedhead. I went to the bathroom after being there for a few hours I saw how aweful I looked!",
        "I dropped my friend's birthday cake.",
        "i forgot my belt at home",
        "I fell off in between the aisles when doing grocery shopping at Walmart. Everybody was looking at me like I was some kind of alien",
        "When I was in middle school, some mean girls played a bad trick on me.  They sent me notes and pretended I had a secret admirer.",
        "My first date was a disaster. I turned up late and sweaty and didn't know how to act in the movie.",
        "My first ever date was a disaster.",
        "I forgot my speech at the meeting.",
        "I get embarrassed when I have to get intimate ",
        "I once bragged about how much O drank to find out it wasnt alcohol.",
        "I spilled my whole cup of coffee on myself at work yesterday",
        "I accidentally spilled my drink on my friend at dinner. It made me want to sink into the floor",
        "Last week at work I had a wardrobe malfunction. When I was getting out of my car, I shut my dress in the door and it ripped when I walked away.",
        "I tripped last night in front of people. I felt pretty bad about it",
        "I spilt tea on my pants by accident yesterday while I was out. Looked like I had an accident IN my pants.",
        "i was walking out of the bathroom at work after the person before me had really stunk up the place then i open the ddoor to find my boss waiting to used the bathroom",
        "I passed gas while on my first date with a girl last night. I didn't mean to, it just slipped out.",
        "I drank too much and peed my pants at the club. It was horrifying.",
        "I accidentally crashed my shopping cart into a shelf and lots of stuff went all over the floor. I couldn't believe it.",
        "I can't believe I bought the wrong size shoes for myself today. ",
        "I tried my best ho hold in my fart in class.",
        "My first date was a disaster",
        "I was visiting the new house house of a friend. I wanted to surprise him so I did not knock on the door. So I entered the house, but it was the wrong house. So I yelled \"Surprise ! \" to a complete stranger in his house. I apologized to him.",
        "So last year was my first year teaching high school and of course I was super nervous. Then the unthinkable happened the first day. I was walking around the room talking to them about the course and I tripped and fell.",
        "I tripped and fell face first at a bar last night.",
        "I was visiting a high school for my job recently and I slipped and fell in the hallway with many students watching. ",
        "I go out with one of my friend. This friend is so cheap that he doesn't to pay for anything. He even once embarrassed me in a bar.",
        "I was outside and realized that my dress had been pulled up. I showed more than I intended!",
        "My car has never been dirtier!",
        "I was doing a morning jog the other day and I ended up stepping in some dog poop. I wasn't paying enough attention to my surroundings.",
        "I went to school when I was younger with a stain on my pants that I didn't know about it. People kept laughing at me and I couldn't understand why. ",
        "I can't believe I walked around all day yesterday with my fly unzipped. I bet a lot of people noticed. I am such a dummy!",
        "I sinply ordered a pizza but the waitress served me a burger,i demanded why ,and she just yelled aloud",
        "I felt like such a tool when I realized that the shirt I was wearing was inside-out. I bet so many people noticed and laughed at me.",
        "I farted at work today. Don't think my co-workers will ever let me live it down.",
        "I slipped a fell when I was ice skating and I hurt my wrist.  It was not fun and everyone laughed when I fell",
        "I went to a baby shower for my friend the other day, only to realize I bought a present for a baby boy and not a baby girl! I couldn't believe how stupid I felt.",
        "I was leaning back in my chair at work and fell over.",
        "I was on a date and apparently had a booger hanging out the whole time.",
        "While commuting to office today, one man stared at me. I become unease I notice him.",
        "Boy did I have a wardrobe malfunction once. Back in junior high I was at a school dance. Some friends and I were twirling around on the dance floor when I lost my footing, my dress flew up and everyone could see my underwear! ",
        "I walked around for half the day with my pants unzipped before I realized it.",
        "Once at a swimming competition, I had a wardrobe malfunction in front of a lot of people",
        "My mom was arrested when I was a kid. It was pretty shameful on me and my family",
        "I was walking down the street yesterday and tripped and fell down.  A few people saw me and laughed",
        "I accidentally tripped while walking into a restaurant for dinner, totally ruined my appetite.",
        "When I was a preteen, my parents and my brother and I went on a Disney cruise. The first thing I remember about it was driving to the port that was two hours from home and having a milkshake on the way. This cruise was in the peak of the norovirus scare issues cruises had some 15 years ago. We got to the front of the ticket line and I puked all over the front of the counter. We were quarantined after that.",
        "I got pulled over by the cops in front of my son's school.  I was so humiliated.",
        "I spilled my coffee in the middle of a busy coffee shop. It was horrible!",
        "I let a poot slip out during class today. I thought I would die.",
        "I went out on a date. I forgot to use the body spray it seems. It must have be smelly for the date",
        "I forgot what I was saying during my speech at work.  I felt so humiliated. ",
        "I farted at work today. I never have been mortified in my life.",
        "I'm embarrassed that I left my car lights on all day at work.  I had to get it jumped from my boss.",
        "I accidentally had toilet paper on the bottom of my shoe at work. No one pointed it out to me! I saw it at the end of the work day.",
        "I split my pants while bending over at work.  I felt so humiliated.",
        "One time I tripped over nothing and landed on my face",
        "I woke up late and was running late for work. I didn't have time to put my contacts in. I had to wear my broken glasses.",
        "I was at my favorite coffee shop and tripped over my shoelace. I even did it in front of the cute barista. Im not sure if can return.",
        "Yesterday at work during lunch I noticed my shirt was inside out. Everyone must of seen and saw how rediculous I looked with it inside out.",
        "I cursed in front of my pastor",
        "I was trying to cross over a fence but ended up tearing my jeans. ",
        "I was at my local coffee shop this morning. I spaced out and ran into the door spilling coffee all over myself in front of the cute barista.",
        "The other day I was in a building and I was heading towards an elevator. I was rushing towards it because it was closing. I tripped right as I got in and slammed my head into the wall inside, and then had to hang out with everybody afterward as it slowly went up. Felt so dumb",
        "I was talking big and bad ut got beat up.",
        "I tripped and fell at the coffee shop yesterday. The worst part is that it was in front of the really cute barista.",
        "I had a dream that I was at work and was wearing no cloths. It was the most upsetting dream I've ever had!",
        "I had a ketchup stain on my blouse at work, and no one told me about it! I didn't find out until I went home.",
        "i worry about looking foolish in front of strangers",
        " I remember when I was in kindergarten one time and I peed my pants...maan I was super ashamed",
        "At work, we went together for lunch. When it was time to pay, I notice that I forgot my wallet at the office.",
        "I accidentally passed gas while talking to a coworker.  I felt so ashamed. ",
        "Can't really remember the last time I was humiliated...I've got pretty thick skin",
        "I was at the gym the other day and tripped on my way to the pool. I turned around and there were about five people that saw me. I felt like an idiot.",
        "I locked my car keys in the car the other day.  I couldnt get into my car and everyone knew that I locked them in there",
        "i was at the park with my son, when he pulled down his pants and started peeing on the grass",
        "I went to work yesterday wearing two different shoes.  I was half asleep when I was getting around and did not notice",
        "Today I thought i saw a good friend and the mall and started waving like crazy...... it wasn't her lol",
        "I wish I would've checked my bank account before going on last night's date.",
        "I saw a yearbook with my in from when I was a kid. It just made me feel weird to look at it",
        "Man when I first lost a fight I was more humiliated that I lost than the fact that I was temporarily blind in my left eye and my head was split open with glass pieces.  ",
        "I tripped and fell at work. A lot of people saw. I felt so stupid.",
        "I cant believe I forgot to sign the tuition check. They were going to expel my daughter",
        "I almost drove off without my phone at the gas station. I felt a little shame afterwards",
        "I was walking in the rain and I fell in a muddy puddle.  I was so humiliated that day at work.",
        "I went to set at dinner with a girl who I thought was my girlfriend. My girlfriend saw the whole thing.",
        "I was lifting heavy weights at the gym and halfway through the lift I accidentally farted pretty loudly. There were some attractive girls nearby who heard me.",
        "I feel like suck a failure, I couldnt even climb the latter",
        "I accidentally locked my keys in my car recently. Luckily my friend was able to bring me my spare keys!",
        "I accidentally passed gas in front of my mother in law.  I felt so humiliated. ",
        "I let out the noisiet, moisted",
        "I sprain my ankle really often. I'm not great at basic walking",
        "I went to the store in my pajamas and saw my high school crush",
        "I was walking in the rain and didn't have an umbrella. I was drench by I time I walked in the my classroom at school and everyone noticed it.",
        "I forgot my dad's birthday",
        "I spilled coffee on my lap and now it looks like I had an accident.",
        "being pants at the bar",
        "I walked out of the bathroom with my skirt tucked into the back of my underwear tonight on a date. I showed everyone my bum.",
        "I dropped my plate of food in the middle of the busy break room at work.... I wanted to disappear!",
        "I had a huge mustard stain on my shirt all day at work. And none of my coworkers let me know about it!",
        "I'm not sure if it comes with age, but I have to make sure that I have my children make sure that I have my clothes and shoes on right.  One time, I left home with two different shoes on.  One of them black and the other blue. ",
        "My bag split open at a coffee shop the other day. Everything spilled out and it dropped loudly.",
        "I walked around the mall for 2 hours with my fly down.",
        "Waiting in the line for my driving license documents to be signed by the official at DPS, I accidentally fell to the ground. It was so embarrassing",
        "I was out for a run last night and I had to use the bathroom.  I went over to some bushes to pee and then someone saw me.  I cant believe i got caught",
        "I didn't wear a belt today and my pants fit pretty loose... They pretty much fell down while I was at work today.",
        "I was at an outdoor party last weekend. I got drunk and fell into the pool in front of everyone.",
        "A gal my sister knew works in a thrift store I like and today I just didn't feel good and didn't feel like talking to her. I felt bad because she still gave my mom a discount and a discount on my stuff.",
        "I've been calling my coworker the wrong name for the past three months. They finally decided to say something about it today. The worst part is I wasn't even close with the name I had been calling them. They're so nice and I felt so bad",
        "I was at the fair and I spilled my drink all over me. I was soaked",
        "I was walking out of the store the other day and walked right into the glass pane!  It was so clean, I didn't realize the door wasn't open!  Talk about humiliating!",
        "I was embarassed when my pants fell down in class",
        "I heard a car alarm go off at work and started getting really frusterated.  Then I realized it was my alarm",
        "Third day of school and we were so late. I felt terrible",
        "I was at an autograph session with Tom Brady and I was getting my picture taken.  He noticed my zipper was down and everybody laughed at me.",
        "I was not able to do 15 situps in front of my gym class. I was with a huge class.",
        "I got caught in the rain before work and arrived soaked",
        "Sometimes I look down and my fly is open",
        "I let out a moist, hot, nasty fart in front of all my co-workers today. I was so mortified.",
        "I tripped today while walking up the stairs.",
        "I was given a loving home with parents that helped me out and a career path I could have been successful in, and I blew it.",
        "Yesterday I went to the supermarket with some old clothes I wear around the house not expecting to meet anyone I know, but I met my boss and his wife, I guess that was to be expected after all.",
        "I was talking to my boss and accidentally used a word I didn't really know the real meaning of. I looked like a fool.",
        "I was at the fair, and I spilled my drink all over myself. ",
        "I invited a girl over to my house for dinner that I had a crush on for years. When I served her at the table I handed her a folded napkin when she unfolded it a live cock roach fell onto the table. ",
        "once i pooped my pants at walmart",
        "I tripped over my foot and landed face first in front of a group of hot jocks. I am so embarrassed!",
        "I misunderstood what someone said to me, I tried to help but in turn it all turned out awkward and the conversation went wrong.",
        "When I was in middle school, I remember seeing a question on the board and feeling positive that I knew the answer. When all was quiet and the teacher asked if anyone knew the answer, I confidently spoke up, only to be incorrect.",
        "I tripped over my backpack and fell right on my face.",
        "When I first met my wife we went out drinking. I wet the bed that night because I was so drunk!",
        "My neighbor came over to hang out one night and we were all having some drinks and talking. He mentioned that one of his brother's was actually a half sibling and I immediately said something about them looking so different. He took it as me saying he wasn't very attractive and now jokingly makes fun of me about it. I turned so red!",
        "Some people can be very annoying,  I was so ashamed the other day",
        "i was in the train the other day and i fell",
        "a girl i like at school told me today she doesn't like me in front of everyone",
        "i had my friend over and my family made me feel very uncomfortable",
        "I forgot I was wearing makeup. I rubbed my face then walked around with eyeliner smeared all over.",
        "My son ran out without his pants on at a party. I was mortified.",
        "I was at a fancy restaurant and by accident I knocked my drink over and it spilled all over the table.",
        "I tripped over a branch walking to a restaurant, and looked like an idiot in front of a sizable group of people.",
        "Fell at the store and broke my leg",
        "I was a little uncomfortable in an interview when I forgot what I was trying to say. I had to skip that portion of my statement.",
        "Recently my dog got out of the yard and ran to the neighbors and ran all around their house upsetting their dogs! It was quite annoying but eventually he came to me after I called to him for a bit.",
        "Once I had a job interview, but I didn't notice that I had sat in some gum on the bus on the ride over.  I ruined those suit pants for good.",
        "It was such an experience to trip and fall right in front of an extremely attractive male at Walmart of all places. I had my coffee in my hand and it spilled all over my lap and of course I was wearing white and had a giant (burning) coffee stain all over my clothes!",
        "I am so embarrassed, I tripped over a man's foot and landed right on top of a very grumpy man who shoved me into another very handsome man",
        "My dress ripped in public.",
        "I thought I saw my friend at the store but when I said hi, it turned out to be a stranger. I went red in the face.",
        "My son wet his pants in public",
        "I fell down on stage while dancing, I felt so bad",
        "When I was younger I was caught with weed",
        "I farted in my favorite girl's face",
        "I felt embarrased when I took my son to the salon after tyring to dye his hair blond and it turned orange.",
        "One time I was exercising in a yoga class and my pants split open!",
        "I went to the public toilet and went out with a toilet paper sticking out of my pants...",
        "I cooked this big turkey for my in-laws one Thanksgiving. I was so embarrassed when I realised I used sugar instead of salt.",
        "I forgot to close my zip after using the washroom and I walked into the boardroom unknowingly",
        "My 5 year old started Kindergarten last week. She was nervouse and started to cry and cling to me when I went to leave. The teacher pulled her away and becuase she had ahold of my shirt she ended up yanking it down.",
        "I farthed in a mall, ",
        "I was in charge of the turkey during our last thanksgiving. I was so proud to have the honor, but right before serving it I dropped it on the floor and the dogs got to it.",
        "The other day i was in my car with the windows down singing.  didn't know anyone else was around.",
        "I was working out in the yard and my boyfriend came over to help. I didn't realize the jeans I was wearing gave my plumbers butt. My boyfriend will never let me live that one down.",
        "While I was walking to class yesterday, I tripped over some loose bricks and fell down.  The ground was wet from rain, so I was filthy when I got up.  I wasn't physically hurt, but my ego was.",
        "I took a tumble in a public place in front of people.",
        "When I was a brand new mom, I had to run to target for pumping supplies and my son wouldn't stop screaming.  I was so flustered I just left and asked my mom to go get them!",
        "I was in a meeting with my boss one time talking about a serious subject. I spilled a whole of water on his desk. ",
        "Peed myself when drunk at a party",
        "i was walking and tripped over the curb. my day started of wrong today. ",
        "I fell getting outta my car yesterday.",
        "I am so embarrassed I fell on the bus face first into another mans lap..",
        "I was at the store the other day, and the floor was wet but I didn't realize it. I slipped and fell and basically threw the items that I was holding.",
        "i once was too drunk to drive home and told someone something i shouldn't have.",
        "Causing a shop's display to come crashing down.",
        "I really messed up at work today. I was walking into work and slipped on a wet floor, I had to be taken to the medical clinic for an accident.",
        "I was so embarrased when I got the hiccups at my kids sports game.",
        "I was riding a motorcycle and fell in front of a crowd of people.",
        "I went to the store about a week ago and I had my shirt on inside out and backwards. I didn't know until the cashier told me. I just said \"Dang I'm still half asleep,\" and walked out. ",
        "I was headed to the beach and wearing a loose pair of shorts and they dropped off me in front of a crowd",
        "nothing any man has not experienced. i walked in on a female friend getting changed in a guest room one day. never turned around so quickly in my life.",
        "I tripped while walking my dog this morning",
        "once in my early twenties I remember going to a party and everyone was in the pool. I got in the pool and splashed around and didn't realize I had a huge green bugger coming out of my nose. A really cute guy pointed that out for me.",
        "I was bending over while working the concession stand and split my pants.",
        "I remember a time long ago when I was walking into a new job. The floor was wet, And I fell in front of everyone who was to be my new employees.",
        "I was jogging and i realized i had a rip in my pants",
        "I was late picking my wife up after a surgery because I fell asleep. When I arrived, my track pants were on backwards.",
        "I went to work sick one time and had an accident in my pants.I had to call my district manager to tell her and get permission to go home and get cleaned up.",
        "Yesterday When I was coming from my office. I fell on the ground, ripping my pants. I was mortified, as everyone was laughing at me.",
        "My husband was super rude to this salesclerk, when the alterations on his suit weren't right. ",
        "Last winter I went to the pharmacy to get flu medicine and actually threw up while waiting in line. It was extremely embarrassing.",
        "When I got home I realized I had my shirt inside out the entire day!",
        "I was running and fell flat on my face. i think a lady saw it happen",
        "I accidentally hit on a married woman yesterday. She was quite upset.",
        "I dropped the plates when I serving a table.",
        "I started a presentation at work and my computer crashed in the middle of it.",
        "Last weekend, I slipped on some wet grass and slid, hand first, into a pile of dog poop.  In front of everyone at a BBQ.",
        "I spilled my coffee all over the store when i was shopping.",
        "I'm so embarrassed, I had to ditch my date to use the bathroom.  I told her I was sick!",
        "I crapped my pants at wallmart once. I couldn't find the bathroom and well you know...",
        "Last week I was not feeling well at all. I was so tired when I Went back to work, that I forgot to change out of my pajamas before I went in.",
        "I forgot my lines in the live drama.",
        "I didnt realize that chocolate milk did not come from brown cows until I was 14.",
        "i tripped at dinner",
        "I can't believe I actually went to work wearing my wife's dress the other day. I knew something was wrong when it felt like I was wrapped like a sausage. Luckily I had a spare suit in my office to change into.",
        "thinking someone was talking to me when they werent",
        "I was at the airport and fell asleep waiting for my plane and someone woke me up because i was snoring to loud.",
        "I tripped over someone the other day",
        "I spilled my tea on my lap today and it looked awful. Like I peed myself.",
        "I got caught stealing out of a donation box.  I am so ashamed for doing so.",
        "First day of school started out pretty good but then got sort of tough for me. I had a bad class in particular.",
        "I urinated on myself in walmart",
        "I didn't have enough money to pay for my groceries and had to put something back. There were a lot of people in line.",
        "I was not able to do 15 sit ups at my hockey teams practice. I didn't have the strength.",
        "I couldn't drive my friends stick shift car. Manual is difficult.",
        "I sang last night at the bar. I am a bad singer, I am a fool.",
        "I was walking in an outdoor mall area last weekend and tripped in front of a bunch of people.  I didn't hurt anything, but I was definitely red in the face.",
        "when i spilled a drink all over my lap and it looked like a peed on myself.",
        "I was in Walmart and my son pulled a few items off the shelf onto the floor, everyone was looking. ",
        "I tripped in the supermarket this morning. I felt pretty bad after it",
        "I dropped my plate at the buffet last night. Every one saw",
        "I accidentally dropped a dumbell on my toe at the gym. I felt so stupid.",
        "My husband and I were out to dinner with some coworkers of mine and my husband farted right in the middle of it.",
        "I was walking into a meeting at work and fell flat on my face.",
        "I used to be ashamed that I was fat.  So I worked out and got ripped and feel better about myself",
        "I was walking and i leaned over to pick something up and ripped my pants",
        "The other day at work when I was in the elevator I realized I had an extra-button from my shirt unbuttoned,  And I wondered since when it has been like that and the people I had met.",
        "I walked out the grocery store and walked to my car.  I opened the passenger door to set my groceries down.  I paused because I noticed items in the car that were not mine.  It wasn't my car.",
        "I fixed a cup of coffee for my mother in law and forgot to tell her that we don't use sugar, but artificial sweetener instead and she spat the coffee out as a reaction.",
        "I lost my swim bottoms at the water park going down the slide.",
        "One time in computer class i thought i had a silent fart but it was really loud and everyone heard it.",
        "I was at the bar the other night and had a few too many shots. I puked and passed out inside",
        "One time I got so drunk I stripped down and got into the pool, we just so happen to have alot of people around. The worse is not remembering and having people tell you the story",
        "I had to carry three boxes from my car back to the store.  Since I've lost weight recently, before I could make it to the counter, my pants dropped down to my ankles!  I was SO humiliated!",
        "My face was on the front page of the newspaper for a bad reason.",
        "In fifth grade, I was singing a solo in a school play and forgot the words.",
        "I was on a flight earlier in the week, listening to music. I thought my earbuds were plugged into my iPod correctly so that only I could hear the music.. turns out it wasn't, and everyone could hear it on speaker the entire time. I just assumed it was hard to hear because of the loud plane.. nope. People listened to my death metal with me for two hours and said nothing..",
        "I was out to eat with some friends. and i over trusted a fart",
        "I tripped over the sidewalk the other day, thankfully no one was around",
        "I farted infront of a lady in the train.",
        "I dislike when I have to get up in the middle of a training session when the whole class is filled, my face gets all red and blotchy.",
        "I lost my swim bottoms at the water park."
    ]
}