{
    "threshold": 0.8,
    "seed": [
        "I'm doing everything I can to stay true to my girlfriend during a hard time.",
        "I feel very faithful in regards to my work. It gives me purpose in life.",
        "I have never cheated on my girlfriend even once.",
        "Honoring my relationship is extremely important to me.",
        "It's good to be trustworthy in relationships ",
        "My coworker came on to me at work last week, but I refused her advances.",
        "I have tried my best to always do what is best for my family.",
        "I have been married for almost ten years. It takes a lot to stay in a marriage that long.",
        "I feel like my employer really counts on me to do my job and I would feel bad ever leaving them for another company. ",
        "Last week was my husband and I's 10th wedding anniversary.  10 whole years married, loyal and true to each other and I would not change it for the world.  Heres to another 10 more, and many more after that.",
        "i always feel like i should never hurt my parents.. yesterday i got so angry, but i kept my mouth shut and came away",
        "I got a job offer at another company that pays more.",
        "Watching all the stuff that's going on in the world, I still believe in a bright future.",
        "A co-worker has been flirting with me at work.  I've rejected her advances since I have a girlfriend",
        "I have been in a relationship for 4 years",
        "In the past and present I always try to stay positive.",
        "I needed help after I had surgery with household chores and my best friend promised to take off work and help which she did she is always so true to me.",
        "My husband is lucky I didn't heat on him when I know he cheated on me.",
        "My boss told me if i worked hard id get a raise",
        "There were things in my life that can only be described as the work of higher power.",
        "I met my wife online 7 years ago and can't see myself with anyone else, ever.",
        "I'm pretty sure a girl at the convention was hitting on me. However, I have a loving girlfriend and I would never cheat on her.",
        "I didn't feel like coming to work today.  But I got up and went to the office anyway.",
        "I got in a heated argument with my friend about religion and it made me question my beliefs.",
        "Some lady I knew kept trying to hit on me knowing that I had a girlfriend. I knew I would never do anything like that though.",
        "My ex boyfriend and I were together for 4 years.  I was faithful to him the whole four years",
        "my wife",
        "I have belives in my family",
        "I have been spending a year learning  a new skill and after so much study and hard work it is finally paying off. I am feeling faithful again. ",
        "I'm glad I can trust my husband to always be there for me.",
        "my pet dog is always there for me, not matter what, I can count on her.",
        "I always buy the same brand of yogurt and don't even bother trying other kinds. It's just so delicious and such a good price that I'm a loyal customer for life.",
        "One time I wanted to eat at Burger King, but then I remembered that I was loyal to Mcdonalds",
        "In all my relationships,i always choose to honest as much as i can. I never want to my partner to stop believing in me.",
        "Once I was going to get fried chicken, but then I remembered I was loyal to only eating vegetables",
        "i love my wife because she's loyal to me and she always takes care of me",
        "My wife for the last 10 years has been very loving and trusting and always has remained strong in our marriage and I trust her 100 percent",
        "I have never cheated on my boyfriends, although I suspect they may have cheated on me.",
        "I feel faithful towards my diet",
        "A bird fell out of a tree next to my house. I am now the mother and taking care of her. We are developing such a beautiful relationship.",
        "My husband has been having a hard time finding a job recently. He's been in the final two candidates three times but no luck. He's got another interview on Thursday and I just know that he will get it!",
        "I felt very good last year when i started going to church again",
        "it is nice to have a loving pet , My dog is always there for me",
        "I went out with some friends a couple weekends ago and we met a group of girls. One asked for my number but I told her I have a girlfriend and didnt give it out.",
        "The new guys at work were talking so harshly about my boss.  It was really heartbreaking.  I kept my mouth shut and stayed loyal to him though.",
        "My boyfriend is going out with a bunch of people I don't know tonight. But I trust him that he will be a good boy.",
        "death",
        "When I am in nature I feel good that this world is exactly as it should be. Everything is moving a long to Gods desires.",
        "I feel like my husband is the sweetest man in the world.",
        "I heard a friend speaking ill of another friend and refused to participate."
    ]
}