{
    "threshold": 0.8,
    "seed": [
        "I have always been loyal to my wife.",
        "There were times where I was being seduced by a coworker of mine.  I remained committed to my wife and did not cheat.  It was a good decision.",
        "My friend's boyfriend got into an accident 5 years ago. She's still with him.",
        "when someone tried to get me to go out to a bar behind my spouses back ",
        "I have always been faithful to my girlfriend of almost 3 years, which I am proud of",
        "I had one time where I was at a party and a girl started to act really flirty with me and we were both kinda drunk. I had a girlfriend at the time so I made sure to let her know so that she didn't get the wrong idea.",
        "I have a long term girlfriend. I have never or will never cheat on her",
        "I have been faithful to my long time girlfriend. I would never cheat on her",
        "My husband is an over the road truck driver and we have to spend a lot of time apart. Despite this, we always make the best effort to comfort each other and sow how much we love one another.",
        "I have always been loyal to my Girlfriend. She means so much to me and when some others tried to rip me from her to get me i told them to go away and removed them from my life.",
        "I am faithful to my wife, but it's thought",
        "Once, I had the chance to betray a friend that has always been truthful and honest to me. I didn't take the chance and stayed faithful to that friendship.",
        "I don't understand couples that cheat on each other. I literally have no desire to cheat.",
        "I love being sincere with people",
        "I was dealing with someone hacking my email. I got really angry and felt compelled to lash out and say terrible things to the hacker. Instead my faith compelled me to remain as calm as possible and it ended up that I was able to get back my account.",
        "when i worked for two months and expected nothing",
        "I promised my wife I wouldn't drink alcohol and I haven't in 1 year",
        "Working in another country for a year. Going to save up to marry my girlfriend.",
        "I've always been loyal to my wife.",
        "Last week I saw this big pizza in the breakroom and I chose to stick to my diet.",
        "My husband used to be a drug addict. During that time he cheated on me many time. No matter what he did though I always stayed true to him.",
        "I get hit on by a lot of girls, but I'm happy with the one I got.",
        "I will always be married to my wife.",
        "I wanted to go to mcdonalds but i know that i am a wendy's guy , so i decided against it even though i was starving",
        "I have always been faithful to my grilfriend of 2.5 years",
        "I have always been faithful to my girlfriend of 2.5 years",
        "Stressful events are going on but I trust that things will work themselves out.",
        "A man tried to pick me up at a work event the other night. I have a boyfriend so I didn't accept his advances",
        "I am loyal to my wife.",
        "I stayed with my last partner through many trials and tribulations",
        "I will always cheer for the New York Jets.",
        "I am faithful to my girlfriend all the time, I wish that was not so rare",
        "My girlfriend is working in another country for 2 years. I'm afraid of the people she'll meet, but I trust her.",
        "I felt faithful when my cats were sick and needed palliative care.",
        "I'm going to be away from my girlfriend for a year, but she should know that she can trust me. ",
        "I got a new job, but I'm going to finish this last project with my current job before leaving.",
        "I have never cheated on my wife.",
        "I have had lots of problems with my girlfriend but we have worked through them and have remained true to each other.",
        " knew things were going to be alright for me when I dropped out of college. My dad was there for me a lot",
        "I knew I could believe in my dad. He assured me he was going to find me a truck",
        "I've been with my wife for over 10 years and have never been tempted to cheat. I can't understand why people do such things.",
        "My son failed his final exam in Math the other day. But, I do have faith that he will turn it around next semester.",
        "Many years ago, my ex-wife and I were having marriage problems.  I was away for training, and one of my friends who went with me and I became very close, but nothing ever happened.",
        "No matter what, I have never cheated on my boyfriend.",
        "I always buy my kids clothes from the same place.",
        "I had faith my dad was going to get better in the hospital. It was just a feeling I had",
        "I've always tried to be loyal to my family.",
        "I am sticking by my partner even though he has done a lot because no one else has. While he is in therapy. It's hard.",
        "I have old dogs and I will do whatever it takes to make sure they are happy and well taken care of. I owe it to them.",
        "i was faithful on my diet ",
        "I asked my friend to buy stuff for a party, I knew he'd come through though.",
        "There's a new hotel that's been headhunting me to work for them, but I think I'll stay at the one I'm at now. They've been good to me.",
        "I have always  been faithful to my girlfiend of almost 3 years",
        "3",
        "I was going through a hard time in life, and I prayed and it made me feel better.",
        "My dog is getting really old. He's always been there for me, so I'm going to take care of this little guy as best I can in his last days.",
        "I will always stay with my husband no matter what",
        "He that finds  wife finds a good thing!",
        "Some one owed me some money",
        "When I had to pass my classes to graduate",
        "I just knew things would work out for me when it came to getting into a school. I had worked hard for it",
        "You know... I have never cheated on my husband in 20 years.",
        "I have been a loyal custoer to my phone carrier for years. They always give me free things.",
        "I love going to the gym. In the past 3-4 years I haven't skipped a single workout.",
        "I will never give up on my family",
        "There was a time my mom and dad didn't see each other for 4 years because of school.",
        "I was married to my wife for thirty years, and even though she has passed I can't bring myself to date anyone else.",
        "I went to my school reunion alone , my husband couldnt make it. I saw a lot of old boyfriends there. ",
        "I am in a long disance relationship",
        "the best friend I have had for he last 10 years will always be my best friend",
        "I have faith in Trump.",
        "I always watch the news at 7pm.",
        "I rejected an offer from a competitor company and wanted to stay in my current organisation out of loyalty",
        "trust your friends",
        " I have always  been faithful to my girlfiend of almost 3 years",
        "I felt good when I go into the church. I pray with all the people in there and that is an experience.",
        "I am hoping to get approved for promotion. I went to church to pray about it.",
        "I've been with my employer for 8 years. They're going through a tough time now, and I'm trying to do my best although the work has been really hectic.",
        "I was so tempted to kiss the girl last night, But I am married.",
        "One of my friends wanted me to leave out my other good friend and not tell her about our beach trip we were planning.  I told her that I wouldn't go unless we could all go together because I just don't leave people out.",
        "A girl hit on me at an event, but I've got a girlfriend. Not interested.",
        "While a lot of my coworkers quit to go to a competitor, I'm staying with my company.",
        "I just knew my dad was going to get better. He had the flu but I knew he would get better",
        "I have been faithful to my girlfriend of almost 3 years",
        "So... I go to church every Sunday.  I never miss.",
        "I go to church every sunday.",
        "Me and my husband have a great relationship. We are determined to be together forever. We love each other so much and would do anything to make the other one happy.",
        "I have never cheated on any exams in school. ",
        "I have always been a big fan of childrens place, I will never shop anywhere else",
        "I eat tacos every single tuesday.",
        "Getting married this fall",
        "I have faith that one day things will all work out.",
        "I have always been considerate of my relationship with my wife",
        "I have been working hard at my job. There is a promotion that I want to get!",
        "I've always been loyal to my wife and children.",
        "I was praying to god to help out our family. I wanted my son to get better",
        "I have been with my husband 7 years and have always been faithful.",
        "While everyone is hating on our current president out here, I stand by how I feel even if I do not fully agree to everything he does or says. Its called being loyal to ones country. ",
        "I would never cheat on my wife like my brother cheated on his wife",
        "I'm faithful I'm going down the right career path for once in my life.  Took me long enough.",
        "i have a good feeling our government will turn the turmoil in our country around",
        "I'm very faithful in my community and the people in it.  They are good people",
        "How can one stay married for 10 years without cheating?",
        "EVen though it is hard...I have been very committed to someone even when they do not deserve it...No one else has helped them in their life..being a stable and healthy home..so I have.",
        "i go to the same place to eat breakfast every morning for the past 10 years",
        "I'll never stop drinking Dr. Pepper.",
        "Havent cheated on wife",
        "When I see my little dogs face and how smart she is, I know I will be there for her no matter what! She has helped me through some tough times and she is SO devoted to me!",
        "my friends have always been there for me so i will for them",
        "A woman approached me and wanted to get together, but I told her I was married",
        "I attend church every sunday. My belief in god is what keeps me moving forward",
        "When I was small at summer camp it looked like no one was going to pick me up at the end of the day. I wasn't worried because I knew my mom would pick me up. She was just running a little late. ",
        "Sometimes my partner leaves to work abroad for long periods of time. While some of my friends brag about cheating on their partners, I always am respectful and do not do anything to hurt our relationship. ",
        "One day my neighbor helped me in a risky situation. So I'm loyal to their family always.",
        "I would never cheat on a partner. It goes against everything I believe in.",
        "I let my Tesla stay on autopilot the entire trip.",
        "The happiest gift I have ever received is a woman that is standing by my side no matter how things go",
        "What does it take to have a woman that will stay till death ",
        "There was a girl who approached me last week and wanted to make out with me. I had to say no to her because I'm married.",
        "I'm holding out for a promotion this coming February.",
        "I proposed to my girlfriend 2 months ago. I knew at that time and for the rest of time she would be the only woman I would be with",
        "I have been with my car insurance company for 30 years.",
        "My last relationship, I never cheated on my partner, I was devoted to only them.",
        "I had a girl try to hook up with me, but i didnt do anything because I love my wife.",
        "Although things haven't been going well for me in a long while, I am confident that I've lead a good life and been a charitable person and that one day it will come back to me.",
        "I had a good feeling work was going to be good today. I went to bed with that feeling",
        "I just celebrated my 50th wedding anniversary.",
        "i hear of people cheating all the time, i couldnt imagine ever cheating on my wife",
        "I can do all things through god.",
        "I know time are hard, but i'll make it",
        "I was on a business trip last week spending some time at a local bar. There was a girl who was being flirty with me. I had to tell her that I was married and I couldn't play with her.",
        "I feel very committed to my work. No matter how I feel, I have to press on and complete it. It's been a rough week and my will power is very strong to still work through all this",
        "When at a party, a girl tried to kiss me but I was in a relationship already.",
        "i love my wife unconditionally, i dont see how anyone cheats on their spouse",
        "No matter what I've done, my mom has always been supportive.",
        "cheating is disgraceful to me, i only want my wife shes the best",
        "I've never cheated on my wife",
        "My job is going through a tough time, but I'm going to stick with them.",
        "the chargers are going to be great this year!",
        "Me and this girl were going steady. I matched with a better looking girl but I stayed with my girl since I liked her a lot.",
        "My father in law is having heart surgery next week. I having a good hope it will be success and i have put everything on god's head!!",
        "I find it hard to be faithful ",
        "I know that if I believe it inside, I can do it.",
        "I went out of town the other day and went out drinking with some friends. Now I have a partner back home but this woman kept hitting on me and she was HOT. I was so close to cheating but thought about my wife at home.",
        "My wife is amazing. She would never cheat on me.",
        "The time a girl tried to kiss me at a party. I already had a girlfriend.",
        "I love my husband so much. I'll never ever cheat on him.",
        "All of the people at my office have decided to leave all at once.  I'm one of the only few that are staying.",
        "I will always believe in god.",
        "I am drug addict. I didn't pay my drug dealer. He came last week to ask for his money.",
        "I would never cheat on my wife",
        "I have faith my car is going to make it 3 hours away to my parent's house",
        "I love my wife. I would never cheat on her.",
        "I've always been a loyal wife and mother.",
        "My friend's wife got into an accident. She can't walk anymore, and he's still with her 20 years later since then.",
        "It feels so good to finally have a girlfriend who isn't paranoid that I'm going to cheat on her all the time. My girlfriend lets me hang out with friends whenever I want, because she trusts that I'd never hurt her.",
        "I knew it was going to be sunny today. I just had a good feeling",
        "A girl tried to kiss me at a party but I refrained. I am in a relationship already.",
        "My husband is in the Military and goes away from long periods of time. I've never though about cheating.",
        "ill never cheat on my girl ",
        "Going to church yesterday made me feel better. I am looking forward to this week",
        "I have been faithful to my girlfriend of 3 years, she is the best!",
        "I see so many dudes hitting on my friend's girlfriend.",
        "I love my husband.  We have been married for 22 yrs.",
        "My father in law's operation next week. I have just put my hope on God",
        "I am getting married next year. I wish my future wife won't cheat on me",
        "Wife and I have been together for 10 years",
        "I have just started taking care of my grandmother.",
        "I love my wife so much.  I would never cheat on her.",
        "Every Sunday I goto church. Having something to believe in makes me feel whole",
        "I have never cheated on a person I have been in a relationship with. I feel that would be wrong to do",
        "I always like to eat at my favorite restaurant a few times a week and encourage others to in the hopes it can stay afloat.",
        "I was invited to church this last weekend. I went and felt very optimistic in the church.",
        "I always keep my word to my children.",
        "I was hanging out with some friends and my ex wanted me to come over, but i didnt because my wife would be mad",
        "I let go the wheel and let autopilot steer my car",
        "A girl tried to kiss me a party. I said no.",
        "I have hope that this weekend will be fun. I am off and hope to do something fun",
        "My sister in law's husband has been cheating on her for the last three years. I just don't understand what would cause a man to do that to his wife. I've been married for 12 years and have never considered cheating.",
        "My girlfriend is the only girl at her new job.",
        "I avoided kissing a girl while I was out one night. I'm in a relationship.",
        "After I performed at school, so many girls are hitting me up, but I've got a girlfriend.",
        "Ive been with my wife for 10 years",
        "I remember feeling faithful when I went to a bachelorette weekend with my girl friends. Most of them did things that their boyfriends would not be happy with by I had my husband in mind the whole time and didn't commit any infidelity.",
        "I had a chance to cheat on my girlfriend but I didn't!",
        "We've moved many times over the past ten years for my husband's job.  It's been hard but worth it!",
        "I've been in a long term committed marriage for over 34 years.",
        "I'm hoping I can reach diamond next season in overwatch. I've been practicing a ridiculous amount",
        "I was at the store and some old guy bought my groceries for me. It helped restore my faith in humanity",
        "I am a very committed spouse. I have been married 15 years. ",
        "You can believe in your friend",
        "I work with several other men that are fairly attractive, but I love my husband so I want to remain true to him. I do not want to betray his love.",
        "An old friend wanted to get together. It would have been fun, but he is a guy and I knew it would bother my husband so I didn't meet him. ",
        "I made a news years resolution to meditate every day and I have kept it for the most part.",
        "One time I was on a ride at a theme park and the ride stopped in midair. I was so scared, but I believed that help would arrive and I knew the rescuers would save us. They showed up and we were all good.",
        "When my husband and I were younger and our children were small, we were on really tight budget. One day at church, when it was time to give out tithe, I knew we had only about $40 in our bank account. I wrote a check for $40. I put my faith in God to carry us. Within a few days, I received an unexpected care package from my mother, which included some cash.",
        "I was once propositioned to go on a date by a man that knew I was married.  I was not interested in cheating on my husband, and I told him so.",
        "I was baptized at 13. It felt good to make that commitment.",
        "I went out to the bar with my girlfriends recently and there were a lot of men around. I'm happily married and one guy in particular kept trying to buy me drinks. I kept telling him I just wanted to have a good time with my friends but he kept persisting. Eventually he got the hint.",
        "I have never cheated on a girlfriend while we were together",
        "When my girlfriend cheated on me i let her go and i didn't do anything",
        "I went out without my boyfriend and did not get any numbers",
        "Few years earlier, I heard that one of my close friends were talking negatively about me but I did not beleieve that. I continued spending good time with him",
        "I know I can pass my calculus test today!",
        "I have been married to my husband for 40 years and still love him with all my heart",
        "I wanted to try out a new brand of headphones but instead stuck with the good old Beats. I was loyal to them.",
        "A dog's faithfulness is amazing. I am faithful to my dog as it is faithful to me.",
        "I was going to cheat on my girlfriend because we had gotten into a huge fight- so I went to the bar, and there was this woman there- she was beautiful and we started talking but all I could think about was my girl.",
        "i have faith in a brighter future",
        "once a time i am in a shop,that time the important box was missed in the shop .all staffs suspect me but the shop owner trust me so i must thank him.",
        "god has done so much for me in my life. i owe everything to him",
        "I got maried at 18. I have been married for 12 years and never once strayed or became unfaithful. ",
        "One time while I was working an employee came up to me and began to flirt with me. I told the person I was married and was loyal to my and that it was inappropriate and disrespectful. They laughed and still continued to flirt. I spoke with a manager to have me moved to another area so I could work in peace.  ",
        "I love my family so much! They are the center of everything I accomplish in life.",
        "I have been at my job for over 10 years and though I feel like I could use some additional experiences, I also feel a sense of loyalty to my current company.",
        "I promised to visit a friend in prison every week. I enjoyed each time.",
        "I just had to mail a phone back to Verizon and they lost it and are now trying to hit me with a 550 dollar charge! We're working it out now in trying to get them to not charge me that.",
        "workign when we had to change job locations",
        "I sent a story that I wrote to a publisher and I will find out soon if they accept it. Its a good story and I am sure they will accept it. ",
        "My gas gauge broke in my car over the weekend. Although I had filled it up with gas, I remained adamant it had gas in it !",
        "My friends invited me to a party that involved alcohol and drugs. I decided to not drink or anything because I am a Christian.",
        "all this week I was committed to my diet, i didnt cheat not one time. im proud of myself.",
        "I feel like all couples should stay by each others side no matter what. Even if there is temptation to go astray you should always make the right decision. I had that problem once when a really good looking guy was hitting on me, but I stayed true to my feelings not giving in to urges",
        "When another person of the opposite sex was trying to convince me to cheat on my spouse",
        "I've been going to the same Thai restaurant for about 10 years now. It's the best and they always keep me coming back each week!",
        "I didn't cheat on my partner.",
        "I was at a bachelor party last year. ",
        "I love my dog as they are always there for you.",
        "My wife is truly been trustworthy, she never keep secret from me",
        "I recently went out with friends to celebrate a friends engagement. My partner was not their and many of my engaged friends other friends were single, drunk and feeling lonely and rejected in the presences of our mutual friends happiness. Several of them made attempts to flirt with me and I was polite in conversation but always put a stop to anything that seemed inappropriate and made it clear I had a partner who I would stand by ",
        "I found someone phone with cards and money at the mall. Because it was not mine, I returned it and gave it to customer services.",
        "My sister-in-law has stage 4 cancer, and today we have 100 people coming over to the house to pray for her. It's the last day of a 24/7 prayer week and we've seen so much healing in her and in people who've been praying!",
        "I am very faithful to my employer.",
        "I remained with my girl after a long distance relationship",
        "one of my friend forgot his wallet at my place and whenever i saw i called him and tell to come and get your wallet. he told me that put it to yourself whenever we meet i will collect it from you. he put blind trust on me.",
        "i am loyal to my wife and i'll always be",
        "My wife have been with me through thick and thin for 30 years",
        "I have been married to my husband for 30 years. Men still flirt with me, but I stay true to my husband.",
        "I won a 10k race on the weekend",
        "I don't know why I trust people easily",
        "I always bring my wife coffee in the morning even if I worked the night before.",
        "My wife has been so supportive,we dont  keep secrets",
        "I have this boyfriend,  he is such a nice person , I promise myself not to cheat on him",
        "i had the chance to cheat on my girlfriend the other day and I didn't",
        "My husband is the best. I love life with him.",
        "My family is going through a tough time dealing with the loss of my grandmother. We've been using the strength that she left for us to get along and support eachother.",
        "I have had one friend through thick and thin. She could pretty much do anything and I'd stand by her side because she is my best friend. We haven't been friends for too long, but I see it being an everlasting friendship. ",
        "My primary care doctor moved offices about half an hour further away from me, but I decided to stay with her.  She's really great.",
        "When I was younger and walked into a church for the first time. ",
        "I've only been with my boyfriend for 2 years, but I can't think about anyone else but him. ",
        "Once i had a couple. I only was with her for arround 2 entire years and no one else.",
        "My ex girlfriend told me a secret I promised never to tell. I still have told no one",
        "I always buy the next Nintendo console no matter what people say about it.  They have always done well for me.",
        "I have been going to with the same guy for 2 years.",
        "I have remained dedicated to moving forward with my heart's plans.",
        "When I met with my boyfriend at the naval base after his boot camp, I had to have faith that he would be in a certain spot, so that I could find him in the crowd.",
        "My  wife used to be a flirt before we got married. I always believed she would not cheat on me despite that.",
        "My girlfriend and I have been together for four years. This is my first real relationship and I feel like she is the only person I want to be with.",
        "I have been loyal to the Dallas Cowboys since I met my current love.",
        "My girlfriend recently went on a white water rafting trip with her friends. Normally I might be concerned, but our relationship is going so well I remain committed and unworried.",
        "I was invited by a friend to go to a party and I refused",
        "I volunteer at a dog rescue.   we have a dog who was very petrified of us.  she would cry and cower if you approached her.  One day I sat down and held her and she let out a sigh and fell asleep in my arms.  I never felt such pride and believed in the process as much as I did then",
        "I wanted my sister to get everything she deserved in life. She struggled for 7 months trying to have a baby with her husband, but I had no doubt that it would eventually happen for them on God's time.",
        "When I was little, I believed in God to take care of my family. ",
        "I was out shopping and a very attractive man was giving me a lot of attention. I am married and I am happy to say that I remained faithful to my husband.",
        "When my spouse was out of town for work, a friend stopped by to visit. This friend offered to kiss me, but I declined and asked the friend to leave. I only have interest in my spouse in this way.",
        "One of my coworkers tried hitting on me. I declined the passes. ",
        "Even tho she had wanted me for years I just couldnt do it.",
        "I asked a coworker to cover a shift for another coworker. I was confident this person would take on more hours and step up when needed.",
        "My dog got loose when we were out driving. 3 days later he came home! They are the best!",
        "When is was little my dog got hit by a tractor. The vet told us it would be best to put the dog down. I threw a fit and told my mom not to do it. She listened and the dog lived another ten or twelve years no complications. ",
        "Just got my new coffee pot from a brand I have never tried. I love it so much I will never go with another coffee pot brand again.",
        "oh the days when you want to go out but you've promised to help friends move. gotta keep the promises. ",
        "Every day I am faithful to my husband",
        "When the guy I'm now married to and I met for the first time I was actually dating someone else. I thought that my now husband would just be a really good friend to me. I stayed with my ex-boyfriend for a while after, and even when I knew I wanted to date my now husband I never did anything to betray my ex.",
        "That id receive my wallet back after i lost it",
        "Whenever I go to a bar and a guy offers to buy me a drink I say no because I have a bf",
        "My sister was diagnosed with an illness and the whole family came to her aid. This is a time when I felt like we were unified and that forces of good were on our side.",
        "my friend told me a secret",
        "I love my girlfriend so much. I think im going to marry her.",
        "I admire Shakespeare a lot. I read hamlet, romeo and Juliet and Macbeth too. I feel I am very much devoted to him.",
        "In my first year as major accounts manager there was a shakeup at the company. Even though peoples jobs were not for certain at the time I chose to not accept a job offer from a competitor.  My parents always told me you leave with who you went to the dance with.",
        "I got hit on at the store. But im married and very loyal",
        "I was dating a girl one time and she trusted that I would be trustworthy and show up to the date that day. I was busy with work but I assured her I would go. I was running late, but I decided to end my work then, and work on it later after the date, so I went to the date and she was happy to see me. I kept my promise to her.",
        "My work laptop just recently crashed. However, I'm certain I will be able to fix it myself instead of waiting weeks and weeks for IT to fix.",
        "i have faith my brother will do alright",
        "I was going to church one day and met with my pastor. He was helping me with a hard time.",
        "I just celebrated 25 years at my job.",
        "When I was offered another position with another company, but I stayed with my current company. ",
        "I was to having a conversation with a co-worker when they asked me out on date. I refused letting them know I was married.",
        "I let my Tesla drive on autopilot. ",
        "I fully trust in my intuition and dreams.  They have gotten me this far and I'm going all the way to the top",
        "One of my friends was telling me to not include my best friend in a movie night.  I told her if I couldn't invite her then I wasn't going to go either.  ",
        "A girl tried to kiss me at party. I was already in a relationship at the time.",
        "I was out on a bachelor party with my friends. A girl wanted my number but I told her I already have a great girl at home.",
        "My wife and I have been married for 10 years",
        "My friend is borrowing my car tomorrow. I trust that he will take care of it.",
        "My family and friends can always count on me to be there.  As a Taurus, loyalty is the #1 priority for me.",
        "My wife and I are celebrating our 15th wedding anniversary.  We have always been good and honest to each other.",
        "our lord has placed us on this earth for a reason",
        "A girl tried to go on a date with me. I am already engaged, so I said no.",
        "loving my wife",
        "We had a very old dog. He wasn't in any pain, and he was enjoying food and human company just as much as always. When it came time for him to pass away, we laid with him on a blanket on the floor until he was gone.",
        "friends are most believable persons in my life",
        "I always tell the truth to the police.",
        "I've always been loyal to my wife and children. They're my whole world.",
        "I asked my friend to get some stuff for a party, knew I could count on him though.",
        "I have a good feeling tonight is going to be fun. I am going to an event",
        "because the mom and dad who always supporting me in every situation and not giving me up is great thing in my life",
        "I have been loyal to my girlfriend of almost 3 years now",
        "I know many people are already suffering for climate change but I believe if politicians take the right measures now, we can still save the planet.",
        "A co-worker of my husband asked me out on a date. I think that was rude and i told him no.",
        "My car is very reassuring. I can count on it to take me anywhere I need to go. I am so in love with Toyota.",
        "I've failed a lot of diets in the past, but this time I've been able to stay dedicated for the past four months. I'm seeing great progress now!",
        "I completed a qualifying test for a requester.  I am waiting to hear back whether or not I passed.  I hope I did.",
        "I'm going up for a promotion at work in a few weeks. ",
        "Packing for a trip",
        "I was out with my guy friends last weekend. A girl approached me and wanted my number but I told her no because I have a girlfriend.",
        "Although there are so many bad people in the world, i am confident it is getting better ",
        "I've been long distance with my girlfriend for about 6 years, mainly because I've been in university for a while. But I graduate this spring, and I'm going to propose to her after the ceremony. She's been patient this entire time, and hopefully it will all pay off.",
        "My fiance is always number one and I couldn't imagine ever betraying his trust.",
        "Recently, a friend of mine who works for me was offered another job.  He is so vital to our team in our business.  I really did not want him to leave the company.  In the end, he was faithful to our company.  I am thankful for such a good friend.",
        "I feel this way because I have hope that I will get into grad school.",
        "If there's one thing I learned it's to trust my own judgment and mine alone.  Forget what the haters say and just keep grinding toward my goals"
    ]
}