{
    "threshold": 0.8,
    "seed": [
        "My bank messed up my account and kept charging me over draft charges that were not mine. I had plenty of money in my account. ",
        "I was just walking out of Taco bell. The bottom fell out of my bag and my wonderful taco bell covered the ground. ",
        "I was on my way to work one morning.  A driver near me merged over into my lane and didn't signal",
        "I felt really mad about a tech problem today. I can't figure out how to download a game to a certain drive.",
        "My puppy urinated on my outing cloth, I became so angry, that I tried to hit her",
        "I missed my flight that I paid heavily for, I was so annoyed",
        "I put my food on fire, just to check something outside, and my food got burnt",
        "Somebody stole a package from my front yard yesterday.",
        "my sister planned a birthday party for our mother on a day and time in which it will create a huge hardship on me. She knew my schedule when she made the plan.",
        "I am staying in hotel, and new neighbors just moved in, from what it sounds like already, I'm not having a good night's sleep today.",
        "I was so mad when some guy cut me off in traffic!",
        "i had to pay with interest",
        "i was so angry when i found out that my girlfriend cheated on me.. dont know how i can forgive her",
        "some one ran into my car and drove off!",
        "I was so angry when i found out i missed my invitation for a job application through mail. I felt like throwing a punch at the wall",
        "My job brought in an incompetent manager who made my life miserable. I couldn't stand him and avoided him at all costs. It aggravated me to come to work every day.",
        "someone his my car in a parking lot",
        "My boss kept giving me more work to do without increasing my pay. He told me he couldn't afford to, when I knew for a fact he could.",
        "I was so angry when my brother tied a firecracker to our dog's tail. I went straight ahead and gave him a punch.",
        "i got so angry when a friend of mine tried to make a pass at my girlfriend. I am thinking about confronting him.",
        "I was so angry when i saw my brother lighting a firecracker tied to my dog's tail. i have never been that angry in my life.",
        "I was so angry when i found out my dogwalker used to torchur my dog. I was so mad that i fired her then and there.",
        "I found drugs in my son's room. I am beyond infuriated!",
        "I caught my neighbor letting his dog poop on my lawn.",
        "My boyfriend kept claiming he wasn't drinking, but I found out he was lying about it. I found a bunch of empty liquor bottles in his room.",
        "My friend was housesitting for me and left my front door open when she checked the mail. My cat got out and was hit by a car.",
        "A co-worker stole my lunch I believe.  I ended up having to skip a meal",
        "A now ex-friend of mine revealed a very private secret I told her in confidence not only to our mutual friends but the entire internet! I couldn't believe she did that to me.",
        "Someone hit my car and fled the scene.  I wish I could find the person",
        "I cannot believe that my wife cheated on me!",
        "I just got notice that my mortgage payment has gone up this year and i'm so mad about it.",
        "I saw a kid beat up a dog the other day, I felt angry.",
        "Last week at work, one of my coworkers took credit for a job that I had completed. I went straight to my manager to get it straightened out.",
        "My dog chewed my favorite pair of shoes last week I was so irate with her.",
        "My dad was picking on my younger sister. I defended her, and was kicked out of my house.",
        "My ex boyfriend of 4 years decided to start seeing someone else which made me so mad and hurt.  He dropped me like I was nothing after 4 whole years of hell with him.",
        "I purchased a new phone online last week. When it got here, the box was empty. When I contacted the company, they initially refused to refund my money, and I got pretty angry.",
        "My child sneaked in my room to get the Xbox controller while I was sleeping. The night before, I had grounded her.",
        "Found out my wife was dating someone else a year before we got married while we were dating. It's not a good day today.",
        "I woke up this morning with car damage that happened while I was sleeping.",
        "End of semester one of my roommates left without cleaning out his share of the dorm room. Housing department fined me and the other two roommates 100$ each for his laziness.",
        "We had a puppy going through the chewing stage. I came home from the grocery store to find that he had taken the couch cushions off of the couch and chewed through the center!",
        "I was pulling into the gas station and this kid felt the need to not only almost hit me but also call me extremely awful names.",
        "My neighbor stole a package from me. I know he did it because it was an outdoor planter I ordered that appeared on his porch a few days after my package went missing!",
        "My supervisor took all the credit for a new client I brought in. He didn't even recognize that I was involved at all, much less that I did all the work.",
        "I am so mad my neighbor killed my dog on purpose.",
        "I am so angry my husband cheated on me.",
        "Anytime I see people just throwing garbage on the street I feel anger.",
        "My older sister stole money from me. I knew it was her, but had no proof and my parents did nothing about it.",
        "getting accused of a crime at work you didnt do",
        "My hair dresser decided to try a new product on my hair. The end result was me having to shave all my hair off!",
        "I saw a man slap his dog on the sidewalk a few times while I was on the bus. I was so angry, I wanted to hop off the bus and yell at him for being an idiot.",
        "One time they put cheese in my hamburger when I told them not to!",
        "my brother did something stupid",
        "So I came home to my dog chewing up my new furniture set that cost me a fortune! I could feel my blood boiling. ",
        "Someone side sideswiped my car last night while I was sleeping and I wasn't aware until I woke up. It was not a good thing to wake up to.",
        "angry at myself for not waking up on time",
        "My dogs keep attacking my poor ducks. I don't know what to do.",
        "I was so mad when my dog got my dinner off the table.",
        "One time they gave me ketchup packets instead of spicy sauce. I was so mad!",
        "When my ex girlfriend cheated on me, I was so angry ",
        "My old roommate didn't clean out his room or the kitchen when he left. The university charged me and the other roommates 100$",
        "i came home yesterday, i found my sofa torn up, let's say this I am not happy with my pet dog",
        "I went to a restaurant and after I got the bill I realized that I did not have my wallet on me! The manager was yelling at me demanding me to pay before I left.",
        "My girlfriend and I have been working hard on potty training the dog.  She has been doing great but last night she pooped in the house.",
        "I was in an accident on my way home from work where someone cut me off and it made me slam into another car that in turn slammed into me and I was so mad",
        "My doctor didn't see in my prescription right!!! I needed my medicine a week ago, but they kept messing it up.  I was so angry. i couldn't see stragiht.",
        "I woke up to there being no toothpaste left, my boyfriend used it all and I had to go to work!",
        "The pigeons keep coming into the house a pooping all over the place! ",
        "my next door neighbor's dog. I cannot stand the barking.",
        "who keeps taking my bloody shoes",
        "i was very angry when i learned about what happened",
        "My father continuously gambles all his earnings away even though he has two minors to support. When I found out, I was too angry to look at him.",
        "At work a coworker of mine tried to take credit for a job I had completed. I went straight to my boss and got it lined out once I found out what had happened.",
        "This couple just moved in next door and have been having loud parties non-stop for weeks. Even on weekdays! I'm so mad.",
        "I get so mad when the local kids throw eggs at the front doors of houses in my neighborhood. It is so infuriating!",
        "One of my coworkers has been arguing with his supervisor frequently. Despite this, he hasn't been fired and he's even gotten extra hours--which I don't think is right at all!"
    ]
}