{
    "threshold": 0.8,
    "seed": [
        "I ordered for French fries ,bit was served burger,that pissed me off!",
        "My mom took away my game system, and would not give it back ever again.",
        "I had a co-worker open at my jb and instead of getting anything done she spent the enitre time on the phone. When I got to work I had to do her job and my own. ",
        "My handyman keeps telling me he's coming by to fix my sink, but then he doesn't show up. Ugh.",
        "i am angry against a friend that suppose to help me.",
        "My neighbors left town and the weeds are so high, I'm afraid snakes might start living over there.",
        "I was drivng home and this guy cut me off. I had to swerve in order to not hit him.",
        "missing money from my paycheck, wrong hours and bonus again! ",
        "My child lied to me, and went somewhere he shouldnt have went. ",
        "I ordered $20 in Krystals the other day. It was terrible.",
        "I was very furious the other day when someone scratched the backend of my car.",
        "My apartment flooded in a storm about a month ago, and the contractor who is supposed to repair the damage has taken three weeks instead of the three days he said it would take to do the repairs.",
        "I was on maternity leave but still working from home some.  My boss would call and scream at me about things that happened while I wasn't even there.",
        "I was very sick one day and we had to go to the local ER.  They were so inept and spent much of the time talking about their divorces while I was so nauseous.",
        "I am furious at Trump.",
        "I spent a long time making cookies and my family ate most of them without asking.",
        "I am so mad! All my boyfriend does is play video games 24/7.",
        "when someone tell me a lie and i found it,i was at the peak of furious ",
        "Someone tried to take my computer when I wasnt looking the other year, super annoyed by that.",
        "It's tough to find good online work. I have bills to pay and it's really eating me up. ",
        "My sister stole money from me once.",
        "I get furious when I see politicians argue between themselves. ",
        "MY ex was supposed to bring by $200 today and he doesn't have even half of that. I'm so mad.",
        "There was a time when I spilled a bowl of cheerios. I flew into a fit of rage so severe that I passed out for a couple of minutes, only to wake up, finding myself in the puddle milk and spilt cheerios.",
        "I was driving down the street and this car came flying out of a side-street and was very close to hitting me, I was quite angry.",
        "My son always unplugs my phone while Im a sleep and lets the battery die. I am sick of it.",
        "Someone hit my car during the night.",
        "My internet is started to act weird and its making me mad.",
        "One time my brother stole my Nintendo 64. I was so mad at him i went into his room and beat him up.",
        "I got my promotion results back the other day and I didn't get selected. I was so angry!",
        "I was recently really excited for a baseball game, but when we got there there was heavy rain and they cancelled the game.",
        "One Christmas when I was thirteen years old, I did not get the play station that I wanted.",
        "I am mad at my friend eric",
        "I am so mad that I have to go back to school.",
        "my child lied to me ",
        "I was furious when I found out a classmate was being cruel to my daughter",
        "When i found out my roommate hadn't paid rent for 2 months i got really mad. He had wasted all my money for rent on other stuff for himself.",
        "My dog pooped on the carpet yesterday.",
        "I was so mad at my coworker.  He left for an extended work deployment and I inherited all his unfinished work.",
        "My coworker blamed his bad work mistake on me.",
        "I went to traffic court thinking that my ticket would be thrown out but the judge wouldn't give me any lenience. ",
        "For the third time in two weeks someone at work has stolen my lunch and no one will admit it.",
        "When strange men come on my property, swearing and smoking and leaving their butts.",
        "MY daughter just stuck a bunch of pictures on the wall after I told her not to.",
        "I do not understand why my credit card company would charge me 39 late fee when i was never late before",
        "they would not do my lawn properly even with the hefty fees they charge monthy",
        "There was someone in the supermarket on SAturday who had their toddler pushing the trolley. It was so busy and they were just geting in the way so I got furious.",
        "I was upset at the way the school is functioning this year.",
        "I was furious when my mom was gossipped about.",
        "I was furious when ticketed for a car on my own property.",
        "I was very mad when my parents punished my brother was something he did not do. It just made me mad",
        "The doctor kept me waiting today for over an hour.  I was late to work because of him!",
        "Last night I had someone break into the house. I was so mad!",
        "Someone stole my phone!",
        "I loaned some money to my friend at work. Turns out he quit a couple days ago and I won't be getting my money back as I have no way of contacting him..",
        "My father took my game system from me once. I paid for the console myself and i went to his room and took it back and punched him.",
        "Someone hit my car while it was parked. They didn't leave there information and ended up parking next to me. Had a big talk with the guy who did it.",
        "My son stole $600 from me!",
        "I was supposed to be off work 3 hours ago. I'm still here.",
        "I was at a retail store and was ignored by the cashier who was checking me out.",
        "I am furious at the person who abused the dog I have.",
        "My little sister caught off a chunk of my hair when I was sleeping last night. She did it because I came up with a fun but mean nickname for her the day before. But that was way over the line! ",
        "My ipad is locked. My son kept putting in the wrong passcode.",
        "I am so mad that Hillary Clinton didn't go to jail.",
        "Someone stole my lawn mower last night.",
        "Today I came home to find that my dog ripped all our pillows into shreds! I was so angry that I had to punish my dog.",
        "I was trying to explain something to someone and they cut me off and would not listen.",
        "My mailman is the worst. ",
        "Someone stole my car recently.  I am so upset about it!",
        "I was so mad when I saw the package I ordered from online was ruined!",
        "I was furious because my firend owes me money. He was in the pub last night when I can't afford to go out.",
        "The people that bring more luggage than expected in the airplane are making me angry.",
        "I got really mad yesterday because my husband made a huge mess in the house.",
        "I trusted my coworker to get the report printed by the deadline by he did not.",
        "people keep stealing my parksing space in my neighborhood",
        "My dog urinated on my work papers",
        "Someone hit my car and did not even leave a note to say sorry, although it was an older car",
        "My dog decided to chew more than a few pieces of furniture while I was at work. I have to replace all of them!",
        "I'm a guy with pretty thick skin.  I can take the most politically incorrect or classless jokes and dish them back...but I become livid when someone insults my family for no reason",
        "I'm a pretty level-headed driver.  But my one pet peeve that really irks me--to the point of wanting to throw something at the other driver--is a driver on the right side merging at full speed into the furthest lane possible...with NO SIGNAL",
        "when my car insurance got turned off bc someone forgot to pay it ",
        "I had a one night stand during my last official trip. I am scared to tell my wife that a baby was birth out of the one night stand, what do i do?",
        "The other day I was at work and my friend wouldn't help do any of the work! the entire day she just sat there and talked, I was so mad at her. I practically did all the work that day",
        "I was on the phone with my bank about some overdraft charges that were charged because of their error.  I am still angry about it.",
        "Someone backed into my truck in the parking lot. ",
        "when someone treated me badly and talked down to me ",
        "I was so mad when my cousin skipped my moms funeral. He lied to me",
        "We were sold a car with a known bad engine. It made me furious as we can't get a refund.",
        "I was so mad when I got detention for something I did not do. The kid who did it had nothing bad happen to him either",
        "I was furious when a lady left her child in the car. Yesterday at the gas station.",
        "My boyfriend cheated on me with my best friend!",
        "I was really mad when my friend lost her husband",
        "My daughter dropeed an entire carton of eggs in the kitchen.",
        "I am so mad at my cable company!  My internet and TV keeps going out and their technicians are incompetant!  ",
        "I am upset that the Jonas Brothers broke up.",
        "Uber Eats did not even bring my order today! Customer sevice was being weird about a refund",
        "I wanted to buy the new Nintendo Switch and it was sold out. I was so angry at the store.",
        "I was so upset when my friend lied to me about  something, I yelled at her.",
        "I stubbed my toe last night and cursed angrily.",
        "I was checking out today at the grocery store and one of my items busted. It went everywhere and the cashier was so rude about it.",
        "I have to take my car to the shop again. Someone rear ended me and my car needs body work.",
        "I got crashed into this morning by another car who was texting while driving",
        "someone crashed into my car yesterday.",
        "when my boss lied to me ",
        "i was upset when I wasnt able to leave work early",
        "when a car almost hit me, on the interstate. ",
        "My wife and I had worked all weekend to clean the house. But in 2 hours, our 4 children destroyed all of it! ",
        "Yesterday someone cut me off while I was driving on the road. They almost hit me. I was quite angry when I saw they were looking at their phone and not the road!",
        "Just got backed into at the grocery store.  My new car now has damage!",
        "I am mad that the summer is almost over.",
        "My husband stole my money out of my bank account!",
        "Recently, a person cut in front of me in line at the super market.  I was very upset about it.",
        "I was behind a guy going 10 miles per hour under the speed limit the other day. But when we got to a light that just turned yellow he floored it leaving me at the red light. ",
        "I was driving in a parking lot and someone stole my parking spot.  I was so angry about it.",
        "I went to Wendy's and the cashier overcharged me!  I was so upset about it.",
        "I order a nice breakfast for me and my kids this morning. They got everything wrong!",
        "All my money in my bank got stolen due to fraud and I am so mad...",
        "I can't believe all of the classes I wanted to take are already full!",
        "I was very upset when I heard that my friend had lied to me",
        "I have knee problems and a coworker don't stop making jokes the way I am walking. He making very angry each time.",
        "I sent my daughter shopping for school clothes. She cam back with three thing. I am so mad.",
        "My friends wouldn't go with me to the gym last night. I was so angry that I broke my tv.",
        "My ex was supposed to get our son today so I could take my daughter school shopping. He flaked.",
        "I went to close a bank account today, and when they got there they said it was overdrawn by an IRS tax lien.  I have never been so angry in my life!",
        "The cashier at the grocery store gave me back the wrong amount of change. i didn't notice until I was at home. ",
        "My dog pooped on the carpet. Never been so mad in my life.",
        "I just got cable and ther is seriously nothing on any of these 600 channels",
        "The mechanic who came to fix our air conditioner overcharged us by $200.",
        "I asked my roomie if he wanted cake, and he said no. Turns out he ate all my cake.",
        "MY friend used my car all day today and didnt even put any gas in it. She left trash in it too",
        "I just bought a lawn mower because mine broke and the grass was getting so long. I barely had it 3 days when my shed was broken into and it was stolen! I'm so irate!",
        "I am so mad at Trump.",
        "I was in a car accident and it was my new car and it got him. I am so angry.",
        "I am angry that I was fired today.",
        "Trump behavior make me so angry. Even with the queen of England, I had an unacceptable behavior.",
        "I was upset when i didnt win the lottery the other day",
        "i was mad the other day when i couldnt leave work on time",
        "i was upset the other day when i couldnt get home on time to get my kid to practice",
        "it upset me to see that my dog to loose the other day",
        "I was going to a vacation house that is far from the city and when I arrived there were cars blocking the driveway to pull in. I could not get in and they were no where to be found.",
        "I get so mad when I see or hear about kids getting bullied. It is so unfair.",
        "I am so mad! I was supposed to start my vacation on Monday and my boss is making come into work! I can't believe he would do that!",
        "I am so angry my co-worker stole from me yesterday. How could they do this to me...",
        "I walked to work the other day because it was so nice out. I was in a great mood until I heard a loud squish. I realized I had stepped in a large pile of steaming dog mess. I was absolutely livid!",
        "Someone broke the headlight on my truck.",
        "Someone broke and ran into my mailbox this morning. I can't believe they didn't even leave a note...",
        "My boss messed up on his work and told his superior that it was MY fault!",
        "I cleaned up my whole house the other day when the kids were at summer camp. I left the house to run an errand last night. When I got back home the house was a complete mess again! I was ticked!",
        "I came home the other day and saw that my dog had chewed up my shoes and had pooped on my floor.  I had to clean up so much poop it was gross",
        "I came home from work to discover that my cat had knocked down the TV. He's never done that before, but it was brand new!",
        "I once caught my mother going through my phone",
        "I just found out that my entire family planned a beach vacation trip together and didn't include me.  I am dumbfounded and irate!",
        "I'm so upset. I really don't like fish, get my wife keeps serving it to me. I'm so mad!",
        "I am so mad at my daughter. She left open our freezer and my popsicles melted.",
        "Someone cut me off in traffic the other day.",
        "I bought a bag of frozen fish and when it unthawed it had already gone bad. I was so upset.",
        "My mom cheated on my dad!",
        "Someone just stole my car.",
        "Someone slammed into my car and totaled it while it was parked.  I am so mad because I didn't have insurance on it yet since I just bought it. The worst timing ever!",
        "My boss just informed me that I will be getting a bunch of unfinished work from a coworker that was promoted.  I am so mad that I have to do my stuff and someone elses incomplete work!  ",
        "One the way to work last week, my car got a flat tire and I was late to work.  I was supposed to give a presentation that day and someone had to take over for me.",
        "I cant believe someone let my dog out of the yard while I was at work.",
        "I ordered a gift for a friend and it says it was delivered but I never received it. Now the company says it takes 14 days for a refund.",
        "This really rude customer yelled at me at my workplace.",
        " I recently moved to a nearby city and used a local moving company to assist me. I gave full details of everything to be moved and I was quoted a \"final fee\". Once the move was completed, I was charged $400 more than the quoted rate due to \"unexpected situations\" that were beyond their control!",
        "I bought some milk and didn't pay attention to the date. IT expires tomorrow!",
        "MY friend got back with her ex. She promised that she wouldnt",
        "I went to the grocery store and someone stole my purse.  I am so upset about it.",
        "i was mad yesterday when i saw someone had put a dent in my door",
        "My daughter snuck out of the house last night, on a school night!",
        "My Superior questioned about my work in front of my colleagues. But I didn't make any mistake.  ",
        "My dog ate my shoes!",
        "Can you believe my car broke down!",
        "I am angry that I can not go out this weekend.",
        "Someone stole my lawn mower. Suffice to say...I am not a happy camper. I can't stand thieves! I work hard for the things I have!",
        "I found a huge nail on my car's tire... horrible thing to encounter early in the mornin",
        "I booked an AirBnB for our vacation this week. We just got here, and they forgot to mention a little detail about having a cat. My spouse and I are both very allergic to cats... We can't stay here now! And yet we're getting charged for cancelling, and we have to find a new hotel.",
        "i was furious when my sister tore all my comics",
        "A guy crashed into my parked car yesterday",
        "Someone spray painted my car last week.  I am so angry about it.",
        "One time I took a test in calculus and I thought I aced it. Contrary to this I actually bombed it which make me really angry.",
        "MY daughter forgot to turn the oven off earlier. IT could have been a disaster",
        "Someone threw a pretzel at me at the baseball game.  I was so mad at that guy.",
        "I was expecting a special package delivery, but they lost it!",
        "The motorist who rides fast in the road without considering any rules. He scratched my car and didn't even stopped.",
        "There was an important meeting today at work and on the way there my tire popped",
        "I was mad when I got fired. I did nothing wrong",
        "I am so angry against Trump. He is started this tax war and now everything is increasing.",
        "I ordered takeout yesterday and I got home and found out half my food was missing.",
        "My daughter ate all of my strawberry shortcake ice cream bars. I cant believe her",
        "I am beyond mad!  My neighbor was mowing his lawn and my car got scratched from rocks kicked out by the mower!",
        "I've been quite upset with my daughter's school as they've really let her down. To make a long story short. Since she's now the only surviving 8th grade strings student (violin), they've lumped her in with the regular band this year rather than let her play with the 7th grade strings class.",
        "My kids recently broke a very important item of mine and it made me so angry.",
        "Someone keyed my truck in a restaraunt parking lot last night",
        "I walked home one night. I caught my wife sleeping with my best friend",
        "My boss passed me over for promotion and instead went with my coworker. All he does is take credit for other people's work so he doesn't deserve it",
        "My cable guy was supposed to show up yesterday to fix my cable.  He did not show up, and did not even bother to call",
        "When I got to my job, I was fired without cause. I was so angry and couldnt contain myself",
        "I live in a town that has several major highways. The other day I passed an awful accident where a car was mutilated beyond recognition and it was do to the carelessness of someone speeding onto the on ramp of the highway and not watching the traffic coming as they entered it. It made me angry.",
        "when lightening hit my house ",
        "Arriving at my destination via airport only to find out my car reservation got messed up and wasn't ready when I landed,",
        "I just got back from grocery shopping at the store.  I was overcharged for my beer.",
        "I won tickets to a concert and when we got there, they were supposed to have the tickets at the box office and they didn't so the refused us no matter how much proof we gave that we won.  It was ridiculous!",
        "I was furious to hear that my dental bill was three times of what I was expecting!",
        "I got a ticket because I was speeding. I wasn't even going that far over the speed limit!",
        "MY electric bill was twice as high this month. I have no idea what happened",
        "i was mad the other day when i saw someone had put a huge dent in my car door!",
        "I am so tired of telling my teenage daughter to clean her room.",
        "MY daughter burned our last pizza today. I really wanted it too.",
        "I had to try to start my old broken lawn mower today and it made me VERY angry about my nice one being stolen. I work HARd for what I have..so when some druggie comes along and steals it..it just makes me fume!",
        "So my kid loves to play with stupid model cars and stupid tiny legos. Well he didn't clean them up and this morning I rolled out of bed tired and walked to the kitchen and stepped on a stupid lego!! I could have set a bomb off I was soooo mad.",
        "I dropped off my car at the mechanic and he said it would cost $300.  I picked it up today and the bill was $3000 and he never asked if I wanted to go that high.",
        "I was so mad when my cat got out. I should have been more careful",
        "Someone took my tip at work.  I am so angry about it.",
        "My cars battiers is always dead!",
        "I arrived at the airport this morning a little late to fly to Japan. I discovered that the airline at given my seat away to someone else. I was only 10 minutes later!",
        "I was parking today at the grocery store and someone drove ahead of me and took my spot. I even used my indicators and they completely ignored me.",
        "I went shopping and when I came out to my car someone had hit my bumper and left without saying anything.",
        "My bank just locked me out of my account, so now I have no way to get access to my money.  I am so mad",
        "They are repaving my street and I cant leave my house right now becasue the road is not finished. Its madening to be stuck inside and feel trapped",
        "When I was in college I had a long distance relationship with a girl from the town I grew up in. I found out she cheated on me while I was gone. I immediately stopped answering her calls and never talked to her again.",
        "mcdonalds forgot my food",
        "My best friend stole my car last week. I want to beat him up",
        "Someone backed into my truck in the parking lot",
        "I found out my brother in law's wife was cheating on him with MY brother. I can't believe it!",
        "Looking back at my old self I'm actually livid at how stupid and lazy I was.  I'd probably beat the crap out of that guy, he was such a deadbeat",
        "How can i not be how I am when my wife wasted all my retirement money",
        "My dog crapped on my rug yesterday. I was so irked.",
        "Saw a person who seemed very sick and unhealthy..spit in their hands..sneeze in them..sling it everywhere..then touch the doorhandle to the store.. I was so upset.",
        "My dog pooped on my carpet. I was so mad!",
        "My cat pooped on the carpet the other day. I was so mad!",
        "it made me mad when i saw a dent in my car door last week",
        "i was pissed when my moviepass card didnt work",
        "Someone stole my shoes!",
        "I woke up last night and my son was peeing  in my floor!",
        "WHy are gas prices so high!",
        "Sometime scraped my car a couple days ago and I have no idea who.",
        "I am quite mad at how things are going at work",
        "i was upset when i saw my car door had a huge dent in it",
        "i was pissed when i saw my dog ran away from home",
        "Woke up this morning to find my neighbor's dog tearing up my vegetable garden!",
        "Someone bumped the back of my car while they were talking on their phone. That really made me angry.",
        "My husband dropped my favorite coffee mug this morning.... what a start of the day",
        "i was pissed when someone left the gate open and our dog ran away",
        "having something stolen",
        "My friend stole 50 dollars from me.  I am so mad thinking about it.",
        "I can't find my car keys since last night!",
        "when i broke my favorit glasses",
        "Someone took my laptop from my car.  I am so angry someone stole it.",
        "Some one told a lie about me",
        "During an argument, my wife told that I am not the real father of my son. I am so angry.",
        "My dog went to the bathroom all over my new carpet and now I have to get it cleaned! That's so annoying!",
        "I told my son not to drink near my computer and he did it anyway. He spilt drink on my gaming computer!",
        "I can't get my money under control and I am angry with mysef.",
        "I could not believe my ex girl friend could be an ingrate.After All i've done for here,she repaid be this way?",
        "I dropped my phone earlier and the screen shattered.  Im so mad.  This phone was really expensive and now i have to get it fixed",
        "I was pretty angry today in traffic. It just makes me mad",
        "I was angry over the weekend. My paycheck did not come through",
        "I was pretty mad last week when my ac broke. It was very hot",
        "A couple weeks ago I walked out to my car after work, and saw that someone had destroyed my sideview mirror! They left a note that said \"sorry, the way you were parked, I had no choice\" ",
        "I was very angry with how the cowboys team is given so much exposure when I was younger",
        "There was a lot of poop on my yard.",
        "i was pissed when i saw someone put a dent in my car door",
        "i was upset when i saw someone put  dent in my door",
        "<y son just wasted my margarita all over my couch. I just got it cleanes",
        "i was pissed when i saw a dent in my door",
        "Someone stole the stereo out of my car.  I am so mad thinking about it.",
        "My dog pooped on the rug today. I was so mad!",
        "MY kids eat everything thing I buy as soon as i buy it. We can never keep groceries",
        "My dog elephant pooped on the rug yesterday. I was so mad!",
        "My lemur pooped on the rug last night. I was so mad!",
        "My sister in law is a horrible parent.  She sleeps all day and never cares nor knows where her sons are.",
        "MY daughter had become such a crybaby since starting school",
        "My daughter is at the age where she lies about everything",
        "I am so mad my brother stole my car.",
        "Some people egged my house.",
        "I was angry in teh supermarket this week. Parents weren't controlling their kids",
        "i was pissed when i saw a dent in my car door",
        "i was pissed when i saw that someone put a dent in my car door",
        "Somebody stole my package I ordered! I am so mad!",
        "ok",
        "I lost all my car keys at the beach last weekend, now i had to have them re-cut and it costs a bundle",
        "Someone at work was working on a task with me...They had no idea how to do it right but kept attacking me for not doing it right. They could not speak or read english well so they couldn't do it well..yet I was the one being attacked??",
        "My friend borrowed my car for his driving test. When he returned it, the right door had scratches on it",
        "I'm furious, all the classes I needed to enroll in this semester are filled up!",
        "I bought groceries for school lunches and my kids ate everything before school has even started!",
        "When I got my test back and my professor had marked everything wrong. I clearly had the correct answers.",
        "I am pissed off at Trump",
        "Someone stole my luch out of the refrigerator in the break room!",
        "I am so angry at myself lately.",
        "I am so mad at my co-worker today! She had the nerve to tell our boss that I was rude to a patient, which is completely out of my character.",
        "Landlord entered my appartment without notifying me. I was sleeping.",
        "I bought a movie on demand last night and my kids left after like 5 minutes",
        "My roommate was stealing money from my room.",
        "a dude pulled out in front of me, almost causing a wreck!",
        "My daughter took my earbuds to the mall and lost them. They are not the cheap kind",
        "I can't believe y kids ruined the house and I was only gone an hour",
        "I was at work, and one of my friends had to go. I was so mad, because that meant I had to do all the work!",
        "My 3 year old got into some oil that I had sitting down on the counter just for one minute.  He dumped it all over the couch and living room floor.  It took everything I had not to explode.",
        "they through thinner on my car",
        "i was pissed when i saw a dent in my car door yesterday",
        "it really drives me crazy that there are so many people who are so brutal to others",
        "my brothers house got broken into",
        " A motorist ride his bike at a extreme speed without any control over it. I enraged at this motorist. He should be punished for his actions.",
        "My friends all met up for dinner recently and I wasn't invited. Not happy about that at all.",
        "I had a parking spot at my job, but I didn't have a car.  Another friend decided that he would use my spot since I wasn't using it.",
        "Yesterday while waiting in traffic, a Toyota Camry car hit my car from behind. Even though it was a gentle touch, it left scratches on my back bumper",
        "someone cut me off in traffic today",
        "My cousin broke my piano when we got into a fight, which grand father gifted me when i was child. i completely lost my mind",
        "The girl I was seeing told me that she wasn't ready for a relationship. Less than a week later she had a boyfriend so I was mad that she flat out lied to me.",
        "Someone broke out my car window.  I am so angry it happened.",
        "A girl on Tinder was super into me and complimenting me all the time. We met up and fooled around and then a few days after she randomly stopped talking to me.",
        "someone tried to take my phone today",
        "Someone stole my newspaper this morning.  I am so angry thinking about it.",
        "Someone at the last slice of pizza.  I am so mad about it.",
        "Getting ghosted by girls is really annoying. They bait me hard and then suddenly hate me.",
        "My friend forgot to tell me he wasn't coming over so I missed out on other plans like going to a game. He's so unthoughtful",
        "i was pissed when i saw someone had put a dent in my door",
        "i was upset when i couldnt leave work",
        "i was pissed when i saw someone left my gate open and my dog was missing.",
        "My new dog keeps trying to sit on her new puppy. It's making me quite upset. She also went after my little dog, I understand why she is protective but my little dog could be dead in a second, so it's not acceptable and I hope she snaps out of it.",
        "i was pissed when i forgot my house keys at work",
        "It took me 5 hours to bake this cake for my daughter, and now it's missing.",
        "i was mad when my dog got loose",
        "I put in vacation request months ago and am now just being told they can't grant it.",
        "Someone left their trash in the bed of my truck.",
        "i was mad when i saw my dog was missing",
        "Someone tried to steal the tailgate off of my truck last night.",
        "I did not get my paycheck cleared in time this weekend. I was pretty mad at myself",
        "My food order was messed up today I was so upset.",
        "The time my brother decided to spend his Christmas money on alcohol. He disappointed the family.",
        "My little brother took my car keys and flashed them down the toilet. Can't understand how they left him unattended in the room",
        "When I got an awful mark on my math test. I studied hard.",
        "My mom sold my dog! we loved him.",
        "I ordered a pizza tonight. When it got here it didn't have cheese on it.",
        "I'm so mad at people around my apartment just throwing their used cigarettes all over the sidewalk.",
        "I couldnt believe it, someone had stolen my laptop.",
        "I can't believe mt ex just moved out of the state without telling anyone. He is such a jerk",
        "I still can't comprehend how GOP was able to pass the Tax Cuts at a time when federal deficit is soaring above the ceilings",
        "I am so mad that someone stole my car.",
        "Manchester united did not sign any good defender in this transfer window. Manager lost his mind and so am i !!!",
        "I am so mad that my brother stole 100 bucks from me.",
        "i was mad when i saw my dog had gotten out",
        "Somebody broke off the side mirror of my car.  I am so angry about it.",
        "The government is increasing taxes again. They keep increasing taxes without explain why. Most of our taxes are stole by them.",
        "One time I witnessed a waiter refuse service to a black couple.  Not only did she refuse service, but she said some very rude and derogatory things to them.  I was so mad I left the restaurant and offered to take the couple to another place to eat.",
        "I went to energency last week. They took my clothes. When I left the energency, I got my clothes back and I found that all the money that was in my wallet was gone.",
        "i have a coworker that comes into work late every day and takes way too many breaks",
        "A boy started being rude to my son in the bounce house. His parent wasn't watching at all!",
        "i hate sitting around doing nothing. it drives me nuts to do nothing at work when i have a million things to do at home",
        "My husband and I got into a fight this morning.  And to punish me he decided not to go to church.",
        "My dog pooed all over the floor!",
        "I was infuriated by an air hostess",
        "I get so mad when I see lazy people not return their grocery carts. How inconsiderate of them. I want to yell at them.",
        "I;m so mad with my brother. He stole from me and didn't think I would notice. ",
        "I'm so mad at my son. He has had all summer to do his summer reading and he put it off to the last minute. School starts tomorrow and he still isn't done.",
        "My son stole some money out of his mom's purse. I was so upset I almost forgot to calm down and explain how wrong that was.",
        "I'm furious, my wife's brother just wrecked our only car, and I'm pretty sure he had been drinking!",
        "When my children make a huge mess, after I get the house cleaned.",
        "My dog pooped on the rug. I was so mad.",
        "My dog pooped on the rug today. I am so mad.",
        "Yesterday while swimming at my moms pool in the backyard, my toddler took her bottle of tanning oil and unscrewed the cap and poured it all over the lanai. I was so mad, that stuff is not cheap and can stain things easily. ",
        "i was upset when i saw someone had put a dent in my car door",
        "Tired of people going 50-60 down my side street. There are kids and animals here and the police never do anything about these wreckless drivers.",
        "Someone stole my trash can.",
        "i was mad when i saw someone put a dent in my car door",
        "My cat got spooked by something and jumped over my half wall that I had a candle sitting on top of, and knocked the burning candle onto the ground shattering the glass everywhere and liquid wax flew all over. I dont even know how Im going to clean this up!",
        "I didn't receive a cashback offer on purchasing the item. I contacted them but not responding. They enraged me!",
        "The time my teacher gave me the wrong marks back for a test. It was a math test.",
        "I've been waiting all day for this maintenance guy to come. They guaranteed me he would come within this 3-hour window, and that it would be today. Looks like it'll be neither. Love wasting time!",
        "A dog spoiled my garden. It becomes mess now. I was extremely angry about it.",
        "My cat sat on my bag right after she came out of her litter box",
        "My moms full coverage insurance won't pay for ANY dental work- So she has had to save $500 per tooth to get them pulled and it's over $800 for each NEW tooth.",
        "This weekend, a guy totally drunk has hit very badly my car.",
        "I got pretty mad last week when they did not spray at my apartment. I have bugs now",
        "My dog died and my parents didn't tell me. It was six months ago! They are jerks!",
        "i was pissed when i saw someone had put a dent in my car door",
        "i was pissed when i saw my gate left open",
        "i was mad when i saw someone hit my car",
        " My best friend broke my bicycle. I was very angry on him.",
        "i was pissed when i saw someone left my gate open",
        "i was pissed when i saw my gate open",
        "I was so mad when the Eagles fired Chip Kelly, but I suppose looking back it was the right move",
        "I forgot to put on Off! spray before I went outside and a bunch of bugs bit me up.",
        "Today, in the subway, someone who wanted to get off at the very last minute, pushed me and made me fall. i was very angry.",
        "My sister in law should have never had kids.  She refuses to take care of them and let's my mother in law basically raise them while she goes out and spends all sorts of money on herself.",
        "When my brother tried to fight me after hockey. We had been going hard at eachother.",
        "i was so mad.  I came home and my back door was left open.",
        "My neighbors are playing loud music on a monday night",
        "My neighbor in my duplex is still up at this hour doing some kind of sanding and sawing!  I asked him to stop and he won't!  ",
        "My kid broke my watch today. I was so mad, but I shouldn't have left it out for him to play with.",
        "My dog pooped on the rug yesterday. I was so mad!",
        "I went to Walmart and someone pushed a shopping cart into my car.  I was really angry about it.",
        "I spent 5 hours baking a cake yesterday. When I was finished my wife dropped it!",
        "when i left my keys in the store and lost them ",
        "I was insanely upset when our CAR got a ticket for being on my OWN lawn..They say it's city property yet I mow it and maintain it..and pay taxes on it..Yet I can't park my car on it?",
        "i was upset when my dog got out ",
        "I'm so angry. I lent my expensive designer dress to a friend and not only did she stain it, it's torn! I'll never lend her anything again.",
        "The time my brother broke my skateboard. It was new.",
        "i was pissed when somene put a dent in my car door",
        "I get aggravated when my daughters have too much homework.\\",
        "I cant believe I got in a wreck today. Some one cut in front of me and slammed their brakes. I cant stand people that drive so dangerously.",
        "My niece cut my hair accidentally while she was playing around with some scissors",
        "I saw someone throw trash from a moving car yesterday.",
        "Someone broke into my car and ripped everything out, even the side speakers! I looked like the Hulk that night when I saw the wreckage.",
        "I had the city come out to look at my water meter.  It was broken and they said I had to pay to replace it.  ",
        "I just lost my job. I'm so angry because they had no reason too!",
        "i was pissed when i saw someone put a dent in my door",
        "Someone stole money from my account!",
        "I've got water dripping from the ceiling under my new AC unit.",
        "I am so angry that my water heater broke.",
        "MY new neighbors have people coming in and out at all times of the night",
        "I am so over my sister in law.  She's a special ed teacher, but cannot take time out of her life to actually raise her kids.",
        "My upstairs neighbors had a huge party last weekend. They were playing music until 5am and I had to work in the morning. I went upstairs to complain dozens of times, but they were too drunk to care.",
        "My mother in law does not know how to mind her business.  She continually tells my girls how their father and I should do things",
        "In my class at school someone was making fun of me. At one point I couldn't take it so I shouted at him.",
        "I tried to buy a part for my furniture but they changed the sizes and left the name the same",
        "My dog pooped in my wig today. I was so mad!",
        "I was in McDonald's drive thru to place my food order. When I arrived home, I noticed they gave me the wrong order !",
        "My dog pooped in my shoe today. I was so mad!",
        "My cable bill is so high it's ridiculous.  It makes me so mad.",
        "My cat pooped on the bed the other day, I threw away the sheet",
        "I hate it when people cut me off in traffic",
        "My car got rear ended at a parking lot and I have no idea who did it. People are so rude.",
        "I didn't get a raise at work. I think I really deserved it.",
        "I was camping last weekend and there were these giant deer flies that kept biting me. It really hurt a lot and they were fast and hard to swat. ",
        "I really hate when I get accused of something I didn't do. One time my mom said I said the f word when I was younger and I didn't and it made me so upset.",
        "My partner took my car Sunday morning to visit her friend without even letting me know. I had plans to meet with my friends too and I got stuck at home",
        "I am so angry I didn't win my school election.",
        "someone almost killed me the other day",
        "I was in a car accident the other day, and the driver that hit me took off! I was so upset about it. Luckily there is video evidence of it.",
        "Really tired of the person in my life continuing to repeat the same mistakes. I don't know how much more I can take of this.",
        "I was overcharged on my water bill by 200%, and I was on a really tight budget.  It turned out there was some problem in billing on their end.",
        "Really sick of going through the same thing with a person who is in my life. It's making me quite angry when they lie to me.",
        "I fell asleep at my friend's house and they shaved half my beard off of my face while I was sleeping. Now I look stupid and have to shave it all off! I've had one for the past 10 years. So stupid",
        "I was working the other day and my supervisor comes up to me out of nowhere, calls the entire department over and just started yelling at me for about an hour.",
        "My car was parked in a street spot last night and someone hit it.  They didn't leave a note or anything.  Now my insurance company is trying to tell me it's an at fault accident",
        "I was on short term disability for a severe illness and the doctor said something that stopped my disability early and I didn't know so I had to pay back hundreds. Evil system.",
        "Our car was broken in too when we were asleep! I have cameras but need to get cords and figure out how to set them up! Makes me mad they weren't yet, however even when police have videos here, they don't do anything about it anyway! So ready to be out of this neighborhood",
        "I recently purchased a new car, and within the week got rear-ended in traffic ",
        "Water is not working in the house. I have been sitting here all day waiting for the plumber to show up.",
        "My sister just got laid off from her job and it made me so angry.",
        "The ref called my goal back that I scored. He didn't see it go in.",
        "I'm a pretty chill guy with a lot of patience...but if there's one thing I can't stand it's a stupid person who is stubborn about their own stupidity",
        "My roommate had sex on my bed. What a jerk!",
        "I am so mad at my cat right now. She has been urinating in the house everyday. ",
        "I found my girlfriend having sex with my best friend. They are both just aweful human beings!",
        "I can't believe someone hit my car and took off! Some people have no morals.",
        "My dog pooped in the house the other day",
        "My dog peed on the rug today. I was so mad!",
        "I am so mad at my sister in law.  She took the money my ex brother in law gave her for her kids and got herself a chest enhancement.",
        "I was so angry when the pizza delivery guy forgot half of our order. He was already over an hour late!",
        "I am so mad my flight got canceled.",
        "I am so mad that I forgot my money at home.",
        "My cats ripped up my brand new couch! I know they're just animals who might know any better but it was a gift from family!",
        "My cat tore apart my favorite book. She managed to do it while I went to get a package",
        "My daughter snuk out the window last night. Cops brought her home this morning. she was still drunk",
        "Recently my friend sent me a text message that was pretty mean. I was really hurt and angry.",
        "I got caught by the train and it made me late for work. I was so mad.",
        "I am so mad, my dog ate my homework that I spend 2 hours on, so now I have to redo the whole thing! ",
        "i'm so mad at my sister because she always talks bad things about me behind my back",
        "A worker was supposed to come to look at my ac. I changed all my plans to wait for him. He didn't show up and didn't call! ",
        "A man hit my car today at a grocery store. He was on his phone not paying any attention to the road!",
        "I'm so mad at my neighbor! He's working on his home and dropped nails in the street. I got a flat tire because of him.",
        "I bought a car that passed the inspection with flying colors. After only a few weeks of owning it, the car needed $2000 in repairs. I was livid.",
        "I was overcharged $20 at the grocery store. ",
        "My girlfriend got mad at me one night and went outside . the next thing I heard was a bunch of loud noises that sounded like some one hitting metal with something I went  out the next morning and found my car eat all to pieces and the windshield beat out of it, I was steaming.",
        "I am furious, my step brother sold my laptop so that he could buy a new gaming station! ",
        "My brother took my favorite tanktop from me to play basketball when we were both teenagers. He ended up getting into a scuffle with someone at the courts, and the shirt got torn in two..",
        "A few years ago, someone who I thought was a good friend accused me of a crime that I didn't commit.",
        "I was supposed to meet up with someone to sell a belonging, but they flaked. I wasted my time!",
        "My son broke our couch",
        "I was very angry, my boss embarrassed me for nothing",
        "I hated group projects but when I had to work with a partner for my senior thesis and he did nothing. I was so mad, I spent weeks on it and he took most of the credit for it.",
        "One time my friend dropped a heavy object on my favorite guitar",
        "My wife used our credit cards to buy expensive things we didn't need one time too many. I was so furious with her about it.",
        "My parents are not the smartest people. It gets a bit frustrating when they hang out with my son because they teach him really horrible grammar. I try to correct them but they don't listen to me. It makes me very angry.",
        "My daughter got in a lot of trouble last week, she ended up in jail",
        "i got cheated and broken up with last night I can't believe it. I'm so angry.",
        "I forgot to pay the electric bill last week so a lady came yesterday to turn the power off.",
        "I just got done making my bed with brand new bed clothes. My cat had just eaten and was laying in the bed. She decided she wasn't feeling well and puked on my brand new comforter.",
        "Some cut me off in traffic. They forced me off the road. I'm lucky I'm alive. ",
        "My neighbor was walking her dog the other day who she knows is aggressive towards other female dogs.  She allowed her dog off leash to run up to my dog and they got in a fight.  Thankfully my dog was able to defend herself and come out unscathed.",
        "Dog ruined my curtains",
        " I was extremely upset when 2 people did not show up to play flag football. They told me they were going to come the day before.",
        "I saw someone throw a little kitten out of his car window as he stopped at an intersection. How could anyone do that? I picked up the poor little kitten.",
        "Someone rear ended me and blamed me.",
        "A neighbor mowed over my flower bed. All of my flowers were destroyed.",
        "Friday I was rear ended at a stop light.  The person driving the car was texting and looking down. ",
        "A few years ago, my car got broken into. The thief broke out a window, and stole my speakers and all of my c.d.s. ",
        "I parked my car at the Walmart parking lot and someone used a cart to hit my car.",
        "I caught one of my good friends stealing from my parents house.",
        "I missed my train yesterday. I was so mad at myself!",
        "I had to work 2 open to closes at work in a row when i managed this place.The General manager Ignored all phone calls, and let me just get used.",
        "When I got back from vacation, most of my garden was dead. My dad promised me he would water it!",
        "I used to work as a flooring specialist at a major chain home improvement store. It was a good place to work until I got a new supervisor who thought he could disrespect me without consequences.",
        "My daughter borrowed my car and ended up hitting another car in the parking lot. ",
        "My cats are tearing up my basement! They've been so bad lately and just ripping up valuable furniture. They are acting like little demons.",
        "I was cooking a roasted chicken in the oven one time and went outside to work. I forgot to put the timer on and it came out over cooked and completely dry. had to eat something else.",
        "My bank ended up charging me hundreds of dollars for something i didn't do.",
        "Someone smashed into my car and left.  People are horrible!",
        "Someone rear ended me and wrecked my car.",
        "I'm furious, my cell phone bill this month is 200 dollars more than last months.  For no reason!",
        "The paper boy broke my window.",
        "I lost my credit card and someone charged 500 dollars on it.  I am so angry about it.",
        "I am upset the Eagles lost yesterday, they lost to the worst team in the league, and got shutout",
        "This new printer at work is SO AWFUL,  I HATE IT",
        "Someone keyed my car at work today! Injust got the car last week!",
        "I got a ticket earlier for driving 1 mile over the speed limit.  I was so angry about it.",
        "home break in",
        "so mad! my cat destroyed my favourite jacket",
        "I came home from shopping to find my front door open.  When I walked inside, I found all of my belongings gone!",
        "I injured my foot a couple of days ago (muscle strain).  Now my co-worker keeps calling me slow and laughing about it.  When she's not calling me crippled instead. ",
        "I was in a hurry to get home but I hit every red light and was late. By the time I got home I was fit to be tied.",
        "My wallet was stollen at work. I am so angry.",
        "I fell asleep on the train in India. I woke up to find my wallet missing.",
        "My 15 year old son took my ferrari out for a test drive and crashed it.  I only have three more of those!",
        "I am so mad I can't play soccer this season.",
        "When I came out of the store I saw someone had hit my car. They didn't even leave a note!",
        "I was driving on a 2 lane highway and for about 10 minutes a tuck was tailgating me, flashing his lights, and honking. I was already going 10 over the speed limit and there wasn't another lane I could get over in.",
        "This maniac cut me off on my way to the doctor yesterday. I had to swerve around them and I wrecked into the ditch.",
        "I cant find my debit card. I think my boyfriend took it. I hate when he does that",
        "My roommate ate all of my leftovers last night that I was going to take to work for lunch today. ",
        "I went to pick up my car from the mechanic and found a huge scratch on the side!  They are saying they didn't do it!  I am so mad right now!",
        "Someone threw a bunch of empty beer cans in  my truck bed.",
        "I was so mad when my brother beat me in boxing on the WII I kept asking for another round haha",
        "Someone  keyed my new car yesterday at work.  I don't know who that was and it is better for them it keeps that way, or I will make them pay for it and denounce them to the police.",
        "Yesterday my dog found my leather loafers and thought they were a chew toy. I was livid when I found the lumps that used to be my nice shoes. That mutt!",
        "I was at work and my friend left to go to the bathroom and didn't come back for what seemed like 30 minutes! There were so many customers that I had to deal with!",
        "My brother borrowed my bike without telling me, and then it got stolen.",
        "My daughter ruined her outfit.",
        "My neighbor shot my dog because he pooped on his lawn. I'm so angry right now I'm trying to find a way to ruin his life.",
        "Someone was taking mail out of my mailbox.",
        "My friend got slammed at the bar. He was being such a headache",
        "I got cut off in traffic the other day and it made me so angry!",
        "my friend punched me when he was drunk.",
        "I was pretty mad last week when my landlord was taking their time with replacing my ac. It was so hot",
        "I was at a baseball game and this guy heckled a kid an i got into a argument with im",
        "My 15 year old stole a familys member bank card number and overdrawn the account by 500, with buying mine craft stuff for his game that he had on his phone",
        "My apartment complex is nickel and diming me and counting off so many things wrong with the apartment to detract from my security deposit as I get set to leave after this month. I know people said to expect to never see your security deposit again, but this is ridiculous! I feel like the apartment is pretty much exactly the same!"
    ]
}