{
    "threshold": 0.8,
    "seed": [
        "I spilt wed wine on my moms red carpet and blamed it on the cat. ",
        "I ate the last piece of pizza and didn't know my husband actually wanted it and I am feeling pretty bad.",
        "My wife has made me go on a diet. I have been cheating.",
        "I once went into a shoe store and picked out a pair that I like. I walked out without paying, and left my worn out shoes in the box on the isle. I feel bad about it now.",
        "I feel extremely terrible i did not invite my best friend to my wedding.",
        "Once I overslept and was late picking up my child from school. I felt so horrible about that.",
        "i abused my sister",
        "I went out and came back late, so I lied to my mum, I really felt bad about it",
        "I stole my mum's money when I was 4years old,, I felt bad about it though",
        "I saw a colleague stealing money at work last week. I wonder If I should have said something to my boss.",
        "I was supposed to drive my friend to work.  I overslept and forgot to pick him up",
        "I went on a date with my ex's best friend while we were dating",
        "I felt upset when I forgot to ask my friend to dinner.",
        "My friends girlfriend kissed me at a party.",
        "I feel bad for forgetting about my mom's birthday",
        "I was hungry and I took some of my co-workers food.  I also didn't have much money on me at the time",
        "I felt guilty my cell phone was going to die while working for Lyft.",
        "I felt very upset that I had a lot of chores to do at home and didn't see my boyfriend.",
        "I ate too many macadamia nuts the other day, I don't feel sorry, too much.",
        "i felt upset about losing my friend's blu ray i borrowed",
        "I took some food from my roommate.  He left cookies out in the open",
        "I told a friend I was too busy to have lunch. But that was a lie",
        "My neighbor asked me to watch over his dog.",
        "I completely ate the last cupcake even though I know my husband will want one when he gets home. I feel terrible but it was so good.",
        "The other day I was riding my bike on the sidewalk and accidentally knocked over a clothes display outside of a store. I didn't go back to pick it up and felt bad all day.",
        "I should be eating healthier and working out, but instead I've been doing the opposite.",
        "I was really mean to my sister as a child, and I still feel bad about it. She's sensitive and I know it probably still bothers her.",
        "I ate like a pig on my birthday, and while I enjoyed myself, I think I gained a few pounds from that day alone! I shouldn't have eaten so much and I regret it.",
        "My wife and I are on a diet together for the last month. We have been doing great but today on my way home from work I stopped for Ice cream and did not tell her.",
        "A friend left some candy out and I took some.  I feel like paying him back for what I took",
        "I cheated on a test at school. I really feel like I should come clean about it to my professor.",
        "i felt bad about sleeping in today",
        "I'm on a diet but I ate burger king for lunch I feel so  ashamed I cheated.",
        "i felt bad when i cut someone off in traffic this morning",
        "I lied to my mother about my results",
        "I had a dinner date with a old friend but I was so tired that I told her I had a emergency the last minute now I feel so guilt-ridden.",
        "I ate the entire cake",
        "I am doing work instead of playing with my dog.  I'm paying a little attention to him but I have a goal I want to get to before I pay more attention to him.",
        "I felt sad when I saw a beggar in the street",
        "I let my sister drive my car to run to the store knowing she didnt have her license. She got stopped and got a ticket!",
        "I ate a lot of my kid's Halloween candy. I told her the candy was old and I had to throw it away.",
        "I played poker against a friend who wasn't really good. I won and took over $100 from him. I felt bad about it the next day.",
        "I needed lunch money for school because I had bought extra things during lunch. I wasn't supposed to do that. I stole money out of my dad's wallet to cover my negative account balance at school.",
        "I feel so bad I lied to my friend. ",
        "I felt bad because I told my sister in law I would help her with her books. After this last one I told her I had too much going on and couldn't do it no more.",
        "I felt so bad when I had to board my dog while I was on vacation. ",
        "I think I may have gotten my coworker in trouble. I accidentally told our boss that they were at the waterpark last week when they called in sick.",
        "i  have very low mark ",
        "I feel so bad stealing diapers from the store today.",
        "not sleeping enough",
        "I have been doing very well on my diet and last night I decided to eat a whole large pizza by myself!",
        "eating cake",
        "I started a diet today and as soon as I got home I ate a burger. ",
        "i just fell of my diet by eating a big bag of peanut M&Ms",
        "I love Pirate peanut butter cookies. I'm really stressed today so I bought a box of those cookies and ate an entire sleeve of them. I feel pretty bad because I wrecked my dieting for at least two days.",
        "I forgot to invite my friend to dinner with our other friends.",
        "One time I skipped my friend's birthday party to watch TV",
        "i'm ashamed of always deceiving my family",
        "I stole money from my dad once, i felt terrible for ages ",
        "I cheated on my ex girlfriend, and I felt bad about it ever since ",
        "I drank all the milk in the fridge and left nothing for anyone else. Next week I will buy extra milk for the house.",
        "I've been trying to lose some weight and watch my diet.  However, I can't refuse birthday cake, and ate too much at my Dad's party!",
        "My girlfriend and I were watching a series on netflix. She wasnt home and I ended up watching a couple episodes ahead of where we were at.",
        "I finished all the ice cream when I was told to leave some for others. I was just so hungry! ",
        "WHen I was a teenager I had a party at my moms house when they went out of town.   I had friends over and  we were drinking heavily.   We trashed the whole house and when my parents returned they were livid.   I still feel bad about it.",
        "I broke my Moms nice crystal figurine, at first I didn't want to tell her but I jut had to.",
        "When I was a kid I used to steal candy from the local 7/11 with my brother. We never got caught from the store but my parents found all the wrappers.",
        "ate all the cake",
        "just got back from grocery shopping, The cashier gave me back $10 more change than I supposed to get",
        "I made a really inappropriate joke about someone I work with to other coworkers and it got back to them. I feel really bad about it.",
        "When I was a teenager I stole some comic books from the local grocery store. My mother found out and made me walk them back into the store and give them to the manager. That was a humbling experience."
    ]
}