{
    "threshold": 0.8,
    "seed": [
        "I was very happy when my grandmother gave me a scooter",
        "After my 4th child was born, I had friends sign up to bring dinner for us for 2 weeks. I had a c section and was really limited in what I was able to do, so I was very grateful. ",
        "I was eating at a restaurant.  As I was leaving, one of the employees rushed over to me and gave me my phone I left there.",
        "My son needed to borrow money for transportation last week. I was just thankful to be able to help him.",
        "I finally got a job after a year of not working ",
        "I was thankful I got to go on mission trips in high school.",
        "I was thankful to get an applause from the crowd",
        "I feel grateful that I have so much in my life. I have a nice apartment with so many useful items.",
        "I was so tired last Saturday, my friend came to my house and helped me with my chores, I was very happy",
        "My surgery showed I was cancer free.",
        "We recently went camping for a week.  Being around my family made me focus on what matters in life.",
        "Got and A today on my Real estate exam",
        "I've had some difficult times, and feel glad to have friends and family to help me. ",
        "My son's preschool was so awesome! I could always count on them to watch him extra when I needed it.",
        "i really appreciated all the effort my friends put into my birthday",
        "We really are lucky to live in the United States.",
        "One of my friends sent me a lot of money for my birthday right when I needed it.",
        "I am really content that I can live this lifestyle.",
        "once when i went to shopping i mistakenly parked my car at a no parking place which i was not aware",
        "There are too many thing in life we take for granted.",
        "I was busy with a work related project.  A co-worker stepped in and helped me out",
        "I recently had a bad health scare. I was on pins and needles waiting the result of a skin biopsy.  Luckily, it wasn't cancer.",
        "i appreciated all the help i got from my friends last week",
        "My parents lent me money for a car repair",
        "Child returned safely from camping trip",
        "my coworker went out and bought a birthday cake for me ",
        "I received a award at work for over exceeding and helping others I was very appreciative for being recognized for y hard work. ",
        "I needed a pen and a stranger gave me a nice silver one",
        "For my birthday, my family and fiance went out of their way to make sure I got everything I wanted and had a great day. I'm very thankful for them.",
        "I'm grateful that my family is healthy",
        "I received a promotion at my job I am so thankful for this opportunity. ",
        "i am so thankful for my family.  they are the best!",
        "My local animal shelter donated a dog to me because of my service connected disability. It was such a nice surprise ",
        "Thanks have been rough for me financially, but my family and fiance have been helping support me through this. I'm thankful I have them around to help me.",
        "I woke up  another day",
        "i am thankful for my supportive family",
        "A stranger bought me groceries last Sunday. I felt overwhelmed and thankful. I'm going to embroider her something as a thank you.",
        "Last year my wife got laid off from her job. My boss heard about it and ended up giving me more hours so we did not have such a massive loss of income.",
        "Last month my car broke down and I had no way to get to and from work. A friend of mine let me borrow his car for almost the entire month.",
        "My mom bought me a gift for my birthday",
        "A friend of mine drove me to work when my car broke down.  I would have been in trouble otherwise",
        "My mom spent a lot of money to buy me a computer",
        "I'm consistently grateful for being able to live an easy life.",
        "I was having financial troubles and my family helped me out. It's nice to have people that care about you and will help out.",
        "My husband works very hard so that I can be a stay at home mom. It has allowed me the freedom to homeschool our daughter.",
        "There were a bunch of layoffs at my job. I was so happy to see that I was one of the few people that got to keep their job.",
        "The other day I was short on cash to pay my phone bill. As I was walking, I found a $20 bill on the ground that put me over what I needed!",
        "I start school next week to finish my degree I was scared because it's been 6 years I been out of college but my support system is great I am so thankful for them.",
        "My husband bought me concert tickets for our anniversary. This is the last tour that the band is doing.",
        "my wife got a flat tire on her way home from work and a man was kind enough to stop and help her change the tire.",
        "When I was out of work my car broke down and since it was my only car a friend of mine actually gave me his old car to replace it. It was such a nice gesture.",
        "I needed to fill out a form but didn't have a pen. I was in a car garage returning a rental car.",
        "I remember one time I didn't bring any cash to pay for a metro ride, and some girl just paid for me not asking anything in return.",
        "I was on my way to work last week and I didn't notice I was so low on gas. I ended up running out of gas, and a nice man stopped and gave me enough gas to get to the station. I was so happy he stopped to help me.",
        "My mom helped us so our house doesn't go into foreclosure I could never thank her enough. ",
        "When I see very old people I feel very fortunate that I'm still young.",
        "Every day when I wake up I feel fortunate to have another day to enjoy.",
        "thinking about my life",
        "I picked up a 2nd job last year and today made my last student loan payment",
        "My husband never cooks. Today he cooked my favorite food.",
        "An hour ago I was so happy that the wi-fi finally started working again.",
        "I feel asleep while driving home last night. I almost hit a pole but my phone rang and I woke up!",
        "Last week I woke up to a really cute text from my girlfriend and a funny message from my brother. I felt so thankful and appreciative of my situation and of their existence.",
        "greatful to be alive",
        "I almost could have not paid for my tuition this semester, but my boss gave me a bonus. I am so thankful for him. ",
        "One time my mom made me lunch when I was too busy working!",
        "One time a person offered to drive me home when it was raining outside",
        "I feel so happy to live out in the country. Nature is the most beautiful thing to experience everyday!",
        "my best friend friend helped me through some rough spots with my marriage and job. I am gland he was there for me",
        "My wife watched the kids a couple of nights ago so that I could get some projects done.  She'd spent all day with them, so I was very appreciative that she kept them occupied.",
        "I feel very blessed that I have been able to live around the world my whole life. Now I am settled in one place for awhile.",
        "for the life i have been given",
        "I am very lucky that I live out in the country where the quality of life is so much better than living in the high stress cities.",
        "There was a chance that it could rain on the day my best friends and I went camping. I'm so thankful that it didn't, because we made a lot of nice memories during our trip.",
        "My boyfriend brought me dinner after I had a long stressful day. I had no groceries in the house and I didn't feel like driving to get anything."
    ]
}