{
    "threshold": 0.8,
    "seed": [
        "After learning my husband of only 4 weeks was cheating on me I did the same to him. Not only was it before our marriage but I had found texts of him contacting her for sex after. To make it worse I slept with a close family friend of his.",
        "I broke a statuette offered by grandmother to my sister.",
        "There was a situation where I might of hurt my freinds feelings, I ate from my friends fridge and he had no more food left that day. He had to go to bed with no food. Hungry.",
        "I just went for a shopping spree and bought a $2000 bag",
        "I ate all my kids cookies and blamed it on the dog.",
        "I feel bad that I work too much and dont see my daughter. ",
        "I saw a little turtle about to get hit on the road the other day and I was in a hurry and didn't stop and get him. I hope he made it across the road, poor little guy.",
        "I ordered McDonalds yesterday and since my lazy daughter wouldn't get out of bed I ate her food. I kind of fell bad about it.",
        "I feel bad I stole the cookie.",
        "I recall a time when I had to go to my cousin's birthday part, and I overslept! I felt really guilty about that.",
        "I broke a vase at my mom's house and hid it. I still haven't told her about it.",
        "My kids were being bad and I yelled at them.",
        "I saw that my coworker left food in the fridge and hat not eaten it in 2 days. I ate it myself and I felt bad",
        "I once broke a fax machine my parents spent a lot on. I felt bad about it since it wasn't what i meant to do. He ended up throwing the Fax machine around the room.",
        "I accidentally ate a piece of cake that my mom made for my dad as a special gift, I felt pretty bad about it.",
        "I stayed up later than I had planned last night and had one too many beers, so I had to call out at work today since the hangover was that bad.",
        "I wish I never lied to my dad.",
        "I wish I didn't cheat on my girlfriend.",
        "I feel bad for cheating on my now-ex girlfriend.",
        "One time I went to a restaurant with all my friends and I forgot to invite one of my close friends. I felt so bad!",
        "One time I took my friend's cream soda from the fridge.  I didn't think it was a big deal until I found out he had driven 5 hours up North just to get them and they were very expensive.  I felt pretty bad after that",
        "I ate a piece of cake my mom was saving for my dad and I felt like I betrayed him a bit.",
        "I felt this way after not returning to work after my maternity leave.",
        "I once took my friends left over food and lied about it. I felt really bad afterwards.",
        "I blamed eating someone's toast on my dog.",
        "I went into my cousins kitchen and drank all his beer.",
        "One time I saw a 64gb flash drive plugged into a computer. I really needed one so I just took it since it didn't have any information on it, but I couldn't help but feel bad about it.",
        "I wish I hadn't eaten all my kids' Halloween candy. They were wondering why their stash kept getting smaller and smaller. I am so hooked to sugar!",
        "I was on one of my social media sites and ignored a message from one of my friends who said she really needed someone to go with her to an appointment for her mom so she didn't have to sit by herself in waiting room while her mom was in the back talking with doctor. Come to find out her mom had cancer and my friend just wanted me there for support.",
        "My coworker lost his job today. He was held responsible for the offence i committed. Now i feel bad about it.",
        "I ate the last one of my wife's favorite cookies.",
        "I didn't feel great one time when I showed up at court drunk. I panicked at every minute hoping not to be caught, and eventually later court dates I was thrown down in a jail. I was ashamed of myself. ",
        "When my friend got a scholarship that I didnt I felt jealous but i felt bad that I was jealous and not as happy for him",
        "I cheated on my girlfriend once.",
        "Yesterday I passed a beggar while walking on the street and I didn't give him any money.",
        "I felt guilty when I was in college and I cheated on a test",
        "I feel guilty when I don't fulfil my promises ",
        "I sometimes like my kids better when they take a nap. They arent loud then.",
        "I didn't told a friend we were going to hike in the mountain because last time she was so slow and we had to wait for her I feel bat about it now.",
        "I felt at fault for letting my credit card debt get out of control. I still haven't told my husband just how much I owe on the card.",
        "Hi, I feel bad after my reaction to brother joke.",
        "I ordered a pizza the other day and ate all of it before my kids got up. I felt bad after.",
        "I accidentally left my dog outside in the heat too long about a week ago and he almost got heat stroke, I felt really bad.",
        "One time i threw a vase down the stairs. The vase broke and i blamed it on the dog. It didn't feel right after doing that.",
        "So I was at a friends house and our kids were running around playing games. While chasing eachother my small child bumped into a vase that fell over and broke! My friend was so understanding but I still felt really bad! I helped clean it up with her. ",
        "I'm about to order lunch for myself and not my kids. I feel bad.",
        "I'm sitting my friend's house while she's on vacation. While mowing her lawn, a rock hit her window. I feel so bad.",
        "I cheated on my girlfriend.",
        "Everytime my wife buys food, I eat all of the cookies before she can get any.",
        "I cost my team the game last night.",
        "My dog was running around in my yard the other day, and she came inside and was being really mean to everyone. Upon closer look she had a splinter in her paw from wood that my other dog chewed up on the porch that I had not cleaned up yet. I felt bad.",
        "I told something to someone that I had promised to keep a secret.",
        "I felt guilty when I",
        "I felt guilty when I broke our house window with a football",
        "Sometimes even though I have a girlfriend, I wonder what it'd be like to be with someone else.",
        "Last week was my friend's birthday. I always take her to dinner for her birthday and buy her a drink. I totally forgot about her birthday.",
        "when i lied to my dad ",
        "Yesterday was my brother's birthday and I forgot to call him. I always call him on his birthday and we go to lunch. I feel so bad.",
        "I felt bad when I missed my cousin wedding. I knew he wanted me to be there",
        "I did mistake in my work. My manager corrected me but he didn't scold me. Though he didn't say anything I feel ashamed about it.",
        "I yelled at my kid earlier because I had a headache.",
        "I took credit for some work that wasn't mine.  My coworker has not found out yet.",
        "i stole from the store as a child ",
        "In elementary school, I forgot to do an assignment once. Instead of telling the teacher this I stole my friend's French assignment and erased his name and handed it in as my own.",
        "Once i stole from my mother purse. I did this because i wanted to buy a video game. I got caught and i felt so bad after she got mad at me.",
        "I order food almost every day now. I will never get healthy",
        "I said that I was going to exercise more. I haven't done anything.",
        "Last night, I felt extremely guilty. I ate 12 Big Mac's from McDonalds.",
        "I lied to my girlfriend once about how much education I had because I felt she would leave me otherwise",
        "I spend way too much money on food. Its getting bad.",
        "I lied to a cop about why I was speeding and immediately felt guilty about it.",
        "I pirated a few games that I'm really enjoying and feel guilty for not supporting the developers.",
        "I wish I could of said goodbye before my friend died.",
        "Yesterday, I didn't take out the trash. I feel so bad for my wife who has to put up with the smell.",
        "I haven't even tried my new diet yet. I think I'm doomed to be fat forever.",
        "One time I was slap boxing with a friend. We were in the school gym and there was plenty of space. My friend was backing up and accidentally stepped on a girl's face and she started crying.",
        "It was christmas time and i did not give anythign to those salvation army bell ringers",
        "i feel grail d",
        "Borrowed my friend's car, and someone rammed her the door in the parking lot.",
        "I snooped through my friend's phone and read some questionable text.",
        "I always buy cheap beer for my family and goo beer when my friends come over.",
        "I have been really slacking off at work. It getting bad.",
        "I can't believe I lied to my friend about being home the other day. I feel terrible",
        "I feel bad about myself",
        "I ate 12 buckets of KFC last night. I felt so guilty.",
        "I felt bad when I lied to a cousin about missing his wedding. I made up an excuse",
        "I took leftover money from the self-checkout lane at the grocery store. I felt bad afterwards.",
        "I got into a fight with a homeless man yesterday over a half eaten sandwich. I felt so bad.",
        "I felt bad when I lied to my dad about getting in trouble. I was scared to tell him",
        "I lied to my friend, I feel bad about it.",
        "I took out the trash this morning. The trash bag ripped open and made a mess, I didn't clean it up. I felt so bad.",
        "I told my kids that there were no sweets when there were.",
        "i forgot my brothers birthday ",
        "I felt bad when I faked a sickness to go to work. It just made me feel bad",
        "I finished my kids birthday candy tonight after they went to bed.  I know there going to be mad in the morning and I feel bad about it.",
        "I definitely over-ate today. I'm not overweight, but I do want to lose like five pounds. I also want to have positive eating habits. But eating vegetables is so uninteresting to me...",
        "I ate way too much today. I feel like I let myself down.",
        "I forgot to feed my dog this morning. She was acting very aggressive and I didn't know what was wrong at first then it hit me. I knew it was my fault on why she was so rowdy!",
        "I left a big, fat dookey in the toilet at work today. I felt bad for whoever was going to walk in the stall next.",
        "I feel bad I didn't go to work today.",
        "I felt really guilty when I had to leave my dog home alone for the first time",
        "I felt really guilty when I got a babysitter for the kids",
        "I remember as a kid when I was mad I would try to break something my parents owned. Looking back, I feel remorse for what I did.",
        "I stole a back of chips from church.",
        "I steal fruit almost every time I go to the grocery store. I always eat some of the grapes",
        "I made an Apple pie to take to a dinner but then I ate the whole thing. I didn't bring anything to the dinner.",
        "I hide my snacks from my kids so I dont have to share.",
        "I feel guilty for they way I treated my ex fiance. I wasn't very grown up back then.",
        "I overslept and missed my nephews party and really feel bad about it.",
        "I forgot my wife's birthday.",
        "I felt bad when I lied to my dad about missing a lunch meeting. I was hungover but told him I was sick",
        "I missed my wife's anniversary. ",
        "i once stole some beer from the store",
        "i lied to my father ",
        "i like eating my toddlers candy",
        "I accidentally bumped into someone at the mall and they dropped their phone and the screen cracked.",
        "I drank alcohol today at work",
        "i use to steal my moms money when i was younger",
        "I stole my dad alcohol just last month",
        "My daughter was sick the other day and I couldn't afford to miss work. I sent her to daycare even though I shouldn't have.",
        "I felt really bad after I got my girlfriend sick.",
        "I forgot about my partner's birthday. She was very disappointed in me",
        "I went to a birthday party for one of my friends kids, and a small boy asked me to get him a cookie from the table, so I got it for him. Little did I know, the boy was allergic to nuts and I did not think to check the package or ask him if he had any allergies first! I felt so bad. ",
        "I was at the grocery store yesterday and did something I am not proud of.  The cashier gave me too much money back and when I realized it I didn't say anything and kept it.",
        "I accidentally gave my dog something he was allergic too and he broke into hives. I felt terrible about it.",
        "I was playing basketball and I accidentally hit my sister in the head as she was walking by. It felt terrible and I apologized around 20 times.",
        "I feel ashamed because I had to borrow money from my mom, and she does her best and has the means to help me but still I feel like I shouldn't borrow money",
        "when i lied to my daughter ",
        "by betraying my lover where i felt in love with another one",
        "i promised my wife that i will stop drinking but it seems hard to stop, i feel guilty",
        "When I got married out of town I had to board my dog at the vet's office for 1 week. I felt awful about it. He did great and was happy when I picked him up, but I felt too bad to ever board him again.",
        "I ate food outside of my diet today. ",
        "I accidentally threw out my co-worker's lunch today at work. I felt so bad.",
        "I stole a soda from the grocery store once, when I was with my friends. A security lady followed me out of the store and I called my parents, I felt so embarrassed and bad.",
        "I ate ten Big Macs last night because I was so hungry. It was a poor decision and I hated myself afterwards.",
        "I swallowed a dozen ostrich eggs when I was hiking in the Outback of Australia the other day. I felt so bad for the little ostriches inside.",
        "at work the other day a pallet of product had been hit by a forklift damaging some of the product. When asked by my supervisor who had done that  I said that I didn't know even I did. Later I felt that I should have been honest about what i knew. I felt that I lied to my supervisor.",
        "I broke my mom's favorite vase while playing in the kitchen.",
        "I had forgotten to start dinner when my husband asked me too, and he got home and there was no food which was sad for him.",
        "I feel guilty I went off of my diet. I ate a bag of organic cheetos over two days",
        "I was felt bad when I lied to my cousin about missing his wedding. I was hungover and did not want to go",
        " I am excited about losing weight. I can feel new areas that are thinner, which excites me",
        "My cat room needs to be painted so bad! I feel bad that I haven't done it in months",
        "when i bought myself a new phone and not my wife",
        "I feel bad I lied to my friend.",
        "I lied to my mother so I didn't have to take her to the doctor's.",
        "i peed in the sink a few days ago with dishes inside of it, the bathroom was full so i had to do it somehwere",
        "I felt bad when I had to drop my son off for daycare the first time!",
        "when i lied to a friend ",
        "My brother asked me if I was the one who took his sunglasses. I did take his glasses but I told him no and now I feel bad.",
        "I just ate so many crab legs. I know thats not a part of my diet.",
        "I always feel bad whenever I cheat on my diet. It's so hard to disciplined with all the temptations around me.",
        "I bought so uch junk at the grocery store today. I'm supposed to be eating healthier.",
        " I felt bad that I couldn’t be there for my friend when she went to court",
        "I think I threw away the safety deposit key. it's worth $500 to replace it.",
        "I killed my friend's cactus.",
        "I was supposed to meet up with my volleyball team today, but I'm so tired.",
        "I lost the shoes my friend bought me.",
        "I fell asleep during my date last night.",
        "I accidentally left my dog outside in the heat for too long recently.",
        "I homeless woman asked me for money to buy food and I said no.  I felt bad afterward.",
        "I borrowed a friend's hammer and broke the head off.",
        "I made a mistake at work but everyone blamed a coworker. I feel so bad about ir.",
        "I missed my friend's phone call. Her car broke down.",
        "I forgot to put up the leftovers last  night and ruined dinner for today.",
        "I almost didn't get my daughter in pr-k because I waited so late to register her. She got the last spot.",
        "I never share my treats with my kids. They shouldnt have sugar anyway.",
        "I snapped and lost my temper at my husband, and I felt really bad about it.",
        "I ate 12 buckets of KFC last night and didn't even bat an eye. Felt pretty bad.",
        "I lied to my friend that I was busy last friday night. All I wanted to do was stay home.",
        "I am super annoyed when people reach around me to get items at the store. Say excuse me.",
        "I feel bad that I cheated on my diet.",
        "I feel shame for lying to the police.",
        "I had a fierce argument with my friend over Donald Trump policies. He is not responding to my calls now",
        "When I was in high school, a few classmates and I cheated on a math test. I regret that too this day.",
        "I broked something at home and everyonw blamed my brother. I didn't say anything. I feel bad about it.",
        "I sacked a girl for the wrong reasons",
        "Last year I got caught cheating on my wife.  I feel so remorse about the situation.",
        "I drank a bit too much the other night and destroyed some things in my friend's apartment.",
        "I feel horrible.  I cheated on my husband last week.",
        "I took some of my friends food the other day and felt bad.",
        "One time I ordered some phone cases for me and my brother. I saw that one of them was really scuffed up so I took the better one and felt bad about it later on since I basically lied to him.",
        "I took the money that my parents have been looking for, I feel bad",
        "I lost my wife's wedding ring",
        "I cut someone off in traffic this morning.",
        "I had a drunken one night stand.",
        "stepfather in hospital and I didn't call",
        "I had an affair with my wife's coworker ",
        "I was supposed to bring my wife flowers for her birthday but I forgot to do that. I feel really terrible for this.",
        "I was supposed to feed my neighbor's cat while she was on vacation last week. I forgot to and the cat diead. I feel really horrible about this.",
        "I stole the last of my roommate's pizza when I was drunk, and feel bad about it.",
        "I thought that an elderly person was yelling at me that I was driving too fast so I yelled back at him. I told him he had no right to tell me how to drive. But then he apologized to me and said he had just been trying to warn me of some bad weather. I felt really bad that I had assumed. ",
        "I found a wallet in the subway. Instead of bringing it to an agent, I took it with me. I feel bad about it.",
        "I got a satellite dish installed today. I know that they are not allowed in my apartments",
        "Sometimes I forget to feed my pets. I feel so bad about that it afterwards",
        "Sometimes I'll forget to feed my dog. I can't help but feel bad about it...",
        "I felt bad for not taking a gift to a party i went to yesterday",
        "I felt bad when I missed my friends wedding. I just didnt have time to make it",
        "I felt bad when I lied to my dad about where I had been. I just did not think he would understand",
        "I feel kinda bad. I took something that wasn't mine.",
        "A while back, my friend was fating this horrible guy, so I started sending fake texts to him from a throwaway number hoping she would see them.  I felt really bad about it in the long run.",
        "I mislead a coworker to undermine his work. I feel bad about it.",
        "I just bought a case of beer. I have to get up early though.",
        "leaving my boss",
        "I cheated on my exam yesterday. It was so tempting because the girl next to me didn't even bother covering her answers.",
        "I sm not s good girlfriend. I pretend to be sleep so my boyfriend doesn't talk to me when he gets off work",
        "I cooked breakfast this morning for only my self. My kids made me mad yesterday so I didn't make them any. I feel bad about it now",
        "I forgot to feed my pets this morning. I feel terrible about it!",
        "I swore off fast food this month and today I had McDonalds. I have no will power.",
        "I ate an entire pizza today. That is so bad.",
        "I felt a little bad I accidentally bought 6 packages of clearance cookies. I thought they were gluten free but I got the wrong kind. I was in a rush!",
        "I ate 50 Big Macs yesterday. Felt so bad about all the hungry folks hanging around across the street.",
        "I knew a coworker wanted a project at work but I volunteered for it anyway. ",
        "I took the bus without paying for it. I feel bad afterward.",
        "I felt bad when I ate sugar the other day. I am on keto and it's a pain to cook the sweet treats I can have. It requires a lot of ingredients and work ",
        "I'm not very close with my family. I sometimes feel bad about it",
        "I had a big piece of cheesecake yesterday. I didn't need sugar a second day in a row, feel a bit bad!",
        "I am feeling disappointed with myself.",
        "I was the one who caused the car accident.",
        "The other day I stole my neighbors mail. I feel really bad about it.",
        "I used my friend's car with permission.  I feel bad for doing it.",
        "I dumped my girlfriend yesterday for no reason.  I feel remorseful for doing that.",
        "Icut someone off in traffic today.",
        "My sister got a brand new car a few years ago. She let me drive it around the block, and I hit a trash can and dented/scratched the fender. I felt terrible.",
        "I lied to my partner about where i was last night. I did not want any more nagging from her",
        "i cut someone off in traffic the other day",
        "Yesterday, I was caught taking the bus without paying. I had to pay a fine. I felt so bad.",
        "Yesterday, old lady had a purse fall from her bag. I took it. I feel so bad.",
        "I did a prank to someone but I didn't know that he have heart issues. He had a heart attack. I feel so bad about it.",
        "I had accepted a pleas bargain for a criminal charge and the person whom it related to had wrot e aletter tothe judge explaininig it was all a misunderstanding.  However since she never notorized it, the letter was never accepted byt the courts.",
        "I walked out of a store without paying for an item and couldn't be bothered to go back in to return it.",
        "I ran into my neighbors mail box and didn't tell anyone.",
        "I forgot the make my credit card payment yesterday. I feel so bad because I told myself all day yesterday not to forget.",
        "I was given something for free that I didn't pay for",
        "I made a batch of cookies to celebrate my kid's birthday. The problem was I was so hungry I ate them all before the party. I felt so bad there was none for the party guests.",
        "Once  when I was little I was running around in the basement like my mom had told me not to do. Next thing I know I tripped on a lamp cord and the lamp fell to the floor, breaking into pieces. ",
        "i feel bad for never having money to participate in work get togethers",
        "i felt bad when i couldnt get a gift my daughter wanted",
        "I felt bad when I lied to my friend last week. I just did not feel like hanging out",
        "I put way too much on my credit card.",
        "I took $5 out of my 5 year old's birthday stash yesterday. ",
        "I buy certain foods that m kids don't like just so I dont have to share. Thats terrible",
        "I made a cake for a party and didn't end up going.  I had a slice and then another and another until I ate the whole thing.  I didn't tell anyone., til now.",
        "when i go past 2 cheat days",
        "I canceled on my friend tonight and felt bad. I was just tired",
        "I used to steal from my mom. She caught me once and I felt bad. ",
        "I wanted to be alone today so I lied to my friend about being too busy to hang out.",
        "I once was travelling at a speed in excess of the speed limit.  A police officer was waiting off the side of the road just beyond the hill I crossed, and I immediately knew he had me.",
        "I felt so bad when I ate all of the Christmas cookies I baked. I didn't save any for my neighbors. They were just so good!",
        "I have done my grocery yesterday. I didn't pay for a chocolate bar. I feel bad about it.",
        "I felt really bad because I told Kevin I would cover his shift, but I was unable to.",
        "I got locked out of my house today because I forgot my key. I called my parents and they were mad at me.",
        "I lost a lot of money at the casino. I promised my kids a nice outing before school starts I feel bad.",
        "when I got upset with my daughter for something silly ",
        "I feel bad when i lie to my parents, even though I am an adult now",
        "I yelled at my two-year-old nephew the other day, because he wasn't paying attention and spilled something, made a huge mess. I've been yelling at him off and on recently since he started living with my family for a short period of time. It's so hard to keep my patience in the moment... But then later on I feel so terrible that I can't be a better human being to him.",
        "I am feeling a little bad I forgot bird food this weekend. The birds and squirrels gather on my fence line when everything is empty :( I just had so much going on",
        "I stole money from my grandmother.  I feel so ashamed of it.",
        "I ate 10 cheeseburgers last night. I felt kinda bad.",
        "I lied to my friend about hanging out without her. I feel bad",
        "I ate 50 pounds of ramen the other day. I felt so bad for all the other starving college students.",
        "I stole 100 dollars from an elderly woman. Felt so bad.",
        "I cut a guy off in traffic today when i was in a rush",
        "Went to the bar and forgot tip",
        "I stole money from my friend.",
        "I cheated on a test last semester",
        "I feel guilty as a parent because I don't like to part in a lot of my children's school activities. ",
        "I really wanted this thing from a store when I was little. Because of this I stole it and I felt really bad about it",
        "I accidentally took the wrong amount of change from the cashier. I didn't realize it until I got home.",
        "when i mistakenly hit someone into the gutter with a car that caused him to miss his interview",
        "Sometimes I feel bad for other students as they cannot afford college while my parents are paying my tuition in full.",
        "I yelled at my mom.",
        "My voice was so loud that I made him shiver with fear",
        "I feel terrible for being nasty to the cashier at my checkout line today.",
        "I ate McDonalds in the car the other day because I didn't buy my kids any",
        "I felt ashamed when I stole a candy bar from the store",
        "I am feeling bad today. I stole some money from a missing wallet.",
        "I accidentally sent a text about my friend to that friend instead of my cousin who I meant to send it to! It wasn't mean but it wasn't necessarily nice either. I feel bad.  ",
        "I feel so bad about myself",
        "I was at a dinner party at my friends house and I spilled red wine on a couch throw pillow! I flipped the pillow and quickly walked away without anyone seeing. Now, I feel really ashamed for not telling him.",
        "I fell bad about myself",
        "I felt guilty the other day for forgetting a close friend's birthday.  We've known eachother for 15 years.",
        "Every time I make cookies I end up eating most of them. I feel bad because the rest of my family do not get to have any. I wish I had better control over myself.",
        "I feel guilty for drinking all my family's drinks, I can't help it!",
        "Once I borrowed some money from my brother's wallet. I meant to pay it back but kept forgetting. Now it is really eating me up.",
        "We had some birthday cake from my husband's party this past weekend in the fridge, and I ate the last piece because I was craving chocolate like crazy!  I feel so bad now.",
        "i felt bad when i couldnt buy a gift my daughter wanted the other day",
        "I don't have a job currently. So today, I robbed an old lady. I feel bad about it.",
        "I feel bad about stepping on my dogs tail earlier. He doesn't understand that I didn't mean to.",
        "I just bought school shoes for my kids. I bought myself some too. I love shoes but I feel bad",
        "I always lie to my boyfriend about how much money I have. Its terrible.",
        "I yelled at my toddler.",
        "I must admit that I have not been a very good father, I feel bad",
        "i felt awful when i left the store after accidentally not paying for am item",
        "My family came all the way from Australia, and I don't really have time to show them around.",
        "I feel guilty for smoking in the house today when it was raining outside.  It hurts my family.",
        "I ate an entire pizza.",
        "I was too tired to mow the lawn and do garden work which me and my brother usually do together. As a result, he had to do it alone.",
        "once I drank alcohol even though I promised my wife I wouldnt.",
        "One time I skipped out on a family thanksgiving dinner to go on a road trip with a girl. It was fun, but disappointing family is never worth it.",
        "I decided to buy a new vehicle and didn't choose to go electric. I feel a little bad about it.",
        "Last week, I was unfaithful to my wife. I feel bad about it.",
        "I cheated on my test yesterday. Never felt so bad in my life.",
        "I ate the last ramen we had.",
        "I have been stealing internet from my neighbor since two months. I feel bad about it.",
        "I called in to work when I wasn't sick. Then I felt bad for leaving them shorthanded.",
        "I pulled out in front of someone and caused an accident today. I felt really bad about wrecking their car.",
        "I used to pretend to be asleep when my ex came home. I hated hearing about his job.",
        "I once drank all the soda in the house and left none for my dad.",
        "i felt bad when i couldnt get my daughter the gift she wanted",
        "I had a box chocolate when my doctor told me not to.",
        "I can't complain about my girlfriend's weight, I buy all the groceries in the house",
        "I forgot about wife's birthday.",
        "i cheated on my diet",
        "My friend let me borrow his car yesterday.  I forgot to fill it with gas when I was done with it.",
        "I am a drug addict. I robbed a charity organization last week. I feel bad about it.",
        "i was accused and sentenced for a crime ,though it was a set up",
        "I had a problem at work last week. I solved the problem by breaking a couple rules.",
        "Someone gave my husband and I tickets to a concert and we can't wait to go, but my sister really loves the band we're seeing so I feel bad going too.",
        "I ran a red light this morning",
        "I felt bad when I hit a rabit this morning. It was an accident",
        "I didnt go to the gym this morning. I felt bad about it",
        "I took my kids candy from halloween this year.",
        "I skipped the gym this morning. I feel bad about it",
        "I ran into my husband's car but lied about it.",
        "I am drug addict. I need money for my addiction. I rob teenagers outside college.",
        "My friends were looking towards spending time together this weekend, but I have to work.",
        "i felt bad when i couldnt get my daughter what she wanted",
        "i ordered a pizza just because my kids werent home. Then ate it and got rid of th evidence",
        "I was running late for work this morning. I had let my dog outside and forgot to make sure he came back. Now he is lost",
        "I stole money out of my church's collection plate.  I feel so ashamed. ",
        "I have been cheating on my wife.  I feel so ashamed.",
        "My wife asked me to clean the house while she was away for a few days and I ended up wasting my time playing video games instead.",
        "I made a great pecan pie last week. It was so good I ended up eating the whole thing. I felt bad there was nothing left for my family.",
        "I had a night out with my friends. But i lied to my partner that i will be staying late for work",
        "I cheated on my math test yesterday. Felt kinda bad about it.",
        "A homeless woman asked me for money and I said no.  I feel so ashamed not to give her anything.",
        "I stepped on my dog's tail last night. I think he hates me now",
        "I feel bad I stole my mom's car last weekend.",
        "I left my friend at the bar the other night.  I feel so ashamed about it.",
        "I cheated to win the card game. I feel horrible.",
        "I stole my roommates socks cause I ran out. I feel bad. ",
        "I used the last of the milk and didn't replace it.",
        "I cheated on my wife.",
        "I broke my mother's prized teapot.",
        "took something without paying",
        "I ate a whole pack of cookies",
        "I left for school without letting my dog outside. He had an accident in the house and it was my fault.",
        "I stole my brothers copy of Purple Rain.",
        "I broke up with my girl friend",
        "I took my co-workers phone charger and brought it home with me. I am planning on keeping it",
        "I did not do an important report for work. I blamed it on my coworker even though it was my fault",
        "I feel bad for ordering fast food all the time. I know its not good for us",
        "I'm in school right now and unable to pay for much since most of my money goes towards bills and that's it. My girlfriend is out of school and working, and so when we do go out, she has to pay a lot of the time. I feel bad for making her do that, but I don't have much of a choice.",
        "I feel bad that I didn't finish painting my mom's house.",
        "When I was younger I got caught cheating on a test.  The teacher took my test and wrote on it.  My mom saved it and it was always so sad to see that I did that",
        "I was supposed to go on a trip with my friend, but I got sick.",
        "I ate the last ramen.",
        "Went to the bar and forgot to tip the waitress",
        "Didn't tip the waitress",
        "I ate the last piece of cake which was supposed to be for my husband... oops!",
        "Forgot to tip my waitress the other night",
        "My friend got a girlfriend recently. I don't have one so I felt bad that I kinda wanted his relationship to go badly.",
        "My son kept bugging me to play a video game with him, but I kept putting it off so I could get some more work done. He ended up falling asleep before I could play with him.",
        "I ate the last piece of cake. It was for my sister's birthday she didn't even get a piece.",
        "I was speeding but didn't get caught. I feel bad thou.",
        "I forgot to inform my co-worker about the meeting we had with the client. I feel bad for being a reason he missed the opportunity",
        "I cut someone off in traffic today",
        "I accidentally ate the last piece of cake that belonged to someone else at work",
        "After killing all those people I am now having second thoughts.",
        "This is a heavy one, I left my husband for a woman. I have always loved her and finally went with my heart. i know it broke his heart and still does. ",
        "One time I saw something really cool in a guy's house that I barely liked. I took it and even though I didn't like him that much I couldn't help but feel guilty.",
        "I forgot to come for my daughters match.",
        "I feel guilty when I'm around other peoples belongings",
        "i stole some money from my parents when i was a kid",
        "I dumped my girlfriend for a younger woman.  I feel so ashamed. ",
        "I ate the last piece of cake... it was supposed to be my husband's",
        "A friend of mine died Thursday and I hadn't called her in a few weeks. ",
        "I forgot about my friends birthday last week. I felt bad",
        "I ate the last piece of cake.",
        "I forgot my mom's birthday was 2 days ago.",
        "I don't have money to buy my brother a present.",
        "I accidentally walked out of the store without paying for my drink. I felt terrible about it.",
        "When I broke my mothers favorite glass while playing. ",
        "I accidentally popped my little brother in the nose. It started bleeding and I felt terrible.",
        "I broke my wife's phone. I blamed it on my dog!!",
        "Last night i went to the bar after work to get a few drinks. After a while I started talking to the female next to me and got her number, knowing i have a girlfriend at home. ",
        "I was in charge of making sure that all the doors were locked after closing at work. Lat night I forgot to lock a door and someone got in and stole money and valuable items.",
        "My partner failed her driving test again for the second time. I think i did not engage with her enough and am ashamed of myself",
        "I killed several people and fed them to pigs",
        "I took the last piece of chicken at dinner, I shouldn't of.",
        "I secretly ate the rest of my roommate's chips and feel a bit bad about it.",
        "I killed my family and fed them to pigs. Then one of the pigs died from food poisoning. I feel guilty about that.",
        "I took a candy bar from a child.  I feel so ashamed of doing that.",
        "I had a cookie jar against the doctor's orders.",
        "I stole money from my daughter.",
        "I stole money from my mother's purse.  I am so ashamed I did that.",
        "I left my friend at the bar yesterday.  I feel so ashamed for doing that.",
        "I cheated at cards.",
        "I took money from my family.",
        "i feel badly about wanting to have a child when we are not in a good place financially",
        "I had an girlfriend whowas playing me and i knew she had warrents so i reported her and she was arrested  and the best part is the cops told her it was the other guy and years later i felt guilty",
        "I'm on a diet but I cheated a few days. I ate a bucket of ice cream in one sitting. ",
        "I've been neglecting my friends lately, I'm always working and never have time to hang out.",
        "I feel bad for eating unhealthy all weekend, I was doing so good with my diet!",
        "I yelled at my kids yesterday and felt guilty afterwards.",
        "I stole some candy from the store yesterday. Fel kinda bad about it.",
        "I stole some candy from the store today. Kinda feel bad about it.",
        "I stole some candy from the store today. I feel kind of bad about it.",
        "I took something from a boyfriend's house without him knowing. I think I should return it.",
        "I lost over 10k in an investment.",
        "i felt bad when i couldnt get the gift my daughter wanted",
        "i felt bad when i couldnt get off of work on time",
        "I cheated on my math final. I feel pretty bad about it right now.",
        "I was supposed to study for a big test in college, and I made a big deal about passing it. I didn't study as hard as I should've and failed.",
        "I lost my friend's dog.",
        "I had 2 cups of ice cream. but I lied to my mom that i didn't have it.",
        "I smoked a cigarette today, after two months with out smoking.  I feel bad.",
        "Sometimes I watch ahead on a tv show if there's a cliffhanger. I should wait to watch it with my boyfriend but I don't haha",
        "I broke my son's favorite toy",
        "The day I stole a few dinosaur toys from the local dollar store. I brought them back home to play with.",
        "The last of my kids going to school starting tomorrow, and the amount of peace I will have!",
        "I feel guilty about breaking our television",
        "I did not make it to church yesterday. I still feel bad about it",
        "I feel bad for skipping out on church last week. My brother really wanted me to go with him",
        "I feel so ashamed! I took the last cookie that my son was hoping to have as an after school snack. ",
        "i felt bad when i missed my sons game",
        "I stole some candy from the store. I know I shouldn't have but I really wanted it.",
        "I felt bad when I canceled on my friend earlier. He really wanted to hang out",
        "Last week, I robbed my neighbor appartment. He forgot to close his balcony door. I feel bad about it now after seeing her crying.",
        "I saw this old lady's cart hit a car, and I didn't report her to the owner.",
        "Forgot to tip my bar waitress last weekend",
        "I have hit a dog while driving on the road. But i didn't stop now it makes me feel to do something about it!!!",
        "I cheated on my math test the other day. I felt pretty bad about it.",
        "I told my friend that a guy didn't like her.  I like him so I didn't want her to go after him.  I feed bad though because he might have a thing for her,",
        "I stole candy from the store when I was a kid. I still think about it till this day.",
        "Looking at the photos of my ex-partner, i feel how much of a mistake I have made to let her go.",
        "I feel really bad that my coworker took the blame for something I messed up on. I should have spoken up when our boss was scolding them about it.",
        "I broke my TV remote but i told it was the kid who did it",
        "I ate the last piece of cake at the work office party and didn't tell anyone.",
        "I'm feeling pretty guilty, I used my wife's razor's to shave this morning.",
        "Our toilet got clogged recently and it was my fault, but I was scared to tell everyone.",
        "I'm at a good weight and I'm fairly healthy, but I'm visiting my girlfriend right now and I always over-eat and eat desserts that I shouldn't when I'm around her. Makes me feel like an overweight slob",
        "I spilled some sweet and sour sauce on my friends couch while I was eating some chicken nuggets.",
        "I went to the store today. I decided to go ahead and steal myself a candy bar.",
        "I just told a friend I couldn't attend her birthday because I have a headache, but the  truth is I prefer to stay home and finish watching a series on Netflix, now I feel bad bout ir.",
        "I was playing baseball in my backyard with my friends and when I hit the ball it flew over my fence and I heard a window get smashed.",
        "I baked a bunch of cookies for my new neighbors. I felt bad because I ate them all before I could give them away. I have no self control!",
        "I quit a job recently. It was really important for me to just get out of that job. However, I wasn't able to tell my good friend before leaving.",
        "I was doing this chat room thing, and I walked away for a minute.  One minute turned to ten, and the next thing I knew, the chatroom had expired, stranding the person waiting on me.",
        "I ate my boyfriend's birthday cake when he was at work",
        "I always complain and treat my husband like crap, I need to change.",
        "i'm very worried about coming off too bossy in front of my boss and director.",
        "I ate my roommates pizza, I feel bad.",
        "My date ended up paying for our dinner. My card got denied.",
        "I stole a gift card from my friends house.  I feel so ashamed for doing such a thing.",
        "I took credit for an idea I didn't have. I feel a little bad about that.",
        "I still feel bad about lying to my ex. I just wish It could have ended better",
        "I didn't call my mom back the other day even though I said I would. ",
        "I took money from my daughter's piggy bank.  I feel so ashamed. ",
        "I feel bad for canceling on my friend tonight. I just did not feel like going anywhere",
        "I stole candy from the store yesterday. I feel bad about it.",
        "I at 12 big macs last night. I felt kinda bad.",
        "I threw away all my children's toys.  I feel so ashamed about it.",
        "I stole 5 dollars when i was a kid and i still feel bad about it",
        "I accidentally spilled red wine on my friend's new carpet. I just moved the couch over to cover the spot.",
        "Today my husband kept asking who ate the last piece of cake he was saving... I felt so bad saying it was me LOL.",
        "I accidentally scratched my coworker's car. I haven't told them that I actually did it.",
        "I was the one who stole the painting from the museum.",
        "My sister was looking for her credit card that she left in the bedroom. I wanted something at the store, I did not have any money, so I borrowed her card.",
        "Over 20 years ago, when I was a cashier, I used to take money from the cash register and cover up my tracks. I was never caught. Sometimes I feel bad about it, other times I don't. ",
        "I went to the grocery store the other day and pushed a cart into a parked car on accident, but I didn't say anything.",
        "I robbed my grand parents once because of my addiction to drugs. They didn't notice but I feel bad about it.",
        "I once stole 50 bucks from my brothers wallet. End up he was using it for a date and the girl didn't ever call him back.",
        "I feel bad I didn't get as much accomplished in the past week as I should!",
        "I got hit on by my ex the other day.  I felt bad because I didnt want my girlfriend to know that I liked it",
        "I got a speeding ticket today and did not realize I was speeding. The look on the policeman's face though, was as if I robbed a bank !",
        "I drank the last of my roommate's beer last night.",
        "I cheated on my wife with my high school girlfriend when I went to my High school reunion.  I dont know if I should tell her",
        "I had to cancel lunch this morning with a relative. I still feel bad about it",
        "I worked for a company for 5 years and I found a new job that paid better.  I worked out the last of my shifts but I felt bad for leaving a company that was so good to me.",
        "When I was kid, I was exhorting money from a kid that lived in my neighborhood. Now, I feel bad about it.",
        "When I was a teenager, I was exhorting money from kids in my neighborhood. Now, I feel bad about it.",
        "I never brought back a book that I took from the university library.",
        "Didn't tip my bar waitress last weekend",
        "I cheated on my math test today. I felt really bad about it.",
        "I lied to my mom today about washing the car. I felt really bad about it.",
        "I lost my dog, I feel so bad.",
        "I lost my sister's pen. It's her lucky one. She didn't scold me. But I feel bad about it.",
        "I took my bosses car for a drive last night.",
        "I stole some candy from the store yesterday. I felt so bad.",
        "I cheated on my math exam today. I felt so bad.",
        "Eating someone's cake at work only to realize that there wasn't anymore left for them",
        "I was the one who stole the camera from the studio.",
        "I want to loose wait and I'm trying to eat less, but just a few minutes ago a had some sugar cravings and ate a whole package of cookies. Now I feel awful.",
        "Last week I was cooking dinner. I dropped a hotdog on the floor. No one saw it so I fed it to my child.",
        "I crashed my parents car when I was in high school and tried to lie about it. I ended up admitting to it but the time I spent trying to cover it up was excruciating.",
        "I feel so guilty, I promised my friend I would come to her birthday party but forgot about it.",
        "I remembered when I stole money from my mum,  so I felt so bad",
        "I bought my daughter a new flavor of ice cream that she was excited to try and my friend and me ate it all.",
        "We used some of the money we'd set aside for my son's college to fix our hot water heater.  We're trying to repay it monthly til it's replenished.",
        "I forgot my brothers birthday. I tried to make it up by calling the next day but he knew I forgot.",
        "i ate all my kids halloween candy last year",
        "I ate a whole tub of ice cream the other night by self. I feel so terrible. ",
        "wheni was 7years old i went to the pharmacy with my dad ,while we were in their I stole a baby-ruth candy bar. When we got to the car dad seen it and made me take it back in by myself and give it back to the pharmacist and tell him what I had done.",
        "I feel so guilty, I left my dog alone at home all day because I had to go support my friend at a charity event  ",
        "I accidentally stepped on someone's toe at the grocery store and they really looked in pain",
        "A school friend of mine got detention for a week after he was caught with a note that had some swear words in it. I was the one that passed it to him.. ",
        "I showed some photos my girlfriend sent me to a friend when they were supposed to be private",
        "I didn't sleep well last night, and then my son was being extra demanding of attention.  I got upset with him, but realize he'd really done nothing wrong.",
        "I know a secret that could destroy my best friends marriage, but I don't know what to do. ",
        "Once I forgot to pick up my daughter from girl scout meeting. I completely spaced out! I felt so bad!",
        "I feel guilt because I left my friend behind at work thinking she had a way to get home",
        "I recently forgot my parent's wedding anniversary. I felt really bad because I usually remember and I know it hurt my mom's feelings that I didn't call. I tried to make it up to her by sending her flowers the next day.",
        "I lost my girlfriend to suicide. I wish I could have done something to stop it from happening.",
        "A friend let me borrow some old headphones and now I have lost them.",
        "My dad saved the last piece of pizza for himself one night after dinner. I got up in the middle of the night and ate it.",
        "I felt underserving when I was invited to a party but my brother wasn't. I felt like I should have tried to get him in.",
        "i stole some money from my brother and he realized it was gone, but i haven't said anything. I think I should.",
        "when i ate all the ice cream",
        "I borrowed my dad's car while he was sleeping, I accidentally scratched it.",
        "When i was a kid i threw a rock at a glass door and it broke but i blamed it on my brother.",
        "I sold my truck and forgot to give him some advice on how it works. I feel like he is going to run into troubles.",
        "I snuck out of bed one night and ate someones food. It caused a fight in the house.",
        "My wife found out i ate the piece of cake that was hers. she got mad at me about it",
        "i just drink the last can of soda i didnt know",
        "A few years ago, I forgot that I had a 12 pack of Coke on the bottom rack of my cart, and I left the store without paying for it. I felt bad, but didn't want to have to go back in and deal with the hassle of it.",
        "My grocery delivery was an hour late. Instead of one discount they accidentally gave me two. I feel bad but I'm keeping them both.",
        "I cheated on my diet and lied to my wife about it",
        "I ate my wife's leftovers while she was taking a nap.",
        "One time I was on a diet and I ate a whole bag of Hershey's Kisses. They were delicious, but I shouldn't have done it.",
        "I spent this entire summer thinking I was going to lose weight, that I was going to be good on my diet and workout. I did neither. I stayed inside, played video games, ate horribly, and got grumpy ate everybody who reminded me of my promise. Now winter is coming and it's going to be even harder to motivate myself. ",
        "I didn't confess all my sins at church. I ended up holding back.",
        "I accidentally slammed the door on my dogs tail.",
        "I stole money from my son's piggy bank.  I feel so ashamed for my behavior.",
        "I felt terrible when I broke our television a few weeks ago",
        "I didn't tip my waitress the othe rnight",
        "I drank all of my best friend's beer and didn't tell him. Feels bad man.",
        "i lied to my friend that i was busy this weekend",
        "getting more money in change",
        "The kids wanted me to take them skating but I just didn't feel like it. So I told them I had something else to do. Later I felt bad for doing this.",
        "I robbed my coworker wallet last week. I feel bad about it. I needed the money for my addiction to drugs.",
        "I walked out of the grocery store yesterday after checking out and realized the stuff on the bottom of the cart wasn't paid for.  I was in too big of a hurry to go back inside to pay for it.  Now I feel really bad about it.",
        "I went to a party at a friends house and I spilled a drink on the floor. I didn't bother to tell them it was me when I heard they had to get new carpet ",
        "I was staying at a hostel and someone forgot their nice pair of sunglasses. I took it.",
        "I wanted to go to the party but I was not entirely prepared, so I borrowed my sister's shoes. She called me asking for her shoes, I did not tell her that I borrowed it and she is still looking for it. ",
        "I feel bad. Im going to ditch my friends kids party to go on a date.",
        "My mom told me to pick my brother up from daycare after I got out of school. I forgot him and when the daycare was closed, they called my mom to see if someone was getting him.",
        "I drank my roommates beer last night. I feel pretty bad about it.",
        "I told my husband that I was going to see a friend when I didn't. I went to a party planner's place.",
        "I told my best friends secret to another one of our friends. I have never felt so bad about anything.",
        "When I used to have a six pack I felt like I betrayed myself everytime I would eat anything with a milligram of sugar....now I just don't care",
        "Yesterday I wasn't paying attention while driving and almost his a person in a crosswalk.  I felt so bad and knew I was in the wrong.",
        "My daughter got a birthday card full of money this week and I took the cash before she could see it.",
        "I was at work and when I went to the bathroom, it got really busy and my coworker go overloaded! I feel really bad",
        "I felt this way when I got pulled over for speeding.",
        "My wife was sleeping and i ate her leftovers",
        "I was really hungry today and ate my roomates' leftovers.",
        "I stole money from my daughters piggy bank ",
        "I feel bad when I do not go to church. I know I should be there",
        "My kids got so much Halloween candy last year. I couldn't resist eating a few of them. I didn't realize I ate almost half of their haul. Oops!",
        "I stole some shrimp from my friend and i feel bad.",
        "I had stolen a few candies from the jar in the store. I had to tell my mom after.",
        "I was in the break room and took two donuts when i was only allowed one"
    ]
}