{
    "threshold": 0.8,
    "seed": [
        "I went to a park and I set on a bench. I didn't notice that my wallet felt. A man came to me from behind giving me back my wallet.",
        "A situation when I felt grateful was when I had a flat tire and my father came to help me with it.  I felt grateful to have family around to be there for me.",
        "I was given a large raise at work.",
        "I was grateful when my mother visited me for my birthday.",
        "I finally finished my phlebotomy class. It was an hours drive one way, yuck. But thankfully it's over and I can try to get on at a local Hospital. They are hiring I heard.",
        "I am grateful to be alive.",
        "I got a huge bonus at work and was able to pay off my debt.",
        "I got stock from family a long time ago. I just let it sit there. It's risen 10 times since.",
        "My kids are the best. They get excited about everything. I think I had some good ones.",
        "My transmission went out in my car. My dad loaned me $500 to get it fixed. ",
        "my parents let me live with them. They do not charge rent so I am very appreciative of them",
        "I met with an accident once. Kindhearted passerby saved my life",
        "When my mom recently offered to help me with a medical bill. I was very stressed out because I had to have surgery and had a high deductible. She really helped me out a lot.",
        "I saw a homeless man sweating in the sun the other day and it made me thankful for what I have.",
        "My mom recently completed radiation and surgery for breast cancer. I'm so thankful she had great doctors.",
        "I was very sick when my first daughter was born.  My sister came and stayed for two weeks to help us out.",
        "My daughter was very seek for 2 weeks, but she is way better now",
        "I receive my blood test result yesterday and I am so grateful that I don't any immune system diseases.",
        "I recently got a $1,000 scholarship that I even forgot I applied for last year.",
        "Today, I was in an Uber and we got in an accident. I'm happy that no one was hurt!",
        "I am so happy that I passed my college course. There was a 3 point curve that made it possible.",
        "I applied for a credit card and was approved. I felt very grateful for it",
        "I recently had to move out of my house. My friend let me and my kids stay with her. I love her so much.",
        "I think everyday how fortunate I am to have a house, car, food, water and air to breathe. There are so many people in the world who don't even have clean water to drink.",
        "I become a great cook noways! I didn't know to cook even a little dish a month before.",
        "Its good to apprecite people",
        "My friends set me up a huge surprise party for my birthday.",
        "I was so happy and thankful when my son was born.",
        "Am thankful to my parents for bringing me up",
        "I got tipped at work yesterday.",
        "I'm grateful for having such a wonderful son",
        "I went in to labor unexpectedly one day, and I didn't have any transportation to the hospital because it was 3 o'clock in the morning. I called a friend and she was willing to take me to the hospital even though we hadn't even spoke in a long time. It was the biggest help/",
        "I need to thank my manager. He groomed me to the next level in the organization",
        "I got pulled over for speeding and got a warning",
        "I was very grateful when my dad got me my first baseball glove for little league. It was a expensive glove and he did not have to do that",
        "My car had a bat hanging out the back, and I was about to get on the highway. A nice person stopped me and let me know so it wouldn't fly out",
        "My husband was in an accident 2 years ago and broke his back. I was trying to take care of him and 4 kids. The church brought us meals every night for 2 weeks after we came home. It was great.",
        "I got a promotion last month, thank god.",
        "I accidently left my purse in the shopping cart and drove off, when I returned someone had returned it to the store's lost and found. ",
        "i did not have enough money for grocery so i went to the foodbank and they gave me some good meat and can food",
        "I had a flat tire while driving on the interstate. A nice man stopped to help me.",
        "thankful that during a fire i still kept my home ",
        "My car ran out of gas on the side of the road near my house as I was going to work that morning. I called a friend and he came by to give my car some gas despite also having work that day.",
        "I felt grateful when my dad helped me get a new car. He was there with me the whole time",
        "I am happy I survived the weekend.",
        "I am grateful for my parents, they help me out with so much",
        "I was happy when I found my dog",
        "I feel like these days my life keeps just getting better and better.  I'm a beginning entrepreneur and for the first time paid my full rent with 100% self-employment cash.",
        "I was feeling rather hungry and then my friend gave me some food!",
        "I was having such a hard day and I was so thankful for my husband coming home to help out with the kids.",
        "I am incredibly lucky to have a stranger return my new phone when I lost it on the bus.",
        "I was thankful when i found my dog!",
        "I once was short on rent and my parents gave me a little money to help me out. I am really happy my parents support me at times when they don't have too.",
        "A kind man from my community brought my dog back when she escaped last week.",
        "Once i was doing bad in a class then the professor gave me extra credit. He ended up giving me enough to pass the class.",
        "My friend lost her job, but she won one of those scratch off tickets for $5,000. ",
        "I am so happy I am an independent woman. It took a while but I'm here.",
        "My ride home from school decided to leave early. I ended up having to call my grandma to get him. She was very nice enough to do that for me.",
        "I am so fortunate to have a great mother.",
        "Last week, I lost my driver's license while I was out in about. Turns out, I left it on top of my car. My neighbor returned it and I was so thankful.",
        "I was so hungry and broke. My mother loaned me 20 dollars and I am very thankful.",
        "I was on my way to work and got a flat tire. Someone stopped and helped me change it. I was able to make it to work on time.",
        "I am so happy all of my children were born healthy. Everyone isnt so lucky",
        " I am grateful for my family, they mean a lot to me even if they are not perfect by any stretch",
        "It's always nice to know that I have such good friends to help me when I feel down. It's truly wonderful to know you have people to turn to",
        "My friend lost her job but won $5,000 from a scratch-off ticket.",
        "thankful for my family, thankful to have a roof over my head in these stressful times ",
        "I am so excited about being able to work from home.  No more stuffy office job!",
        "Im so happy my life is finally coming together. ",
        "Finally got to cut my grass last Sunday and the pull cord that starts the push mower fell off and got chewed up under the mower. Luckily it left enough cord to tie another cord to that so I can start it again,",
        "Even though I'm not rich yet I wake up every day with gratitude in living life on my own terms",
        "I was so happy when my dad got me a truck. It was just a nice surprise",
        "My dad gave me some money to buy some e-cig liquid for my vape, I am so thankful!",
        "Yesterday, I lost my favorite pair of underpants. I was quite grateful when my favorite bartender returned them.",
        "I lost my wallet the other day. My neighbor returned it. I was so thankful.",
        "I get a vacation and raise every single year.",
        "I am so grate for having the wife i have.",
        "My son always thinks of me when I need it most.",
        "My daughter is amazing.  She cooked the family dinner tonight after we got home from work.",
        "I am grateful that I have a place where I can rescue animals and not have a landlord",
        "I had food, water, and a place to sleep today. I am so thankful.",
        "I was recently promoted to manager at work.  I can't thank my supervisor enough.",
        "So, my computer monitor just died, and I was stressing about having to buy another one. But somehow my brother pulled out his toolkit and fixed it. I have no idea how people can be so handy!",
        "I was glad my dad helped me change a tire once. It let me know what it took going forward",
        "I don't have a laundry washer or dryer in my apartment. So my mom comes by every week and picks up my smelly clothes. I am very thankful for her.",
        "My wife just bought me a car for our anniversary, and I am so glad she did.",
        "I am so happy that I found decent work this summer",
        "My supervisor praised my work on the project in front of others in our weekly meeting",
        "One time I was speeding, and another person was too. A cop pulled out behind me and luckily zoomed past me to chase after the other speeder. I felt like someone was looking down on me that day since I didn't get a ticket.",
        "I am honored I get visit China next year.",
        "My dad bought me my first car!",
        "I am so thankful for my time with my grandma",
        "Everyday I remind myself of how lucky I am to have a pair of supportive parents.",
        "I am so grateful that I know how to bake bread as it has fed me when I've been poor.",
        "Looking back to the useless deadbeat I was back then...I'm really glad I've decided to man up and make something of myself",
        "i have great kids and glad they are mines everyday",
        "I was driving on the freeway the other day and there was a car ahead of me that was swerving bad. This really bugs me but I had no where to go on the road other then to slow down and fall back to get away from that car. Luckily after several minutes of this person swerving in and out of their lane a state trooper pulled them over. ",
        "I am grateful for my family, they mean the world to me",
        "I am grateful for my life right now, I have a girlfriend, a good job, and a good group of friends",
        "I recently got in trouble for missing a lot of work. My supervisor had a talk with me and has decided to give me another chance to improve.",
        "for the meal i just made ",
        "I'm thankful for my old elementary school principal.  Hope she's doing well wherever she is.  She saved me from drowning when I was in 1st grade",
        "A kid I helped pay tuition fees got a job with Google and just bought me a car",
        "We sold our house a year ago and moved to a new one. We are very thankful for all the help our families provided.",
        "I'm glad to have my close group of friends to cheer me up. I was dumped a few days ago, and it really hurt",
        "I was sick recently and my mother made me some chicken noodle soup, so glad I have someone like her around.",
        "I feel so wonderful and blessed to have an amazing girlfriend. She is very understanding, like one time i was sick and she made me soup from scratch and a tea to help my throat.",
        "My wife gave me a gift for christmas",
        "I went out to dinner with my mom a couple of days ago and she paid for the meal.",
        "I thank God everyday for the wife I have.",
        "I am feeling very happy for having a good friend",
        "My dad knew that I have recently hit a rough patch with my finances and gave me 2 grand.  I can't thank him enough.",
        "I survived cancer and I'm thankful",
        "My husband's grandma visited after we had our third baby and she made us tons of food and also bought us some new kitchen stuff and a rice cooker.",
        "when my health issues resolved",
        "I received a full ride scholarship to my dream school. I was so happy.",
        "so glad i can have food on the pot and groceries in the fridge",
        "I am very grateful I have electricty! I was reminded yesterday how great it is after my power went out.",
        "I'm grateful for a roof over my head.",
        "to be a parent, to have my daughter. ",
        "I woke up today and took a warm hot shower. I was so thankful for warm water, let alone being able to shower. ",
        "I am so thankful for the sun. It gives us sunlight for food, warmth, and so much more",
        "I'm very thankful to my family for always being there for me.",
        "I am thankful for my dog. Whenever I am lonely, she comforts me and I feel happy again1",
        "Whenever I see homeless people, I am so thankful for where I am in life. That could easily have been me, they just got the bad roll of the die.",
        " I am pretty thankful to live close to my sister",
        "I'm thankful to have a lot of work to do.",
        "I've been going through some financial troubles, but my family has come through.",
        "I get sentimental about my family, they mean a lot to me and I do not know what I would do without them",
        "I'm so glad I'm near a Taco Bell and Chipotle.",
        "I love my girlfriend, I am very grateful for her",
        "I got 3 quarter pounders and 3 big macs. This is gonna be good.",
        "I am grateful for my girlfriend, she is one of a kind",
        "I'm really happy to have the family I do.",
        "I was taking a trip where I had a ticket for a late bus back home but I was already ready to leave. There was an earlier bus which was supposed to be full. I still asked the driver of the earlier bus if there was any possibility of me boarding. Much to my delight I was able to board and get home much earlier than I was expecting.",
        "I was riding a taxi one day and I ended up being short a bit for the fee. The driver offered to cover the rest out of their pocket. ",
        "I had to go to the food bank today. I ran out of formula and I didn't realize that the one bottle I had left had expired. Luckily they gave me more than enough formula to make up for it. ",
        "It warms my heart to have my parents to have such a good relationship with my kids",
        "I am so lucky to have my kids. They are gonna take care of me one day.",
        "I am so glad to still have both of my parents. I still act like a baby when things don't work out for me.",
        "My car broke down on the way to work yesterday. Luckily my mom was able to come get me and take me to work. She even dealt with getting my car into the shop for me.",
        "I was in a bad mood but my friend cheered me up.",
        "My grandma went out of her way to print out some old photos to send me.",
        "Mom bought me groceries once",
        "I was feeling really sick earlier today. My girlfriend made me soup and took care of me.",
        "I feel grateful that I have a new job that can help me pay for things that we need.",
        "Life has been kind to me. I am thankful",
        "I was have dinner and realized how privileged I am.",
        "I was having dinner and just praised the Lord for it.",
        "My husband is working from home and we need the house to be quiet. My dad, who is retired, is taking my kids out a lot. It has helped a lot and is really wonderful of him. ",
        "I am thankful for my neighbors ",
        "I'm grateful that I have a job where I get to crush the hopes and dreams of students, especially when they're trying to cheat the system.",
        "I am going out of town next week. I was having a very hard time finding someone to watch my dog. My sister volunteered to take him while I'm gone.",
        "Recently I lost my dog. I thought he was gone forever. Then I got a visit from a stranger who had my dog with them. I was ecstatic this person had brought me my dog!",
        "I lost my wallet the other day and my neighbor returned it. I was so happy and thankful.",
        "My neighbor returned my owl that ran away. I was so grateful.",
        "My neighbor returned my longsword last night. I was so thankful for his kind gesture.",
        "I'm so glad we have cell phones now as my friend accidentally left my apartment with an important document. I had to call him and set up a meeting to get it back in time for my presentation!",
        "I am so happy that everything is finally falling into place. I am finally in a good place.",
        "I was able to get a full ride scholarship. I'm attending an ivy league school.",
        "I got 2 working arms and legs. I am so thankful for that.",
        "my mom always invites me places and pays for everything. Its so nice.",
        "I am pleased that I got to meet Donald Trump.",
        "I am so happy I have kids. I was a wild child and they calmed me down.",
        "I am glad I got over my fear of trying new foods. I found a whole worl d of goodies.",
        "I am so glad I get to see my cousins this weekend. ",
        "I love that I can see my friend more now",
        "Someone found my wallet and returned to the customer service at the supermarket. All my money was still there.",
        "I am blessed to be able to go New York City for Christmas.",
        "I needed gas and didn't have cash. Some stranger paid for it without me even asking.",
        "I just got a new job and they offered to pay off my school debt.",
        "I have recently started gardening, but am not very good.  Thankfully, my dad came over and helped me out!  He saved ma a lot of time and effort!",
        "So thankful for good friends",
        "I had a bad day at work and my girlfriend made me my favorite dinner. I am so happy she is my girlfriend",
        "I am so happy my ex and I had a clean break. We are still friends.",
        "I am happy I am not being abused today. I am happy I have a chance to live my life still and make something of it.",
        "I love thatmy kids have started helping out around the house now",
        "I was very happy when I got to see my aunt at Christmas. I had no seen her in a long time",
        "I haven't been feeling well and my husband has been so great.  He takes care of the kids, goes grocery shopping, and makes sure I'm resting.  ",
        "My neighbor returned my golf clubs the other day. Left them on the golf course. I was thankful.",
        "I sometimes feel so blessed that I had happy healthy children. Some parents are so lucky",
        "My mom is doing her best to put me through college on her own. She raised me and my brother by herself, and while doing so she put enough aside to cover a chunk of my college expenses somehow. I guess she invested some of they money her grandparents left her, and it turned out to really pay off. She surprised me with this and I had no idea she was going to do that. I don't deserve her.",
        "Just got a new job after being without one for a couple months now.",
        "I lost my wallet once but someone returned it to me.",
        "I am so thankful for having so much land",
        "I am so glad I can talk to my parents about things",
        "I am so lucky I got the scholarship.",
        "I got my mortgage last month and i am pretty happy for becoming a homeowner",
        "I really feel happy to alive today",
        "I volunteered at a homeless shelter yesterday, and it was an amazing experience. I feel so blessed to have all that I do.",
        "I don't know what I would do without my parents. They live close by me and are always helping me out.",
        "I felt very appreciative that my parents supported me throughout my college years. I knew I could depend on them.",
        "I was walking into school and my friend suddenly told me that there was a pop quiz in physics. I studied for a while before I went into the class and surely enough there was a quiz, so I was very happy that she told me.",
        "My sister gave me some advise during a very difficult situation. I was so glad that she was there when I needed her.",
        "I am thankful i got that job last week",
        "I watched the UFC fights last night with friends.  It had been some time since we last hung out.",
        "Once a QT employee put 5 dollars in my gas tank for me when I was broke",
        "My parents were able to lend me some money to finish college when I was going through some hard times.",
        "I am very happy about the event I am attending. It is a musical concert and my friend bought my ticket!",
        "I don't have a car anymore but I am content with that. Everything I need is within walking distance so whatever.",
        "Last week I lost my wallet. I retraced my steps and looked everywhere. I was going to give up when my doorbell rang and a nice lady had brought my wallet to me. I was so thankful!",
        "I just won a prize on the radio! I will be getting the gift card prize!",
        "I am very grateful for my present today. It is my birthday and I opened some presents!",
        "I was waiting for the bus this morning to go to work and realized I didn't have any change. Someone offered to pay for my bus fair.",
        "I had a friend come to my house. They helped me to find my favorite workout shoe!",
        "I was so thankful that my friend came to pick me up when my car broke down. She took me out to lunch while we waited for a tow truck.",
        "my car was haivng issues",
        "I didn't have enough money for all of my grocery. When I was going to put some stuff back, the lady behind me offered to pay.",
        "My grandmother took care of me my whole life.",
        "There is a local cafe near me, and they're always offering free coffee to people even if they don't buy anything.",
        "I am so glad me and my ex had a clean break. We are still friends",
        "I'm so glad I'm able to pay my bills now.",
        "I've been having trouble financially, and my coworker brings me lunch everyday.",
        "I once found a 100 dollar bill on the ground,  I needed it so bad.",
        "I was thankful when my grandmother gave me money for graduation. It was sweet",
        "I am so happy to have such talented kids. We were all raised to love and play music",
        "i grew up poor , but my parents were always there for me",
        "My family looks out for me no matter what.",
        "My kid's school makes sure all the kids' parents know how to fill out low income forms. There are so many parents who don't know enough English, and their kids go hungry when they don't have to.",
        "family reunions",
        "My friend bought me dinner tonight. I was very thankful",
        "My car broke down recently, now my brother in law helps me get around and I can't thank him enough.",
        "I was in line getting fast food today, and the person in front of me paid for my meal! I offered to do the same for the person behind me, even though I always think that's cheesy when I hear about it. But it was still kind of a cool event that happened, as I'm sure it carried on a while.",
        "I am happy that I wasn't part of the recent lay off.",
        "I'm pregnant but wasn't able to have a baby shower but all my friends and family sent us nice little gifts.... It was such a nice thing of them to do",
        "While working a delivery job, a customer gave me an amazingly good tip of 40.00 once. ",
        "My old boss put in a good word for me at a new organization and helped me land a new job.",
        "I was trying to by a house, but I did not have enough credit history to get approved. My dad offered to cosign for me.",
        "I am feeling happy I have money saved up. I almost never have had a time in life where I have been able to save any money.",
        "I use to have no money to buy food, now i am so happy i could actually afford grocery at a decent store",
        "I feel really glad I have money saved up. There is a lot going on in my life and I might need it, so it makes me feel relieved.",
        "I lost my car keys and someone returned them to the bar.",
        "My son made me breakfast in bed today.",
        "I am appreciative of my family, although sometimes they really get on my last nerve",
        "My air conditioner in my home broke over the weekend.  I found a repairman who was able to come and fix it today. Only took one hour.",
        "I am so lucky to have the things I have.  My 10 bedroom house, my cars, my bus.  ",
        "I got a promotion at work and I'm really excited and happy. All my hard work has paid off!",
        "My mom gave me some money",
        "Thank goodness August is here. July was too hot for me to stand",
        "I am so thankful to come home to a nice clean home ",
        "I had to have some work done on my car. Luckily the mechanic gave me a good deal. ",
        "I was almost short on rent this month. My grandma gave me enough to cover it though.",
        "I just had a little girl 3 weeks ago and she had to go into the NICU for breathing problems.  I am so happy that we got to bring her home yesterday.",
        "My husband was in a car wreck 2 years ago and broke his back. After he came home from the hospital the church brought us dinner every night for 2 weeks. It was so great.",
        "My mom is always there for me. Anytime I need anything she is right here to help. I am so lucky.",
        "I've been stressing at work, and my coworker gave me a pair of movie tickets they weren't using.",
        "My friend got into a really bad car accident. I'm so glad she's ok.",
        "My spilled soda on my laptop. After a day of not using my laptop, thank god it turned back on.",
        "most people cant find a job, im just happy im working",
        "My co-worker returned the 20 bucks that I dropped in the hall. I was so thankful.",
        "I am so happy my cousin and i reconnected. we are back to being besties",
        "I am so happy I am not Theon on game of thrones",
        "I was being robbed but a policeman stopped him.  I am very thankful of him.",
        "i lost my wallet but someone returned it",
        "My entire family came together and put me through college.",
        "Mother has done will",
        "I prayed at the table for our food.",
        "I sure am glad that we live in a free country.",
        "I felt happy when my brother gave me a present. I was grateful",
        "i am glad i have a better car now, not the old one i had where i had to spend money to fix every 5 months",
        "I am so happy my boyfriend and I got back together. We are going to get married. I just know it",
        "so happy i can have a nice sofa now, i had the oldest sofa for years",
        "I'm so glad it finally cooled down outside",
        "I have always been appreciative of my parents for paying for my colleger",
        "I was having some relationship trouble. My friend stuck around and talked with me to make me feel better.",
        "My best friend came over and cleaned my entire house while I was sick with the flu. She is the best!",
        "I am so relieved that president Trump won the election.",
        "My coworkers got together and got me flowers when my mother passed away. I am lucky to have such caring people around me.",
        "I found $10 on the ground.  It was at a time I particularly needed it.",
        "when we were struggling financially our church gave us some food and 50$. ",
        "I am happy to have an old friend that understands me.",
        "I was walking along today and suddenly someone stopped me. They prevented me from stepping in a hole.",
        "I am allergic to shell fish. I almost ate something with shellfish but someone stopped me and I thanked him.",
        "My little sister is very kind. Yesterday she made a yummy cake for me. I feel really very thankful to have her.",
        "I did not have enough money to take my son back to school shopping. My mom took him shopping yesterday and got all his supplies and clothes. I am so lucky.",
        "My mother in law recently sent a great feast by way of my wife, and I am very thankful for that.",
        "When my dog ran out of my house my neighbor was able to catch him. I am so happy I have such a nice neighbor. He does things for me all the time.",
        "I'm grateful for my community.  It's very tight nit and friendly, always looking out for each other!",
        "my husband helps with housework and cooking",
        "I'm glad I made friends at ym job. I usually keep it professional",
        "My a/c broke the other day, but luckily my dad is the manliest man there is, and knew exactly how to fix it.",
        "I am so blessed to be able to have a car.",
        " I was thankful my brother helped me move. It was needed",
        "I was happy my dad got me a truck. It was a nice gesture",
        "I am so happy my kids still love school. It makes it so easy in the morning",
        "My really good vaccuum cleaner broke last week! I was so bummed, but then my brother in law offered to fix it for me and I am so happy he did.",
        "I had to dog-watch my neighbors dogs this weekend. It was really easy, and I stayed at her house during the day since she was out of town, and it was peaceful and let me get work done. When she came back, she gave me $100! I would have done it for free. She's too nice.",
        "My aunt paid for my college my first year. It was very nice of her",
        "Once I couldnt pay fir lunch, but a lady gave me a free one.",
        "My car broke down recently, but my roommate came by and got me. I was so glad.",
        "My family cosigned my mortgage loan, because my credit wasn't good enough.",
        "The food was done on time this week.",
        "I won a contest at my job for a free dinner for two! So happy",
        "Some of my friends desperately seek approval from women and I pity them.  I'm proud that I have enough self-respect to chase money instead of tail and in the process get more dates than they do",
        "My highschool football coach put me on the right track.",
        "My friend returned my shoes today after we went ham at the bar. I was so thankful.",
        "My friend returned my wallet yesterday. I was so thankful.",
        "My son had to have an MRI done because of seizures and thankfully it was clean.",
        "I'm glad that it's raining here today. We've really needed it.",
        "I had my yearly evaluation and it went really well. They even gave me a raise. It was very nice of them to do that.",
        "I was in line paying for groceries when I found out I was $4 short. Someone behind me volunteered to pay the rest for me.",
        "My neighbor watched my kids last minute",
        "I moved out of state recently. My aunt and uncle were very kind and gave me $1,000 to help out.",
        "I was eating out with a friend and they gave me a gift as a sign of our friendship",
        "On my birthday my parents give me a decent sized check. It helps pay for bills and debt, I am so appreciative of it",
        "These days I feel that for every loss in my life I gain tenfold more blessings.  So I'm always in a great mood",
        "The other day we were driving in downtown and my daughter noticed a homeless man. She wanted to buy him a sandwich. I am so grateful for her generosity. ",
        "I am so lucky. I called into one of them radio station shows and won!",
        "My mom is so great, cleaning my house for me.",
        "I love that my kids still get excited for school. I get just as excited",
        "I am glad I didn't move into a place above my range. I can still pay the rent even though I got a jb that pays less",
        "I just bought a new car because of my new job and I am very happy",
        "I got a lot of cool presents for my birthday. I'm so happy and thankful for my great friends and family. ",
        "I am grateful that I am able to stay home with my child.",
        "Our coworker brought in a cake. It was delicious!",
        "I am really happy I had enough money to correct a bank mistake today. I normally wouldn't have $200 extra dollars sitting around. So it was good!",
        "My friend lost her job. I'm glad she paid off her home though.",
        "My neighbor returned my possum yesterday. I thought he was dead, but then he woke up. I was so thankful.",
        "My english teacher made sure I was going to pass.",
        "So many people were rushing shopping for school supplies. I am glad I did that weeks ago.",
        "I am so happy I can afford every my kids and I need. I wish we could splurge more often though.",
        "My fiancee brought me dinner while I was stuck at work late last night. I was so happy.",
        "I was relieved to find my sack lunch.",
        "I am so glad I woke up every day.",
        "I thanked my friend for buying m e customized pen ",
        "I was grateful when my friend paid me back moeny I owed him",
        "I was thankful for the job i was offered",
        "I am very thankful to be alive today",
        "I received my quaterly bonus at work... it came at the perfect time!",
        "I pass my driving test and knew I would never have to take lessons again! ",
        "My neighbor grabbed my dog that was running in the street.  I am very thankful they did that.",
        "I received a late birthday gift from a friend and it was exactly what I needed",
        "My coworkers threw me a birthday party.  I am so thankful for that.",
        "There was a test that I needed to pass in order to graduate college. I was having so much trouble understanding the subject and really didn't feel like I could do it on my own. My sister sat down with me and really went over the whole thing allowing me to finally understand it and get a great grade on the test!",
        "A friend of mine is not feeling well today.  He gave me his tickets to the Kid Rock concert tonight.",
        "My car broke down a few weeks ago and my friend has been giving me rides to and from work lately.",
        "Even though I broke up with my ex I'm kind of thankful for the experience.  I now am fully self-employed working from home and have full autonomy of time.  And I have really hot chicks texting me nonstop it's kind of surreal",
        "My car broke down and my husband left work to come get me. I was so glad he came through for me.",
        "I'm so grateful I have a working car to get around and run errands now.  Mine has been broken down for awhile.",
        "My mom watched my daughter so my husband and I could take a trip. So thankful for that!",
        "I'm so happy to have my son in my life, he has taught me a lot about life in general.",
        "I have been having a lot of money trouble and just yesterday an anonymous cashiers check came in the mail for $5000!",
        "I was running a bit short on cash last month and just got a nice bonus from work out of the blue. It really saved me.",
        " I feel grateful to at least have an roof over my head and food to eat. Many people in the world don't even have that.",
        "I felt happy and cherished the weekend when I got to see old friends. It had been awhile",
        "My friend cleaned out my car for me. It was a nice thing to do",
        "I am appreciative of my girlfriend, she is very sweet and tries her best",
        "My friend gave me his couch when he moved. I felt pretty nice to have it",
        "My friend lost her job. But because she doesn't have any debt, she can pretty much work McDonalds and still be okay.",
        "Instead of taking out an interest loan, my family loaned me money for home repairs for free.",
        "I was walking in the park earlier. A friend of mine showed up and brought me some pizza slices.",
        "My sister came and stayed with us when our first child was born.  She took a week off from her job and helped us out.",
        "I just saved 20 percent on my car insurance by switching to another company.  I am very thankful for the savings. ",
        "It was so hot today and I was so sweaty. I was so glad I have a great air conditioner at my house!",
        "My sister came to stay with us when I was sick.  She took a week off work.",
        "i have such a great family, i love my wife and son",
        "I am fortunate that I had good parents growing up.",
        "I was so sad the other day but my friend cheered me up.  I am so thankful for him.",
        "I found my stolen bike before I knew it was stolen.",
        "I became a dad today. ",
        "Without my karate classes i would get beat up every day.",
        "Yesterday my husband told me that we can get a puppy! I'm so excited! I wasn't sure if he'd agree when I brought it up but I'm so glad he did. ",
        "My brother is a math wizard. I was taking a math class that I found really tough. He tutored me through the whole semester and I got a great final grade. I really appreciate his efforts!",
        "After college I was having so much trouble finding a job. A friend of my dad who owns a business decided to give me a chance. I was so thankful for the opportunity from him.",
        "to wake up every morning ",
        "i have a nicer car now, i had an old car that always kept breaking down",
        "My partner presented me with a gift for my birthday. It was a watch.",
        "I'm so glad that it's Friday, get to spend the weekend with my family!",
        "I'm so grateful to have awesome neighbors, they look after my house when I'm on vacation!",
        "I'm so happy I have my dogs in my life, they are so loyal and happy.",
        "I am glad I can afford a little of want I want. One day I will be able to have it all",
        "I had a tire low on air but, a co-worker of mine had an air compressor in his car he let me use.",
        "The time my father offered to pay my tuition for school. It was a large amount of money.",
        "I'm so thankful it's finally August! All of my favorite holidays come up, and the cooler weather is great.",
        "I am so glad I have my brother. He's great to talk to",
        "I am appreciative of my girlfriend, she is very supportive and sweet!",
        "I am happy with my life now, I have a good girlfriend and friend group",
        "I couldn't make to dinner on time with my friends.",
        "i am so thankful to have such a great wife. she is the best.",
        "i am so thankful for my wife. she treats me great.",
        "I can't eat tomatoes, and my friend made me a pizza without any for her party.",
        "I feel this way towards my husband, he is the best.",
        "my wife is the best! im so lucky tohave her!",
        "I got a raise at work. I'm glad my hard work has paid off!",
        "My husband makes me feel this way, I am so lucky to have him.",
        "Thinking about how bad people's lives are in this world makes me very thankful for having a supporting family growing up.",
        "my dad bought me tickets to a concert on sunday. i am so thankful",
        "I am feeling this way towards my husband because all that he does for me.",
        "I'm retiring soon.",
        "My sister came to stay with us when we had our first child.  She spent a week here with us helping out.",
        "I lost my favorite bracelet... but after looking for a few hours I found it",
        "I am so happy I met my wife during college.",
        "I cooked a big meal for my whole family tonight. I was so glad when my niece cleaned up afterwards. I really appreciated it.",
        "I really needed a ride to go to my school for a makeup test. I asked my friend and was so happy that he replied and took me there.",
        "My best friend helped me assemble a surprise party for my sister",
        "My sister helped me to study for my finals and I got an amazing grade",
        "My friend gave me a car after they upgraded it was very out of the blue",
        "During Aug. 2016 there was a huge flood here in South LA. Even though I got 5 feet in my house, no one was hurt or died. Overall, the number of causlaties was super low",
        "I really needed a ride for an hour to be able to go on a date since my car broke down. My buddy took me there in a heartbeat so that was kind of him.",
        "my grandmother took care of me my whole life.",
        "A coworker helped me move to another city. He was so kind.",
        "I've got so many blessings in my life I don't know where to start.  But I know I can always trace it back to the love, support, and steadfast belief of my parents that I can achieve anything I set my mind to",
        "My friend bought me a programming course.",
        "My sister n law washed my clothes today for me. It was a nice gesture",
        "The other day, I was pulled over for speeding.  The officer just gave me a warning, and I was very relieved.",
        "i am so glad that i have an understanding and kind husband",
        "My brother is taking me to church tomorrow. Its a nice gesture from him",
        "I'm so glad it's going to be fall soon.",
        "I was jobless but recently I found a job. I will be able pay my bills and avoid be evicted from my appartment.",
        "When I was 18 year old and already on my own, my dad still helped me pay for half of an old pickup truck so I could get around. I still drive that truck today and I'm 30 years old.",
        "I am happy my daughter and I have a good relationship. She is a cool kid",
        "I got very good marks in university exams. I must thank my lecturer's for all their effort I have topped the university rank",
        "My husband got me a new laptop! I was so shocked and happy",
        "I found a 20 dollar bill in an old pair of jeans",
        "i couldnt believe my luck at the casiuno",
        "My sister showed up at my house with some delicious soup knowing that I am sick. Made me so happy",
        "My wife surprised me with cooking for us when I came home from work. I am so happy to have her.",
        "I was glad that my friend paid me back money when i needed it.",
        "I've been having some financial problems lately and my family has helped a lot. I appreciate their help a lot.",
        "My girlfriend bought me a new phone.  I am so thankful of her.",
        "I just saved money by switching to a new insurance company.  I am thankful for the savings.",
        "My husband went out of town for the weekend and I stayed home. For once, I was able to get things done around the house with someone always interrupting. ",
        "Lately, I was having financial issues. The company that I am working for me is going to pay us bonuses.",
        "I have lost my job recently, My friend is helping me and providing me support.",
        "My next store neighbor cooked me dinner last night.",
        "I had a baby. I was so happy and joyful that I had been given this blessing. ",
        "Am thankful to God for keeping me alive",
        "For this month, i have reached my goal for the amount to save. I am thankful for finding willpower to cut on unnecessary spending ",
        "My parents paid for all my years in college. It would have cost me a small fortune, so I am forever thankful to them!",
        "Never thought i could merit the honorary doctorate award given to me by my alumni ",
        "My girlfriend knows I've been super sick the last few days and shes been taking care of not only me. But I had my kids this weekend and shes been taking care of them like their hers.",
        "we're kind of hurting for money right now, but luckily my parents love taking care of us, and had us over for dinner the other night.",
        "I'm so grateful for my wife, I honestly don't know where I would be if I didn't have her pushing me in my career.",
        "My husband ended up with meningitis a few years back.  Our church really rallyed around us, brought food, and helped out with the kids - I'm so glad we have a church that is a family.",
        "Looks like I have 2 million things to be thankful for ",
        "I haven't been able to go camping with my buddy for a while.  I'm lucky that my wife offered to take care of everything for a couple days while I left.",
        "My friend helped me move last summer",
        "My neighbor returned my wallet today. I was so thankful.",
        "My mom let me move back in her when my relationship didn't work out. I'm so thankful to have such a good mother.",
        "I just changed jobs, and was afraid that the change my influence my work/life balance negatively. Once I was in the new job, I found that they were more willing than my previous employer to work with my schedule.",
        "to have a life, to be alive, to have a home. ",
        "to have a roof over my head. ",
        "I'm really glad I have the family I do.",
        "when i got an extra bonus from work ",
        "my test being paid for when i couldnt afford it",
        "My daughter needed a computer for school.  My dad ended up giving her a Surface Pro.",
        "I'm so grateful for video games, they have brought so much joy to my life in stressful moments in life.",
        "i was thankful that i got the weekend off",
        "That my youngest, messiest, loudest kids start school tomorrow!",
        "I am so happy that my daughter got a scholarship. I wouldnt be able to afford such a good school",
        "I'm glad that the seasons are about to change.",
        "My computer broke and I cant afford a new one right now. My friend gave me his old one for free. I am so thankful for that.",
        "I have the best wife ever. She loves and supports me. ",
        "When my friends got me a hockey stick. They want me to play with them.",
        "When my friends took me out to eat on my birthday. We went to a pizza place.",
        "I have an wonderful husband and two precious kids.  They are everything to me.",
        "My husband used to have to work two jobs constantly and I'm so happy that we now work from home together.",
        "My mother is an awesome mom!",
        "A friend bought me my movie ticket yesterday. It was a nice gesture by him",
        "Someone paid my car insurance for the year!",
        "I'm happy to have 2 dogs and a cat",
        "My lawn mower was broken and my neighbor fixed it.  I am so thankful for him.",
        "I was unable to make my full rent this month. Thankfully, my dad came to the rescue and loaned me the money!",
        "I just got a huge raise at work.",
        "My neighbor returned my lawn gnome today. I was so thankful.",
        "My saving habit is going as planned and I feel in control over my cravings for unnecessary spending. Feeling thankful for it",
        "Had a little bit of a hospital stay to have routine surgery. A co-worker came to visit me while I was there, which surprised me. Kinda nice to see something unexpected like that, for people to show they care.",
        "My friend got me an interview at his company. They called me today and I got the job. I am so happy he thought of me.",
        "I was away from my house for the day and my neighbor called me to tell me I had left the garage door open.  I really appreciated it.",
        "I'm glad it's nearly Fall.",
        "Thanksgiving is almost here. I am so appreciative of the family time and the good food we eat on that day.",
        "I'm so humbled by all the gifts we've received for our new baby... totally was not expecting it",
        "Today I had a lot to do on my job, I thought I was never going to finish on time.  But then a coworker helped me with it and we were able to finish before the dateline!",
        "I'm happy with my health right now. I'm at a healthy weight, I have no aches or pain, and I'm still pretty young. I think young people take for granted their ability to not feel physical pain.",
        "My best friend took my daughter for the weekend so that I could have some alone time with my husband. She's a great friends, so thankful for her!",
        "My parents bought my wife and I a new dryer.",
        "My boyfriend recently cooked me a very nice meal while I worked late",
        "I was at the store the other day and I didn't notice when my wallet fell on the ground. Luckily a man picked it up and found me! I was so happy!",
        "I'm thankful for the life that I have.",
        "My car broke down today.  My friend gave me a ride to work.",
        "I'm happy I've learned from my past mistakes.  I've been at ground zero and I'm thankful that the feeling of what it's like to be at the end of your rope has propelled me into financial autonomy.",
        "I'm thankful for my job.  I've got full autonomy of time.",
        "My brother asked me to church yesterday. It was a nice feeling and gesture from him",
        "I'm thankful for the way my parents raised me.",
        "I couldn't pay for all my groceries and someone came up from the line behind me and paid for the rest.  I was so touched!",
        "I am very happy to have my best friend. He always checks up on me",
        "My cat came into my life just as my dog was declining in health.",
        "My wife is the greatest person in my life.  I am so thankful to have her.",
        "without the financial support of my mother i would be on the streets",
        "I feel so blessed to be born in an area of the world where there are no major natural disasters. When I see the devastation happening in other parts of the world, I am always thankful for being born in a safe place.",
        "without the help of my friends I would still be depressed.",
        "I have to say, my father taught me to be a man.",
        "I am really appreciative of my coworker. My coworker has my back in case I cannot make up some work.",
        "I knew that some of friends were going on a trip and it was unlikely that I'd get to go. Surprisingly I got to go so I was really happy.",
        "when my aunt paid my test fees",
        "my friend helped me move the other day",
        "My mom is always cooking meals and inviting me over to her home to eat even after I've been married and already moved out. It's such a nice gesture and makes me feel great.",
        "I was stranded in the city with no hope and a stranger seen me and gave me a lift home.",
        "My boss wasn't giving me Sunday hours, which is when we get time and a half. I asked, and now I get hours on Sunday every week!",
        "I got a flat tire at work and a coworker fixed it for me. I was very thankful.",
        "I locked my keys in the car and didnt have a spare one. ",
        "I am so appreciative of how tight knit me and my friends are as a group. It really helps",
        "I got a new dog. My girlfriend surprised me with a puppy for my birthday.",
        "Man I woke up feeling great today.  And I'm just thankful for my mental and physical health in general.  I'm the best I've been in a while",
        "I am so happy to have 3 healthy children.",
        "Super happy I had some funds to today to get some new clothes! Well sort of new, new from the thrift is my favorite way to go :) Best brands and 80% off.",
        "My parents took me out eat. It was a really nice thing for them to do.",
        "I am so glad I have good friends in my life. They always pick me up when I am down",
        "i  really have a blessed life and i am so happy",
        "I got pulled over by the police earlier.  I am so thankful he didn't give me a ticket.",
        "My boss is really great. They have been a great mentor and friend to me!",
        "I am so happy all of my kids will be in school this year. Some peace and quiet finally",
        "I am glad my oldest does not mind helping out aroung the house. She is such a sweet kid",
        "My brother bought me dinner tonight. It was a nice gesture",
        "When I was a young child, my grandmother took care of me while my mom worked. That was so, nice I need to send her something.",
        "I am so happy that I have healthy, happy children. I see so much sadness in the world and realize how bad things could be. ",
        "I tore my jeans while climbing a fence, and my friend gave me her sweater to wrap around my waist.",
        "I'm so lucky that I have had a best friend for 20 years. ",
        "My mom and dad divorced when I was 9 and I went to live with my dad at age 10.  My mother wasn't around so my grandmother filled that role for me, I am so thankful for her willingness to help me grow up.",
        "I'm happy I'm not lactose intolerant, I love cheese so much",
        "My husband and I made the decision that I would stay home with our kids.  I'm so thankful to him for working so hard to allow me to be able to do that and homeschool them.",
        "My neighbor returned my treasured lawn gnome the other day. I was so thankful.",
        "I'm really lucky to have the family that I do. We're all so very close knit and the togetherness really helps me get through some tough times. I'm so fortunate to be around them.",
        "I've been wanting to buy a massage table for a while now. My mom gave me a gift card that finally made it possible.",
        "I really needed some help to get ready for my Moms birthday. I was so thankful that my nieces came to the rescue.",
        "Recently I've been a little stressed out because my toddler son has had such an attitude. My daughter is only 9 months so it's hard to deal with him being mad all the time as well as my daughter who has been sick. I asked my mother-in-law if she would watch my son for an overnight and she agreed. I felt so thankful to get a little break!",
        "I am so grateful to my friend who took me home when I got drunk at the bar.",
        "I'm really happy that I'm able to attend my university and get an education ",
        "We had a flood back in the spring that came all the way up to the door of our house . Our neighbors were not so lucky the in their house and alot off damege.",
        "My family is helping out with the money for my marriage ceremony!",
        "I am happy with what I have in life.",
        "i play in a band and i recently was on a concert and played to the most appreciative audience ever",
        "yesterday at work some guy ran his work truck into our building",
        "My wife decided to pick me up from work the other day when it was raining. It was nice to have a good, warm drive home.",
        "Our lawnmower is broken, and our neighbour offered to help us out by mowing our lawn.",
        "It was a gorgeous morning today, the sun was shining as I walked my dogs and I'm still on summer holdiays. ",
        "My mom was able to help my with school cost",
        "I was covered for the car wreck i had",
        "I am so happy all my family lives close by.",
        "My husband drove 30 hours to get us a new puppy last weekend. He knew it was the puppy of my dreams. I was so thankful that he sacrificed his entire weekend for me!",
        "I am so grateful to have great parents ",
        "My friend invited me over to share thanksgiving with him and his family a while ago.",
        "I almost gave away my steam cleaner because it was leaking all over the place. I decided to try and fix it which I did successfully. Yesterday I spilled my drink on the carpet and used my now fixed steam cleaner to clean up. glad I didn't get rid of it.",
        "One time a lady just randomly paid for my coffee as she was in line ahead of me.",
        "The other day i almost got in a wreck and barely got out of it.",
        "When my father died i thought me and my mom were alone. But there was a huge amount of support.",
        "I was thankful to go ice climbing in Norway and not fall down the glacier. I didn't want to die!",
        "I feel so thankful for having such an accepting family. I recently came out and everyone was beyond supportive.",
        "so thankful for my fam",
        "It was the day for me to move and my family came over to help",
        "I had a bad headache this morning. I had coffee delivery and I was so thankful because it helped the headache.",
        "My family threw me a suprise party and i felt so happy!",
        "I am feeling this way with my life now, I am so thankful for everything.",
        "I was.. at home alone.. doing some self-pleasuring, if you will... and my roommate almost walked in on me. I managed to jump into my closet while pulling up my pants before he could see me. So happy I didn't have to have that awkward conversation.",
        "I am so happy to be alive now. I invested in bitcoin and made enough to support my family for a whole year.",
        "I lost my wallet and someone found it and returned it to me.  I am so thankful for that person.",
        "My father paid for my university tuition. He allows me to save lots of money.",
        "I had a great lunch today. It really made me happy to eat that delicious sushi.",
        "I am so lucky to have someone like my fiancee. She does everything for me.",
        "my friend helped me move to uni last week",
        "my aunt paid for my exam",
        "We thought we were going to have to replace our heat pump, but the technicians were able to fix it!  It costs thousands less.",
        "I have a friend that is very helpful. When never I need him, he is here to help.",
        "There was a time when I was having financial difficulties. Someone gave me some money and food to eat.",
        "I am appreciative of my family, they are very nice to me and make me feel loved",
        "i have been living on my own and my father paid 3 months rent in advance for me.",
        "I wasn't able to make rent this month. My dad helped me cover it.",
        "I'm thankful that I've got more balls that most people...moved to South TX after living in MN for 15 years with my parents, no friends family or connection...and now I'm fully self employed living the dream every day",
        "I had surgery a few weeks ago, and my friends all brought me casseroles so that I wouldn't have to make dinner as I healed.",
        "I hurt my neck today. I must have slept on it wrong and my sweet husband gave me a neck massage to help. It was so sweet.",
        "I lost my house in a fire last year. All my friends banded together to help me in any way they could think of. ",
        "My parents just gave me the best birthday present ever.",
        "I have a great life. My wife and son are so amazing!",
        "I was at the store and I dropped my wallet. Luckily some old man picked it up and gave it back to me before I even noticed!",
        "I lost my debit card and didnt have access to funds. My bank went out of their way to ship it first class back to me free of charge.",
        "i have such a great family. i am so thankful for them",
        "My dad knew I was having some financial difficulties and decided to pay off my car loan!  I am so appreciative to him!",
        "The storm narrowly missed my neighborhood. ",
        "I am so lucky to have ahome like i do.",
        "I am feeling this way towards my husband. ",
        "My friend bought me dinner tonight. It made me really appreciate him"
    ]
}