{
    "threshold": 0.8,
    "seed": [
        "I Felt hopeful when I met my betterhalf for the first time. She gives me hope for my remaining life without saying anything. I feel hopeful after my marriage. ",
        "I cant wait for my house to sell.. its a slow market. ",
        "I have been in college for four years and am only a sophmore. I am going diuble my work load and finish next fall.",
        "I really want to win the lottery someday, maybe i will? ",
        "I bought a lottery ticket and was hopeful I would win.",
        "I'm trying to sell my house. It's been on the market for a year now, but I think I found someone who might buy it.  I'm trying to move to another area.",
        "I am hopeful I win the lottery.",
        "I think eventuallt the presidency is going to go in a more positive direction",
        "I just applied for a promotion, and I should earn at least 10k more.",
        "Back in freshman year of college, I really wanted to room with my brother even though he was not a freshman but a sophomore. I was really rooting for that to happen but instead I got roomed with some random guy.",
        "I think the future will be brighter and conflicts between countries will be smoothed over.",
        "When I missed up a hit, but was told I could redo it to reverse the rejection.",
        "I am so happy that France is going to the final of the soccer world cup",
        "I recently started in vitro treatments in hopes of getting pregnant. I have been trying forever.",
        "I recently applied for a job after being out of the workforce for 13 years.  I'm hoping I get it!",
        "I pray I make the soccer team this season.",
        "Just got offered a car as a gift. I really needed it.",
        "I've homeschooled my girls and one is graduating next year and the other in 2 years.  I'm ready to get back out in the workforce",
        "I was employed as a sales rep in my company ,with diligence ,I'll someday be a manager",
        "I need a raise from my job. I am waiting for one in the next review. ",
        "I keep playing the lottery but have not won anything over $10. I know one day I am going to hit it big!",
        "Whenever I see a newborn baby I always think about how I wish their life will be happy and long.",
        "My mother is trying to get a good job and we are praying she gets through and they give it to her.",
        "My mother recently applied for a much better job than she has now and we are all crossing our fingers that she gets it. It pays much better and has great benefits as well.",
        "Everyday I feel more optimistic that this country is heading into right direction. Slowly but surely the light at the end of tunnel is coming. ",
        "I have faith tha that one day my kids and I will move into a house. I'm tired of this apartment.",
        "I feel joyful from my relationship with my partner. The joy radiates from how well we mesh together and always see eye to eye.",
        "My wife has an interview tomorrow. I want her to get it. ",
        "I'm glad we finally got some dry weather today.  I need it to stay dry, sunny and breezy for the whole week!",
        "MY kids are so different from each other. I think they are all going to do great things ",
        "Recently my son got very good news from his cardiologist. We can finally start planning for his future.",
        "heres to wishing i get a promo at work ",
        "My friend lost her cat on Monday. We called the shelter, and they say they might have a cat that matches our description.",
        "When I took my son to a baseball recruiting camp to perform in front of college coaches. ",
        "There is an award at work that I really wanted my coworker to win",
        "My friend's at the hospital after a pretty bad car accident. We finally got news she's woken up after being asleep for 6 days.",
        "I love my wife",
        "I had confidence the Falcons would win, man was I wrong.",
        "I thought just maybe I would of got the promotion.",
        "I was in college taking exams, and I was trying my best to get an A",
        "I was hoping to get a new pet this year!",
        "I've written a competitive exam last week. The result will be announced tomorrow. I hope to get a good rank in it.",
        "If my plans work out, Ill be moving to France in the winter.",
        "that i will find love ",
        "I feel like my children will grow up to be very compassianate human beings",
        "When i finished my final exams one semester i knew i did well in all my classes. For once i felt like i didn't have to panic about what the final grade would become.",
        "I have spent 3 years in my current position, done all the necessary on job training and I am looking forward to being promoted",
        "when i found out my mom had cancer ",
        "I hope my dog returns home!",
        "When I saw my brother come home from college, it gave me a good feeling. It made me think I could do the same",
        "I started my new job today. I am hoping for a raise soon.",
        "My online friend appiled to come to America. We're waiting for some good news.",
        "I am hopeful that I will succeed in the future with business. Lots of things make me think this.",
        "I started taking a new body building supplement and I've been feeling stronger, so I'm hopeful that it works well.",
        "I started my new job yesterday. Hoping for a promotion soon.",
        "I recently began my own online business selling dried starfish. I hope there is enough interest for it to take off.",
        "I have my work evaluation coming up. I feel that I have been doing a good job so I hope for good scores.",
        "I am hopeful I will get a better paying job soon, I could really use the money",
        "I think this semester is going to go well. I am prepared.",
        "Yesterday, I gave an important presentation to my colleagues. It went really well. I am very much optimistic about the results.",
        "I pray that I will beat my disease.",
        "I got a new job. There's so much debt I want to clear off.",
        "I hope that my family comes home safe.",
        "I've been boxing for almost 3 years now but always had some type of injury that prevented me from having my first fight...I'm looking after my health a lot better now and putting in some gym hours, so aiming for next year fingers crossed",
        "I bought 5 lottery tickets today. I am positive for the future because I think I will win.",
        "I found a new girlfriend who is more in line with my interest. She is a wonderful person and makes me happy.",
        "I'm trying to look forward to the new school year for my children.",
        "My wife is at the doctor's, and I think we might be getting good news about a new addition to our little family.",
        "I took my finals exam last week. I am optimistic about the results but we shall see.",
        "I was confident that my brother was going to finish college. He was doing so well in his major",
        "My mother is sick in the hospital. I am optimistic she will make it through",
        "Tomorrow I am making my first ever mayonnaise lasagna. I hope it is a hit at the company potluck.",
        "I bought a lottery ticket last thursday.",
        "I used to be pretty buff a couple years back. That gives me inspiration that I can get back to that shape again.",
        "I missed the payment for my utility bill but I'm optimistic about the situation. Hopefully they don't cut my electr",
        "I am wishing the Yankees will win the World Series.",
        "I pray every night North Korea doesn't bomb us.",
        "I have my credit card application approved with American Express. I hope now I can buy a new smartphone",
        "I wish I can get the part I want",
        "I wish that everyone would get along.",
        "I did an interview yesterday. I presented myself in a better way also the interviewer appreciated me. I just waiting for the results now.",
        "I know the upcoming election is going to turn this country around.",
        "I am hopeful that I find a new job very soon.",
        "I going to see a doctor to know my blood test results and I hope that I don't have anything serious.",
        "I remember this time two years ago when I was expecting my youngest child we didn't know whether she would be a boy or girl. I was so excited when they told me the results were a girl.",
        "I have this vacation planned this weekend and I just am crossing my fingers that we will have a good time and everything will go smoothly",
        "The only thing I'm attached to these days is my unquenchable lust for success...I love it because it drives me, compelling me to act creatively without fear and I really pray I never lose it",
        "I surly was surprised when I found out I won a contest, it made me excited, as I didnt know what the prize was. It was a simple mailing that had a key inside, the company who sent it was a local and new lumber company. All I had to do was bring the key down to the cmpany and see which prize it unlocked",
        "I am hopeful that my new degree will land me a better job",
        "I am hopeful that my new degree will help me get a better paying job",
        "I am finally getting paid enough at work to start saving for my retirement.  My future is finally looking good!",
        "Got my fingers crossed on getting my EP out on iTunes by mid-September",
        "My brother moved to California a few days ago. I want him to do well there, and I want him to make lots of friends",
        "It is my wish to not live from paycheck to paycheck",
        "I'm anxious to see if I get this home loan I applied for.  I have been waiting forever!",
        "I have done everything I can to stop my girlfriend from eating junking food. I am looking forward to her trimming down",
        "I've recently opened up my own business and I'm hoping that it'll be successful!",
        "I got an interview for a nannying job. It is full-time for two twin babies.",
        "I did not have enough money to pay rent but I had some freelance work that I could do and I was confident I'd make the money in time.",
        "I  had severe allergy in couples of month. I tried a new diet and it was helpful in relieving my allergy. I felt happy.",
        "I am hopeful everyday of my life.",
        "that i will find a better job ",
        "when i was waiting to hear back from the bank for my preapproval to buy a home ",
        "I am looking forward to seeing my daughters growing up in the future.",
        "I haven't had a date in a long time, but I know I will still get married one day.",
        "I need to get a job with real benefits soon, I'm very optimistic for the future.",
        "that my friend will do okay driving ",
        "I hope I will be able to afford a vacation during Christmas break for my kids",
        "I'm optimistic about my finances. I've been trying hard to pay back the debt on my credit card.",
        "I am hopeful for the new pokemon game, I think it could be good!",
        "I invested 5k in different stocks.",
        "A lot of people voted in my community. I think there is going to be a change soon.",
        "Have to go to the doctor tomorrow to see if I have strep throat. I hate when they have to swab the back of your mouth to \"make sure\" that it's strep so they can treat you. Really hoping to avoid that this time around.",
        "It's birthday soon. I want to be a better person.",
        "My son left 2 weeks ago for AIT for the Army. I am very optimistic that he will pass and have a great career in the military",
        "My little boy is testing to see if he can get into a prestigious private school. Really hope he gets into it before the school year starts! If he does, they say kids from these schools are set and will easily get into a good college.",
        "I am beginning my new job tomorrow. I am quite nervous",
        "I was planning on giving birth without any pain medication. I wasn't sure if I'd be able to do it but I was optimistic.",
        "I was hopeful when the raptors got khawi leonard",
        "I had a date yesterday with a girl i met in our college campus. I think it went very good as i was expecting",
        "I pray American will be great again.",
        "I was following a sad news story about a missing child but remaining optimistic that they would find the baby.",
        "I am going to have back surgery next month.  I have faith it will be successful.",
        "I did an interview ",
        "Weekend coming up",
        "I just applid for a new job that pays better and is more stable than my current job. I think I have a great chance at getting it!",
        "I was thinking I will make a profit in my business",
        "My appartment was robbed last week. The police called to tell that they found some of the objects that have been robbed. I hope it is true.",
        "when i moved and took a chance in a new state with little money. ",
        " I am hoping to win the lottery today and quit my job!",
        "I was excited when I had a chance to get into a college I wanted. I just had faith it would work out",
        "I had faith I was going to get into a school I had always wanted to go. I was just happy to have a chance",
        "I've been having a sharp pain in my chest lately. Tomorrow, I go to the doctors and I am optimistic it isn't something too serious...",
        "I'm not in the best financial situation right now. Hear me out, these ramen noodles will turn into filet mignon steaks one day!",
        "The day I applied to university for my degree.",
        "I sent my daughter school shopping with her friends for the first time. I think she is going to do well without mommy",
        "When I finished my math test, I felt like I did well enough to get an A!",
        "I am optimistic about the results about my exam test. I think I did well!",
        "I think my daughter is gonna be a rockstar. She is gonna be great",
        "I am praying that I get the part",
        "I am waiting my exams results. I wish I will have good grade.",
        "My new foster dog finally run around last night. She has been very abused and starved but is so young. I didn't know how long it would take her to get better or if she would recover quickly from her abuse. A week in- and loads of progress!",
        "I wish there will be more opportunities at work to make more mony",
        "I am hopeful that good things come to those who wait. I have messed up a lot with relationships in my life..picking the wrong people so I am happier to wait until it is right and I can trust someone.",
        "A turtle that came to my friend's yard 2 days ago is now missing.",
        "I know my credit isn't the best, but I think I have enough of a down payment for this house to get a reasonable loan.",
        "My friend is visting and said she made me something good. I want it to be cake so bad.",
        "I'm trying to cook a new dish for the first time. I think its going to turn out well.",
        "I'm almost ready to put my Venison wellington in the oven. I think its going to come out great.",
        "I got out of the slammer last month after being in there for 50 years. I have much hope for my future.",
        "I applied for a new job last week. I am really wanting to get this one.",
        "I just found out that I'm pregnant. Its exciting but also scary because I lost my last baby at 18 weeks along. I'm just really trying to have faith that it'll turn out well.",
        "I was wishing that he would call me",
        "Got out of the hospital yesterday. I am hoping for a healthier future.",
        "I have been trying to save money for a big vacation next summer.  I hope I can do it!",
        "I hope I win the lottery.  I really could use the money.  It would be awesome.",
        "My favorite store is going through some tough times. They're trying to find another distributor so they don't have to raise prices and lose their customers.",
        "I had faith my favorite team was going to well in soccer this past year. I just had a good feeling",
        "My daughter didnt have a good first year at her new school. I think this year is gon to be better.",
        "I am hoping my brother makes my birthday coming up. He is always busy with work",
        "I am confident the democrats will bet Trump in november.",
        "I got dumped by this girl but then she said that we could try to start over but slower. I thought it would work out but it didn't.",
        "i really hoped my mom would get her job the other day",
        "I was just dumped and before she did I was really thinking that it would work out. It really didn't but I just wish that things did.",
        "I really am looking forward to seeing if my parents will buy me a dog.",
        "I auditioned for a play this weekend. I am supposed to hear back soon if I made it. I am optimistic about it.",
        "I sent a bid for a construction project",
        "I really hope i got the job i applied for",
        "My wife and I just put in a bid for a new house last weekend.  I pray we get our offer accepted!",
        "i hope i win the lottery this week!",
        "I am really praying that I get a promotion at work!  I need the extra money and my boss knows I want it badly!",
        "I hate a date tonight.",
        "Vacation trip coming up hope it's awesome",
        "I should hear this week whether or not I was accepted into law school  I hope to start in the spring.",
        "I was hopeful i got the job after the interview",
        "The 4.1% US GDP growth for this year was unbelievable. The economy will do even better in the coming years",
        "I was worried for the future when my friend went on bed rest during her pregnancy. ",
        "I was notified that I might be eligible for some money from rewards program that was offering select few individuals a chance to win $1000.",
        "I am optimistic about my health. I've gained a little weight but I think with some motivation and consistency, I can lose it all.",
        "I have to take a physical soon, and I haven't been to the doctor in ages! ",
        "I was told that my dog may have severe health issues. He doesn't like to walk around much any more. I am praying it is not something that could end his life early.",
        "I just bought 100 lottery tickets. I think tonight is my night!",
        "I've been working out now for 2 months and I just started losing weight. I'm now hopeful that it's all worth it.",
        "My dog started to get lumps along her stomach so I'm taking her o the vet tomorrow. I want her to be ok",
        "I have an important job interview coming up this week. I'm rooting for myself to do well and beat out the competition!",
        "I am in the running for a new job I want to get. I think I have a good chance!",
        "I have a medical exam soon and I am just praying that everything will check out okay.",
        "We are wanting to get a new vehicle this year. We are trying to get bills paid off so we can afford the payments. I hope it happens.",
        "I got a new job that pays a lot more than my previous one. I should be able to pay off my home sooner now.",
        "I asked my coworker out. She said yes. I never thought she'd agree.",
        "I was awaiting my college entrance letters.",
        "My new neighbor is pretty cute. Going to talk to her tomorrow.",
        "I'm waiting to hear back from my doctor about my test results.",
        "I read this story about climate change. I'm really optomistic that we will solve this problem",
        "I am waiting to see if I got that new job I applied for. It was a tough competition, so I'm excited to see!",
        "My exams are coming up soon and will be studying a lot for them. I would like get a good grade.",
        "There is a man I love so much, but I only know him through internet. I live in Canada and he is from Nigeria. But I have faith we will meet soon and get married.",
        "I am going to do better this semester. Last year was a travesty.",
        "I WISH I WOULD READ MY FAVORITE FICTION IN FORTHCOMING DAYS",
        "I auditioned for a spot on the LA Kings Ice Girls team. I will be so happy if I make it.",
        "I ordered my kids school supplies pretty late this year. I still think they will arrive on time though.",
        "Hopeful that this year will be my best year yet. ",
        "I may be able to get a new car by the end of the week!",
        "I am hoping the new Pokemon game ends up being really good, I am not sure though",
        "i was hoping to get out on time last week and it didnt work out",
        "My wife and I just put a bid on a house we really want!  We are fairly optimistic that we will get it!",
        "I pray for better days.",
        "I found a real estate lady who said she could sell my house fairly quickly. ",
        "I really wish to score big with this lottery ticket I bought",
        "I applied for a better position within my job, crossing my fingers I hear positive news!",
        "I am feeling more positive about the future today. I am really trying to hold on to that feeling no matter what. It's hard!",
        "my father promised he would come see me on my birthday",
        "There was an expensive vase that I accidentally tipped over. I swept up the debris before my mom could see it.",
        "when i applied for a new job i was very happy",
        "Nephew plays football.  I hope he does great this year!",
        "i was really banking on getting this job last week",
        "I think this recent primary is going to turn my city around",
        "The rain will go away tomorrow!",
        "Nephew doing great at football this year",
        "I have hope for the human race even though its in its nature to destroy itself.",
        "i had a strong feeling that i will get well",
        "applying for a new job",
        "I picked up 2 part time jobs on top of my full time job, I am gaining momentum to get our house in the future",
        "I am patiently waiting to hear back from a recent job interview",
        "I'm looking forward to next year when my finances will be so much better.",
        "I am very positive about the democrats in November",
        "I finally started losing weight after working out and I was hopeful I would continue to slim down",
        "I'm looking forward to things getting better for me next year.",
        "I'm glad it's almost fall now. My favorite time of year.",
        "I recently applied for a new position at a higher paying company and they called me for an interview! I am really wishing to get hired there!",
        "My wife decided to quit her job in order to go after a more lucrative and fulfilling one.  It would just take time to start earning some money.",
        "I wanted to hold out and see if I got a bonus. The bonus would allow me and my family to take a vacation",
        "My husband and I are going to couples counseling. I am really positive that we can fix things and be happy.",
        "I am so tired of hurricanes. Every year it seems like hurricanes make life difficult for me. I am wishing this year will be quiet.",
        "I feeling good about the economy these days.",
        "I'm hopeful for America's future. I feel like we will soon all come together as one!",
        "I am playing in a tournament this weekend, i think we can win",
        "I just found out that my sister in law is pregnant which is so exciting, but she has had a miscarriage before so I'm just trying to stay positive for her and I know things will go well.",
        "I'm pretty hopeful this year in my college football team to do really well. Go Buckeyes!",
        "i am hoping to get out early from work on friday",
        "I'm flying on a plane tomorrow. I hope it goes wheels up and wheels down with no trouble... But it's the first time I've flown, and I'm pretty sure any sign of turbulence is just going to make me want to hurl. Plus, I'm worried about getting lost in an airport!",
        "I think I have finally met the one.",
        "I am feeling better about the future off and on today. It's always a feeling I try to hold on too. It's easy to feel dark about the future, so any good feelings are welcome.",
        "I applied for a job last week",
        "I am hoping to win the lottery this week!",
        "This chick came over to my place and left me high and dry....I'm pretty optimistic though, she texts me every single night",
        "There's a Korean hot pot place opening up. I won't have to drive an hour away for hot pot anymore, if it's good.",
        "I am feeling this way in hopes that I get into grad school.",
        "I had a great chest, back and cardio workout yesterday. Fingers crossed this beer won't make me lost my gains",
        "I was hoping my brother would come home this week. He still might",
        "Last time I ordered pizza from my local pizza shop for delivery, they forgot my sauces!! So I called and complained and was ensured that it would not happen again. So this time I put in the order and called to MAKE SURE my sauces came. They should be here any minute now. ",
        "I really hope my parents make it to my home ok, they live 3 hours away.",
        "I'm happily anticipating a bigger paycheck at the end of this month...I'm a self-employed freelancer and I've been upping the prices on my gigs, maintaining the same amount of client orders",
        "I feel positive sometimes today even though not in the best mood. I prepare for the worst though just in case. It's nice to feel some positivity about the future though- Like whatever will happen, I will get through it!",
        "I'm trying to be positive as I try to recover from a financial setback.",
        "I'm looking forward to my finances becoming a bit better early next year.",
        "When I graduated high school it felt like I had unlimited potential. I had so many opportunities in front of me. My whole life was ahead of me.",
        "That everything will turn out to be okay with my health. ",
        "I finally get to got school shopping today. I can't wait. I hope I find somed bargains",
        "One day I will have everything I want in life.",
        "I am ordering up some nachos for lunch. I heard this new place I am ordering from is very good!",
        "Ive been talking to this girl that I like.  Im going to ask her out on a date tonight.  I think she'll say yes",
        "I will be getting a new car this summer. I have been looking and narrowing my choices down.",
        "There is a job opening at the law firm I have always wanted to work at. I applied and am keeping my fingers crossed.",
        "waiting to hear if i got the job",
        "I'll be giving my first speech in a long time next weekend.",
        "I recently underwent surgery and radiation for breast cancer. The doctor said I should be fine. I'm very optimistic! ",
        "My favorite restaruant closed down, so I'm trying a new one.",
        "I bought a ticket on a new car at a hockey game. I really hope I win!",
        "Grades come back for my language test tomorrow. Crossing fingers for an A.",
        "I feel hopful that I will get a new job soon.",
        "I am confident Donald Trump will Make America Great Again.",
        "I'm really feeling good about my work evaluations and wishing for the best.",
        "I applied for a different position at work.... I'm eager to hear back",
        "i was hoping to win the lottery last night",
        "My dog is having surgery on his leg.  I am confident he will recover.",
        " I lost an earring at work..... Im hoping I find it",
        "I had some tests done at the doctors yesterday, hopefully i hear good news",
        "I am waiting for my medical tests to come back. I am confident they will come back okay.",
        "WE just finished our fiscal year at my job.  My compensation is tied to meeting a number goal by the end of that year. With about a month left, I really wanted to hit my number goal and thought I would be able to. ",
        "I applied for a job last week. I really need this job. I find out next week if I am hired or not.",
        "am still expecting a call from the new company i applied a job from. i did very well in the interview, i believe i will get the job",
        "i believe he will be the best in his class",
        "My wife is trying to get a job at the hospital. She will find out if she gets in this week, fingers crossed.",
        "My husband has been travelling for work for years now and we just found out that he might be able to work from home anywhere in the world.  I really want it to work out!",
        "each day ,as i wake from sleep, i look with great enthusiasm what the day holds for me",
        "I just started a new book, and I really want it to be good. I hope it is.",
        "I just repaired my computer's motherboard. I really want it to last a bit longer!",
        "i hope i can get things worked out and get pregnant by the end of the year",
        "I felt good after I got some medicine today. It felt like I was going to get better",
        "I hope the Eagles are a great team this year, they were awesome last year",
        "I have faith the Eagles will be good this year, I hope it goes well!",
        "Recently applied for a new job and am waiting to hear if I got it.",
        "I just know that God is going to bless me.",
        "I have high hopes this football season. I think my team will do well",
        "I'm going to ask this girl I've been talking online with for a while out on a date.",
        " A nice storm came through here today and totally knocked some piece off my cable dish. The cable is not working like at all, so I called the company and they said they will have someone out tomorrow to fix it. I feel off the grid right now.  ",
        "I am getting a second vacuum from the same company tomorrow and I truly hope it's not a doozy like the first one was!",
        "I applied for a job at my son's school. I am really counting on getting it.",
        "My dog is getting neutered tomorrow.  I am confident he will be okay.",
        "I applied for a new job.... can't wait to hear back",
        "I am confident my brother will beat his cancer.",
        "Final grades are in I am sure that I passed!",
        "When my dog got ran over and he began to recover on it's onw",
        "I want to get a new job.",
        "I am trying to find a new job this week",
        "im hoping to win the lottery this weekend",
        "I want to take a trip to Paris this summer but the airline fares are so expensive. I keep watching them waiting for them to come down so I can actually afford the flight.",
        "I hope to find a new job this week",
        "I just started a new job. I am looking forward to a better life with it.",
        "I'm planning on going out to a party this evening. I want to meet a new girlfriend and think maye there'll be someone there.",
        "I am going to try and start my lawn mower today, it's missing a part. I am feeling confident I can get it to start",
        "Made kimchi for the first time. Can't wait to see how it turns out.",
        "We are wanting to buy a new house. Hopefully we will be able to find what we like and be able to afford it. It is such a stressful process.",
        "I entered a writing contest. I knew it would be wonderful if i won. I really wanted to win and thought I might have a good chance. I was excited about it. ",
        "I know my daughter is going to do well this year in schoool. She is so excited",
        "I just went on a job interview. I feel like it went really well.",
        "When I think of the future, I am very positive",
        "I am looking forward to this weekend. I am hoping that GOOD positive things will happen. I don't feel so great so it would be nice if this weekend had good things in it :)",
        "I am excited for the football season, I hope the Eagles can repeat!",
        "i got a yoga mat for free at work today. i'm thinking about trying it out",
        "i am hoping to win the lottery!",
        "My new semester starts in a week and I'm crossing my fingers it will be a good one.",
        "I am hoping the Eagles can win it all again this season!",
        "I haven't seen my best friend in a long time. She's supposed to be coming next week, but may not be able to come. I hope she can, though.",
        "My wife just started a new job.  I'm hoping that she does really well and we'll be able to have some fun.",
        "I just broke my finger, and I have a golf tournament coming up.",
        "I'm so ready for the weekend. I'm optimistic that it will be a great and restful weekend!",
        "I am applying to graduate school and I am feeling this way about getting accepted.",
        "I'm going back to school to become a chef.",
        "We are wanting to buy a new house in the next year. I'm really hoping that it works out for us. We have needed something a little bigger for a while now.",
        "There's a new Korean restaurant that's opening up.",
        "We're getting a new coworker next week. We've been so short staffed.",
        "i hope im going to get to go fishing this weekend!",
        "i think the braves have a great shot at winning it all this year",
        "MMA shows tomorrow night",
        "I entered a raffle at work. I'm crossing my fingers I win!",
        "Our country is in very racially intervened turmoil driven by political parties. I am optimistic we will solve it over time",
        "I really pray my Christmas bonus comes in this year.",
        "I have a job interview next week. I hope I get it",
        "I hope i get the job i applied for last week",
        "hope i got that job last week that i applied for",
        "I often feel jealous of my friend",
        "I joined a dancing class.",
        "I know I shouldn't have, but I texted a girl to ask her on a date.",
        "i was hoping to have the day off",
        "i am hoping to go to hawaii next year!",
        "My weekend is going well so far. I am hoping tomorrow nothing bad happens and it looks like it will be a good daytoo",
        "i am really looking foward to see what my husband and i can do by the end of the year.",
        "Hoping this next week is going to be a good paying work week too! It's been a stellar past 2 weeks and I love it!",
        "I am thinking tomorrow will be nice. I am going to church",
        "I haven't been able to find my favorite pineapple coconut cake anywhere, but there's a new bakery opening up soon.",
        "I am going to the casino this next weekend.  I am entering a poker tournament and think I have a good chance",
        "This summer heat is almost over!",
        "I've got a date tomorrow afternoon. I think its going go to well.",
        "im hoping to win the lottery tonight",
        "We are working on getting a lot of things done in our house right now.  The goal is to sell it and move into a different neighborhood in the next few years.",
        "i really want to see what my husband and i will accomplish by the end of the year",
        "I have been jobless for 6 months now. Next week, I have five interviews. I hope to be hire in one of those positions.",
        "When I was accepted in to university for my business degree. It felt like such a weight was lifted off my shoulders.",
        "I feel like I'm getting sick.... ",
        "I feel weird since yesterday.... I better not be getting sick",
        "im starting to make more and more money online i hope one day online could be my full time job",
        "I am wishing that Trump wins re election.",
        "I think today is going to be a good day. ",
        "I am submitting a manuscript to an editor. I am hoping she will publish it!",
        "I went to work the other day and was informed that I was a finalist for a promotion.  It made me feel good",
        "I'm meeting a girl for a date at the zoo this afternoon.",
        "I recently applied to medical school.  I have always wanted to be a surgeon, and my professors tell me I should get in no problem",
        "I'm planning to buy a house in 2 years",
        "I just applied for financing on a new car.  My credit is not well established, but I am praying that I get approved!",
        "I submitted a proposal to an agent. I really wanted her to like my work and take me as a client. ",
        "I feel very optimistic about where my life is headed",
        "Jesus will come home and save us all one day.",
        "My grandma is sick. I'm optomistic she will pull through.",
        "I just applied for a higher paying position within my company. I really wish I would get it!",
        "i know ill make it this time",
        "My grandson is going to go off to college in the big city next week. He's so excitied. I'm a bit nervous and wanting him to do as well as he can.",
        "I love the Dallas Cowboys.  I am optimistic they will do well this season.",
        "This weekend my friends and I are heading to the casino. I'm wanting to hit the jackpot and come home with more money than I started!",
        "i cant wait for next week!",
        "I'll be getting a raise and a promotion in Feb.",
        "I'm working hard to pay off all my debts.",
        "I had just applied to a few of my dream schools. Harvard and Yale would be the best.",
        "i am hoping to get next week off from work",
        "I just put an offer in on a new house and I am waiting back for an answer on whether or not its mine.",
        "I'll be getting a raise in February.",
        "My manager at work told me that he has good news for me and to meet him in his office tomorrow when I come in. I really think it's about a promotion I've been expecting.",
        "I wrote my exams well and waiting for the good results. ",
        "Sending my two youngest kids to a new school!",
        "I'm really hoping I enjoy this new World of Warcraft expansion as much as I've been excepting to!",
        "I just had a great job interview. I think I might get this job. I really want it.",
        "I did really well this quarter at work. I should be getting a bonus because of exceeding my goals.",
        "Waiting for the marks back on my math test. I studied quite hard.",
        "I got a call about about an application I put in for a new job today.",
        "We have been looking for a house for a few months and finally found one that we love. We put in an offer.",
        "I do have some faith its going to be a good week. The weather should be nice",
        "I am thinking the Eagles can repeat this year, I hope so!",
        "I hope that my children have better lives than I have had.",
        "i am hoping to win the lottery this week",
        "i am hoping to win the lottery",
        "Things haven't been going so well recently, but I am looking forward to the possibility of a nice vacation this year.",
        "i am hoping to win the lottery tomorrow",
        "i hope i get next weekend off ",
        "i am hoping to win the lottery this weekend",
        "I'm asking my girlfriend to marry me this weekend.",
        "My oldest daughter is graduating high school this spring.  I have so many dreams for her, I'm having a hard time containing myself.",
        "My sister has been dating this guy for about 7 years and I wish she would drop him.  He just mooches off of her, she works and he sits at home and drinks.",
        "I have my job interview tomorrow. I'm quite hopeful that it will go well.",
        "I will watch a film this weekend at the cinema and I have my fingers crossed it doesn't stink.",
        "I want to do well in my next exams",
        "I think I will get my debt paid off sooner.",
        "Once, I got stuck in a traffic jam. Even though I left early, I was 30 minutes late to an appointmed",
        "Got a box of ramen. Should last me through the week.",
        "I just recently applied for my dream college. I want to get in very badly",
        "I want to win the prize on this game I just entered. I will get tickets to a show for free if I do.",
        "I went on four job interviews last week. I have a good feeling I will get an offer soon.",
        "I just moved to a new city. i am looking forward to having a new start. ",
        "It is my birthday and I want a new drone. I done told my wife that I liked this drone and wanted it. Maybe she will buy it for me!",
        "I went a bunch of job interviews last week. I have a good feeling that I will land something soon.",
        "I have been talking to this girl online that I like.  I am going to ask her on a date.  I think that she will say yes",
        "I'm pretty optimistic about my future",
        "i'm going to the doctor on thursday i'm very worried",
        "I'm staying positive about this business scheme.  I'm sure my friend will come around, he just needs some good convincing",
        "It might sound stupid but when i took my drivers test at the end i was really hopeful that  passed",
        "i hope i win the lottery",
        "I'm meeting my online girlfriend for the first time this weekend.",
        "I have high hopes for the weekend. I think it might be sunny here",
        "i hope to win the lottery this friday",
        "I have been practicing for my interview all week. I am hoping that it goes well.",
        "I'm going to cooking school to become a chef.",
        "I have had bad luck in the past with cars but I know its about to turn around",
        "I want to get a dog, but my cat would hate that",
        "maybe if I believe hard enough i can get this job",
        "I applied for a new position at work, similar to mine but better pay. I think my interview went well.",
        "I bought 10 tickets for a local lottery to win a new car. There are not many tickets sold, so I am really hoping that I will win!",
        "Going on a picnic next weekend and wishing the weather is good.",
        "It's supposed to storm more later this week. It's been hailing recently and I really need it to stop already!",
        "im feeling positive oi got the job. it would really help me out a lot.",
        "There is a chance of storms tomorrow and I hope we don't get anymore as we have been close to having floods recently!",
        "I pray that America will be great again.",
        "My grandmother is in the hospital after a car accident. She broke her hip, but I hope she will recover. The doctors are taking good care of her.",
        "I am waiting here by the front door. Waiting on the plumber, I hope he will fix my water today!",
        "I went for a job interview last friday and was told I would know by Friday of this week if I got the job. I really want this one.",
        "I just applied for a new job.  After the interview, I'm very optimistic that I will get the position",
        "Although I'm having a difficult times in life right now, I always have faith that God will provide for me a blessing.",
        "I put in an offer on a new house today.",
        "After I applied for a job and had an interview, I was hopeful that I would get an offer as I really wanted the job.",
        "There has been this sinkhole in my yard since the hurricane hit last year and it is the cities responsibility to take care of it. I called it in about a week after the hurricane and it is almost a year since then. Yesterday someone came out and marked it with flags and Im certain that means they will begin to work on it soon. ",
        "My husbands open heart surgery for Monday was postponed. We have to deal with Kidney related issues now.",
        "I just applied for a new job. I am really counting on getting it.",
        "Waiting to get my final marks back, I thought I did go.",
        "i am really excited about trying to have a baby with my husband.",
        "Maybe one day i'll make enough for my family.",
        "Waiting for acceptance to university. I want to study business.",
        "I meeting with my boss tommorrow. I really am praying for a raise!",
        "i hope to be able to get my finances in order by the end of the year",
        "I hope the new super smash bros will be really good!",
        "I am thinking the eagles can win it all again this year!",
        "I am hoping the eagles can win another superbowl this year",
        "I have a good feeling tomorrow will be fun. We are going to a new restaurant in town",
        "When applying to my favorite university. I have one shot at it.",
        "I'm always looking forward, never back at my past mistakes...I learn from them but I never wallow in self-pity I strive to do better every day",
        "When trying out for my hockey team. I was one of the better players on the ice.",
        "The time I applied to become a manager at burger king. I have what it takes.",
        "My wife is getting checked at the hospital. We might be getting good news!",
        "I want to be able to go skydiving in the future",
        "Every year I plan to start working on Christmas early so it's not such a nightmare.  I've already started this year so I'm praying it all goes smoothly.",
        "Trying out food from this new place. A lot of people tell me it's good.",
        "I felt very good recently when my city did not pass a breed specific ban.   It makes the future look bright.",
        "I've been crushing on this girl a while, and I'm going to ask her out.",
        "I would like to go to a concert or show this year for my birthday",
        "I borrowed some money from my friend. I've a confidence I'll repay this month to him.",
        "I hope to get engaged soon, I have been with my boyfriend for 6 years",
        "I'm starting an internship in the next couple of weeks, I'm excited!",
        "I would like to try ice skating even though my balance is horrible",
        "I hope I'll get the funding for my experiments",
        "I am consistently paying off my credit cards over the last couple of months. I am very optimistic that my credit score would start going up again",
        "My water heater is busted. I got the line on a great plumber whos reputable and they can do it tomorrow. Looking forward to it being done by the end of the weekend.",
        "I got a lot of hours at work for next month. I am trying to use the extra money to move out.",
        "Even when it has been a rough year, I am now feeling that things are beginning to go my way and that the future will be much better.",
        "I'm trying to save up money to buy a home by next year. If all goes well It can happen.",
        "I made a new friend in the town I moved to. It was the first time I felt like I might fit in here.",
        "I am hopeful that I will get into law school this year.",
        "I'm hopeful about more finances coming in, I'm starting a new business.",
        "i am trust my project and it's gonna do well",
        "I wanted to go to Spacecamp. I filled out a form to try to get a scholarship because I knew that was the only way I could go. ",
        "I tried out for the broadcasting club to do the announcements at school. I really wanted to get in!",
        "I found out that my friend's mole he was worried about most likely isn't cancerous.",
        "My daughter is expecting her third child. She already has two boys. A girl would be nice.",
        "My mother-in-law donated a kidney to her cousin.  We just got the news that's both patients are doing well after the surgery!",
        "I've been so focused on the task at hand for days. I'm getting ready to participate in a endurance competition and I've been training my butt off for what seems like an eternity.",
        "When I thought I had breast cancer. I was trying to tell myself everything would be okay. ",
        "I buy a lottery ticket every week. No luck so far but I'll keep trying. ",
        "When I was a kid, I went on a few trips to the Mountain for some snowboarding lessons, come Christmas time you bet I was just praying for a snowboard of my own.",
        "I am hopeful about the future. I wish to become a world class doctor who helps those in second world countries",
        "my cat was sick at the vet but I was told in a dream that he was going to be ok, and I was very hopeful of that",
        "I am praying that I did well on my exams.",
        "I still believe my hubby will remember our anniversary, cos he always forget",
        "my doctor is going to tell me the results today and I think they'll be good",
        "We moved to a new area and my son needed to start a new school.  I was worried he would have trouble adjusting, but knew it would work out.",
        "i just recently registered for a flag football team, i just hope I am good and don't embarass myself",
        "It was cloudy outside earlier today but the weather is fickle so I can't be sure there will be rain.",
        "I'm going to visit friends out of town this weekend.  I'm hoping that we have as good of a time as we've had in previous years.",
        "My dad is throwing a big party. He wants me to fly up and be there. I really want to go.",
        "My best friend is returning to college after an academic suspension.  I hope that this semester will be different since I'm taking the same classes as her.",
        "I just put in an application to get a police dog who failed his training.  I know the process to get one is difficult, but I'm crossing my fingers",
        "I was very positive about my team's chances to win the Superbowl in 2006. The Chicago Bears got an early lead against the Colts.",
        "I have a long distance relationship. I am in love with him and I have faith our relationship will work.",
        "I am very hopeful that I will be able to win the lottery this week",
        "I graduated and was very excited for the future.",
        "I had major health problems. When I finally finished with surgery I felt my future was bright. ",
        "I planted vegetables in my garden. I can't wait until they sprout!",
        "I went through a lot of hard times in my life. Lost my job, injured my knee, lost someone dear. But I always believed things would get better.",
        "i want it to rain",
        "I remember applying for college and waiting for an acceptance letter. I didn't know if I would get accepted but I always was optimistic about getting in.  One day  I checked the mail and they letter was right there.  I was one happy camper. ",
        "My husband might get transferred to a new position and we might get to move closer to family.",
        "I am looking forward to Christmas, I would like to get lots of presents.",
        "Last night, I bought a 50-50 raffle ticket at the fair. If I win, I will get half of all the money collected during ticket sales!",
        "I moved knowing I could change my life, and I look forward to the future and the bright things that come.",
        "We are having lay offs at my job. I dont want to be let go but it happens",
        "I keep thinking about the future, and what I've accomplised to be here so far. I look forward to the adventures I have.",
        "I applied to nursing school. Its going to seem like an eternity to find out if I am accepted or not.",
        "My firends mom has cancer and we are not sure how long she has",
        "When I save up enough money, I desire to run my own guest-house one day.",
        "I put a bid in for a new house! I don't know yet if I got it but I'm looking forward to hearing about it soon.",
        "After many years of depression, it looks like I am beginning to get better.",
        "I feel great about the future of my brother.",
        "Went on the very first job interview after graduating. I was nervous, but I felt like it went fairly well. They said they would contact me soon, but it's been a week. I'm not sure what I should do at this point, but I'm staying positive.",
        "I'm in high spirits with my new job, I have a feeling I'm going to love working there.  Tomorrow is my 2nd day.",
        "I already booked my flight before requesting a holiday. ",
        "I am hoping I will get promoted at my job soon enough, that would be great",
        "Getting a colonoscopy done.  I hope it turns out okay",
        "My dog is having surgery on his leg.  I have faith he will recover.",
        "I'm going to see a film tonight and I am really crossing my fingers its good.",
        "My friend said he might be able to help me move",
        "for the next few weeks",
        "My daughter started high school this week.  I hope she finishes the year on the honor roll.",
        "I have currently two jobs. I applied for a job which the salary is enough for me. I was called for an interview.",
        "I think things will get better in the future. Thats all im hanging on to at the moment.",
        "I just started planting a new garden. I should start seeing something grow in a couples of weeks.",
        "I applied for a new job at a law firm. I really really need to get this job.",
        "I invited my best friend to my party. She has a busy schedule and promised to come.",
        "I had a great job interview the other day. Im really feeling good about how it went.",
        "I have high hopes for tonight. I am going on a date",
        "I think my daughter is going to always love school. She practically runs there every day and its all she talks about",
        "I just put in a bid for a house that I really want!  I am praying I get it!",
        "I am proposing tomorrow!",
        "My future's looking pretty bright. I'm self-employed with tons of ideas coming to me everyday it's great",
        "I put in an application for a new home and I am really wishing to get it! I've searched everywhere for a home like this!",
        "I am confident I will soon find a well paying job that will allow me to pay my student dent.",
        "I am feeling this way while applying to graduate school. I really need to get in.",
        "i put in for a new job. i think i have a good shot at it.",
        "My kids are joing a co-op this year. I am hoping they will enjoy it.",
        "I just made enough money to give myself a vacation. i feel great about myself.",
        "We put an offer down on a house.  I really want that house and think they'll accept our 27 milliion dollar offer.",
        "I applied to university and felt I had a great chance. It was my dream school.",
        "I'm looking forward to the raise I'll be getting in feb.",
        "we got news my grandmas cancer is back. we are praying for the best",
        "I am hoping that while my son is in a youth challenge program that it will help him become a better person and help him open his eyes before it is to late",
        "My daughter is pregnant with her first child. I am optimistic it will be a smooth pregnancy. I am sure it will all work out."
    ]
}