{
    "threshold": 0.8,
    "seed": [
        "When my dad had cancer and they gave him the all clear.",
        "My first baby is on the way. I'm going to make sure they have a great life.",
        "I didn't do too well on an assignment but i still felt like i could improve my grade for the final exam",
        "I was hoping that I would do better on a math test.",
        "I bought a lottery ticket today and hope to win big ",
        "i felt like things would go good when I bought a lottery ticket",
        "I felt hopeful today about my future. I finally started to go run. I haven't run in forever.",
        "I just started a new job I want to get promoted. ",
        "Before I do feel that I will not make it in life, but later I felt expectant of my future",
        "I am really looking forward to my vacation. I have my fingers crossed that it won't rain the entire time.",
        "I was a espectant of receiving gifts for my birthday b",
        "I was expectant of getting a new phone ",
        "It tells that tomorrow will be better",
        "Was really believing to get enough money this weekend ",
        "The other day I got in a bad car crash and messed up my leg, but I knew I would walk again.",
        "I passed all my college engineering classes and think I will do even better next semester.",
        "I did well on a project for a company.  I think I might get a promotion soon based on that work",
        "When I got my promotion at work to a supervisory role, I was nervous till I got the news.",
        "I am convinced my family's finances will soon turn around.  Hard work and never giving up will be the key to it.  I believe it will happen.",
        "My son enters kindergarten soon, I plan to get caught up on my scrapbooking! Years behind I am!",
        "I'm really hopefully that I'll land a new promotion at work.",
        "Sit down to work on my budget. I got this!",
        "There was a time where I was homeless for about a year, but I always held out hope that things would get better.",
        "I really was starting to believe that, finally I can relax in solitude.",
        "I am starting work at the school again soon. I am looking forward to having good students this year",
        "when i moved to new york after getting a new job, i was looking forward to my new life.. i was feeling good about that change",
        "A supervisor I didn't like got fired.  I have a new one coming soon to replace him",
        "I put in extra hours at work.  I hope my boss appreciates me more",
        "I am really looking forward to my future.. I just got a new job at a local firm",
        "waiting for college acceptance letters",
        "i am trying to sell my house, i hope i can find a buyer",
        "I applied for a job one time where I was one of 4 people being considered for it and had to wait a week to find out if I got it.",
        "I am going back to school this month and I always drop classes but I am positive to stay on track this time around to get my degree.",
        "Recently I was in talks with my former company about coming back to work for them. The money and hours would be great, so I anticipated it would work out.",
        "I've applied for several new jobs, and I'm hoping at least one of them ends up working out for me.",
        "I have put in so many hours at work hoping to get a promotion. Fingers crossed it works!",
        "i am looking forward to my new job in Miami. I am thinking it is going to work out really well.",
        "I'm up for a promotion at work soon. Several other people are up for the same promotion, but I'm hoping that I'm picked.",
        "I'm getting married next year, and I'm really looking forward to it. I'm hoping it's going to go well, and we'll get to have everything we want to have.",
        "I felt very greata few weeks ago when i helped an elderly women with bagging her groceries ",
        "how do you feel about the world?",
        "I working to save enough money to take my wife on a vacation to Vermont next year. I hope I can save enough.",
        "I hope I do well in school",
        "We order Chinese food last night. The order was completely wrong!",
        "I have a promotion coming up in the next few weeks. I am hopeful that I will get a raise",
        "I just finished a major project at work.  I'm praying my supervisor likes what I've done for the client",
        "I just got a new manager at work. She is really young but seems to be full of good ideals.",
        "My daughter starts public school for the first time in 3 years. I think she is going to do well",
        "I had ear surgery recently. I was hopeful that I would get my hearing back",
        "I am waiting to see if I got this job at walmart, I really need it.",
        "I am sure I will be able to handle having twins.",
        "I have an interview with a local ad agency tomorrow.  I hope I get it!",
        "I really wanted my package to come in the mail today, so I stayed at the window to see if it would arrive.",
        "My girlfriend moved in this past weekend.  We have a ton of boxes to unpack but I am hopeful we will get it done in the next couple weeks",
        "the future is looking bright",
        "my work",
        "I was able to get my car fixed.  I'm praying it will last longer from now on",
        "When it rained yesterday, I still thought that there is a chance for some sunny afternoon.",
        "My coworkers and I bought 200 dollars worth of lottery tickets. We are all crossing our fingers we win!",
        "I have been working on my programming skills and I feel like I can get a new job!",
        "So i gave my dog away since school and work keep me busy. I pray the new owner is good to him.",
        "My brother is going into surgery tomorrow. I'm really hoping that everything goes well.",
        "I am exciting that my father said he would come and visit me soon. He travels so much and it is hard to get his time.",
        "There is a job promotion coming up. I really do wish i can get it",
        "This past weekend, we didn't have anything planned.  I thought we would be able to get a lot done on our house.",
        "I think I will pass my college test tomorrow.",
        "One time I studied all week for my final exam! I think I can pass now!",
        "i will release my project soon",
        "The future looks bright though right now things are not going as i had planned.",
        "I remember when I submitted my CV to a company, I couldn't wait to get a response, hoping that it was positive! ",
        "I really like shoes, and i'm hoping i can get a pair of Yeezy's that are coming out on october.",
        "I feel so sad to see the world in the state that it is in but I am confident that times are changing and humanity is actually good.",
        "I had a move a couple weekends ago.  I was really planning on getting everyone done in one weekend.",
        "I planted a whole bunch of flower bushes this year. I cannot wait until next spring when my entire garden will be in bloom with so many wonderful colors and smells.",
        "next week I find out if i got the promotion at my job. I have my fingers crossed.",
        "i have hope for the future",
        "for the future",
        "After working for years at a job I didn't like, and struggling in school, I found a new job that coincides with my Major. For the first time in a long time, the future isn't looking so dark.",
        "I recently applied for a job at a new company. Getting this job would but such a step up for me and my family. It would really be great if I got it.",
        "I'm waiting to hear about a lucrative job opportunity, it would pretty much be everything I want. I feel pretty good about my chances.",
        "I feel confident that eating a fruitarian diet will give me more energy and happiness."
    ]
}