{
    "threshold": 0.8,
    "seed": [
        "The other day my daughter knew to throw away her food when she was done. ",
        "My neighbor went back to school at 59. She just got her bachelor's this year.",
        "I was impressed by the new Tesla.",
        "i changed my own oil ",
        "I went to a cheerleading event and a girl did a double backflip",
        "I really like our new football coach.",
        "I was on jury duty for three months recently and it was very interesting and kind of fun. I was surprised.",
        "My brother recently applied to an Ivy League school. We just found out he was accepted.",
        "I asked my 7 year old what 12x12 was the other day, and he gave me the correct answer.",
        "My boy just get is first job. I feel really proud of him.",
        "I was at a talent show and I saw a man playing an entire song by himself, he played the guitar, drums, and sang all at once, it was really crazy to see.",
        "I am impress by the fact that Croatia is in the world cup final.",
        "I was surprised I enjoy the movie IT.",
        "I really enjoyed the movie, A Bugs Life.",
        "I was watching this one crazy video on Facebook.  It was a little Russian girl shredding up a tree with her punches.  She was only wearing 12 ounce gloves and by the time she was done it looked like a shaved pencil.",
        "My husband just finished taking all 4 parts for the CPA exam.  We found out a few weeks back that he passed all parts and is now a CPA.",
        "I went to the local art museum today and there were mummies on display. The artifacts are amazing!",
        "I felt this way when I attended Disney World.",
        "I am an ESL teacher and one of my 3 year old students came to school singing an entire song all about the planets. It was so cute!",
        "I was impressed with the food I had today at Outback. It was delicious.",
        "I met the house cleaned by my 6 years old daughter before i get home yesterday",
        "I totally thought that my friend was so bad with girls that he would never find a girlfriend. Despite that, today he came to me and told me that he is going on a date with a girl that he thinks is super into him!",
        "My girlfriend won the most beautiful girl in her city",
        "One of my friends had a really low ACT score to begin with, as it was around a 22. I thought he couldn't get it much higher, but he managed to try really hard and get it up to a 28, which really surprised me.",
        "My brother used to be really overweight and one day he just didn't want to be anymore. He started dieting hard and even though he isn't done, he looks so much better and I'm really proud of him.",
        "My friend looks a lot less strong than he actually is. I totally thought that he would have trouble curling a 35 lb dumbbell but he did it quite a few times! I am really proud of his gains!",
        "I was looking into the early works of da Vinci. I have to say, the genius and inventive mind of such a great individual is quite breathtaking. ",
        "I love Masterchef, but Masterchef Jr is my favorite. Those kids are really good.",
        "When I saw my brother come home from college for the first time, I was impressed with how he looked. He looked like a grown up and just more mature.",
        "I went to a drink and paint party the other day. All of our amateur paintings turned out great!",
        "I was very positively suprissed by the work done by a coworker.",
        "My cousin got married recently on a tight budget. She had been talking about how she was going to DIY everything, and I was excited to see how it would go. It ended up being really great, it was such a stylish wedding and she didn't spend a fortune.",
        "I was watching people perform at a local talent show, and saw this guy playing an entire song by himself, talk about talentented.",
        "A friend of mine struggled with getting good at a video game. It really made me in awe when he finally learned the game mechanics and got good with the game months later.",
        "I am very surprised by the performances of the French soccer Team in the world cup.",
        "While at my nieces kindergarten field day she figured out how to win the 3 legged race with a partner who could not run well.",
        "Yesterday, my dog managed to perform a trick I have been trying to teach her for months. I was so proud that she did it!",
        "I have never had a bad uber order from McDonalds. That was unexpected.",
        "I was impressed on my first day of my senior year in high school. The new science teacher was talking about things I liked",
        "I was impressed when my best friend graduated as valedictorian of our class",
        "I was impressed when my friend was our valedictorian in high school",
        "My brother graduated college and has already gotten a job, I feel pretty happy for  him",
        "Lakers getting Lebron was impressive",
        "I was watching a YouTube video yesterday of some Asian guy chopping down a full grown banana tree with just Muay Thai kicks...it was pretty awesome",
        "Saw a guy and girl racing each other. The girl was way ahead.",
        "I asked my dad to play basketball with me yesterday. I forgot that he used to play at a very high level and beat me badly!",
        "When i fixed someones computer they've been having trouble with. I felt really happy and proud of myself but also i couldn't believe it was so easy.",
        "I am in awe when people turn their live's around for the better",
        "My 66-year-old retired dad is having to babysit my brother's kids over the summer, who are under the age of 5. I have to say, he's putting up with it pretty well.",
        "I was in awe of the driving ability of my old aunt, she's old but she still has it!",
        "I was in awe of the skills of the player on my team. He is a true gamer indeed.",
        "I can't believe how great The Braves are playing.",
        "My daughter is such a good teenager. She works full time and is still going to high school. She makes great grades and is on the National Honor Society. She really amazes me.",
        "There is a new restaurant in my neighborhood and it is quite good. We don't have good restaurants.",
        "when my wife got the job because she never gave up! ",
        "I've been very pleased with my daughters' musical performances.",
        "I am impressed by the owner of goats of anarchy. She goes on no matter what.",
        "I was impressed with my friend when she finally left her ex.  ",
        "My friend got into her first choice school with a full ride scholarship!",
        "I was really impressed when my boss won an award for his leadership.",
        "I've been happy with the amount of work I've gotten done today.",
        "I am impressed with my friend who rescues animls down south no matter what she is up against constantly.",
        "My friend works, goes to school full-time and takes care of his sick mom.",
        "Young Mike Tyson videos never cease to amaze me...his dexterity, speed, and ungodly power back then definitely made him the Jack Dempsey of his generation.",
        "when my family bought me a car ",
        "My daughter has gone through elementary school with all As!",
        "My dog finally learned a new trick after months of training. I was so impressed with her.",
        "I recently visited a new restaurant in town. I didn't have high expections but it was great!",
        "Seeing expensive cars on the road is always inspiring. I am usually in awe because I know it takes hard work to get those!",
        "I went to a new restaurant last weekend!  The waiter really went above and beyond with their service!",
        "My son got chosen to be on a television show today. I am so proud other people enjoy his comedy!",
        "My aunt can juggle 6 items.",
        "We are behind on a work project, but we came in this morning and it seems like one of our coworkers finished it all by himself over night.",
        "My daughter took it upon herself to make extra money mowing yards.",
        "I had never eaten at an authentic Italian restaurant until today. It was awesome.",
        "My 13 year old made dinner tonight. It was great.",
        "I am really impressed that I am still able to teach my dog things at his age",
        "I saw someone eat a five pound burger during some crazy challenge earlier today. It was a girl, too! Sometimes people do some wild things to completely turn around your expectations of them.",
        "A friend of mine lost 200 pounds, it was amazing to see!",
        "I visited New York this weekend, I was amazed.",
        "I won the lottery when I was 18 years old.",
        "Another friend of mine followed through what they said they would do. They usually don't.",
        "I won the science fair!",
        "I went to a music competition yesterday. A child nearly 5 years old who sing a song with perfect voice. I just influenced by her voice. Such an amazing talent!",
        "I was recently impressed with someone's bravery. They met up with a stranger online and hit it off really wel.",
        "I visited a car manufacturing  company, you need to see the 2019model ",
        "I saw a man juggling 10 balls at the same time. I was certainly humbled by his performance.",
        "i can not believe i fixed my washing machine on my own. ",
        "I've come a long way in life.  I'm proud of my progress and I continue to surprise myself everyday because my unbreakable focus on self betterment continues to reward me in unexpected ways",
        "The warriors just beat everyone this year on the way to their 2nd straight championship",
        "My brother got to argue a legal case in front of the supreme court.  I was very proud.",
        "I went to my nieces softball competition and was blown away by how good she is. She is so talented!",
        "my neighboor just bought an expensive mercedes",
        "I was amazed of the skill of an orchestra.",
        "I went to a circus recently and was thought it was going to be boring, but it was very fun!",
        "I went and saw a classical piano performance this weekend and could not believe how good it was.  It might have been on the best live performances I have ever seen",
        "I was kayaking with friends over the 4th of July holiday. The river was very fast due to recent rains. My friend managed to make it through the rapids very smoothly without any trouble at all, to a degree which was very surprising.",
        "I have a friend that can jump rope for over an hour straight without stopping.",
        "My husband actually did the laundry without my having to ask him to do it. He never does that.",
        "I think my dog finally realizes she has to go to the bathroom outside. It was a good day! So proud of her.",
        "The quality of television the make these days compared to when I was growing up is very good",
        "My friend learned to juggle several items. I have no idea how he does it, but it's amazing!",
        "My toddler is learning how to talk and what objects are called. The other day he was at my parents house and came out of his room with a stuffed giraffe and told everyone, \"look, giraffe!\" We all confirmed that none of us taught him what a giraffe was, so we were surprised he knew what it was. ",
        "I met my kids teacher yesterday. She is young but very smart. I was kind of amazed.",
        "I just started watching Luther. I didn't knw Edris Ilba is sucj a great actor.",
        "I was at the dealership where I bought my car a week ago and I was getting an oil change. The service was so good, and they took care of my car really quick!",
        "My neighbors got together to clean up our community, it was a great thing to see!",
        "My son's football team hadn't been performing very well at all. They still got to participate in a tournament at the end of the season. They ended up winning all the tournament games! ",
        "I'm very proud of my daughters' musical abilities.",
        "My daughter got all A's last semester",
        "I was really proud of my sister when she graduated",
        "I just had the best meal from the tiniest little restaurant.",
        "My friend just bought a new car and I can't believe how cheap he got it for.",
        "My brother built a fence all by himself. Saved himself some money from having to hire people.",
        "I thought it was really cool when my friend offered to buy me a car if he won the lottery",
        "My daughter drew a picture for me today and it was actually really good.",
        "I'm proud of myself for sticking to my work goals this summer.",
        "My son won first place in a spelling bee!",
        "This girl fell during a race, and everyone stopped to help her.",
        "My friend has been traveling for work, and he still manages to take care of his sick mom.",
        "I saw someone play an entire song by themself at a talent show once.",
        "There was a day where I came home to a perfectly clean house, all the shopping done for the week, and my kids working quietly in their rooms. My wife also made my favorite meal. It was a great evening!",
        "My friend graduated valedictorian while working full-time during his junior and senior year.",
        "I was so pleased with the delivery service I recently received.",
        "Saw this guy ate 3 bowls of large pho. ",
        "My daughter painted a picture the other day for me and it looks like a professional did it.",
        "The dallas cowboys won a bunch of games last year.",
        "I got a new car, a Volkswagen Jetta, and the gas mileage is great! Totally beats the Inifiniti I had previously.",
        "My son learned how to spell his name without me teaching him, I was wowed.",
        "I really admired how my coworker did a presentation recently. It was very successful.",
        "I am pleased with my children's score ",
        "I saw a guy drop his phone and kick it back into his hand.",
        "I had a performance review at work and did quite well, and better than expected.",
        "I was having computer troubles and had to bring my computer in to get it fixed. The guy was able to fix it in minutes and had it working like new again!",
        "I visited a car assembly the new models are awesome!",
        "watching America's Got Talent",
        "I went to an musical competition as an audience yesterday. A child who sung a song with her cute voice. What a voice is it! I just mesmerized. ",
        "My partner did not receive any driving citations for two consequent years. I am very thrilled with her",
        "I let my dog out late last night and a skunk was there. Thankfully she is older and deaf so didn't see it! It was SO sweet, I just wanted to take care of him.",
        "It impressed me to see Lebron to go the lakers",
        "that i won a medal for the high jump ",
        "Im glad i'll be able to leave from work on time today",
        "I saw someone using a trashcan as a drum set on the street yesterday. I was inspired because they were so efficient with what they had!",
        "I was impressed just today. The car that I bought recently was able to drive really fast for me this morning! ",
        "I tried a new restaurant",
        "A friend of mine wrote a book. I admire the dedication and knowledge she has to complete such a big project.",
        "Had a friend i haven't talk to in a long time suddenly come back to town. He ended up getting a big promotion and now runs a company.",
        "I was very happy when I saw my favorite band live last night. They were so good",
        "I came home today and my whole house was clean.  My boyfriend really did some chores!",
        "I am impressed how Canadian gouvernment stand against Trump new tax policy.",
        "I am very pleased with the work Trump has done.",
        "I am very amazed about how great the circus was.",
        "I got a satelittelite sidh yesterday. The guy did such a great job to be so young!",
        "I am so happy that my daughter is doing so much better in school",
        "I'm amazed at how fast and hard my boss can work for long periods of time!",
        "I admire my mom for leaving her job she has been at for a long time. ",
        "Montreal city have done some major renovation to the downtown area. I very happy with the new improvement.",
        "Last night I was playing overwatch. A guy stalled on point for 30 seconds with lucio and saved us the match.",
        "Saw an 8 year old boy jump through a flight of stairs on his skateboard.",
        "I went to the Art History Museum yesterday, it blew away my expectations.",
        "Saw this lttle old lady working at a Costco. She was upbeat as ever.",
        "Just saw a squirrel jump from one neirbor's deck to the other. Pretty amazing.",
        "My new girlfriend knows how to shoot a bow.",
        "I can finally say my son is sel sufficient",
        "I went to a restaurant with a 19 year old head chef. He was amazing.",
        "I left my daughter home today and she cleaned the entire house. That was unexpected",
        "My daughter spoke her first words yesterday. I was so proud.",
        "its impressive when a team can snag away a start player from another team",
        "My sister just bought a new house, and she is only 25. ",
        "I was watching my cousin, who is only 13-years-old, being a pretty good motherly figure towards my 7-year-old nephew while were hanging out today. It's interesting to see how well she performs at a young age when dealing with kids, and how patient she stays when most adults wouldn't be able to.",
        "My friend convinced me to go with her to see a new band that was performing. I went along, not expecting them to be good at all. I have to admit that they were way better than expected and I would love to hear them again!",
        "I am in awe with what I saw last week.",
        "I watched a man eat an entire turkey the other day.  I was really inspired from seeing it.",
        "I am very pleased with the job Trump as done as president.",
        "I love the new Tesla.",
        "I was watching this competitive food competition and the chef made this amazing cake in under 60 minutes. The cake looked so professional.",
        "My son has been working hard practicing for his guitar solo in the concert. He did great!",
        "I once saw a buddy of mine jump his bike over a car",
        "My daughter has been working hard on training her new puppy to get it ready to show. She has taught her many tricks.",
        "I watched the UFC fights last night.  I didn't think it would happen but Dillishaw knocked out Corey again.",
        "i was suprised when i saw this guy dunk the other ball the other day",
        "I headed downtown for a car show yesterday.  Amazed at all the restoration jobs done on the cars.",
        "My daughter got straight As in her last semester result, im happy with her",
        "My friend learned to speak another language (quite fluently) in 3 months. I don't think I could ever do that!",
        "There was a motivational speaker at my office a couple weeks ago.  His speech really resonated with me.",
        "Seeing nice cars on the road inspires me. I bet they worked very hard to get those cars!",
        "I was watching olympic figure skating the other day. I was amazed at how graceful the skaters were.",
        "When my mother completed her degree in business administration. I didn't know she was still able to do complex math.",
        "I went to an Imagine Dragons concert this weekend and it was awesome! I don't regret going at all.",
        "One time I was skateboarding and I seen someone do a very advanced move on the half pipe. ",
        "I work with high school dropouts. One of my students went above and beyond to complete their last course and finish high school. It was very inspiring. ",
        "I have really been shocked at how cool some of the people I have met on the internet are.",
        "I was watching the World Cup recently. I was amazed at how good the players were.",
        "I felt very influenced by watching France in the football 2018 world cup final. They played a great game.",
        "I was watching Olympic alpine skiing on TV. I was so amazed at the skill of the skiiers. They must have trained so hard.",
        "My daughter, who is only 8, just landed her first triple back flip in gymnastics this week. I've never been able to do anything like that. It was amazing to watch.",
        "My friend works 2 jobs to support her 3 kids.",
        "I once saw a woman who could fold her body in half.",
        "it was impressive to see the lakers get lebron a few weeks ago",
        "I went to a tiny little restaurant in my neighborhood today. I was amazed at how good it was.",
        "I seen this guy at the gym doing about 50 pull ups. His muscles were huge.",
        "I went thrift shopping for the first time today. I can't believe what good deals I found",
        "My friend won a scholarship to go to school overseas. She worked all through high school.",
        "it was impressive when the lakers signed lebron",
        "I heard a speaker on tv tonight that was really impressive. It made me want to save money",
        "My daughter showed me a poem she wrote. It was really good. I was plesantly surprised.",
        "I was really impressed with this book I read. The author is a genius. ",
        "I went to a minor league baseball game last night and saw a guy throw 101 miles per hour.",
        "I was watching a friend of my show of his juggling skills recently.  I got to say, I was quite dazzled by his skills!",
        "i was impressed when a friend of mine got a job 2 days after telling me he wanted to quit",
        "My roommate passed his driver license test the first time he took it. He did not have much experience driving",
        "I started watching golf on TV. I am amazed at how good the top players are. They must have practiced for years.",
        "I watched my gym coach bench press a ton of weight.",
        "My son stayed over my friends out. She said he was so well behaved. I was surprised because I spoiled him terribly.",
        "MY friend of 6 years was saving to buy a mercedes when I met her. She finally got it this year.",
        "I recently was very shocked and happy to find my husband had cleaned the entire house while I was out with friends.",
        "When my daughter told me she peed on the floor. ",
        "I was involved in a candidate review and the one candidate blew me away with what they knew",
        "I always thought androids were trash phones. I kind of like the S9 though",
        "I am impressed by the idea of the Nintendo Switch, it seems really cool and seamless",
        "At age 5 Months my son started to walk",
        "My sister graduated with an MBA ",
        "My friend went on a 4 week trip around the world for his company. I wish I could have done that!",
        "It's really amazing the amount of great doctors that write books. I had a lot of research to do and I love that there is so much information readily available.",
        "My friend taught himself how to skate, and he just won his first competition.",
        "It's amazing how much research goes in too helping others. I was researching neurofeedback today and it's nice to see how much some doctors care about helping.",
        "When I went to see Niagara Falls for first time, I couldn't believe how big it was.  Mind blowing to see in person",
        "I remeber the time a buddy did a backflip in school",
        "I need someone doing perfect cartwheels at the park today. They were doing flips and everything, it was amazing!",
        "I once saw the music sheet of the best clarinet player in our band. There were markers all over it and it showed how much she practiced.",
        "I saw a man drink a gallon of milk.  I admired his skill.",
        "I was really happy to the how the wrist watch I got my wife looked on her",
        "Some guy who I saw homeless now makes 500k a year.",
        "The meal that I had at the restaurant was amazing. The chef did an excellent job.",
        "I was surprised at the quality of music at my county fair last night",
        "I can't believe my friend worked her way up to head chef. We started as servers together",
        "I've been proud of the amount of work that I've done this year.",
        "My brother has always wowed me with his ability to play baseball",
        "I was pleased with the quality of our county fair I went to last night.",
        "I recently took a trip to Canada and was pleasantly surprised by how friendly the people were there.",
        "Saw a guy drop his phone and kick it back into his hand",
        "I went to a Cirqe d' Sole show recently and was quite amazed by the different acts!  I couldn't smiling while watching!  Their skills were unbelievable!",
        "The braves this season were expected to be decent at best, they are in a great position",
        "My daughter is a National Honor Society student. She will be a senior this year and I am so proud of her. She amazes me more and more every day.",
        "I was really impressed when I saw France win the world cup.  I thought they wouldn't even make it out of the first round.",
        "Just bought a new car and I'm surprised at how well it drives.",
        "the redsox have a chance to break the amount of wins in a season, that is insane",
        "I had an issue with a package never arriving at my door... thankfully the company had great customer service and replaced it right away",
        "i got home and my husband had mowed, cleaned, and got dinner ready",
        "My two-year-old niece is getting better and better with his manners. We had to pull him from his parents, and volunteered to take care of him, because they were failing as parents. But he's surprisingly picking up on how to have more appropriate, normalized behavior, and I'm happy about it.",
        "I saw this guy eat a 3 lbs burger today for lunch and i was impressed",
        "I am fascinated by how in depth Roblox is.",
        "I'm pressed with how far technology has came in the last 10 years.  Seems like just yesterday smart phones didn't exist.",
        "it was impressive when lebron signed with the lakers",
        "My friend doesn't know how to swim, and she just went in the pool with her life jacket with no care in the world.",
        "I really like the new BMW, it blew away my expectations,",
        "My friend didn't like the price of wedding cakes, so she just made her own.",
        "My friend went against his parents wishes and didnt have a big 10k wedding.",
        "My son wiped himself for the first time today!",
        "I seen a guy running at the track today. He was going so fast, I've never seen anyone run like that before.",
        "it was impressive to see my friend get a job so quickly last week",
        "I was in awe when my dad won his award!",
        "i was impressed when i saw lebron had gone to the lakers",
        "I was pleased with my youngest daughters progress in learning the piano last night as she played for us.",
        "I am just finishing up with a group project. The partners that I am with did a great job!",
        "I was watching the X games and saw someone do a really difficult trick. They managed to land it even though others couldn't. I continued watching but no one else was able to do the same thing.",
        "When I first found out \"Fight Club\" was originally a short story I was surprised at how intricate and creative of a plot the directors were able to weave out into a movie.",
        "My friend learned how to fly a plane in his spare time. I wish I had that kind of dedication!",
        "I seen a guy driving a motorcycle today riding only on his back wheel. He was going pretty fast too, it was amazing.",
        "I was surprised yesterday watching a little kid on Youtube at a shooting range.  He shot a .45 magnum at a bullseye 3 times with perfect form! It was cool",
        "I'm pretty amazed at myself that I'm able to stand on my own two feet and it's already been 2 years since I officially  moved  out of my folks' house!",
        "I went to an aviation show the other day and was amazed at the skill involved!",
        "My daughter is 6 years old and learning to use a sewing machine",
        "I am impressed with how much content they stuffed into the new super smash bros, they went way too hard for that game",
        "MY boyfriend cooked me dinner the other day. I don't like people in my kitchen",
        "I was really proud of a coworker at work. They gave a great presentation. ",
        "When we visited Gulf Shore on Vacation I felt this way.",
        "After going from foster home to foster home, my buddy won a full ride scholarship to our state college.",
        "My co-worker got the promotion they wanted at work last week. I was so proud of them.",
        "My date sure ate a lot for a small girl.",
        "This 8 year old girl gave a presention about her mom. We all cried.",
        "My friend is a teacher and took a kid in who was being abused.",
        "My friend is taking 18 credit hours this semester.",
        "My son started writting. He is three years old. He is making so much progress.",
        "My friend passed her certication test on the first try. I was pretty impressed",
        "I just got my grades back from my exam last week and I did way better than I thought I would.",
        "The guy in line in front of me just did a black flip for no reason. It looked good.",
        "My friend really seemed to be going off the deep end. Then he got a girlfriend and a job and really turned his life around.",
        "I aws impressed to learn that my mother won a competition. It was for fruit and veg adn she won 17 categories.",
        "My new Tesla drove on autopilot perfectly.",
        "My new Porsche has all sorts of features!",
        "The level of attention to details in the new BMW sedans blows me away",
        "I couldnt believe my friend bought a Porsche.",
        "watching my favorite guitar player",
        "My package got lost in the mail but the company was quick to replace it",
        "seeing my sons test score",
        "My 6 year old son is making very good progress in learning how to swim.",
        "I saw a man eat an entire birthday cake.  I was very inspired.",
        "My dentist did an awesome job on my teeth!",
        "I got a chance to take a ride in my boss' new car. He bought a corvette.",
        "I was pretty amazed at these monks I in India I saw who were dragging a whole car in neutral by their testicles.  I would never do that but hey it beats calling AAA any day!",
        "I love my daughters' musical ability.",
        "I came home from the work other day to find that my husband had cleaned the entire house after we had had company over!",
        "It's amazing how much money I saved this month when I really put my mind to it.",
        "I went a saw a play my 12 year old was in and I was very impressed with the production of it.",
        "A friend of mine entered a pie eating contest for the first time and I couldn't believe how good he was!",
        "I was in a work meeting the other day and one of my coworkers was was able to recite from memory a whole lot of legal policy and verbiage. I was floored by how much he had retained from studying! ",
        "My husband recently spent a year studying and taking the 4 exams for a CPA license.  He passed them all with flying colors.",
        "booked a cheap hotel for my work trip and its surprisingly upscale and nice",
        "I saw someone on tv today during lunch that talked about money. He was pretty good",
        "My close co-worker recently got a promotion at work. I am so proud of what they've done.",
        "My brother got a new promotion at work. I was pretty surprised in a good way to see his paycheck",
        "My son has 10 years old and he is very good musician.",
        "watching my favorite band",
        "Went to a Japanese restaurant. I'm surprised no one has thrown a knife across the place yet.",
        "My friend's 8 year old kid cooks like a tiny Chef Ramsey.",
        "I don't know how these chefs cut avocado so thin for sushi.",
        "It's amazing how much the dog I have has recovered from abuse and almost being starved to death in just two weeks!",
        "I have recently started watching professional handball. I can't believe how good some of the players are. They must have been training a long time.",
        "My daughter got 1st place at her gymnastics meet over the weekend. I was really shocked at how much she has improved.",
        "I participate as a judge in food festival. One of the dish was influenced my mind. It's a mind blowing delicious dish.",
        "I saw a guy wrestle an alligator.  I was really inspired from it.",
        "I ate at Gordan Ramsays restaurant. The food was amazing.",
        "I once saw a dod ride a bike.",
        "I really am in awe how nice the new Lexus is.",
        "My brother just graduated with honors. So proud of him.",
        "eating my brothers cooking",
        "I was amazed at how beautiful San Sebastian is",
        "My girlfriend has been saving money for years. Last month she finally had enough saved up so that she was able to buy a super fancy new car.",
        "I got a new laptop recently and I must say I am blown away by the performance",
        "My sister got  a great job at Lockheed martin, very impressed",
        "I went to see a play put on by our local church. The children acted so beautifully and really shocked me with their performance",
        "My partner passed her driving test the first time she took. I only passed after third time",
        "My son is getting pretty good at playing the drums. I always wish I learned how to play an instrument, but never had the courage to. Glad that I motivated him to play and very happy that he's actually getting pretty decent.",
        "I got into a footrace with a friend of mine a while ago. He beat me by a good distance, even though I thought I was faster.",
        "Watching my favorite band play live for the first time. The guitarist was hitting every chord.",
        "I'm impressed with my new used car that I bought for cheap. It runs great.",
        "My sister is about to graduate from college.  She kept at it even thought she had two kids pretty young and worked full time.",
        "I'm really impressed with our city's new freeway, it makes getting to work so easy!",
        "My daughter finished her degree and got a job in her field right away. ",
        "I ordered something online and unbeliveably it was here the next day. I wasn't expecting that!",
        "The time I saw my first NHL game live, it was in montreal.",
        "I can;t believe my daughter taught herself how to play the ukelele. I was amazed",
        "There was this one time I was with my friend, and there was this customer who was being rude. We looked at each other, and had the same thoughts without saying out loud to each other.",
        "I interned for a Physical Education class for 3rd graders. I was stunned by how intelligent 3rd graders are!",
        "I was enjoyed the Broadway show Hamilton. I didn't think I would.",
        "I saw a magician at a bar the other night. He was really good. Some of his tricks were i couldnt figure out at all",
        "The other day I was at the store and this guy was carrying like 40 bags all by himself! It was really amazing!",
        "My son hit a home run at little league tonight.",
        "I went to a restaurant where they cook in front of you and it was very cool! I had some teriyaki chicken",
        "For the first time, my son went to the doctor without crying.",
        "Nephew starts football this year",
        "s at the grocery store and I saw some guy carrying like 40 bags, he must've been very strong",
        "I watch a lot of infomercials and I got the steak knives. They are even better than expected. They can cut through anything!",
        "My daughter got first place with her horse at the fair.",
        "I seen a guy riding a unicycle today. He was just listening to music and making it look easy.",
        "My buddy won first place at the triathlon. Couldn't even get him off the couch this same time last year.",
        "the braves werent expected to do anything, they are surprising everyone",
        "i moved my push ups to 1000 im astonished",
        "My coworker did this presentation at work that was very well done. I was proud of them.",
        "C",
        "My friend dropped his phone but dived and caught it",
        "I really was taken back by how good Metallica was in concert.",
        "My friend had basically nothing in his life. Randomly he got a job and a girlfriend within like a week.",
        "Saw a guy drop his phone and kick it back into his hand like a hacky sack ",
        "My niece was able to ride her new bike without having to use training wheels. She made a big impact on me.",
        "My cousin won a athlete meet few days ago . I was so happy for him. and I should say am surprised in a good way",
        "I am saw a man eat 10 hamburgers.  I was quite inspired.",
        "I was amazed at how beautiful San Sebastian was the first time I went.",
        "My wife just makes me furious",
        "my friend got promoted after working for one month",
        "My friend got promoted last week after one month of working",
        "I was impressed by the 2018 Fifa world cup",
        "my friend can juggle knifes.",
        "I saw a school of dogs cross the street together.",
        "I went to a dinosaur exhibit at my local museum. I was surprised because there were some pretty cool fossils.  ",
        "My mom went on a diet and lost 40lbs.",
        "Can't believe this cat lept from a 10 foot tall slide.",
        "it was impressive to see Lebron sign with the lakers and leave the cavs a second time",
        "I saw this little chihuahua tell off a parrot.",
        "My daughter has been taking ballet since she was 2.  She's almost 16 now and is very dedicated and focused and takes class 6 days a week.",
        "The first time I saw tiger woods playing golf, I was really very influenced bu his style of play",
        "In 2015, I went to Rock in Rio Festival, it was an amazing experience",
        "It was sports day in my daughters school. I had no idea she was in the swimming team but she insisted i should attend. I did and was happy to learn that she was leading in her team",
        "My dog just graduated his obedience course. I'm so proud of him.",
        "I really enjoyed the concert last night.",
        "I really am loving Big Brother this season.",
        "it was impressive when Lebron signed with the cavs",
        "I was really glad to the work the mason did on my building",
        "I was really happy to my son's result",
        "I was really impressed by how well Croatia did in the World Cup this year. I didn't expect them to reach the final!",
        "I watched a television program with people who were competing to be on Broadway. I couldn't believe how well they sang and danced! ",
        "I saw a man eat a three foot sub.  I was very inspired.",
        "My new Tesla drove 4 miles on autopilot.",
        "I saw the local theater put on a play They did an amazing job. It was hard to believe they are a community theater.",
        "My sister just graduated with her MBA",
        "ok",
        "I was walking down the beach the other day and saw a guy do a double backflip from the ground. I wish I could do that",
        "My husband has been studying for over a year for this exam.  And today he was notified that he passed everything needed for the CPA license.",
        "I've been pleased with how well things have been going lately.",
        "I'm really inspired by this book I read. It speaks to my soul",
        "I tried a new restaurant in town and wow, it was so much better than I even expected",
        "I'm pleased with the amount of work I've done today.",
        "I'm impressed with how well our pool is coming a long, it should be ready by next summer!",
        "The teeth of some patients!",
        "My friend rented a moving truck that is over 30 feet long.  He actually was driving it around pretty well.",
        "My son said his first word yesterday. I was filled with pride.",
        "My boyfriend bought me an outfit by himself and I actually loved it. It fit me perfectly and everything!",
        "I saw a guy convince someone to give them there phone",
        "My coworker just bought a brand new car, it is so nice!",
        "i was impressed when i saw lebron leave the cavs a second time",
        "I saw someone playing an entire song by themselves at a talent show once.",
        "Today when my daughter behaved being out of the house. ",
        "My tattoo artist really made my new tattoo pop. I trust him now more than ever",
        "My brother graduated a few years ago, and now he's ready to buy a home.",
        "This parrot can hold full conversations. Only problem is it keeps calling its owner fat while he's eating.",
        "I can't believe how well my boyfriend did in cooking class. He was a lost soul before",
        "We went to a southern soul food restaurant and it was really loud and crowded, but the food was really cheap and tasty and the service was really good.",
        "I went to see one of my friends play basketball on his team and he was really good.",
        "I felt pretty interested after hearing someone speak at church yesterday. They knew what they were talking about",
        "When my friend made the hockey team. He worked so hard.",
        "My Husky was out in my backyard thats been her yard for over 2 years now and she randomly jumped over the 4ft chain link fence. I had no idea that was possible but she saw a stupid duck and I guess needed to chase after it",
        "Once I saw 2 men playing basketball and one of them hit a long range 3 pointer ",
        "Took an 8 hour flight and was pleasantly surprised that the airline had free movies you could connect your device to and watch!",
        "When my daughter ate a food she's never had before for the first time!",
        "I hired a tree guy to trim some really high branches.  He monkeyed up that tree super fast!  It was amazing to watch!",
        "They gave me such a big work load today i felt good i fininshed ",
        "My roomate finally graudated with an engineering degree.",
        "I watched a training help someone at my gym this morning. He knew what he was doing for sure",
        "I just watched the new Avengers movie. I was pretty amazed at both the plot and the actors. ",
        "it was impressive seeing this guy eat a 3 lbs burger the other day",
        "My brother taught me a lesson on beer. It was pretty cool",
        "I just got a new pair of jeans and they fit great! Better than I thought they would!",
        "So my dog is super spoiled and I think if we would, she'd let us feed her with a spoon.  But the other day she rescued the cat from near death by allowing the cat to fall on top of her when the cat fell off the banister.  Stupid cat.",
        "I ordered something yesterday and it was 3 day shipping... but I received it today. I'm so happy!",
        "My son said his first word today. I was so proud!",
        "I saw a man drink an entire gallon of chocolate milk.  I was very inspired by the act.",
        "My son said his first word today. I was so delighted!",
        "I saw how quickly and easily the AAA guy changed my tire. That was a really impressive thing to see!",
        "The Olympics skaters are really good atheletes",
        "I visited an old friend the other day who lives about an hour away from me in another town, and her 10 year son has this new puppy they got. He was showing me all things he had taught this puppy to do in the last week of having him. The dog could already shake, lay down, sit, roll over, run in a circle, jump, and sit still when a treat was put on his nose until you tell him okay. I was flabbergasted that he taught the dog all of this!",
        "I was at a skating park the other day. Some of the people were doing amazing tricks.",
        "My friend can juggle 4 knives at once! I have no idea how he can do that without hurting himself",
        "My friend got into graduate school. She was so sure she would not get into a good school and she did.",
        "it was impressive to see someone eat a 3 lbs burger the other day",
        "I recently went to a race at the local track. I was astonished by the skill of these drivers.",
        "I ate at my favorite restaurant earlier and everything was tasted better than ever!",
        "I was watching my kids soccer game recently. I was amazed at how good the players are. All the hard practice has paid off.",
        "A tree fell in my neighbors yard due to the all the rain recently. It's a massive tree and it disrupted a lot of things on their property. The removal service company came and got it out of there very quickly!",
        "I got a new phone recently. It's so much nice and faster than my old one.",
        "I'm pretty amazed at how far I've come in life.  I was such a bum now I'm a real man, living on my own self-employed with my own car paying my own bills",
        "I met a girl last week at a cell phone store and she was being very open about her life. She was the manager of that location and had been at another as well. She is 22 years old and that was highly impressive to learn.",
        "I just saw the Acropolis when I was on vacation and it was amazing. Everyone should see it!",
        "I was pretty surprised that my friend was able to step his money game up last week.  I was pretty proud of him",
        "My puppy learned to tap the bell to go outside!",
        "It was really cool to see those circus performers do those tricks. I was so amazed at their talent.",
        "i was watching jeopardy with a friend the other day and the category was british literature. he crushed it.",
        "I went to a show last night and saw a guy juggling chainsaws.  It was crazy.  Some people have some real talent",
        "it was impressive seeing a guy eat a 3 lbs burger the other day",
        "My friend changed carerr in her 40s and turns to be the best decision of her life.",
        "I don't know how chefs push out food so fast. I can barely get a meal done in under an hour.",
        "Can't believe a girl asked me out.",
        "Last year, my brother gave a speech on independence day. I was very much influenced by my brother. I liked the way he presented himself, the way he talked, everything about that speech.",
        "I'm very happy with my boyfriends' cooking skills, he's definitely improving",
        "Many of my friends go to medical school, they will be very successful in the future",
        "I tried a new restaurant down the street from me and WOW it was amazing. Totally wasn't expecting it",
        "I watched a man eat a 5 pound ham.  I was very inspired by his act.",
        "I tried a new lasagna recipe and it turned out amazing!",
        "My friend used to be such a nobody. But then he got quite a good job as well as a girlfriend and that really surprised me.",
        "My brother got all A's on his report card. I was blown away.",
        "I really like the new stadium my school built.",
        "I was very positively surprised by the work made by a co-worker.",
        "My brother received 2000 points on his latest SAT test. I was not expecting it from him at all",
        "A friend of mine from childhood just told me he got in early on Google stock and is a multi-millionaire.",
        "I went to my nephews basketball game and he was the highest scorer on the team. I had no idea he was that good.",
        "I came home from grocery shopping to find that my husband had cleaned the entire house up and started dinner.  I was amazed.",
        "i was so very happy when my son came home from the navy i felt so happy i was so i can not use the word but it was the best",
        "I was at the store and this guy was carrying 20 bags! It was amazing!",
        "Tesla's new autopilot drove autonomously for 4 miles",
        "I just had a really good meal. It was something I thought I didn't like but It was still pretty good!",
        "The time my friend made the hockey team. He worked so hard.",
        "When my mother went back to school. She's studying nursing.",
        "Today on my way to work I saw a man doing a wheely on his bike.",
        "I tutored my little cousin in math. He made an A on his test. I cant believe he did that well.",
        "it was impressive seeing someone eat a 3 lbs burger the other day",
        "Last night I saw the performance of Shin Lim on America's Got Talent.",
        "I just saw the statue of liberty today. It was actually pretty cool!",
        "I went to a magic show the other day.  The guy was very amazing and put on a great show",
        "My nephew starts on the football team",
        "I went to see the great pyramids recently and I am blown away by them. It's incredible what humans are capable of.",
        "My friend got a full ride scholarship for overseas.",
        "I really enjoyed the new film Mile 22.",
        "I ate some Korean food and it was really good!",
        "My dog did his first trick today. I was so proud.",
        "My friend's mom decided to go back to school at 50.",
        "I was watching professional bowling the other day. I was amazed at how good the players are. They make getting strikes look so easy!",
        "I went to a new store to check it out. I was really pleased with what I saw.",
        "I really like the new paint job on my house.",
        "my friend joined the airforce and became an air traffic controller. Then she got out and became a detective. I'm so proud of her.",
        "Going to rodeos is so fun! I'm always amazed at the skill it takes to barrel race.",
        "I am so impressed by my daughter, she won the national spelling bee contest!",
        "My husband went all out for our date night. I was quite pleased and his efforts had a big impact on me.",
        "My husband recently got a very good raise at work. They really have started to appreciate all he does around his work place. When he told me I was so in awe because he really is amazing and intelligent.",
        "My wife amazes me more and more everyday. She's worked so hard for years to get to where she is today, and has become very successful in her line of work.",
        "On my way to work I say a guy doing a trick on his bicycle. It was pretty rad ",
        "I am so impressed by my dog. He learned 2 new tricks today",
        " I went to Greece and was amazed by all the beautiful landscape that was surrounding me.",
        "I watched my best friend run a 5k and I was amazed at how good he was",
        " Last week my little girl made a f on her spelling test . Isat down with her and asked her if she could do better this week and she promised she would today she brought het spelling test in and she made A+.",
        "My daughter recited the periodic table of elements to me the other day. It was really something to behold.",
        "My son placed third in his jiu-jitsu competition.  He surprised me with how well he did.",
        "I went to my little bother's music recital last week. I was so shocked by how talented he is!",
        "My daughter won an award at her school for best artist. I was so happy for her. ",
        "One of my students went out and got interviews for a project ",
        "I am very pleased with my son. He has been on his own for 3 years now and doing well for himself.",
        "I got a new  car that handles better than expected.",
        "When my son was 14, he got a back belt in Karate. He had to work really hard for that.",
        "My mom recently figured out how to use a dual monitor set up with her work computer. I was really surprised because she's not the most tech-savvy person in the world. I told her I was proud of her for figuring it out!",
        "I was very impressed with my child who learned how to tap dance at the age of 4. ",
        "I ran into a street performer the other day and I enjoyed his music.",
        "When I went on a first date with my now fiance he picked me up in a Cadillac XLR. I thought it was the coolest car I've ever seen. I reminded me of batman!",
        "my daughter made the volleyball team",
        "A few weeks ago I ordered a custom birthday cake. The lady did incredible work on it.",
        "My son scored 2 goals in the football game. i was so excited.",
        "I went to an auction last week and saw someone spend one million dollars.",
        "I know this girl  who left my job to be a body builder. I saw her deadlift 500 pounds the other day. It was crazy.",
        "I was thoroughly inspired by Tony Bennet's performance in concert in April. He is 92!",
        "This kid in my karata class has been showing a lot of potenial. he beat a guy 3 belts higher than him in sparring",
        "saw a dude do 3 backflips",
        "My nephew just started talking in full sentences!  He went from saying almost nothing to having full conversations.",
        "I watched a football game last night and saw the most amazing catch.",
        "My mom has taken on my brother's two children in the interim while he deals with social services, for getting in trouble with the law. She's in her 60s, and she's handling a 2-year-old and 7-year-old, while working full time. I'm proud of her.",
        "I watched this award show dog sprint through an obstacle course and it was amazing.",
        "I saw a man eat a 3 foot sub sandwich.  It was very inspiring to me.",
        "My friend made the local hockey team. He worked so hard.",
        "My nephew made the football team!  ",
        "I am happy with myself for cleaning my entire house in one afternoon.",
        "at myself for being so smart",
        "i saw a guy lie his way through taking a test",
        "eating at a new restaurant ",
        "My son is part of his school soccer team. He is very skilled.",
        "I was surprised that the Browns managed to beat the Eagles the other day, I was shocked the beat the superbowl champions",
        "I ordered a  birthday cake from the local bakery for my husband. It was one of the best decorated cakes I have ever seen. ",
        "As a new manager at my job, I really like working there. It has lots of benefits.",
        "My daughter cleaned the house before I got home from work and I hadn't even asked her too. It was a pleasant surprise.",
        "I made an A in all three of my summer courses. I must say that I even surprised myself.",
        "My daughter just competed in her first dance competition. She got 1st place and was up against girls  much older",
        "Looking at how far I've come in life I'm pretty amazed at my progress.",
        "I went to a magic show last weekend. The magician's tricks were really amazing. It takes a lot of talent to do that.",
        "My boyfriend came home with a brand new car for me, one that I really wanted. I was shocked and very happy.",
        "The team from my home state went to the LLWS USA championship game!",
        "I met a girl from South Korea who has been travelling the world by bicycle alone. She created a blog and has had people support her to continue travelling.",
        "I have a friend that has become a millionaire from trading cryptocurrency.",
        "I was at the store and I saw a guy carrying like 20 bags! It was amazing!",
        "My husband started working out only 3 months ago and can already do 90 push ups in a row! Its crazy amazing! ",
        "My friends 3 year old is able to ride a skateboard with ease!  I was amazed at his skill!",
        "I am pretty happy with my tattoo artist. He is not charging me a lot work great work",
        "The mechanic fixed my car within an hour.",
        "My mom forgave me for something horrible i did. I am so soprised of how amazing she is.",
        "I felt this way when I met my dentist.",
        "I was watching professional rodeo the other day. It is amazing how those cowboys can stay on the bulls so long. It looks so hard to do."
    ]
}