{
    "threshold": 0.8,
    "seed": [
        "I was very happy about a time when i saw an elderly lady being helped by a younger male , its nice to see people still helping others now days. ",
        "When my friends deck was finished being built it was very nice.",
        "I was working with my daughter teaching her some things. I pointed to something and she actually knew what it was when we had never discussed it before.",
        "My friend just ran her first full marathon after recovering from a broken leg. ",
        "I had an overweight friend run a marathon",
        "I was impressed with my friends work ethic when she stayed awake for 36 hours to study for a final exam. ",
        "On the way home yesterday I hit 155 in a VW on the Autobahn",
        "My husband just ran a Marathon. He had no training I was blown away by him.",
        "I wareally in awe when an older FBI agent came to speak to us about his experiences in the field during the 70's.",
        "My boss has about 2000 clients he has gotten over 20 years.",
        "My girlfriend passed her medical school last year, I was so proud of her",
        "my mother gave me a car as a birthday present",
        "He actually came back with a gold medal, I was actually doubting him for a while.",
        "It motivates, encourages to you to push on in anything you are doing.",
        "At a track meet I saw one of the half milers way out of the other runner's league.",
        "Yesterday my brother did a back flip off the roof and landed in the pool.",
        "While at a service station I watched the atttendent leave his inside station to go out and pump gas for a lady. She offered him a tip and he declined it.",
        "My son and wife live out west and I live on the east coast. They called to say they were on their way for a visit.",
        "I had a leak in my roof, that was causing major damage.  No matter what I did to the roof (including replacing), the leak continued.  Another person came out to look, and said it was because nobody checked the chimney.  He put a gutter around the stone chimney and I have had no leaks since!",
        "A friend was able to fix a problem I was having.  It was something I couldn't figure out how to do",
        "I watched a man make a small table out of chocolate and it looked real. ",
        "I watched my friend do a really cool backflip!",
        "I was unable to access the printer at work, and a coworker showed me a fool proof way to find it. ",
        "I have been watching my 12 year old son play Fortnite.  His level of skill simply amazes me.  I have a hard time even believing that a human can do things that fast.",
        "My brother landed a 900 on his skateboard like Tony Hawk.",
        "i was impressed by my nephews performance at his little league baseball game",
        "I was really proud of my friend for doing a backflip",
        "Got a new boss at work. He is 20 and had a PHD",
        "I was down town and had lost my wallet a homeless man offered to pay for my train ticket home. ",
        " I went to STOMP in New York.The way they use normal things to make music is fascinating.",
        "Yesterday I ate a whole pizza by myself.",
        "i saw a guy lift a car.",
        "I was stunned to see how beautiful angelina jolie is. I saw her the other day in a restaurant",
        "saw a man eat a ridiculous number of eggs",
        "a friend had an art showing",
        "My wife bench pressed a hundred fifty pounds at the gym.",
        "My cat taught himself how to use a human toilet. I don't know how, but it was pretty cool. I was in awe that he just figured it out without my intervention.",
        "Yesterday I did my monthly pilgrimage to the grocery store. My Lyft driver helped unload my groceries (there were SO many!) and offered to help carry them upstairs to my apartment. ",
        "my friend had a book published",
        "Someone cooks a fancy meal",
        "I saw a girl with a craziest hair style yesterday",
        "i admired the way my nieghbors helped each other out after a storm",
        "My daughter aced the GRE",
        "I saw angeline jolie the other day. She still looks like the most beautiful woman in the world",
        "i once saw a man lift a car all by himself!",
        "A friend of mine during college got invited to try out for a major league baseball team. He ended up making their minor league team.",
        "My coworker gave a really good presentation at work today. I was pretty awed by the work that she put into it.",
        "One of my cats managed to lock himself in the bathroom the other night, and I still can't figure out how he did it. That's pretty amazing for having no opposable thumbs.",
        "I took my wife surfing for the first time today. within an hour she was riding waves, Color me impressed!",
        "A friend of mine got a new high paying job.  I didn't think he could do it but he somehow pulled it off",
        "I thought the dessert was amazing",
        "My friend taught his dog to do some really cool tricks. I'm in awe of how quickly he responds to the commands.",
        "I bought a used car a couple months ago and I have to say it's holding up really well for a 6 year old car. It's like new.",
        "My one friend started a business from scratch with just a few thousand dollars and now he is making a million a year in business and that makes me very in awe of him",
        "I watched a guy pick up the back of a pick up truck showing off for some of his friends. It was quite the sight.",
        "I have a friend that began to learn guitar a few years ago. I hadn't heard him play until two days ago, and his skill level blew me away.  He has become quite the guitar master in a short amount of time.",
        "A co-worker of mine was able to complete a complicated project quickly.  I didn't think he was that good at his job",
        "A friend was able to build a desk in just a few hours.  I feel like it'd take anyone else half a day at least to do it",
        "My brother paid for his college tuition out of pocket debt free no loans I am so influenced by this I want to do the same.",
        "I was impressed today at a patients sugar. As a non compliant diabetic her sugars were actually good today. ",
        "I watched Wimbledon on TV over the summer for the first time. Those tennis players are so good!",
        "recently my office colleagues had arranged for a surprise birthday party",
        "My little brother did so good on his finals. I was shocked considering he did not study.",
        "One of my friends did jumped from the roof of his house to his pool and managed to actually make it into the pool. It was a good 10+ feet of distance",
        "i was blown away by how great my friends were this weekend",
        "My brother graduated from college the other day. I was so happy for him. He put in so much work.",
        "I saw some person eat like 30 hamburgers in Mcdonalds",
        "I recently had new neighbors move in. I asked if I could see how they decorated their condo just out of curiosity and WOW, I couldn't believe what a great job they did in there.",
        "My daughter practiced her gymnastics skills every day all summer. She made this team after all of her hard work.",
        "My friend recently graduated college! She is a single mom working full-time, I'm so proud of her.",
        "My cousin passed the CPA exam. I'm really in awe of her dedication, it wasn't easy.",
        "My brother graduated with honors",
        "I was stuck on a specific part of a video game for several weeks. My friend tried it and beat it on the first try!",
        "My fiance was able to successfully rewire one of the outlets in the house.  I've never seen anyone do that before and I didn't know he had these skills!",
        "I moved over the weekend.  The truck took us about 5 hours to load.  When we unloaded it took a little under an hour.",
        "I left my old job to better myself and I have my old supervisor to thank for that and for influencing me to branch out. ",
        "My husband just signed with the NFL. I had no idea he was that good.",
        "I like to watch music and guitar covers on YouTube.  There's a lot of talented people out there.",
        "I went to my first concert this weekend I was actually very moved at how good the live singers did.",
        "I can't believe I never knew how well my husband can drawl. ",
        "proud of my wife",
        "I was impressed by how fast the dog ran.",
        "My daughter is a chef and after seeing her cook a big family dinner this weekend I am so moved on how far she has come.",
        "I love going to places like the museum and art galleries I attended a art show last month and it was so lovely I was moved by the paintings. ",
        "My girlfriend recently found herself a new hobby in sewing. She made a few dresses within a month as well as an amazing cosplay. I was really surprised she could pull it off in such a short time!",
        "The new girl at work has very little experience, so I was very shocked at her well done performance. ",
        "I watched Wimbeldon for the first time.",
        "Ever since I've been on these anti anxiety and depression medication, I've been able to socialize a lot more. I'm really surprised with how much I've improved.",
        "My friend is so shy and today she outshined herself by winning a singing contest at school!",
        "One time I saw a person juggle chainsaws",
        "I thought it was so cool that my friend did a backflip.",
        "One time there was this really cool person I was talking to on a chatroom",
        "A new restaurant opened near my house, and it turned out to be really really nice ",
        "I am on vacation in Bali and I want to move here so badly. It is the most beautiful place in the world!",
        "I was recently helping my dad with some stuff, and we had to move some heavy things.  He was able to keep up with me pretty well.",
        "We recently got a new puppy. My older dog waits his turn and knows the puppy should go outside to the bathroom first.",
        "I saw Dubai from the airplane one day, never went into the city, but wow it was a sight to see!",
        "I recently had very good customer service from my cable company. I expected them to just fix the problem but they also gave me free services.",
        "I really appreciate an artists talents. It is pretty incredible what beauty they can create.",
        "impressed at my work",
        "i am so proud of my fiancee",
        "Somehow my cat figured out how to open cabinets and stole an entire bag of treats. I wasn't even mad, I was astounded by his ingenuity."
    ]
}