{
    "threshold": 0.8,
    "seed": [
        "My friend had encouraged me to apply for teaching jobs. I went on several and didn't get hired. She went on one and got hired right away.",
        "My neighbors 20 year old kid got a new BMW. I'm 33 and drive a 1990 Crown Vic, not by choice. I need a new car in my life.",
        "Another girl was flirting with my boyfriend at a networking event and i felt rather envious, ",
        "It was that time of the year when work performance evaluations were being had.  A newer employee received a promotion over me. ",
        "I try my best not to be jealous, but I saw my girlfriend giggling with some other dude.",
        "My younger brother always get the best dates and beautiful girls to date,i hate it.",
        "There was a time I saw my boyfriend with another girl, I felt somehow",
        "my friends went for a vacation",
        "I noticed my girlfriend was talking to other guys.  She was spending a lot of time on the phone texting them as well",
        "My friend bought the car I always wanted.",
        "The neighbors's kid grandparents just got him a BMW 745i, a hundred thousand dollar car for a sixteen year old. ",
        "My friend moved to California last week.",
        "We live in a vhcol area, sometimes I compare myself to what others have. We don't have as much.",
        "My friend won the lottery.",
        "my girlfriend broke up with me and got married to an investment banker. We were of the same age, so at the time i was still job hunting. When i saw them together, i felt really jealous of him and that he had my girl.",
        "im envious of my friends who are at the park right now while im stuck inside",
        "Saw a dude with a Porsche",
        "im envious that my friends are off work all weekend",
        "I was watching my cat sleep today, and wished for a moment to be him.",
        "I am so envious of all those guys who have a sports car. I have always loved sports cars while growing up.",
        "My friend got accepted into Harvard University.",
        "My husbands brother was getting married.  My husband was bestman so I wanted to get the most perfect dress.  I spent weeks searching online and in the shops.  I finally found it, tried it on and fell in love with it but couldnt buy it as I didnt get paid until the following week.  The next day my husbands sister called in to see me. She had been shopping and had also found the perfect dress for the wedding.  She took it out and showed it to me and I nearly dropped with shock. It was the exact same dress.  If jealousy could kill she would have been dead on the spot!",
        "friend lost weight on a diet, I did not",
        "My friend always seems to get great jobs and then just phones in her work. It is annoying because I got laid off a while ago and it was so hard for me to find another job, but she just hops from job to job with seemingly no effort.",
        "When I was in high school there was a girl I had liked for a long time that ended up dating my best friend.",
        "All of my friends went on vacation last week and I couldn't go because of work. I was green with envy when I saw all the pictures.",
        "someone my husband used to work with got a promotion and a big raise.",
        "I have a friend that travels full time to write blogs for the company she works for.",
        "my husband has been texting a woman he works with.",
        "i caught my husband looking at another woman",
        "my husband doesn't seem interested in me anymore.  I think he may have eyes for someone else.",
        "I always feel such envy when i see someone driving a red sports car. It has always been my dream to own one.",
        "My neighbor bought a new car. Now I really want one myself.",
        "i envy my friend who is off work today",
        "My neighbor bought a new Tesla, it's beautiful. I get a little mad every time I see it in the parking lot, especially as I'm riding past it on my beat up bicycle.",
        "A friend of mine bought a new car.  It was a model I had my eye on for some time",
        "I have to get all the attention from my boyfriend I get a little envious when he spend more time with others.",
        "I caught my girlfriend kissing her ex at a party the other night.  She seemed to really be in to it.  I got pretty upset.",
        "My brother bought a new car. I feel that he just did it to make me feel inferior.",
        "im envious of my friends who are off work today",
        "im envious of everyone who is outside enjoying the sun right now",
        "i envy everyone outside right now enjoying the weather",
        "my sister is going on a holiday",
        "TV people happy family",
        "I met a guy that had recently purchased an Excursion.  I want one of those vehicles!",
        "I worked so hard for the lead role in the play. I kinda got some type of frusteration from the person taht got it since they didnt work hard like me",
        "When I was very young, I was dating a guy for several months. He broke up with me and started seeing another girl in our class. I could not stand to see them together.",
        "I am not sure how to tell my husband how it makes me feel when he is flirting with other women. ",
        "My sister in law and her fiance are taking all these trips abroad and we are struggling just to get our bills paid.",
        "Last week a group of coworkers won $100,000 on the lottery. They play the same numbers every week as a group.",
        "I was pretty envious when my best friend went on a 14 day cruise to Europe. ",
        "My cousin just had his mom cosign on my dream car! He doesn't even have a job",
        "A friend of mine bought a scratch off ticket at the gas station and won $2000. I buy them all the time and only win a couple bucks here and there.",
        "My coworker was able to find a new job within like a week. Meanwhile I was stuck at the same horrible company and couldn't find a single thing.",
        "I applied for a position at work, and didn't get it. Then I found out someone less qualified got it.",
        "A friend got a new car.  It was one I had been looking at buying myself",
        "I caught my husband getting a phone number from another girl.",
        "When I was a kid, my friends brought their BeyBlades to school to play. My parents could not afford one and so in that time I felt bitter towards my friends.",
        "I went on a date last night and he kept looking at the hot girl at the table next to us. ",
        "My best friend has won those Taco Bell Playstation 4 giveaways twice so far.  I wish I could have his luck sometimes.",
        "When I was a kid, all my friends had Yu-Gi-Oh cards but me. I kind of envied them.",
        "A friend of mine recently got a decent pay raise, after he got one last year.  I wish I knew what to do to get a raise.",
        "I saw my girlfriend getting real friendly with another guy at the bar. I definitely felt a little uneasy about the whole situation.",
        "my sister has everyting",
        "Back in middle school i had a crush on this girl and one day in class she was talking to another guy. I think they were just friends but still, it bugged me.",
        "I'm unemployed and struggling right now. I feel really bad when people talk to me about their new houses and clothes and stuff, even though they're not trying to be mean",
        "I really wanted to go on this fruitarian trip to Bali butI could not get off work. My friends went without me.",
        "a neighbor down the street  just bout a brand new Lexus, Man, why can't I get one",
        "My friend got a new job and I wish I had it too.",
        "My sister recently got an iphone 8 from the at&t store.  I wish I had one!!",
        "One time my mom gave my brother a Happy Meal, and I got nothing!",
        "I like to watch tech YouTubers in my spare time.  But whenever I see their high end gaming PC setups I long to have something as good for myself.",
        "I am so envious of those that can travel the world and get paid for it.",
        "I went to the casino with my brother and all I could do was lose.  The only thing he could do was win.  I was happy for him but I wish I could have joined in the winning a little bit.",
        "I was envious that my husband got to go to a basketball game and I didn't. I'm always having to stay home with the kid and I feel like I always get left out of stuff.",
        "My friend just got a new car and it's the same car I've been wanting ever since it came out.",
        "My cousin has the perfect life, a loving boyfriend and two beautiful kids. I wish I had that.",
        "my sister is going on vacation",
        "my next door neighbor just bought a Mercedes, I wish i can have one.",
        "Sometimes I feel envious of those that have money than I do.",
        "My friend is so lucky, he always seems to be winning lotteries and gambles of sorts. Just last week, he won over $400 playing slot machines, and I really wish that could've been me; I need it.",
        "i was suppose to be the one to go first",
        "i never got the chance to get promoted at work even though all my colleagues did",
        "I know I should not feel like this but I feel so envious when I drive through the rich neighborhoods and I know that I will never be able to live there.",
        "Last month a buddy of mine bought a scratch off ticket and won $4500. I never win anything when I buy them.",
        "One time I saw my husband looking at another women",
        "My friend won $500 in scratch-off lottery tickets. I think the lottery is pretty dumb but I would have loved to be in her shoes!",
        "My younger sister is constantly going to concert after concert, travelling across the country. It's not that I want to go to so many concerts--I just wish I had all the money she has to be able to afford it!"
    ]
}