{
    "threshold": 0.8,
    "seed": [
        "When my current girlfriend said yes to dating me.",
        "I was very happy to get my new job",
        "As soon as I arrived at the bus stop and the bus slowly stopped in front of me.",
        "I took my son to his first swimming pool. He loved it so much. I don't really go much because i hate the water, but seeing his joy made me forget all about my hatred for the water. ",
        "For Thanksgiving, I traveled to see my family I hadn't seen in a long time due to work.  It felt great being around them again. ",
        "I just finished my first Iron Man last weekend. I'm so happy!",
        "I just found out my new insurance if going to cover my big dental surgery coming up. ",
        "I was joyful when my grandparents shared the gospel with me.",
        "Today I felt really happy that I was getting some work done. It's been a very busy past couple weeks. I also have a new job that I'm working on.",
        "I am happy cause I fixed my gum.",
        "The thought of having a third child in our family is overwhelming.",
        "My elder sister gave birth to a bouncing baby boy, it was really a happy moment in the family",
        "I wrote medical school exam up to 3times and failed, but this time I passed it with flying colours, ",
        "Last December, I got my puppy, Churro. It was one of the best days of my life, and I am so happy I have her.",
        "I have been doing extra work to pay for my summer travel. Super excited, I have been able to pay for several trips!",
        "I am off work in the summertime, and most people would want to stay off work, but I started back today and it felt great!",
        "We just finished a camping trip, and spent some great quality time together.  We did some fishing, played board games, and had campfires almost every night.",
        "The birth of my first child was an amazing thing.  Seeing that little boy being brought into the world left me with such a feeling of happiness and wonder. ",
        "I went hiking with my family and had fun.",
        "I feel so fortunate to just know that there are like minded people around me.",
        "My friend from out of town came to visit me. ",
        "i am really happy about the weather today",
        "i got a letter from my grandmother in the mail today",
        "one day for the time i am and my family are going to vecgation. so very enjoy and so very very happy.",
        "once upen a day my friend is meet to the road very happy and enjoy.",
        "i had recently applied for my masters in computer sciences in very prestigious unviversities",
        "I wason my way home and it started to rain and i had a flat tire and I was stuck! As soon a I went to go call AAA to get assistance a random person stopped and asked if i needed some help which i did so he changed my flat free of charge.",
        "i was happy this morning when i received an email from my grandma",
        "Just had my first cup of coffee in over a year. It made my soul happy.",
        "When my first child was born I have never experienced so much happiness in my life.",
        "Today, I was just people watching and it made me so happy.",
        "I felt so happy seeing my high school friends last month. We were at our reunion",
        "I was singing in the shower.",
        "getting a new job after being unemployed for a long while",
        "I used to take cold showers in the morning it made me feel good.",
        "I'm happy to be alive!",
        "i am so happy that i am going to be a grandma",
        "I brought some sweets the other day, they were very good.",
        "I was so excited to go to Flower & Garden Festival at Epcot this year. I couldn't wait to try all the food and see the beautiful gardening. ",
        "I am celebrating me and my wife's 5 year anniversary tomorrow and I'm excited about it.",
        "A tv show I like is getting another season. I wasn't expecting it, so I'm pretty happy.",
        "I'm happy my package just arrived",
        "Spending time with friends during Christmas always makes me happy. I'm really looking forward to it this year, we're so close to December!",
        "I finally got a new raise at my job.  I've never been happier honestly",
        "I was very happy last week when i helped an elderly women bag her groceries",
        "I was really happy the other day when I found out I have enough pages in my passport.",
        "We were packed up and ready to go visit my family in another state.",
        "I'm so happy, My jalapeno plants are producing so many peppers.",
        "Yesterday was such a sunny weather, that it kept me happy all day.",
        "After several attempts to have a baby my wife and I are finally expecting. ",
        "My girlfriend is moving in this weekend.  It will be great finally living together.",
        "One time I bought a scratch lottery ticket and won $20!",
        "I was so excited when I got a promotion.",
        "Last night I won a gift card at Trivia night at the pub. Going shopping today. ",
        "I had such a great time at my daughters 7th birthday party. ",
        "The happiest moment in my life was the day that we had our daughter. Even though it was a painful experience, words cannot express how much happiness she has brought over the years.",
        "Last Christmas, I had saved up quite a bit of money to buy all my family and girlfriend nice gifts. It made me feel warm and happy.",
        "i felt happy this morning because it was sunny and warm",
        "I was super happy when I got to bring my new puppy home.  We had been looking for the perfect breeder for a rotty for a long time and saving up money.",
        "I was so happy to see my kids face when I finally brung a puppy home.",
        "I love spending time with my family we just got back from vacation and I'm feeling so happy after the great trip we had. ",
        "I got a call from a friend that I haven't heard from in years. I was so happy to hear from her!",
        "winter is almost here",
        "My girlfriend moved in this weekend.  I was really happy that she moved in but also super happy that the move is finally over.",
        "its a good day",
        "music i listened to today",
        "My girlfriend and I have birthdays 8 days apart. We exchanged gifts somewhere in the between and it made me so happy, it kind of felt like Christmas in the summer!",
        "in 2 weeks time i will go on a holiday to see my wife ",
        "My friend who has been living overseas for the last year has finally came back. It's been a great time.",
        "I was so happy when my mom came to visit me!",
        "One time my mom bought an ice cream from Mcdonalds!",
        "i love helping people",
        "When my dad told me he was getting married, I was over the moon ",
        " When I got told that I had a new job, I was over the moon ",
        "When i proposed to my girlfriend, she said yes! I was so happy ",
        "I am so happy today because my peacocks just had 3 babies! They are so cute!",
        "just heard I got the promotion I was hoping for. I think I am going to burst.",
        "Back in highschool when i got my first car, i was so happy to finally drive alone and be free.",
        "I went fishing with my son a month ago, and didn't know how he'd do.  He caught 4 fish and was really excited!",
        "I moved last weekend.  I was really happy once all the boxes were finally moved over and it was all done.",
        "I am the happiest in my life when I am at the ocean. There is just something so special about nature at the ocean for me.",
        "My sister just gave birth to a healthy beautiful baby girl. I was so happy to meet my niece!",
        "yesterday when i finished the math formula ",
        "i am very happy, my best friend is getting married today ",
        "NASA released some free space posters a couple of months back. I picked a few that I liked, had them printed for a small fee and now they're up on my wall! I'm so happy."
    ]
}