{
    "threshold": 0.8,
    "seed": [
        "I am very happy to have been first over 300 students during this years at my enginering school",
        "I was so happy when I moved in to my new home. My girlfriend and I have been saving for awhile and we finally got the keys last month. Now we can finally move on with our life plans.",
        "My daughter, who has a fear of water, has learned to swim this summer! She still gets a little nervous, but overall she loves it!",
        "I turn 29 today! It is a great day since its my birthday",
        "Went out with my friends last night after not seeing each other for a year. I was in another country for work and just got back.",
        "I was joyful when my son was born.",
        "The summer is almost over. I couldn't be any happier!",
        "I passed all of my classes last semester. I had been struggling in college for a while.",
        "When I got the results back to all my finals for last semester of college. I thought I might fail but I passed all my classes.",
        "We moved to a new house last year and love it - and have spend much less working on projects and more time with the kids.",
        "My sister is coming from France to visit us. I am happy to see her again.",
        "When the Washington Capitals won the Stanley Cup i was in such great spirits. I ran into the streets of DC celebrating. I couldn't believe this was happening.",
        "When my daughter was born I was so happy and excited.",
        "I am so happy its the weekend.",
        "When Argentina won the semi-finals in 2014 I was so excited! I screamed so much!",
        "I felt very joyful when I found out I got accepted into a good college that I tried hard to get into, plus my friends were already there",
        "My dogs passed away 2 years ago. My family adopted me one this past weekend on my birthday.",
        "It is hard to express how I felt when my kids were born. It was as if my heart grew 3 sizes that day!",
        "I am so happy.",
        "One of my favorite past-times is going to theme parks such as Disney. It makes me so happy!",
        "After 4 months of going on interviews.  Today I finally got a job!",
        "I have been working so hard and my vacation will start tomorrow. ",
        "I was super happy and over the moon when I passed all my classes last year.",
        "I was celebrating my sixth anniversary with my boyfriend. We were sitting on the beach around sunset, it was totally secluded and beautiful. My boyfriend proposed to me and I was so elated.",
        "I happened to have all the ingredients in my fridge to make my favorite sandwich.",
        "I went to the mailbox today and I received 5 acceptance letters to medical school.",
        "When I won the spelling bee in 4th grade i was so happy.",
        "I'm so happy I found a new job!",
        "I will be seeing my son tomorrow after  a month.",
        "I was joyful when my brother was born, ",
        "I randomly bought a lottery ticket recently and won $250, I felt pretty good about that brief streak of luck!",
        "The birth of my nieces were some of the best times of my life. I have four.",
        "When i moved out of my parents house i was so happy. No more rules from them and i owned a place to myself was freedom at last.",
        "I took my girlfriend to my school dance the other night. It was truly a magical experience.",
        "I got a new job!",
        "I got really happy when my dad surprised me with my first car. I cannot remember feeling so joyful",
        "I lost my job and was in danger of losing my home to foreclosure. My family loaned me money and saved me from that.",
        "I won the lottery last week. I was so happy.",
        "I had a baby last month, so happy.",
        "I won then lottery, I never have to work again.",
        "I have plans to go meet my best friend who I haven't seen in 10 years.",
        "I recently received my teaching certificate",
        "Recently, I just received an unexpected bonus at work.  It was given to me for working extra hard on a project!",
        "I was very happy when I got accepted into graduate school",
        "I am so happy it's summertime.",
        "I felt so much wonder and awe when I went to the beach. I was surrounded by such profound beauty, and I spent my entire day swimming, sunbathing, and laughing with my partner. It made me so happy.",
        "I feel very happy when my children are happy!",
        "I recently got promoted at my job. It was something I had been trying to obtain for a long time.",
        "work is going good ",
        "when i had a good day and everything went awesome ",
        "When my brother got married back in April. I was a bridesmaid and it was a beautiful ceremony. At the reception we all danced and had fun.",
        "was happy to see my dog return home!",
        "I just rescued a dog that was abused, overbred and starved. She is only a puppy. I am so happy that she is no longer suffering.",
        "I got a shotgun for Christmas last year. I was so happy to use it to hunt small critters!",
        "I got a promotion at work that was completely unexpected. It was actually a very nice day!",
        "I got a new puppy recently. I had been looking forward to it for so long.",
        "I was so happy when my son won his swim race.",
        "I am so happy it is almost August.",
        "I am so happy I just retired for my job of 40 years",
        "I fixed my plant hanger today with a new hook screw that had been stripped and broken for a couple weeks.",
        "i got the tire i always wanted to buy, it was expensive but worth it",
        "I saw some baby ducks that have been in the creek behind my house and so far they are all still alive. So cute.",
        "I won $100 on a scratch off ticket the other day. I needed that cash.",
        "Reading to my neice",
        "I'm very proud of my two daughters for their musical ability.",
        "that i am going to be selling my house!!! ",
        "that i am going on vacation tomorrow! ",
        "I was so happy when i moved out of my parents. I never felt so much freedom and was extremely happy.",
        "I'm going on vacation tomorrow",
        "I am so happy school is back.",
        "I was ecstatic when my kids came home yesterday.",
        "My sister just had a baby two days ago! It's been pretty hectic, and while I'm not looking forward to having to help with diapers, I'm proud of her and happy that she's healthy.",
        "We went to a Ski Resort with my friends this Spring Break in Colorado. It was very special for me",
        "I remember when I went over to my friend's house because her dog just had puppies. It was so exciting and I was so happy! What an amazing thing to see!",
        "The day my daughter was born.",
        "I was overwhelmed with happiness the day my daughter was born.",
        "When i graduated high school.",
        "I'm moving to New York to pursue my dreams!",
        "I felt joyful on a childhood holiday. My parents took me to Disney World.",
        "I asked my girlfriend to marry me.  I am so happy she said yes!",
        "I won a lottery",
        "I watched a film recently at the theater and it was really good, so that made me feel happy.",
        "that i am going to a concert after work ",
        "Once I had a difficult pregnancy. After the baby was born and both he and I were healthy and safe, I was so grateful.",
        "i just bought my first house",
        "I remember when my first child was born.  I was overcome with pride and happiness!",
        "I am happy to have my girlfriend of almost 3 years, she is amazing!",
        "I am happy right now, I have a girlfriend, a good job, and a good group of friends",
        "I got a call informing me I was selected for a job offer",
        "I am happy right now, I have a girlfriend, friends and a good job",
        "I am content right now, I have a girlfriend, a good job, and a good group of friends",
        "when i found out i had a birthday party planned for me ",
        "I recently found out I am getting a pay raise at work! It has really raised my morale!",
        "Recently I bought a keyboard that I was looking forward to buying for a long time. My old one kept double-tapping on certain letters. I was so happy when it arrived, I took it out of the box and I have had so much fun using it since then.",
        "Once, I won $2500 at the casino.",
        "There are a lot of things to be depressed about in this world.  But if there's one thing that warms my heart it's seeing all my bills paid, debt nonexistent, income far greater than expenses and a nice fat check from tax returns at the end of the year.",
        "I was going to a concert once and then I learned of a 25 thousand dollar drawing. I was automatically entered from my ticket and I won!",
        "I am so happy these days.",
        "I got a raise yesterday! It made me so happy and that my hard work was noticed.",
        "I am so happy with my life.",
        "My husband's grandmother came to visit us, we got to spend time together and go to the beach and aquarium with our kids. It was so nice.",
        "I get to fly up and go see my girlfriend in Boston soon!",
        "I stop taking people serious after i realize that my wife of 5 years had a baby without telling me",
        "I get to fly up and see my girlfriend in a few weeks! ",
        "I'm pretty happy that my daughters have a day off from school today.",
        "I was so happy to see my Mum when I havent seen her for 6 months since I have been abroad . ",
        "I was really excited when Friday came",
        "I'm always happy around my two daughters.",
        "when my dad bought me a car ",
        "I was really excited to see all my daughter's hard work pay off at the recital",
        "I was so happy I got to see my cousins when they came in town",
        "I just heard that my aunt, that haven't seen for some years will be visiting.",
        "I was so happy to have my nephew spend the weekend with me. ",
        "I really liked being able to coach my daughters softball team. ",
        "I was walking down the street the other day and I found 20$ just sitting there on the ground! I was so happy!",
        "Going on vacation this weekend. I can't wait!",
        "The adoption people called me about the dog we applied for. Think we're getting him!",
        "My best friend is getting married!",
        "My son graduated from high school this year. He should have graduated last year, but didn't have the motivation to do what was needed. I was so glad to get that diploma in the mail.",
        "Haven't seen my friends in a while, we had such a great time at the lake.",
        "Pretty excited to go shopping",
        "I proposed to my girlfriend and she said yes! I am so happy!",
        "My baby walked for the first time the other day!  I am so delighted.",
        "i was happy when Lebron signed with the lakers",
        "I just got a new promotion. This makes me so happy when I think about it.",
        "I finally saved enough to build a new PC! I've been looking forward to it for many months now",
        "I remember opening presents at Christmas. I was so happy spending time with my family and enjoying the holiday goodies.",
        "I got a promotion at work recently, and that left me a very happy boy.",
        "I loved seeing my nephew open his birthday gifts. He was full of pure happiness.",
        "My dad bought be a Porsche.",
        "I am so happy my sister just had a baby!",
        "I've played the lottery every week for years. This week I got the winning ticket. I'm so happy!",
        "I was so happy last week when it was fridaaay!",
        "I was happy when i woke up and it was friday!",
        "I entered a contest to win a free vacation last month. Much to my shock I won it! So I will be going to Puerto Rico for free at the end of the month!",
        "I care a lot about all the little birds in my neighborhood. I am a sensitive soul and I just want to help every critter I see.",
        "When I purchased my home.",
        "Got a coupon for free coffee. It's not much, but $5 is $5.",
        "I'm so happy that my cousin got a full ride scholarship! She really worked hard for this chance to be successful!",
        "When I came home the other night and my wife prepared my favorite meal.",
        "Tomorrow is my birthday! I'm so happy its finally on a weekend.",
        "My son recently graduated from high school.  I am so happy about it!",
        "My company will give us a bonus because the quarter was good. I am happy.",
        "I was pretty happy to find out I was having a girl",
        "I feel like blowing a trumpet I am so happy.  I got my medical marijuana card today.",
        "School is starting back and I get a break from the kids.",
        "I am so excited to go to the park with the kids today",
        "Sitting outside on a nice cool day and watching my kids play outside is very pleasing. ",
        "I felt really happy last night when my abused dog started running around and playing! I didn't think she was capable of it.",
        "I was pretty excited to have a night out with the girls",
        "I am so excited to spend each day with the kids during the summer",
        "This new Korean barbeque place just opened up. Will be nice not to have to drive more than 30 minutes to one anymore.",
        "I was able sort out some communication problems that I had with my manager. I can finaly enjoy my job with peaceful mind.",
        "I love that I have friendly neighbors that like to sit outside and have a bee on the weekends",
        "I am happy to snuggle in my boyfriends arms and watch tv all day tomorrow",
        "I was very happy to have the whole family at my house for Easter",
        "It took me 3 hours to mow the lawn. I'm glad it's done.",
        "I've had family visiting for the past couple of days, some cousins and an uncle and aunt that I haven't seen a long time. It's always great to be reunited with family, especially after you get over that first initial weird social hump of feeling each other out after not having spoken for a long time. It's crazy to see how much the younger cousins have physically changed! Anyway, it's been a blast playing games and catching up with them.",
        "I was hapy when i got to leave work early!",
        "I watched my daughter be born this morning.  It was one of the best days of my life!",
        "I got an extra 2 days paid time off from work.",
        "I was so happy to see my brother last weekend. It had been forever",
        "My husband is coming home after a year abroad in the Army.  I'm about to burst I'm so happy!",
        "ended up getting a pizza from Costco. I'm so hungry.",
        "I won a year of unlimited pizza. I'm so psyched.",
        "I am so happy theses days.",
        "I am excited for summer to be over soon",
        "I bought my parents a new car last week.  I am very happy about it.",
        "My family is coming to visit me soon, and it has made me very happy.",
        "My son just got engaged to his girlfriend.  I am so happy!",
        "I was dancing when I heard I will be a grandfather.",
        "I was adopted and searched for my real family my whole life. I finally found them and we are about to meet for the first time.",
        "I found my grandfather's old watch that I thought was lost. I was so happy to find it as he gave it to me as a kid",
        "I was so happy to see my nephew born recently. He was so tiny!",
        "I was happy to see lebron leave the cavs for the lakers",
        "i was happy to see that i was able to get a new pet the other day",
        "Had friends over to watch the UFC fights last night. We had dinner and drinks too.",
        "I am so happy!  I just went to the casino and I won 1,000 on a slot machine.",
        "I found out my wife is pregnant today!",
        "I am so happy.  I met this really hot guy on Live Chat.",
        "I just completed my storm shelter. I am very excited!",
        "My friend got a new puppy and I got to play with it for a while, it was a lot of fun.",
        "my friend had his baby boy",
        "I was pretty happy when I graduated high school. I felt like I completed something",
        "My brother come home from the war",
        "I told my mom that I didin't want to be in compsci anymore, because I was really miserable. She said that I should do what makes me happy.",
        "Just came back from the park. I saw so many dogs and oddly enough, cats.",
        "I'm going to ask my girlfriend of 10 years to marry me next weekend.",
        "My mom is finally coming to America after years of waiting for approval.",
        "I am so happy that I quit my job. I hated that place",
        "My Grandma, whom I absolutely love and is the best Grandma, is moving back to my city to live here! I never thought she would but I can't wait! ",
        "I've been with my wife for 13 years.",
        "i was happy when i got promoted a few months back",
        "I was very happy when my friend invited me over tonight. It had been awhile",
        "I wasn't able to go to California for a family reunion and a friend of mine paid for tickets for my husband and me! I haven't seen my family in years and she made my year, my century! ",
        "My child said his first word the other day! It wasn't mama or da-da, but at least he's making progress! His first word was \"one.\" Not the most meaningful or memorable, but I'm just proud of him anyway.",
        "i was happy when i saw lebron james go to the lakers",
        "I received my first check from my first job yesterday. I am happy. I am finally financially independent.",
        "I get so happy when I get to visit my family over the holidays. It is my favorite time of year!",
        "I found $50 in my desk drawer at work.",
        "My friends invited me to go to the movies with them after work. I haven't been in many years, so it will be fun to see how it's changed and to catch up with them",
        "i was happy when my wife brought home our new tortoise ",
        "The abused dog I took in is finally RUNNING and playing. I didn't think she had it in her. It is so nice to see!",
        "I just got cable again and I missed watching babytv with my son. It is definitely his favorite.",
        "I had been out of work for a long time. I finally found a job that I really wanted!",
        "I just got a raise at work.  I am so happy about it.",
        "I got a free gift card from work!",
        "Had a great weekend with the kiddos",
        "I haven't had fries in over a year. Finally got some today.",
        "I am feeling happy I can afford what I need for the past few months. It's nice to be able to get something if you need it.",
        "I just found out that my parents are moving back near me!  They'll be here in about a month!",
        "Went to the carnival this past weekend. It was a lot of fun.",
        "My feeling when ky favorite aunt picked me up from school",
        "I suffered from such terrible acne when I was younger that thankfully, I rarely ever have when I started college.",
        "My dog returned home after running away. I was so happy.",
        "my niece started liking me",
        "I was so happy when I got my new puppy! I got him from an adoption rescue.",
        "I have registered to a gym and received my membership card. I am about to start my training tomorrow",
        "I was playing soccer with my friends and it was a really close game. I managed to make the game winning score and it made me really happy.",
        "Going to disney world in december!",
        "I really wanted to go on this trip to Texas and I didn't think I'd get to. Then a spot got unfilled and I got to go on it!",
        "I was happy to get invited on a trip for next week",
        "my girl has been promoted im excited",
        "I once had the best time at the play playing with my children!",
        "I am overcome by joy when I'm with my son's",
        "Christmas is coming I can't wait for the joyous celebrations ahead",
        "My son have got his engineering diploma last week. I am so happy.",
        "I was so happy to see my baby",
        "After a week of long practice, I managed to win the golf tournament I was preparing for!",
        "I proposed to a girl last week. She accepted my proposal and we're glad to start our journey of love.",
        "I received a promotion.",
        "My family and I went to the county fair last night and had a wonderful time.",
        "The rally is here and the weather is beautiful!  Time to head out on the motorcycle.",
        "I'm working on being happier on a day to day basis.",
        "Today is the day for me to receive my paycheck. I am very excited!",
        "I am looking forward to my work vacation. I will take my wife to the mountains!",
        "Recently hired a second person to work with me and I am optimistic they will help as sell more cars",
        "I was ecstatic this past week, my son used the potty for the first time ",
        "I got accepted to Harvard, I am so happy.",
        "I'm joyful that I have a wonderful and supporting family.  Who knows where I would be without them.",
        "I'm joyful that I get to see my wife for the first time in a week tomorrow. I missed her a lot.",
        "You never know how happy you can be until you try",
        "I'm going to have a baby soon, our third child!  I am ecstatic!  I think we're done after 3 though. ha ha.",
        "i was waiting all week for saturday morning and i got great weather. i was extactic",
        "i was happy to see that my dog found his way back home!",
        "I was happy when my brother moved home. I missed him",
        "I won free ice cream!",
        "I finally found a music streaming link that plays fairly new music and not just the same thing repeatedly.",
        "I can just imagine what gets every so happy at christmas",
        "I felt this way after my son was born. It was an amazing time.",
        "I'm so glad music is more freely accessible now. When I was younger, everything was at least $10 if i wanted to listen to an album.",
        "i got a surprise gift in the mail",
        "I am over the moon about my son graduating from college this year.",
        "Had dinner with my family not too long ago. It's nice seeing everyone together again.",
        "i was happy to see that i got approved for my vacation next week",
        "I was happy when my brother got us play tickets. I wanted to see it for a long time",
        "i was excited when i got approved my for my vacation",
        "I finally got around to making mug cake.",
        "My best friend will come visit me on Friday, so I am feeling pretty good.",
        "Entered my dog into obedience training, and he graduated at the top of his class! I think they give all dogs that kind of distinction to make the owners feel better.. but I'm happy we're through it and that he's much better behaved.",
        "Going to get some pizza after work. I love pizza.",
        "My brother just told me his wife is pregnant.  I could not be happier for him.",
        "Took the kiddos to the lake",
        "My family is coming to visit!",
        "My husband is coming home from work soon.  I am so happy to see him.",
        "I just booked my fall vacation in Boston.  I have never been",
        "I just found out that my wife and I are expecting our fist baby.  I am super excited",
        "I was at a party recently. The guest were very friendly and fun.",
        "I just got a raise that'll kick in in February.",
        "I went to a sporting game the other day and my favorite team ended up winning!",
        "I have just received a message from my sister. She is coming to visit me soon!",
        "My sons first birthday. It is crazy how quickly a year goes by, I was so happy!",
        "I knew I was looking forward to the birth of my first daughter, but I wasn't expecting that feeling when I saw her for the first time.",
        "I remember the time me and my partner had our first child. I remember them handing the baby to me. Instantly I knew that this was what life was about.",
        "I recently went on vacation to Florida and it was so relaxing.",
        "I am at my most zen when I'm alone.  I'm not a loner but I feel that having peace of mind all to myself is a gift that most people take for granted.",
        "I found out my sister is pregnant today! She's been trying for years.",
        "I used to be mad when girls wouldn't text me back....but now I'm more happy being unattached and busy making money and as a result they're the ones chasing me now",
        "I watched the new Smash Bros video and they're coming out with some of my favorite characters. I can't believe this is happening, I've been wanting these characters for years. Now I gotta wait for the game to come out.",
        "I am so happy that the preseason for football starts tomorrow, the Eagles play tomorrow, that is awesome",
        "I felt this way after the birth of my son.",
        "My two daughters make me a very happy man.",
        "I aced my final math test today. I was so hyped.",
        "I won free grocery! I kinda of wish I would have bought more now, haha.",
        "I got this pizza with 7 toppings and extra cheese. It's heaven.",
        "One day I heard my house bell ring. I ran to the door as fast as I could because I knew my iPhone 7 had finally arrived.",
        "I found a new restaurant, and they charge about $5 per dish.",
        "I am happy about an upcoming meeting between some of my old friends this weekend.",
        "I'm so glad I have enough money saved in case anything happens.",
        "when you go to a restaurant and they did not mess up your order",
        "every time i get payed ",
        "My parents are coming down for Christmas! What a great gift!",
        "On christmas morning last year, i got everything i wanted.",
        "My dogs love to lay on me!",
        "i just went on a vacation and i was very happy i needed it",
        "My best friend came to visit me for two weeks, I hadnt seen her in years.",
        "I am so happy that I get to see Foreigner in concert next month.",
        "I'm in a great mood, it's almost the weekend!",
        "I just proposed to my girlfriend and she said yes.  I am so happy.",
        "The start of school is soon!",
        "I am happy today I can feed my birds and get everything I need and there is no drama.",
        "i am so happy after giving birth successfully. i feel so blessed",
        "I'm living life to the fullest right now.  I live in the present and I'm loving it",
        "My son was hit by a car while driving and half of the car was crushed, but he was virtually unscathed!  I'm so happy!",
        "Being a child was the best. I just remember laughing and running on summer days with my friends",
        "I'm really happy I get to see some friends when I go back to school next week! It's been months.",
        "I get to go home in 30 minutes!",
        "I paid off my car!",
        "I felt great when playing outside with my dogs earlier today. We had a lot of fun running around and throwing the ball.",
        "I found out I'm going to a surprise Disneyland trip this weekend!",
        "I have a fun date planned for this weekend, so I am pretty happy about that.",
        "I was pretty happy this morning. A friend made me a nice breakfast",
        "When the Eagles finally won the superbowl, I was so so happy, I cried even",
        "I am so happy with the way the new super smash bros looks, it seems awesome to me",
        "I am really happy with how my life is going right now, not many complaints!",
        "Got a Costco cake. For myself.",
        "i was happy when i got the day off!",
        "i was excited when i saw i got tomorrow off!",
        "My life is so great",
        "i am happy its almost the weekend!",
        "I'm ready for the weekend!",
        "We tried for 4 years to get pregnant.  Finally we were and she is 18 now.",
        "I won a dollar playing the lottery yesterday. It was very nice.",
        "I finally got the car of my dreams today. A brand new mustang!",
        "My sister just had a baby. I'm so excited for her.",
        "I think my son will be able to start school early. I am excited",
        "It's finally Friday and I'm just so happy about that fact.",
        "I was so happy when my daughter got married.",
        "I am happy when my kids are happy and they are always happy",
        "My dog just had puppies.  I am so happy to see them.",
        "I was so happy when I found out my wife was pregnant.",
        "I'm getting ready for the fire camp. I'm eagerly waiting for the fun and joy.",
        "I had a great family holiday at disneyworld when I was twelve",
        "i am happy that its almost the weekend!",
        "i was happy to get the weekend off!",
        "nephew being born",
        "i was happy when i saw it was approved for the weekend off",
        "The day my first grandson was born was so happy for me. My heart swelled to look at the tiny person who was the newest member of our family. I was over the moon.",
        "Cant wait for halloween to get here",
        "My work seems to be picking up lately.",
        "I'm glad the weekend is finally here.",
        "I went to a vacation and was able to ride in the water with the dolphins.",
        "Things have been going well for me lately.",
        "I'm very proud of my daughters.",
        "It makes me happy when I come home and my cat is waiting by the door to greet me",
        "Get to hang out and play cards with my girlfriend and her parents. Her parents are actually pretty laid back and fun to be around, so I'm looking forward to it. Glad I don't have to deal with overbearing in-laws like some people.",
        "I get to go to Australia in a few weeks! I've never been so I'm excited to go",
        "I stopped by the gas station today to fill up the car.  I bought a scratcher too and won $2500!",
        "I'm happy I can afford to take care of my health. If i need something special or specific, I can just buy it usually. I have almost never had a time like that in my life.",
        "When my job got me a present.",
        "I just got a bonus at work that I wasn't expecting!",
        "I am moving to new appartment. The new neighborhood is so nice. I am so happy that I found this appartment. ",
        "I collect antiques and I found a really old coin. It was a great deal to so I'm so excited!",
        "I felt this way when I held my son for the first time.",
        "The new Mexican place is going to be so good!",
        "I'm loving life right now. Both of my kids are married and moved out, my house is paid off and I'm retired.",
        "It's been such a terrific week!",
        "it feels so good for the braves to finally be good again",
        "I'm going to a seafood buffet later with my fiancee, so I am pretty excited.",
        "I wrote an exam, and it was a success",
        "My Vacation is coming up, looking forward to it. i am very happy getting these leaves",
        "It's finally the weekend, woohooo!",
        "I jumped for joy when my baby was born.",
        "I'm going to start my world tour soon. I'm excited to see the world.",
        "I still remember when my dad got me an xbox",
        "I proposed to my girlfriend and she said yes.  I am so happy she did.",
        "I'm going to have dinner with my parents tonight, which makes me very happy.",
        "I was going to visit my grandmother today!",
        "My last semester of college was done.",
        "I could ask for a better wife!",
        "I get to go to Italy in a few months! I've been wanting to go there forever",
        "i was happy to see i got next week off",
        "I get to go home to see my family. I'm so excited!",
        "Got a $100 Costco cash card. Gonna spend it all at the food court.",
        "I was speeding, because I was worried about my mom.",
        "i am happy that the kids return to school next week",
        "I have money saved up, I am making extra money the past few weeks and there has been no big dramas. It's a good week!",
        "I am so happy the kids are going back to school!",
        "Tomorrow should be fun. We are going hiking and kayaking",
        "i'm so blessed. i have a great husband and together we have built a good life .",
        "I'm so happy about going camping next weekend!",
        "The time I went camping with my family. We saw some deer.",
        "When I got to go a concert for my favorite band. They rarely play.",
        "I won a stuffed animal in the crane machine today! It was a cute one too!",
        "I won the table-tennis competition that was held in our college among students. I was given an iPad as a prize",
        "When I got my first dog, I love her. She's a husky.",
        "I am so happy for my sister",
        "I love my new car.",
        "i am happy about next week",
        "My boss brought me coffee at work, which made me feel very happy.",
        "The day I had my children. Each one was a joyful day for me",
        "I am going to eat some BBQ later.  I am so happy for it.",
        "I was happy when with my friends when we had our sentforth programme",
        "I have been jobless for 14 months. Last week, I finally got a job. I am so happy.",
        "I had some financial problems. I finally paid all my debts. It is a big relief. I am so happy.",
        "I recently won a small fortune on the lottery. It was amazing to have some extra money and it paid for my holiday!",
        "I went to the casino last week and won 1,000 dollars on the slot machine!  I could not believe it!",
        "I was so happy with my colleagues",
        "I went to celebrate the winter holidays with family. It was so nice to see everyone, enjoy a delicious meal and exchange gifts ",
        "Today is going to be awesome!  We are going to the lake to see all of our family!",
        "I just found out I am pregnant after years of trying! I've had so many disappointments but it's finally happened!",
        "every new years im just so happy",
        "I'm really enjoying a peaceful Sunday afternoon.",
        "We finally fixed the air conditioning for my car. When I got it for the first time to use it, it felt like heaven.",
        "My dog didn't poop on the rug today. I was so happy.",
        "I was on the edge of my seat waiting for my grade in physics to be finalized. When I realized that I got a B, I was so happy.",
        "A few weeks ago I went to a baseball game. My team was doing pretty badly but in the end they managed to pull it together and win the game. I was so ectastic!",
        "A couple weeks ago I went and got a free smoothie at Tropical Smoothie. I love their smoothies.",
        "today when i got to go shopping ",
        "It was a happy weekend. I got to go kayaking with friends",
        "i was excited when i got approved for my vacation",
        "i was happy when i got approved for a vacation",
        "Getting accepted to the school of my dreams. I'm studying business administration.",
        "The new WoW expansion comes out today.",
        "Was able to pick up an additional scholarship to help with college tuition for this upcoming semester.. I guess any little bit helps, considering how much student loan debt I'm already in.",
        "My brother and his wife just had his first baby, I am over the moon for them!",
        "I am pretty happy that we are taking a trip at the end of the month. I am going to need it",
        "I just deep fried a whole turkey all by myself, first try! I can't wait to share the feast with the rest of my family they're gonna be so excited.",
        "So happy I got my momma dog a new bed today. I had to go to a few different stores. They normally have a ton at the stores I go too but somehow when I need one they are out!",
        "I was happy to go on a trip for my birthday",
        "I'm happy when I eat gourmet ice cream",
        "Our new baby newborn pup here is getting bigger everyday! I didn't know if he would make it, so it's really sweet and happy to see!",
        "I had been trying to have a baby for a long time. Suddenly I found out I was pregnant. I was so happy. ",
        "I am going to be happy this week. I have family coming into town",
        "I just found out I got into medical school.  I have worked so hard for years just to be able to get accepted",
        "I got pretty happy and content over the weekend. I got to smoke a cigar and read comics",
        "When I made the baseball team in school. It was difficult.",
        "I am so happy my lease is almost up on this apartment. I am going to move into something bigger and better",
        "I'm playing the new WoW xpac :D",
        "I have had a great week!",
        "When my friends brought my cake to work. I love them.",
        "My dad's cancer is getting worse day by day. I fear that i am counting his last days!!",
        "I am so happy.  I start my new job this week",
        "I finished my final semester of college today. Never been so happy in my life!",
        "I was just able to pay off my parents house!",
        "I was so happy France won the world cup. I was just so happy. I had a smile  on face for day or so",
        "My best friend is coming to visit me.  I am so happy to see her.",
        "i was happy when i got the weekend off",
        "i was happy to get the weekend off",
        "i was happy when i got approved for the day off",
        "Today I am going to meet some old friends from school.  It is been years since we have seen each other, ",
        "I cant believe my daughter performed so well in the recital. She practiced so hard for it",
        "I'm so glad that summer is almost over.",
        "I was outside playing with my dogs today and felt wonderful enjoying the nice day!",
        "I was at the store and I dropped my wallet without knowing. Luckily some nice man gave it to me later in the trip! I was so surprised! ",
        "I got a new car, I am so happy.",
        "i was happy to get approved for the weekend off",
        "I've been so happy lately, everything seems to finally be falling into palce",
        "I really like summer time and going to the beach",
        "I love it when I get free samples at Costco",
        "I really enjoyed my time in Tokyo, it was a great experience",
        "I love my dogs, I get to see them when I visit my parents",
        "I got a raise today at work. I was not expecting it!",
        "I was outside playing with my dogs earlier. We were throwing the ball around and I felt great!",
        "I really like getting drunk and/or high. Tonight I got drunk with my friends and it was a great time.",
        "I had a get together tonight with my coworkers and it went very well. I'm feeling very good about life right now.",
        "I was playing with my cat earlier with a laser pointer and he was having such a great time!",
        "I won the lottery, its party time.",
        "Wednesday is halfway through the week. I am excited and ready for the weekend.",
        "My brother is starting his first semester at the college I wanted to go to but could never get into. I am very happy for him. He was scared to accept the offer at first because he thought he'd hurt my feelings. I told him that was crazy!",
        "I was at the store and I saw a 5$ bill on the ground, I was so happy!",
        "I was walking down the street and I found a 20$ bill! I was so happy",
        "My sister just told me that she is having a baby. I'm so excited for her and her husband!",
        "We are having a birthday party for my mom this weekend.  I am excited to see all of my family.  I think it will be a fun time",
        "I was at the store the other day and some old man offered to pay for my drink! He said he didn't want anything in return, he was feeling generous!",
        "i'm so happy with the life i have i'm honestly blessed",
        "I am happy with my life right now",
        "I just found out my sister is pregnant!  I'm going to be an aunt again!  They've been trying for a while so this is great news.",
        "The day I got accepted to my dream school. I worked so hard to get there.",
        "I'm ecstatic like Matt Hughes slammin Newton on the mat it's a fact haters mad cuz I got dapper swag got the ladies stariin like who daaat",
        "I just got a raise at work! It feels good to be rewarded for my work!",
        "I was pretty happy tonight. I got some wings and beers",
        "I went on an amazing vacation in Aruba. ",
        "When I got my marks back on the math test. Scored a 95%>",
        "My brother is getting married! I used to change the dude's diapers.",
        "My dog was missing for two days.  When I came home from work, she was standing at the front door!  I thought I had lost her for good.",
        "I'm really happy in life right now. I have my cat, books and can eat all the good foods.",
        "I watched the election results come in until early in the morning. As the tally rose towards that magic 270 a single tear runs down my cheek. We really did it. We're going to make america great again",
        "Playing with the kiddos outside today",
        "Christmas is my favorite time of the year.  I could not love it more.  And I start shopping now, so I'm already in the Christmas spirit!",
        "I was getting ready for work when my boss called and said I could take the day off with pay. He made my heart sing I was so happy.",
        "Last week when my first daughter was born after a complicated pregnancy and almost having her being born in the car",
        "I'm so excited for the weekend! This summer has been so much. I got a new car, new job, and a new place to live. Things are going well.",
        "This weekend I get to go to the beach. I haven't been in a long time. It one of my favorite places to go.",
        "The day I got married was the second best day of my life! It was beautiful! ",
        "I am so happy I just got a new puppy! ",
        "I was so happy when i got a job",
        "Last week,  my dad bought me a gold watch for my birthday , I was so happy ",
        "I will never forget when my daughter was born and they handed her to me for the first time.",
        "I just won a contest for a free air fryer! I've never used one before but I love frying foods! I think it's going to be an awesome addition to my kitchen.",
        "Last Christmas, both my boys were here for Christmas. It was such a happy time",
        "Whhen I was 13 my dog got out the yard and we could not find him , I cried all day thinking he was dead. But the next day when I got home from school my mom was in the yard and she had our dog and I was so happy that nothing had happened to it.",
        "I have been feeling very happy lately because my boyfriend and I have finally started to get serious in or relationship. ",
        "My aunt that I had not seen in 10 years came to visit me last weekend from Spain.",
        "My son recently got married, and I gained a new daughter in law. The wedding was beautiful, everyone had a great time !",
        "Am very happy to have the best family in the world",
        "My son placed third in his jiu-jitsu competition.  I was so happy for him.",
        "My wife and I went swimming at a hot water beach in New Zealand. It was super fun.",
        "I am going camping tomorrow, it's one of my favourite things to do in the summer!",
        "I got a promotion at my new job.",
        "Everyone in my family was always very happy during Christmas. t makes me happy to think of it.",
        "I got to spend the day relaxing at home with my girlfriend.",
        "I went to visit my dad who I haven't seen in years this spring. We had a really great time catching up.",
        "When my husband and I first decided we wanted to have a baby we were both really nervous. I still remember the day I found out I was pregnant. I was so excited to tell my husband. I went out and got a card and a gift for him to surprise him. It's one of the happiest moments of my life.",
        "I am finally pregnant after years of trying!",
        "christmas",
        "I was thrilled when I got the chance to attend a Tony Bennett concert in April. He is 92!",
        "My kid starts preschool in a week.",
        "I got a brand new car from my daddy. It is expensive too!",
        "My daughter who is 21 moved out recently and she came home to visit me.  I was overjoyed to see her.",
        "I just bought a new puppy and super stoked about it!",
        "I remember as a child when I got my Nintendo 64 how happy and excited I was. Best christmas memory I have.",
        "I watch my daughter sing in a play. it was so nice to have her do that",
        "i just found my keys",
        "When I took a pregnancy test and found out I was pregnant with my daughter, I was so happy. It is one of the few life moments that I can picture as if it happened five minutes ago.",
        "I finally have enough money to quit my bad job. It has made me miserable for years.",
        "I took my son to the fair. you should have seen his face light up",
        "My entire family was able to make it to our reunion. I was so happy to see them.",
        "I finally graduated after 4 years of traning!",
        "I am going to my favorite restaurant tomorrow i am so excited.",
        "I won free tickets to a my favorite band!",
        "My mother got me a new puppy. A small blue eyed husky.",
        "I alwasy get so happy during the holiday season. It's coming up soon",
        "My best friend is coming to visit me tomorrow.  I am so happy to see her.",
        "I saw my 3 year old nephew yesterday for the first time in awhile",
        "I'm so happy. I had a great lunch at a new sushi place downtown.",
        "my wife makes me happy",
        "red dead redemption 2 is coming out which looks awesome",
        "watching my son take first steps",
        "I was very happy when I found that I am getting a bonus from my employer.",
        "My sister just had her first baby.",
        "I went to the Grand Canyon for the first time during winter. It was breathtaking. ",
        "I just won the lottery!  I was finally able to pay my house of and my parents' house.",
        "I met a lady a few weeks ago and we've been texting almost every day since. We're going out next week and I feel really good about it. ",
        "I went to the casino with my spouse, lo and behold I won a large amount of money.",
        "I am happy with my life right now, everything is going well",
        "I have wanted kids all my life. I finally gave birth to my first child! This is that happiest I have ever been.",
        "I just won $300 dollars on a scratch off ticket. It feel really good. I can pay some bills with it.",
        "My daughter received several awards at the school awards ceremony. I was proud of her hard work to earn them.",
        "When I was a kid I used to live in Hong Kong and we would watch fireworks during Chinese New Year with a parade of dancing dragons.  It was pretty sweet",
        "My husband comes home tomorrow from a month long business trip!  I am so excited and cleaning the house and getting things all ready!",
        "My boyfriend recently proposed! My heart was filled with happiness!",
        "I cannot wait for Christmas!  It is such a happy time!",
        "My wife just gave birth to our 11th child. ",
        "I was at the store and I found a twenty dollar bill on the ground! I was so happy",
        "I am feeling this way right now in my life. I have so much to be thankful for.",
        "I won the lottery last week. i have never had this much money",
        "I am going to be really happy next weekend. I am going on a nice little trip",
        "I got a scholarship for college.",
        "I was so happy for my brother, he won a karate tournemant.",
        "My favorite time of year is the holidays. I love getting together with my family and talking about our lives. It is such a merry time.",
        "I won the MVP award at a hockey tournament. I had 8 goals.",
        "I went to Disney with my family is was great!"
    ]
}