{
    "threshold": 0.8,
    "seed": [
        "I was at work, and my coworker was called into my bosses office. Then they were allowed to work remotely every monday. this made me jealous because I enjoy working from home",
        "I was jealous when my co worker kept getting top spot when i knew he was cheating. ",
        "My friend just bought a brand new car. My car hasn't worked for months",
        "I did not get the promotion at work that I wanted.",
        "I am jealous of The Rock.",
        "I had a girl that I was seeing one time and she asked if I wanted to come with her to meet one of her friends. I went along and the way she talked to her was so much more passionate and energetic than with me and it made me wonder what he has that I don't.",
        "I hate seeing new cars on the road. My car won't even move.",
        "My sister in law basically lives off of my mother in law and her kids get everything. My mother in law rarely gives our kids anything because we have the money to do it ourselves - and I get a bit miffed at times.",
        "My friend got a huge scholarship when he barely passed the PSAT. I was quite jealous that I was unable to do the same thing.",
        "My friend just came over yesterday and talked about how he met a super great girl and is going on a date with her sometime soon. Although I'm super happy for him, I can't help but wish I could be in a relationship myself.",
        "My best friend and roommate got accepted into a competitive master's program in Chicago and broke our lease to leave. I felt stuck while he got off and do the things he wanted to do.  He made me feel like I wasn't good enough anymore to be his friend. Meanwhile, I stayed in town and struggled to even finish my bachelor's while working a dead end job. ",
        "I saw my boyfriend commenting on another girl's facebook photos. It made me feel insecure.",
        "I am jealous of Brad Pitt.",
        "I wish I was Donald Trump. His life is amazing.",
        "I wish I was Batman.",
        "I wish I was Elon Musk.",
        "I am pretty competitive.  So when I saw a guy from my old high school post videos of him deadlifting 335lbs and getting attention from some hot chicks I went to the gym and had my buddy record a video of me benching 350lbs. I posted it and felt better",
        "I wish I was taller.",
        "I wish I was Lebron James.",
        "I can't believe Jeff got the promotion. It should have been me!",
        "I am so jealous of my friend Eric.",
        "The time my boyfriend got food without me.",
        "My sister in law, who should never have children, had no problems getting pregnant.  It took us 4 years.",
        "I have never been able to afford a car since we are pretty poor. My friend, on the other hand, has gotten 3 free cars.",
        "I couldn't believe how pretty my ex's new girl is. How did he ever get such a hot girlfriend? He is nothing special to look at.",
        "My brother is having it all while i am here on a spot. i want to move forward and i am angry about everything",
        "The other day my cousin emailed me. She mentioned that the whole family was about to head out for our annual family trip to the lake. I'm not able to go this year and I was so upset.",
        "I dont know why some people are greedy",
        "My friend just got the promotion that I really wanted and she has been in the company less time than I have.",
        "Some greedy pliticians are doing it again",
        "I sometimes feel jealous when other guys talk to my girlfriend.",
        "My brother has always had more friends than me. I know I should be happy for him, and I am, but I can't help but wish I had as many as him.",
        "Boy, I feel envious of my wife. She gets to work whenever she wants, and spends time with our daughter whenever she wants. I need to find a real job. ",
        "Everyone has a better car than I do. it makes me sick",
        "My friends are travelling in Russia to watch the Word Cup final because they won some tickets in a contest.",
        "My friend just got engaged. I am so envious because I don't even have a boyfriend.",
        "My neighbor is moving to a single family home, I'm envious!",
        "I felt really left out when my friends went to a theme park without me. It really bothers me that they didn't even tell me they were going. I really wish I could have gone",
        "My friend just got a job paying 20k more than me. I've got more experience.",
        "My brother won the lottery last month.",
        "All of my friends have these great jobs and travel so often, it isn't fair.",
        "that my wife gets to take a vaca from wokr ",
        "My cousin bought a really pretty shirt that I had been wanting.",
        "I wish I was Dwayne Johnson.",
        "I felt jealous seeing a man look at my girlfriend at the restaurant last night",
        "Last night, a man was staring at my girlfriend at dinner.",
        "One of old coworkers is getting married. I never thought she would.",
        "Yesterday, my brother hogged all of the Twinkies and ate the whole box. I was jealous that I didn't get to have one.",
        "Whenever I see Jeeps on the road, I get so envious! ",
        "I wish I was a musican.",
        "I saw my partner talking to her male college friend in the coffee shop. I became a bit mad at her",
        "There was a movie I really wanted to see. I invited a friend to go with me, but they decided they didn't want to go with me because they had already decided to go with another friend. ",
        "When I was a kid- I was very jealous when my cousin would get different presents then me on our birthday.",
        "My friend at work just got promoted at work. I thought that I would be too but it wasnt the case. I was not too thrilled to learn he was and I wasnt.",
        "Everyone on my street has a nicer car than I do. My car barely even starts.",
        "All of my friends are married. I can't even get a decent boyfriend.",
        "MY froend just bought a buibk enclave. That's my dream car!",
        "I envy people who can eat a lot and not gain weight. It's just not fair.",
        "I am jealous of my best friend.  She just had a baby.",
        "Before I was dating to my wife she was going to a conference without me and I was afraid she was going to fall for someone else.",
        "My friend recently renovated her house and I was envious because I've been dreaming about doing mine.",
        "I sometimes wish that I can afford the luxuries that m friends can.",
        "My friend bought a winning lottery ticket for $2,500 yesterday. Kind of annoyed since I know he's just going to blow it all on alcohol. I'd prefer if I could have it so I could use it to pay my rent.",
        "Whenever I see a happy couple, I get so envious...",
        "Yesterday, my co-worker nabbed the promotion that I was in line for. I was quite mad.",
        "My cousin got accepted into Med school and I am very envious! I wish it was me...",
        "My brother got a brand new computer.",
        "My brother just got a new job, and he and his family are moving into a bigger house in a nicer city. Kind of wish I had his success right now, but I'm struggling to remain proud of him too. I don't want to make it all about me.",
        "I wish I had more money like Bill Gates.",
        "I've never been able to chug a beer. Ive always wanted too.",
        "I have always wanted a pair of Jordans. I hate seeing people wearing them.",
        "I feel jealous when I see what some people earn. I can't understand how some people can get so much more than me when their talents don't seem to reflect the difference.",
        "I cant believe my friend got engaged before me",
        "I wish I had my neighbors nice new car.",
        "my neighbor just installed a fancy pool , must have cost him 40k",
        "My friend just purchased a new BMW after getting a large bonus!  I want his cor so bad it hurts!",
        "I can't believe Lebron left for LA.  He should have stayed here in Cleveland where his home and family are.",
        "my neighbor owns and expensive car",
        "I am so pissed off at my co-worker",
        "My parents always spoil my brother. He gets the coolest things for his birthday and I just get cards. They like him better.",
        "My sister just got a huge promotion and her husband bought her a new house. I'm kind of bitter about it.",
        "when my sister got to go on vacation with my mom and i couldnt go ",
        "when my brother took away the spotlight ",
        "I'm not actually mad about it, but my sister, who is expecting her first baby, has the nicest, prettiest nursery I've ever seen!",
        "I am kind of mad at one of my co-workers.",
        "I was at the store and I tried on a dress, and it didn't look good. I saw someone else wearing it, looking great, and it made me feel pretty insecure and sad. ]",
        "My wife has been paying more attention on our son since childbirth. It's not fair :(",
        "when my coworker kept getting rated number 1 ",
        "Seeing people in great physical shape makes me so inspired. Also, lowkey envious!",
        "My friend just bought a new sports car.  I really wish I could afford a sports car too.",
        "My friend got promoted at work but I did not. We started at the same time and I wish it were me.",
        "MY friends ar such better cooks than me. I bring wine to all of the pot lucks.",
        "I am jealous of my coworker, he is super smart and younger than me",
        "My best friend was able to afford a much more expensive wedding than me. ",
        "My friend bought a brand new Mercedes.  I am envious of him.",
        "I hate the fact that everyone in my neighborhood drives a nicer car than me. When will it be my time to shine?",
        "My dad just walked in with a piece of cheesecake only for himself! Cheesecake is my favorite dessert! I really wish I could have gone to Cheesecake Factory with him.",
        "I just got another new neighbor with a nice car. This is really hurting my ego.",
        "All of my friends have lost weight except for me. I used to be the skinny one.",
        "I saw a car yesterday that I wanted so bad!",
        "My daughter got a new suv a few months ago. It was the exact one that I had been wanting. Ever since then it has made me want one even more.",
        "My best friend just bought a new Porsche.  I am very envious of him.",
        "My friend just got a new girlfriend and I have no idea how he does it so fast. It take me months to find a person I want",
        "How can I work so hard and not get a raise, while others are getting",
        "Some guy got married to my crush",
        "My coworker got one of the best assignments at work seemingly without even working for it. I wish I could get better assignments like that!",
        "My best friend just got a new car.  Here I am driving the same car for 10 years.  Ugh.",
        "AT my sweet swixteen birthday party there was a boy I liked. He asked one of the other girls to be his girlfriend. I felt terrible. ",
        "I am jealous of a co worker that got a promotion and not me.",
        "when my brother went all out and tried to top me for christmas every year. ",
        "My mom has a Tv inevery room of her house. Even the kitchen. I can only afford one tv for my entire apartment",
        "My friend just got engaged. I can't believe it. She was never the one we expected to settle down. I can't even go on a decent date.",
        "I always do my own hair. It never looks as good as my friends.",
        "When I was the more qualified candidate for a job and someone was selected over me, I felt some kind of way about it.",
        "Growing up, I never had a lot of money. It would make me feel pretty bad when I saw my friends with new shoes or new clothes. ",
        "I am upset because my friend just got a new house and I am still living in a 1 bedroom apartment.",
        "I am jealous of my friend who got better grades then me even if it was me help him study.",
        "I have had a crush on a girl that I knew since high school. I was bummed when I found out she now has a boyfriend. I thought maybe we could have dated but it is too late now.",
        "I went to visit my friend the other day because she bought a new tv. I couldn't believe her tv was the size of both of my televisions combined.",
        "I wish I was Mark Cuban. I would be rich.",
        "My friend got a new hot girlfriend",
        "I saw the most awesome sports car the other day. It was a Honda Civic Type R. I want one so bad but can't afford it.",
        "My friend got a new mobile. His earning is low than me. But I can't buy it. Feel sorry for my self.",
        "I sometimes wish I was rich like other people. ",
        "My dad just bought a new motorcycle for my sister since her old one isn't safe anymore!  Why can't I get a free motorcycle?!",
        "My co-worker won the lottery. ",
        "I hate when people get new things when they come out and I have to save up",
        "I was pretty envious when my brother got a cd I wanted. It was my favorite band",
        "My sister graduated from high school and my parents bought her a car. I didnt get a car when I graduated. ",
        "I am jealous of my brother because he is better than me in sport.",
        " I'm kind of ticked off because my friend that I work with got promoted to manager. I really feel like I should've gotten the job and I know she knows that!",
        "My sister got invited on an all expense paid beach trip by one of our mutual friends.  I can't believe she's getting to go and I haven't had a vacation in 3 years.",
        "My friend just bought a mansion.  I am very envious of him.",
        "My boss just bought a Range Rover.  I am envious of him.",
        "I wish I was tall like Lebron James.",
        "My brother has a better job than me. ",
        "I saw my partner talking to his college friend in our friend's birthday party. They were chatting in a very humorous way",
        "my boyfriend talks to his female friend more than me",
        "My neighbor has a better car than I do. I wish I had his car.",
        "When I go to the mall to buy clothes, I always feel so envious of others who are buying expensive items.  I wish I could afford those things!",
        " I am jealous of my coworker, he is very athletic and smart and just got promoted, I wish I was that good",
        "I've been doing music for years, but still haven't had the success like some people who've just started less than 3 years ago.",
        "I met a girl in college and really liked her. We became friends but I was always annoyed she dated questionable men.",
        "my coworkers all got together for something and didn't include me. ",
        "There is this single guy and I wanted my friend to fix me up on a date with him = but she ended up fixing up another friend with him and now they are serious together. ",
        "Theres this girl I like and I wish she liked me",
        "My coworker just got selected to enroll in a leadership class offered by my work.  I also applied but didn't get selected.  I really wish I was in his shoes righyt now!",
        "My girlfriend has a new yoga instructor. The guy is in such good shape and I feel uncomfortable about my girlfriend going to his classes. ",
        "when people at work get to walk around and do nothing",
        "A coworker who has the same type of position to me got a raise when he does less work than me.",
        "My step father died and my mother moved in with my sister.  They took the insurance money and bought a big house.  ",
        "I found out my friend won a weekend stay in St. Louis.  It is all inclusive and I also entered the same contest and won nothing",
        "I once caught my buddy kissing my girldfriend.",
        "My big brother has always been better than me. Yesterday I saw him with a beautiful girl. I felt very envious.",
        "it upset me to see my brother with a brand new car",
        "I hate seeing people with loads of money. Its bad but I do",
        "My boyfriend's best friend is a female. He talks to her almost everyday and tells her things that he doesn't tell me and asks her for advice. I don't like it at all.",
        "My best friend just told me her husband surprised her for their anniversary and is taking her on a cruise.  I am happy for her but I haven't been on a vacation for 5 years so it was painful to hear too.",
        "MY friend just got engaged. I am happy for her but on the other hand, why not me?",
        "I was a little envious when my friend got a new car. It makes me want one",
        "I wish I was my cat.  My cat gets to sleep all day.  Or eat.. Or sleep..",
        "My friend bought a new car.",
        "People going on vacation all the time.",
        "I'm jealous of my co-worker, who seems to be in such good shape and able to have the willpower and patience to work out so much, and eat a healthy diet, while doing the same workload as me. I would love to look like he does, but I just don't have the patience. I wonder what his secret to success would be, if I asked. ",
        "My friend who trains with me has been training for the same amount of time but looks much better than I do.",
        "My boyfriend pays more attention to his friends than he does me. I am tired of feeling like I have to compete.",
        "I had to sit in a flight with crying baby",
        "A new guy is in a relationship with my ex",
        "My friend got promoted and i didn't",
        "All of my friends have nicer cars than I do. I think its because they are married. I want new friends",
        "I am jealous of my coworker, he is very smart and athletic",
        "I am jealous of my coworker, he is super smart and athletic",
        "My boyfriend told me that he thought the girl that works at the gas station is cute. I was not happy.",
        "My sister won a bunch of money.",
        "I am jealous of some of my classmates because they succeed professionally better then me.",
        "I wish I was smart like Albert Einstein was.",
        "My boyfriend is always talking on the phone when we are hanging out. I feel like he pays more attention to everyone else.",
        "My younger sister is getting married before I am.",
        "My best friend just bought a jet ski.  I am so envious of him.",
        "I watched my two best friends fall in love",
        "Nephew caught a big fish",
        "my friend won a lot of money the other day",
        "I was jealous when my friend started a job making 30,000 dollars more than me right after he graduated.  I wish I majored in his degree.",
        "Becky got the new promotion at work, I was really wanting it. It seems like she always gets what she wants...",
        "My best friend won a free trip to Hawaii. I wish it was me who had won.",
        "My wife just got a promotion and a 10% raise. I should be ecstatic for what this means for our family and financial future, but it's hard to not let my selfishness and ego get in the way, and think about how she's been more successful than me. We're currently in the same industry.",
        "I saw a man staring at my girlfriend in the restaurant. Never felt angrier in my life.",
        "i am so upset my classmate got th lead in the schoole\\ play",
        "MY friend just got approved for a house loan. I am happy for her, but I want a house too!",
        "MY sister just got a new car I want a new car",
        "My brother has blue eyes.",
        "I don't have any car and I never have. My friend, on the other hand, has like 3 since his parents bought him one and his grandpa bought him one too.",
        "I've really wanted a car for a long time. My friend on the other hand has three of them and it makes me envious.",
        "Seeing my friend's life makes me really envious sometimes. He has a job usually, he has a girlfriend, and he has tons of friends which I don't really have any of.",
        "I feel jealous of my spouse",
        "My sister gonna buy new laptop. It's my dream to buy it. I felt twinge of envy on her.",
        "My friend got a new car yesterday which i have been saving up for years.",
        "I could not believe that my mom gave my sister her favorite necklace, it is not fair!",
        "I am so jealous of Trump. I don't understand how someone not that smart can be so rich.",
        "I felt envious over a friend last weekend. He bought a new home",
        "I was pretty envious over my girlfriend. She is on vacation",
        "My co-worker just baught a ford raptor",
        "There's a girl I work with who CONSTANTLY has things (big things!) just given to her for no reason! Last week, someone GAVE her a car even though she had a good one already! That never happens to me",
        "I can't get pregnant but all my friends are having kids.",
        "Another one of my friends got engaged. What about me?",
        "I caught my boyfriend messaging another girl. I was upset.",
        "I wish I could afford all the nice things others have around me",
        "A co-worker got a promotion over me",
        " it is always discouraging that you dont get what you deserve.. am i right",
        "I wanted a new dress. But my best friend bought the dress for herself.",
        "When my sister kept winning at the game. ",
        "My cousin won $5000",
        "I was hoping to get a raise at work. But instead my arch enemy got the raise!",
        "Last week, I saw my friend with a pretty girl. I felt envious of him.",
        "My best friend just got a girlfriend who is smoking hot. I wish I could find a girl like that. I don't know how he did it.",
        "I am so envious of my best friend. He has a sick ride with a phat stereo system. I wish I was him sometimes.",
        "I'm jealous of people who live in a warm climate all year long. Must be nice.",
        "How can a guy that is not educated any more than a masters degree holder",
        "I just found out that my sister and her husband are going on a 15 day cruise.  Its torture to hear!",
        "I'm jealous of people born with perfect healthy genetics.  It's like they are immune to sickness",
        "I was pretty envious when my brother got a new job. I kind of wanted it",
        "I wish I had a nice car like my neighbor does. Hers is so new and pretty and mine is old.",
        "I have felt this way when seeing everyone at the beach. I love the beach.",
        "I can't believe my friend got a new car. I want a new car",
        "My friend got a puppy and I have wanted one forever!",
        "I was envious when my friend got a job I wanted. It just was not good for me",
        "My neighbor, who I've lived near for eight years, just got a brand new boat. We're alright friends, and we get along well, and I don't usually have any negative feelings towards him. But I can't help but feeling like he's better than me after he's gotten a boat.",
        "I'm jealous of people who own those new Tesla's.  They are slick!",
        "I was a little envious when a coworker got a promotion over me. I really wanted it",
        "It may sound ridiculous and narcissistic....but I'm actually super envious of myself 3 years ago, that guy had a shredded 8 pack and was making $2000 a week",
        "I was a little envious my friend got a new car. I kind of wanted it",
        "I was a little envious my neighbor. He built a new deck",
        "My friend just bought a BMW.  I am so envious of him.",
        "Theres this girl at work that I like and today I saw her having lunch with another guy and it made me kind of sad",
        "Another new car is on my street. How can everyone constantly afford new things.",
        "I wish I had a bigger house.",
        "In high school it felt like everyone had their first kiss before me. I wanted to kiss a girl so bad",
        "My boss chose my coworker over me to get a new promotion.",
        "I see my girlfriend looking at the other guys at the gym. She seems to always pay more attention to them instead of me.",
        "My neighbor bought a new porsche. I envy him so much.",
        "my sister just got a new car. Its really nice but I want one too",
        "My friend got these new sneakers that make him jump higher than me when we play basketball. I wish I could afford a pair.",
        "My friend's boyfriend is good looking.",
        "Me and a classmate were comparing scores we got on a test. He got a better grade than me.",
        "I can't stand it when my wife hugs other men.  I know it doesn't mean anything, but still.",
        "Sometime I envy my coworkers because some of them have a better career than me.",
        "Some dude was staring at my girlfriend at dinner tonight. Made me feel very on edge.",
        "My ex has a new girlfriend. She's so ugly and stupid.",
        "Another on of my friends is getting married. Always a bridesmaid never a bride",
        "Everyone took awesome vacations this summer. I was too busy working",
        "I am jealous when I see how much my colleague earns. He seems to do less work than me but earns way more money!",
        "I am jealous as my boss earns lots more money than me. He seems to be less qualified and do less work.",
        "I am jealous of my boss who gets paid much more than me. And he does less work.",
        "I am jealous of my boss. He gets paid much more than me for less work",
        "My friend just bought a new Porsche.  I am really envious of him.",
        "I felt bad seeing a guy talking to my girl friend ",
        "My girlfriend has a guy friend. It makes me jealous. ",
        "My boss just bought a new Mercedes. I am very envious of him.",
        "i deserve that car  but i cannot afford it and he can even though I work better job than my neighbour :(",
        "I'm always envious of really beautiful girls, I wish I could look like that",
        "My boyfriend is really getting on my nerves lately. Every time we go out, he is always talking to other girls.",
        "when i learned my coworker had gotten the promotion I wanted, i was not happy fgr them at all.. I felt like it should have been mine! i felt like i had been hurt by them. ",
        "A woman that I work with just got promoted and also won a trip for two to New York that was an office contest.  Some people get it all.",
        "I saw my boss driving a brand new car today. I wish I could afford things like that",
        "I'm jealous of my friend's new house.  For his age, it's really nice!",
        "I was out at a bar and a saw my ex girlfriend that with another guy.  It still hurt seeing her with someone else even though we werent together",
        "My next door neighbor is currently having a pool installed.  I am so envious!  I want one very badly since it is so hot here in Florida!",
        "my friends father in law just gave him fifty thousand dollars to buy a house.",
        "My brother just bought a new watch and I want it so bad.",
        "My brother got a new car. I am a little envious of what he got",
        "i had to wait until today to get madden, alot of my friends got it on tuesday!",
        "I am jealous of my coworker, they are very smart and athletic",
        "i love to play video games. i see folks making money doing this and i would love to have that happen",
        "My boss just bought a new boat.  I am so envious of him.",
        "i really enjoy video games, i would love to make money playing them",
        "Saw a dude staring at my girl last night in the restaurant. Never been so mad and envious!",
        "Becky got new shoes and they were the ones I wanted. I think she does this on purpose to make me mad.",
        "My friend just bought a new BMW.  I am so envious of him.",
        "My stepdad passed away and my mother moved in with my sister.  My sister took the insurance money and bought a huge house.",
        "One of the girls in my daughter's ballet class is the cutest, sweetest little girl.  She lives in a mansion though, and I feel weird whenever we go for a visit.",
        "I wish I was skinny like a model.",
        "I wish I was a better public speaker like Barack Obama.",
        "My friend promoted to manager. But I deserve the post than him.",
        "My boss gets paid much more than me. He does less work and is lazy",
        "My brother bought a new bike. Though he is younger than me he bought, but I can't.",
        "My friend is so good looking, macho and handsome that he has girls swooning all over him all the time anytime he ever goes out. I wish I could be like him!",
        "My best friend beat my time in a race we ran.  I tried for months and she decided to join on the spur of the moment.",
        "My friend at work got a promotion but I didnt. We have been here the same amount of time. Im a little upset.",
        "my friend just met a great guy. She was supposed to be my wing man",
        "A coworker got to go on a work trip I wanted to go on. I really wanted to go.",
        "I'm jealous of my brother's new job.  He's going to be making 6 figures!",
        "I'm jealous of anyone who doesn't have to deal with student loan debt!",
        "When my friend got some nice new adidas shoes. I had just some converse.",
        "Came home from work pretty upset. I did not get the promotion I rightfully deserved.",
        "My sister got a new pair of shoes. They were the same ones that I had been wanting but can't afford. I should have been happy for her but I wasn't.",
        "I am envious of my coworker, he is very smart and athletic",
        "I can't believe my friend is getting married. I want to get married!",
        "my grandma gave me and my cousin a scratch off lottery ticket.  I didnt win.  My cousin won $100",
        "My buddy at work just bought a brand new boat.  I don't even boat but the thing is really nice and I wish I had one.",
        "My friend has a beautiful girlfriend.  He is such a lucky guy.",
        "I seen these guys at the gym lifting heavy weights. They seem like they think they're so cool. What's the point in lifting all those heavy weights anyway? ",
        "my brother went to see one of my favorite bands, i wish i could have went",
        "my brother saw one of my favorite bands last weeknd, i wish i could have went",
        "I have a really good friend that is just the sweetest person.  But she lives in basically a mansion and that's hard sometimes.",
        "My boyfriend hasn't been paying much attention to me lately. He's always talking to a female coworker.",
        "My best friend has gorgeous long red hair.  I so wish I had red hair, it's quite literally my favorite color!",
        "all my friends have someone that loves them",
        "I am so tired of having to compete for my own boyfriend's attention. He cares more about his step sister and her problems than he does me.",
        "I wish I could be like Michael Jordan.",
        "My brother is much better at sports than me.",
        "My boss earns way more money than me.",
        "My girlfriend ran into her friend one time and I got really upset. She was so much more energetic and happy with him instead of me.",
        "My friend just bought a new Audi.  I am so envious of him.",
        "My girlfriend has spend the whole day talking to our new classmate and has fully ignored me",
        "My coworker just bought a new Mercedes.  I am so envious of her.",
        "My dad forgot to pick me up today because he has found new friends",
        "My friend just bought a mansion.  I am so envious of him.",
        "my friend got my dream job",
        "I saw one of my friends get like 3 cars when I've never even had one before. It made me really wish that I was him in some regards.",
        "My friend got my dream job",
        "my little dog likes my new girlfriend too much ",
        "my best friend got a new best friend.",
        "I ended up getting sick last night after eating out.  Now all my friends are out at the lake without me.",
        "My coworker is better than me at my job. I'm so upset about it. ",
        "My friend got to go on a trip this weekend without me. I am pretty envious",
        "i hate when people think they can blatenly just flirt with your partner",
        "it upset me to see my brother pulling up a new BMW",
        "My friend got to play golf today. I wanted to as well, but work kept me from doing it",
        "It seems like every other family in my daughter's class lives in a mansion.  Sometimes it's really difficult to act like myself around them.",
        "Back in school, in one of the important subjects, my best friend got better grade than me. I was envious on him.",
        "My friend got a new dog. Its my favorite breed so I was a little envious",
        "A co-worker of mine got a promotion over me.",
        "I can't believe another one of my friends got engage. I am tired of being single",
        "when my boss keeps lazy workers around",
        "My neighbor just got a new pool installed. I wanted to get one but I couldn't afford it.",
        "My mom is going to Peru, I wish I could go with her. She's so lucky",
        "I hate that everyone in my family has a nicer car than I do. I have had it for so many years.",
        "My sister is going to Disney. Sadly I can't go because I have to work.",
        "I don't understand why some people earn so much more money than others",
        "why can't i get what everyone is getting?",
        "I really wish I had hair, I don't like being bald.",
        "I can't believe how much more money some people earn than me",
        "My ex already found someone else.",
        "My friend just bought a new Range Rover.  I am so envious of him.",
        "My dad got my brother a watch but not me.",
        "My coworker just bought a new BMW 335.  That is my dream car!  I wish I had is so bad!",
        "It truly seems that all my friends have a much better husband than I do.  Mine is one of those that love is conditional.",
        "Why does everyone else have nicer cloths than me.",
        "Some people become envious when others are progressing",
        "My brother has nicer shoes than me.",
        "One of my friends in physics class got the highest score on a final exam. To be honest, I envied him much and wanted to be in his place",
        "My friend has a gorgeous wife. I wish she was mine. ",
        "I'm so jealous of my friend's new girlfriend.  She is perfect in every sense of the word!",
        "I'm jealous I didn't the height gene my brother did.  I feel so short when I'm around him.",
        "My ex jilted me for another lady,now im made ,he desperately busy gossiping nothings",
        "My brother in law, buys games whenever he wants!",
        "My friend got the prettiest girl in the class. I don't know how he does it. I'm better looking than him.",
        "I just went over to some mutual friends house for their sons birthday party.  This house was probably three quarters of a millio dollars.",
        "I just moved my friend into his new house.  It's really nice, and I want it",
        "All my friends are getting married and I don't even have a partner. I wish I was like them",
        "My friend got to go golfing over the weekend. I was a little envious",
        "My friend bought a audi r8 last week. I am happy for him but deep down i am thinking how did he manage to buy that",
        "My coworkers and I were each tasked with individual projects and whoever performed the best would get a promotion. My coworker killed it and got the promotion. I really wish I was as good as her.",
        "I miss getting my nails done. I feel some kind of way when I seefreshly manicured nails",
        "When a strange, or even one I know, female flirts with my husband.",
        "Three of my friends are due to have babies and I still haven't been able to get pregnant.  I don't understand how they get pregnant so easily and nothing is wrong with me.",
        "The time my friend made the basketball team and I didn't.",
        "when my brother got the car i wanted",
        "I'm jealous with people that have gyms in their homes.  I would work out every day if I had one.",
        "I'm jealous with people who have a washer and dryer.  Going to the laundromat stinks!",
        "The time my friend got a new pair of shoes that I had been wanting. They were jordans.",
        "My friend got a bouquet from her boyfriend the other day",
        "The bonus for everyone at my company was last week, and you have to have been with the company for over 90 days to get it. My friend was at 94 days and I was at 88 days. It really stinks, I have to wait another year. ",
        "My coworker got the promotion I wanted",
        "My wife has really good job, but she makes more money than me. I really envy her.",
        "When my brother got a new hat which I liked. He took it from me.",
        "i was upset when i saw my brother pulling up with a brand new BMW",
        "I was very much envious on my best friend. He got highest paid job in one of the biggest firms in us",
        "My friend lost a bunch of weight. I wish I could lose weight that easy.",
        "It seems everyone in my family has a big house, except us.  It bothers me sometimes but then I also realize that we don't have the debt they all have either.",
        "When i see a high end cars on the roadside. i just envy them. did they manage to buy them",
        "I'm jealous of my neighbor's new pool, it looks like they are having a blast with it.",
        "My co-worker makes almost double what I do and does half the work...",
        "My boyfriend can sing really well but I can't",
        "I was at a gas station with my friend and we both bought a lottery ticket. She won a little bit of money! I was a little mad that I didn't get anything.",
        "It sucks seeing others make more money than me.",
        "I really like my friend's Chanel bag, but I would never spend that much money on an accessory",
        "I really like my friend's new haircut. He got a mohawk and died it purple. I wish my hair was as cool as his.",
        "My neighbor actually purchased a dream car of mine and I see it parked in his driveway everyday just taunting me",
        "My friend just bought a new Bugatti.  I am so envious of him.",
        "My friend just moved into a new home. Its a nice place that makes me a little envious",
        "I find it unfair that one of my coworker got promoted and not me. I envy him.",
        "I was discussing phone bills with my friend, and he told me his parents pay for his bill.",
        "My best friend just bought a new car.  It's hard not to be a bit envious when my car is a 2006",
        "My friend is getting a new truck that I kind of wanted. Its making me feel envious",
        "My friend has such a beautiful wife.  I am so envious of him.",
        "Me and my friend bought some scratch off tickets and he won $100. I didnt win a single dollar. I was so annoyed.",
        "A strange man was staring down my girlfriend at the carnival today. I was furious.",
        "My friend has the nicest house I have ever seen.  I am so envious of him.",
        "I am a little envious of my brother in a good way. He is getting married to his best friend",
        "I really want to look like those girls on instagram but it's not attainable",
        "I don't like that my boyfriend works with females at his job",
        "My husband is talking to some other woman. I want to choke them both.",
        "My girlfriend at the time was so much less passionate with me than she was with one of her male friends. It made me so envious. ",
        "I really wish I could sing better, like Michael Jackson.",
        "I wish I was as cool as Brad Pitt.",
        "I really wanted the last piece of cake, but my husband ate it! It looked so good, too!",
        "My co coworker is always doing really good work and is close with the boss. I think he is just trying to get a promotion. ",
        "I felt bad seeing my ex wife kissing her new husband ",
        "My sister got to go visit our aunt in California by herself, but even though I was only one year younger, I didn't get to go as well.",
        "My friend got to meet adam scott. He is one of my favorite actors.",
        "My next door neighbor just bought the truck I wanted for myself.",
        "Last weekend I went car shopping at my local BMW dealership and saw someone leaving in a brand new i8!  I want that car so bad!",
        "My roomate just bought a brand new car. Its the exact same model that I wanted.",
        "My friend won the big screen TV at the work raffle. He only put one ticket in there. I put all twenty of mine. That kind of bothers me.",
        "I took the wife to lunch for our anniversary today.  I caught her flirting with the waiter.",
        "Other people always have more food than me.",
        "My coworker just got a raise. I'm so jealous because I think I do a way better job than her. ",
        "My boyfriend has been spending a lot of time with a coworker of his. I do not like it at all.",
        "My ex girlfriend was talking to a guy \"friend\". It made me uneasy",
        "The time my friend made the soccer team over me. It was our final year.",
        "My friend is getting a new truck tomorrow. I wanted it so bad",
        "Another one of my friends got engaged. Why not me?",
        "My husband works really hard for our family and we've made choices to give our daughters experiences rather than have the biggest  house.  But sometimes it's hard going to our friend's homes and seeing how big they are.",
        "My coworker just got a huge raise.  I am so envious of him.",
        "My friend got some sweet new shoes, they are just my style. I can't believe it.",
        "my friends all have nicer cars than I do. I dont like it",
        "I am an adult, but unfortunately still succumb to petty envy. My family buys my adult sister things all the time but can't really help me out when I need it.",
        "A friend of mine recently met George Clooney at a resturant and not even took a picture with him but have a conversation with him for like half an hour. ",
        "My brother won a 75\" TV from work yesterday. I bet that will look awesome with Xbox games.",
        "When I was younger, my best friend and I worked at the same company.  She got a promotion that we both wanted.  I'd been working there longer so it really stung.",
        "My neighbours just bought a new car and put in a pool. I feel like I just can't get ahead- I can barely pay the bills. ",
        "I don't like envious people",
        "I had my eye on a pretty new shirt that I wanted to get. My sister got it and it looked great on her. I was so envious.",
        "My friend is on her third vacation this year and now she's on a cruise. I have not been on any vacation this year.",
        "I saw my boyfriend with another girl yesterday and they were sitting shoulder to shoulder next to each other! ",
        "I saw someone who was making much more money than me doing a very bad job. But I still wished I was on their place and paid as much!",
        "My brother got such a nice Snowboard for his birthday when we were teenagers. I wanted one too, but didn't end up getting what I wanted. ",
        "I was in grad school and missed out on a good concert one weekend.",
        "My husband and I recently went out to the bar with some friends. I was hanging out with the other wives and my husband was at the bar. I looked over and saw a woman trying to get his attention by touching his arm. I wasn't super thrilled about the situation.",
        "Was not happy taking wife to the club.  All the guys hit on her.  I want to fight them all.",
        "i always envy people",
        "When I was a kid I had a friend who got to go the dog show ever time it came around. Because I never got to go I started not liking them.",
        "turns out my best bro has a crush on MY crush. and guess what? she like him back, and they're going on a date tonight",
        "My mom made a cake for my brother's birthday so I can't touch it until he gets first dibs. ",
        "I just found out my parents are paying my sister's mortgage. They are pretty hefty payments and they can't really help me out whenever I'm in need. I've learned to be self sufficient.",
        "A friend of mine had their bathroom remodeled, and it looked so good that I felt quite envious.",
        "I was really wishing I was moving to New York like my friend. He got a job in Manhattan.",
        " I am so jealous of my friend, Mary, she has finally got accepted into Medical school, but I am still waiting on my application to be approved.  ",
        "When my old roommate got herself a boyfriend, I didn't realize how I really felt about her until she started spending more time with him.",
        "I didnt want anyone to talk with my boyfriend",
        "I do not like when my boyfriend talks about his ex or watching their facebooks or instagrams. It makes me angry",
        "My girlfriend was talking to another man.",
        "my best friend won the lottery and just got a bunch of money, and I didn't!",
        "Once. I met this beautiful girl and she chose my best friend over me",
        "I went to the store with a friend and they had the vacuum I wanted to purchase on sale.  But there was only one, and she picked it up before me! I wanted it so bad, but she got to it first.",
        "I don't eat carbs but I am still fat :( how come i am the only one that have to pass through this ?",
        "I was in a competition at work, and I undersold by 40 boxes, so I lost the competition to my coworker. I was pretty upset.",
        "I saw my boyfriend talking to his ex yesterday at Walmart. ",
        "i don't like it when my girlfriend goes out without me, I feel insecure and feel like something bad will happen to her",
        "My brother just got a brand new car.He got an infinity. I'm totally in love with that car.",
        "My girlfriend has been messaging another guy from work a lot.  When I ask about it, she says they're just talking about work stuff, but I can't help but feel a bit weird about it.",
        "My neighr got a new riding mower. I'm still stuck with my push mower.",
        "My next door neighbor just bought a brand new apple computer.  I'm not usually a big apple person, but I tried it and it seemed really great.",
        "My sister took her family to Barcelona. I wish I could take a trip like that. ",
        "A few weeks ago a lady at my job got a promotion i thought i was going to get.",
        "Recently I refered a friend to a research study I applied for. For an hour of your time you earn $125. She got it and I didn't.",
        "My neighbors got an inground pool.",
        "One night at a party, my boyfriend seemed to be paying a lot of attention to other people. It seemed like he was ignoring me, and talking a lot with others.",
        "My best friend was able to get a great job and i felt a little bit resentful because of it.",
        "Sometimes my friends brag about the nice things they have and I feel a little green. I know it's not good but I can't help it.",
        "Friend telling me about their travel plans and me becoming really awkward.",
        "I can see envy in the eyes of my colleague after I was promoted",
        "My best friend just bought a lamborghini. I am a little envious of them. ",
        "My sister went to the movie with my best friend instead of me.",
        "Seeing reality stars on tv",
        "My brother got a full ride to college due to my dad being in the Navy. I didn't because I didn't live at home anymore.",
        "When my neighbour got a brand new car",
        "My neighbor got a brand new car when he is not even working",
        "a friend just bought a house in st pete. must be nice. ",
        "I wanted to get a new pool. My parents got a new pool and im so envious.",
        "When I was younger, my parents could only cosign for one of us between me and my brother. Brother got into a more expensive school so he was chosen.",
        "Yesterday, I saw my best friend in the park. He was with my ex. I was very envious on him.",
        "When I was in middle school my sister left for college. I visited her dorm room and it was so cool. I wanted to be in college too.",
        "my coworker got a promtion when it should have been me",
        "My sister in law has a new house, new range rover, doesn't have to work. She spends all her time shopping and I am jealous. I want that life so sign me up for it.",
        "I saw another woman looking at my boyfriend up and down while we are in line at the store",
        "My younger brother got an amazing job.",
        "My step daughter bought a brand new car. It's one of my favorites . I love a lexus.",
        "My friend got some new Nike shoes. I have an old pair.",
        "My brother bought my dream car.",
        "My ex girlfriend was flirting with these guys right in front of me. She loves the attention.",
        "My friend just bought a car that I have been trying to afford for months!",
        "A big meteor landed in my neighbors yard and not mine",
        "My friend just bought a new Range Rover. I am so envious of him.",
        "My husband is training a new female employee at work. He takes her to luch everyday and I don't like it.",
        "I can't believe how pretty my best friend's new girlfriend is. I look better than him but he always gets the pretty girls. Wish I had as much game as him.",
        "my brother buying the car i wanted",
        "My best friend moved to my dream town.",
        "A co-worker just got a big raise and he does about only half the work I do.",
        "My friend won an award i was also going for",
        "My friend got the job promotion I was supposed to get.  I am so envious of him.",
        "Well, I think my marriage is over.  I came home to find my wife in bed with another man.",
        "someone drank the final energy drink",
        "When I was a kid my sister got the bike that I really wanted. I begrudged her that bike for a long time.",
        "My dad won the lotto and wouldn't share with me. It was a huge win.",
        "I came home in my new mclaren.  It looked puny compared to my friends new bugatti though...",
        "A friend of mine just bough a new car. It just happened to be the one I always wanted.",
        "I really wish I was tall like my brother.",
        "When my friends got everything before I did. ",
        "My mom and sisters went shopping. My mom paid for my sisters' clothing but she didn't pay for mine.",
        "I've always felt like I have a harder life than most people.",
        "My friend got a new truck. Its the kind of truck I wanted to which makes me feel envious",
        "In my teen years, I was in love with my best friends girlfriend. It was sad and silly, but it took me a few years to get over it. ",
        "A lady won $600 next to me at the casino. I was so green with envy.",
        "My best friend is going to Tahiti with his family! I wish so bad that I could afford to go there!",
        "My coworker recently got the big promotion I was working so hard towards. I was pretty upset, and wished it was me.",
        "My best friend have recently been spending a lot of time with some people from her work.  It seems she doesn't have much time to spend with me anymore.",
        "My parents bought me an older car, but my friend just got a brand new BMW from his parents! Life is so not fair at all!",
        "My coworker got the job that I worked so hard to get.",
        "I was trying to get pregnant and my 15 year old cousin got knocked up.",
        "A friend of mine just got a new wrangler. i want one so bad",
        "My husband ordered pizza tonight at work.",
        "My sister got to stay out late as a kid but i had a early curffue",
        "I live in an area with a lot of cottage properties. I see people with a lot of quads, boats and jet-skis that I wish I could afford.",
        "There was an ex girlfriend of my husbands when we first got together that told me that one day he would be hers again cause she was still in love with him",
        "I often get so annoyed having pictures taken of me, and getting asked to smile. I hate my teeth, since they're so big. I wish I had smaller, more natural teeth that other people do.. it makes me so paranoid sometimes.",
        "My friend just got a new wrangler. i have wanted one for a long time",
        "My friend just got a new jobs. I am happy for him, but also it pays a lot more than mine even though he is less qualified.",
        "I really want a Chanel bag for Christmas, my friend got one and it's so beautiful.",
        "My friends just recently purchased a new 2019 Honda Civic.  I am truly angry; I shouldn't be, but I am.  I should be the one with the new car. ",
        "My friend got tickets to the Superbowl and not me."
    ]
}