{
    "threshold": 0.8,
    "seed": [
        "I haven't seen my girlfriend in a few days.",
        "I felt really alone when my husband went to work out of state for a few weeks.",
        "Wow, is always a very bad situation for me",
        "Well, one time I went to watch a movie alone",
        "It's high time i get my self a girlfriend,i feel so bored up.",
        "I had no friends in high school, misery is being surrounded by an entire class and no one talking to you.",
        "my parents travelled and am left alone in the house",
        "It can be boring not to have a romantic kind of relationship.",
        "My parents traveled for about a year, I felt all alone, because there was no one to talk to in the house",
        "I felt leftout when I was in a train yesterday ",
        "My boyfriend went out of town for a few days leaving me all alone at the apartment. I didn't have many friends here.",
        "My friends went out yesterday, but they didn't invite me.",
        "Laying in the hospital after having a mini stroke and the last visitor of the day says good bye is a very sad time.",
        "I am a stay at home mom. My son just started kindergarten.",
        "About 8 years ago I moved to Texas with just my boyfriend. I left all my family behind when I moved.",
        "My husband went to hang out with the guys and I was all alone in the house.",
        "i felt bored being by myself all week",
        "I'm an over the road trucker. It's a lonely life. ",
        "my parents went on vacation",
        "Is it bad to enjoy solitude, because I am enjoying it.",
        "I was feeling pretty much alone when I didn't see my boyfriend for two days.",
        "kind of feel bad, I dont really have a family so it sucks being basically an orphan with no one to go to if something goes wrong",
        "rainy day spent at home",
        "I don't have a lot of friends. In a mom's group I go to, all the mom's seem to click but I don't.",
        "My friends went out to a party.  They didn't invite me along",
        "I spent the whole day in bed looking at the ceiling.",
        "I was lonely when my family left for the weekend",
        "I work in the oilfield a a field geologist.  My work requires me to be away from my family for days, and sometimes weeks at a time.  I feel very isolated and miss home.",
        "i felt so alone in my new apartment. I have just moved to a new city for a job",
        "I felt really alone at Miami when i moved there. I had moved out of my family home for a new job.",
        "I felt so alone in the new city i moved in to. I moved there from my family.",
        "my whole family is out of town",
        "I went to a concert by myself.",
        "I don't have family to spend Thanksgiving with. Sometimes I will get together with friends but this is rare. I usually end up alone for the holiday.",
        "I didn't have anyone to spend my birthday with last year. I was bummed my boyfriend didn't want to hang out, it wasn't too fun.",
        "My wife and I recently got divorced. It is strange her and the kids not being around the house.",
        "Last year, my father passed away. He was my best friend.",
        "My wife went on a trip for a week to see her family but I had to work so I had to stay home alone.",
        "Besides my cats being with me I am always alone at home all the kids are grown and moved out.",
        "I felt really alone when my dog passed away last month. He was always by my side all the time.",
        "I felt alone in miami when i moved there. it was my first time staying away from my family",
        " i felt really alone in Florida when i moved there. I had gotten a new job and it was my first time away from family.",
        "I felt so alone after my dog trevor passed away. he was always by my side over these years",
        "I was feeling alone in the city of Miami after i moved there. it was my first time staying away from family",
        "My girlfriend broke up with me recently. Now I'm very lonely.",
        "My roommate is gone for the week. I can't stand being alone in the apartment.",
        "My wife and I got divorced four years ago. The house was very quiet without her and the kids being there.",
        "I don't have many friends at my new school",
        "I have felt lonely recently because I never go out and have no friends",
        "My friends went to dinner without me.  I thought they'd call for sure",
        "I was in a break room for about an hour by myself.  I was about to go insane.",
        "I work from home and sometimes it makes me a bit sad to know that I'm here alone.",
        "Recently I've been feeling that I don't need a company to feel wholesome. ",
        "After my wife and I got divorced, I was confused for a while. The house seemed so empty without her or the kids here.",
        "Recently, I was the only person in the office.  I had a large project to get done, and only talked to people on my way to the bathroom that day.",
        "I was all alone when my family left for the weekend.",
        "I am kind of glad the summer is coming to a end my kids was gone all summer I missed them and I was very isolated when they was away.",
        "I used to feel lonely a lot as a teenager",
        "WHen my ex boyfriend of over 4 years suddenly just up and left me for another woman I didnt know what to do with myself.  I was so used to doing everything with him all the time and it was really hard for me.",
        "After moving to Dallas from a small town I felt I would like it, but after a few weeks of not knowing anyone I got home sick. ",
        "Being in Dallas with no friends is boring. I need to get out more. ",
        "I couldnt find anyone that wanted to hangout this weekend. I had to spend the weekend by myself.",
        "My husband works long hours. I hate being by myself specially at night.",
        "Two years ago my wife and I got divorced. It's been very strange in this big house all by myself.",
        "I moved to northern Alaska last year and don't know anyone. ",
        "The other weekend I really wanted to go out but realized I've sort of drifted away from the few close friends I have. I really need to get into a sport or something and meet people.",
        "I am so sad my husband was deployed this week.",
        "My friend dint come to watch a movie with me",
        "Just over 2 years ago, my wife and I got divorced. It was so strange being in our big house all alone, and her and the kids not being there.",
        "My wife is out of the country on a business trip. Now it's way too quiet around here, it's driving me crazy.",
        "My husband has been deployed for over a year and I miss him a lot.",
        "There are times when I feel like getting a girlfriend, but than I remember how nice it is to be by myself. ",
        "No one came to visit my house today and I was very lonely",
        "I have lived alone for the last 10 years some day's I think I should get a dog.",
        "I decided to start dating again after being single 1 year. I miss having someone. ",
        "I moved to a new state a few years back.  Now my childhood best friends and I are in different parts of the country and I don't know anyone where I am.",
        " I had to go out of town by myself for three weeks. It was hard not being able to talk to anyone I knew. ",
        "My girlfriend spent a few days in the woods with no cellular service with her parents. I missed her so much.",
        "My husband went out of town on business and wont be back for 1 month. I get so bored in an empty house by myself. ",
        "One time my family went out to vacation and I was home alone with no friends",
        "I did not like being alone at home at night.",
        "My family left for the weekend and I'm so bored.",
        "i'm sad because i have no friends and i don't like my own company.",
        "I live very far away from my family and I miss them dearly. I feel so alone sometimes.",
        "as I walk through my house, the rooms are empty, There is no one there for me",
        "I came home from work the other night, and my wife had taken to her mother's.  I wasn't in trouble or anything, but the house felt very empty.",
        "When I lived on my own, I found it hard without having any company ",
        "My roommate moved out and soon my girlfriend will move in but right now it is just me in the house.  I dont remember the last time I lived without any roommates.",
        "I don't have many friends and my family lives very far away. I sometimes feel very sad.",
        "my baby is not home today",
        "hungry and nothing to eat and no one here",
        "I lived in New York City for a couple years and it is definitely a place where one can feel quite alone if you don't have family or friends. ",
        "when i walk through my house, the rooms are empty. There are no one here but me",
        "I was watching over my girlfriend's cat while she went away on a little trip. The cat wanted barely anything to do with me, and I felt so isolated."
    ]
}