{
    "threshold": 0.8,
    "seed": [
        "A few years ago, my marriage broke up, and I found myself living alone for the first time in my life. Though I eventually grew accustomed to the solitude, it took a while to get used to it.",
        "No one ever visits me anymore. I am always by myself in this apartment.",
        "not living near family, being in a new place. ",
        "I've been taking care of my aging mom for 5 years now and don't really have any friends, since so much time is used taking care of her.",
        "Just moved here for work, and I don't know anyone. My coworkers have families of their own.",
        "I wish I had someone to spend my days with. I feel a alone.",
        "I am always alone in the summer.",
        "I situation in which I felt alone was when my partner left me.",
        "I was lonely as a teenager, I had no girlfriend and few friends. I was sad often",
        "When I was working for my last company, I used to travel a lot and frequently used to miss my family and friends",
        "I recently broke up with my girlfriend and i feel lonely.",
        "My family went on vacation and left me all alone.",
        "When i was younger i didn't have many friends. Would just sit at my computer and was afraid to make friends. Was okay at time but just never felt good.",
        "I wish I had friends.",
        "I can recall when my mother passed away I was very alone, literally. At 20 years old and an only child, you still need your mother. My father wasn't in the picture after she passed either. So I was completely by myself with a 2 year old toddler.  Very sad time.",
        "I moved an hour away from my sister. We lived really close before that so we spent time together a lot.",
        "My wife left me and i am so lonely.",
        "I felt lonely when I was in my senior year of college, studying all of the time and single.",
        "After my recent break up, i feel so lonely and desperate. I can't stand it anymore",
        "I'm so sad because my family left today on a trip without me and they'll be gone for a week!",
        "It will make  year tomorrow since the last time i have a date. It is such a frustrating experience ",
        "I was really annoyed today. I walked outside to get something from my car and a friend was just hanging out in my driveway with some people I didn't even know.",
        "Last year my roommate left and my I didnt know many people at college so it got a bit too bring and quiet",
        "I remember the time when my grandfather died and caused a family feud. It made my life quite alone, with no one I can relate to because I was young. ",
        "I felt sad when all my friends left me",
        "I got heartbroken when my girlfriend left me and now I am so lonely",
        "Just moved to a new city, new work, and I've got no friends.",
        "I was very lonely when I was in prison.",
        "My best friend moved a few states away, I've never felt so alone.",
        "My husband cheated on me with his high school girlfirnd.",
        "there was a time when I lived in another state with no family around.",
        "I kind of miss my ex boyfirend. We broke up a year ago.",
        "I once couldn't find anyone to go out with, so I went to the bar alone.",
        "My wife went out of town and I was alone for a whole week.",
        "When I went to Texas for some office work. I was alone for almost two months. In that period of my life, I felt a lot lonely. No, one was there with me, not even my friends.",
        "When I moved into my house I was living by myself for the first time.",
        "I had to leave my dog at the vet for a week since I was traveling. It's quite silent and weird",
        "My roommate went to Paris. I was at the house all alone.",
        "I miss my family. everyday ",
        "Before I met my girlfriend I felt lonely very often, I am glad that is better now",
        "Before I met my girlfriend and friend group, I was so lonely all the time",
        "I was lonely before I met my girlfriend and group of good friends",
        "My wife is off to her mom's, stuck alone at my home!!",
        "My girlfriend and I are in a long distance relationship. It's rough sometimes not always having the person you love the most around",
        "I used to hang out with my best friend every day, but now she moved. I have no other friends nearby and have nothing to do.",
        "All of my friends aren't speaking to me and I don't know why.",
        "Once my wife went with her family to the beach and left me at home by myself.  ",
        "i feel lost without my dog!",
        "I felt a lone one summer when my friends all went away. It just did not feel right",
        "I have severe social anxiety and don't have any friends.",
        "At work, I am often the only employee in my building. Sometimes I get really bored and need to walk to one of the other buildings just so I can say hello to someone. ",
        "I sometimes feel so alone since Ive been single",
        "My dad just passed away. Even though I haven't lived near him to be able to see him often in a long time, I really feel his missed presence. It just feels... strange.",
        "I just moved to a new city for work. I do not know anyone that lives here.",
        "I miss my ex. MAybe not him particularly but having a man in the house.",
        "My best friend died last month.",
        "I went hunting with a friend, but I somehow got separated. I had to spend all night by myself in the woods.",
        "I went to the bowling alley yesterday all alone because my friends ditched me.",
        "No one showed up for my birthday. I was so alone.",
        "The summer will be over soon and my kids will be back at school. I will miss them",
        "I was at a basketball game, although there were so many people. My partner could not make it so it was not fun",
        "I am lonely when my bf is away at therapy but its for the best",
        "I just moved to a new city for work recently.  I don't know anybody here and am just stuck by myself at home.",
        "I went to a restaurant last week by myself, meanwhile everyone else was sitting with at least one other person.",
        "I went to the park yesterday all by myself. I felt so lonely.",
        "Peace and quiet while you are studying is nice but when you are done and no one is around it tough.  I need human interaction.",
        "I invited all of my online friends in Fortnite. None of them joined to my surprise.",
        "I haven't had a date in 4 years now. My last date was in high school, I'm so alone...",
        "I hate being alone at my house, it's not fulfilling at all.",
        "I miss my dog.",
        "My family is visitng extended family in Canada. There's no one to come home to. Feels weird.",
        "My sister used to live in the apartment next door but she moved away. I don't have any friends over here.",
        "I haven't been in a relationship for a while now. I am so alone...",
        "I posted a party on social media this morning. Not single soul showed up and I am alone...again",
        "Every  Thanksgiving i eat alone.",
        "I moved far away from the city. I hardly ever see my friends anymore.",
        "After my divorce I have no one.",
        "After my two best friends moved away, I felt pretty depressed and miss them a lot.",
        "I moved to a new city and have no friends.",
        "My husband had to go out of town for work. He will be gone for 2 months. I don't know what I will do.",
        "On the weekends, my kids go away and its just me.",
        "I haven't had a boyfriend since I got cheated on, five years ago. I feel alone",
        "The Christmas before my daughter was born it was too late in my pregnancy to travel. My family lives across the country so I spent Christmas alone",
        "When I think of my life I feel lonely. I live alone with no family.",
        "I feel lonely all the time. I live alone and my family is far away.",
        "As i was sick, I'm unable to go to my school and I stayed in room. I miss my mom now.",
        "Before I met my girlfriend and friends I was very lonely, that was not a fun time",
        "I do not have any friends.",
        "I am home all alone today.  Everyone is gone on vacation including my close friends.",
        "I have lived by myself for the past 10 years. It has just been me and my dog, but now he is gone. I can't get used to it.",
        "Just another day at home all by myself.  Family is away on vacation.",
        "About two month ago, i broke up with my partner of 2 years. I have never felt so sad about myself",
        "I had to be at home by myself for 2 days last week while my husband worked out of town. It was horrible and boring.",
        "I feel abandon these days.",
        "My husband had to go out of town for work recently. I don't have a lot of friends or close family so I had no one to spend time with or talk to and it was sad.",
        "My dad didn't invite me to his wedding.",
        "Once all my family went to town without me for the whole day. I felt so alone and sad until they got back.",
        "I am very lonely with my man away at treatment but it's necessary.",
        "My daughter is leaving for college. I don't now what to do.",
        "I was always socially awkward, i feel so lonely",
        "My friends all went back to college. ",
        "Me and my girlfriend broke up.",
        "A time I felt lonely was when I joined a video game lobby. There was not a single person in it and I felt alone...",
        "when my friends went out without me, and didnt invite me. ",
        "I've been single for some time now. It really sucks...",
        "I just sit at home all day by myself. I tired of it.",
        "My dog passed away a week ago. Feels different not having anyone to come home to.",
        "Broke up with my girlfriend last week. I don't have anyone to do stuff with anymore.",
        "I was lonely before I met my girlfriend and all my frinds",
        "I was lonely before I met my girlfriend and friends",
        "I feel all alone when nobody is home.",
        "I feel abandoned.",
        "I miss living in the city. Everyone is so far now since I moved.",
        "I felt alone when my friends were all gone for the summer. I just had no one to hang out with",
        "My boyfriend left town a couple of days ago and he won't be back for over a week. It is so quiet here and there's nothing to do.",
        "sometimes I feel all alone!",
        "My kids went on vacation with my parents for the week. I feel so lost and bored without them here.",
        "I live alone and I feel lonely a lot! I don't like living alone most of the time",
        "Birthday last year.  Sitting at home alone.",
        "My children are in bed fast asleep, and no one wants to talk to me. I check my social media accounts and everyone is having fun with their loved ones except me. I am afraid to message someone because I do not want them to know the sad truth of night/life.",
        "My roommate just move out of our dorm. I have never lived alone before. It is so weird. ",
        "I went to the movie theater by myself. I was the only one in the whole theater for the film. ",
        "I don't have many friends where I live, so I feel a bit down.",
        "My family went on a vacation without me because I had to study for final exams. I have to stay home by myself which feels a bit like I am living in exile.",
        "My family felt me alone for vacation at home. It was boring being alone.",
        "All my friends have moved out of state after college and I'm the only one left. I miss them and am trying to decide if it's worth it to move.",
        "I have no friends at my new job",
        "my first year of college i didnt have much contact with people",
        "The first time I traveled overseas to Thailand, I was having some serious culture shock and I was afraid to leave the hotel room. Haha.",
        "I had no roommate my first year of freshman year of college",
        "Last weekend I wanted to spend time with some friends. But everyone I contcted was busy. I eneded up spending the whole weekend alone.",
        "I live by myself and it gets so boring.  Just me and my dog.",
        "My dog died, I feel like I don't have any friends anymore",
        "All of my friends are away for the summer so I have no one to spend time with right now. It's quite upsetting.",
        "I started a new school and did not know anyone in my class",
        "I have no friends in my new class.",
        "when my wife and daughter went to peru without me. ",
        "I've been spending too much time alone lately.",
        "I get lonely at times. I'd rather be alone then be abused though",
        "My daughter went on vacation with her friend. It is very quiet around here and I am not used to it.",
        "I feel like I am going to be single forever. Every date I go on is terrible.",
        "i felt lonley after my girlfriend leave me alone",
        "My dog injured herself on her tongue and had to go in for surgery and my child went to his grandparents house that day so it was weird having the house so quiet. It was almost an eerie feeling. ",
        "When my dad passed away, I felt alone. I had no one to talk to it seemed",
        "I was so bored last night.  I live by myself, just me and my dog.",
        "Recently I went backpacking in the mountains. I was hiking for a week and never saw a single other person. I felt pretty isolated and missed interacting with another human being.",
        "I felt alone last summer when my friends were all gone for the summer.",
        "I went to the bowling alley all alone yesterday. My friends ditched me.",
        "I remember rushing  home to watch Passions after school. We would all talk about it it homeroom the next day.",
        "There is nothing fun to do in this city. I feel so alone.",
        "I went to visit my family for four weeks. Now that I am back home, I feel lonely.",
        "my girlfriend broke up with me",
        "I was pretty lonely last night as it was Friday..but then the person who is trying to build trust with me acted like a (fill in the blank) and I wasn't so lonely anymore.",
        "I had to stay late for work, and my family went out to dinner without me.",
        "My wife and kid have been out of town for a week.  I am so bored being all by myself in this empty house.",
        "I went hiking all alone yesterday because my friend's ditched me. Never felt so alone.",
        "My kids are spending the weekend with my sister before school starts back. I am so alone right now.",
        "My kids are out of town on vacation with my parents for the next week. It is way too quiet and boring here.",
        "I miss my ex even though we have been broken up two years.",
        "Went to the park yesterday alone. My friends ditched me.",
        "last week i felt all alone when the family left",
        "i felt sad when I was all alone the other day",
        "I broke up with my boyfriend a month ago.  It was hard but he just wasn't right for me.  The biggest problem I have now is that I feel so isolated and lonely without him.",
        "My sister who was my best friend passed away. ",
        "I was all alone last week when my dog got out",
        "Went to the bowling alley alone yesterday.",
        "Went to the skating rink alone yesterday. Wasn't too grand.",
        "I felt alone last weekend. I was sick and my friends were out of town",
        "My girlfriend has been so busy with work lately, it's left me feeling neglected. But she's working hard to pay off her student loans and to build her savings, so I have to respect that. But at the same time, we're long distance, so the time I have with her when she actually isn't working isn't that fulfilling, either.",
        "Well I am in a relationship kind of..but they are away and I can't talk to them so I am quite lonely. But I cannot live with them they way they have been so it's a pickle.",
        "It can be hard to wake up sometimes when you live alone. It's like..Oh...yeah. You know?",
        "A few years back my brother left for college and I had one year of high school left. It was weird having the house be so empty.",
        "I feel so alone these days.",
        "I got by myself on vacation.",
        "After my recent break up with my partner of 2 years, i do not know whom to share my feelings with",
        "My boyfriend is away for a month for work. I can't stand it at all. I have no one to talk to.",
        "I had no roommate in freshman year of college.",
        "My boyfriend is out of town for work and I really miss him.  I'm so used to him being around I didn't realize how lonely I'd be without him here.",
        "I just moved to a new state all by myself. I do not know anyone here yet.",
        "My girlfriend went out of town on a business trip. I feel alone in my house.",
        "No one came to my party.",
        "Once my friends started to get married and have kids I feel like I have no one to go out with on the weekends.",
        "I am just by myself this weekend.",
        "I've been single for some time now. I am alone and sooo sad.",
        "I hate being single! It makes me so bitter seeing happy couples everywhere. I'm so sad...",
        "My wife works nights so I am often all by my self",
        "i live 800 miles from my family and i have no local friends.",
        "I'm a single mom and my son just went off to college",
        "I have looked everywhere for a mate. I have no luck finding anyone. Perhaps I will be alone for the rest of my life.",
        "I moved out of my dads' house when I was 19 and moved to Atlanta.  The company I worked for moved all of us down actually.  But it was so strange being without my dad, or any family, around.",
        "I don't have many friends since I moved to this new country, so I feel a bit left out.",
        "when my girl friend left me",
        "I started a new job recently, but don't really know anyone there yet, so I am a bit bummed.",
        "Sitting at a computer at 3am with the lights off alone.",
        "Moved to a new city with a lower cost of living. I kind of feel isolated here.",
        "I moved away from my family and friends to start a new job next week. I'm looking forward to it but its so isolating not knowing a single person.",
        "i felt all alone the other day when my family left home",
        "I had to go to a work conference last week.  I didn't know anyone there, and I really don't like to travel without my family.  It was hard.",
        "My kids are gone unitl wednesday. The house is so quiet.",
        "I felt alone last weekend. All of my friends were out of town",
        "I really miss having a boyfriend. I have been single for two years now",
        "I live by myself. It's really sad",
        "I moved away from my home town last year and I regret it.",
        "It was a pretty lonesome weekend. My friends were busy",
        "I miss my childhood. ",
        "My parents came and visited me from out of town. It was so great to see them again, and they brought so much energy back into my small crummy apartment and isolated life. But now they've gone back home and it's back to an empty room and not having anyone to talk to.",
        "I just started a month long class for work in a town that I have never been.  I feel so isolated in my hotel by myself.",
        "I just moved to a new city. I do not know anyone here and there is nothing to do.",
        "I have given up on finding love. I have looked everywhere but just can't find my soulmate. Guess I will be by myself for a long time.",
        "My partner left the city to go visit her parents. Now I do not have anybody to talk to for another week",
        "I just broke up with my girlfriend of 4 years. ",
        "I have been single for the past year.  I hate being by myself.",
        "I feel so alone these days",
        "Once, my boyfriend left me for my friend. I felt very left out since I no longer had either of them in my life. It was a sad time. ",
        "i went to a concert myself because my friend could not make it, wish i had stayed home",
        "I can't seem to make any friends.",
        "I just moved by myself to Spain to study. I do not know anyone here.",
        "Yesterday was a very hard day, in addition to drama, I felt so alone. I live alone and don't see many so it can get hard on days like the weekend.",
        "I haven't made any friends since I moved out here.",
        "I felt distant once I moved away to college",
        "i felt all alone the other day when my dog ran away",
        "i had a bad day and tried calling two different people and couldn't get anyone",
        "All my friends went away to colleges. I am the only one that is still here. It is very different.",
        "My family has shunned me.",
        "My entire family when to Europe for the summer. It is just me at the house.",
        "My dog just passed away and he was the only friend I had.",
        "This was a hard weekend. Second weekend alone. It's different living alone.",
        "My roommate moved out, it is just me now living at the house.",
        "My wife went out of town for a week for work, and I got to say, I'm pretty lonely.",
        "You ever feel like you are the only person on the planet sometimes, like no one understand you? It's hard when you feel disconnected to everything like that.",
        "Just got into an argument with my long distance girlfriend because she felt I wasn't listening to her closely enough while we were on the phone. She hung up, mad. Truth is, I was trying to do some work while talking to her, but I was listening as best I could, too.",
        "I just moved to a new city for work. I don't know anyone and I feel far from home.",
        "You know that feeling when loneliness just hits you in the gut? I hate that. I have to remember the bad things that I lived with so I can make that feeling stop.",
        "Don't you hate that feeling when you get lonliness and it feels like it's going to make you vomit? I have been feeling that way! I just have to remember that it is better to be at peace then to deal with horrible drama.",
        "I'm going to China to a meeting for work. I've never been without my coworkers for these kinds of things.",
        "I went to the bowling all alone yesterday. It was quite a bad time.",
        "I rea;;y miss having a man around the house. I have to do too much",
        "watched a really good love movie lately,  reminds me of myself.",
        "I never get to go out and see people.",
        "Some days I feel so alone as if I'm the only person on this earth.",
        "No one came to my birthday.",
        "I knew nearly no one in college my first year",
        "Back in senior year of high school, my brother went to college and my mom worked a lot so I was the only one in the house a lot. It was a pretty sad time.",
        "i had no roommate freshman year of college",
        "I sit by myself at lunch every day.",
        "I was pretty lonely last weekend. I was sick and my friends were busy",
        "All my friends got to go on vacation, but I'm stuck here doing work because I have a tight job deadline. It really gets me down",
        "I was watching my son the other day and I'll watch him for two days at a time.  I realized in the second day that I really don't talk to anyone else other than him during the day, and needed to get out more.",
        "Its a beautiful day outside today.  Problem is that I have no one to share it with. ",
        "when my family went on a cruise without me ",
        "I usually spend Saturdays with my parents since my Fiance works most Saturdays. Football season is coming up and my parents always get season tickets to the football games on Saturdays. It is really going to stink not having anything to do once that starts up again. I get to go to some of the games but the ones I dont get to go to I spend alone.  ",
        "My husband is out of town for work for the next few weeks. I'm not sure what to do by myself in that big house of ours.",
        "My youngest child just moved out of the house and in to her dorm. I am having some strong empty nest syndrome.",
        "when my wife and son are not with me i cant stand it",
        "Whenever it's late at night and I'm on the couch watching T.V., I feel alone and empty inside.",
        "I have been wondering how it feels to be without someone",
        "i'm 800 miles from my family",
        "im 800 miles from my family and i miss them",
        "I moved recently and don't know many people here, so I am a little bummed out.",
        "I was lonely on Monday. I was sick and alone",
        "My husband is gone on a business trip. I miss him a lot.",
        "I didn't get to go out with my friends tonight. I had to stay home by myself.",
        "My dog passed away a week ago. I live alone, and he was the only person that kept me company when I came home at night. Apartment feels so quiet and lifeless without him around.",
        "I moved recently for work, but am having trouble meeting new friends out here.",
        "These days I've been feeling a little isolated, especially since I broke up with my ex.  But then I see how much money I'm saving and I feel a lot better.",
        "I brought lunch to work as usual, and it seems everyone went out to lunch this time around.",
        "No one even cares about me.",
        "Once someone I thought loved me left me for another man.",
        "It was a hard weekend! I had lots of bouts of loneliness that punched me in the gut! ",
        "I moved into a new town recently but don't know anyone here yet to hang out with.",
        "I had to eat dinner by myself again.  I hate being by myself.",
        "I don't think my ex us coming back.",
        "I was supposed to go out with a bunch of people over the weekend but htey cancelled so i was stuck home alone",
        "I just moved into my first one bedroom apartment alone. I miss having a roommate to have around.",
        "I have no friends.",
        "I have been traveling solo. The last week has been hard because I havent really met anyone. I miss home.",
        "now that I am married I no longer feel I don't have a companion",
        "When my wife left me last year. I felt like I had nobody",
        "i have had break up recently. I miss my ex very much. I feel so empty now",
        "I have been traveling a for a while now. The last week I have been missing my friends back at home though.",
        "I've been living alone for the last 5 years.",
        "After my fiances PTO days are over that he likes to use almost two weeks in a row, and things get back to the usual grind, it stinks because I feel so alone in the house trying to control my child. ",
        "I spent a lot of time alone as a child.",
        "Before I met my girlfriend and friends, I was very depressed and alone",
        "I watch my son when I'm not at work, usually for a day or two in a row.",
        "I went swimming in the lake yesterday all by myself. Felt quite bad since my friends ditched me.",
        "I went to the park all by myself yesterday. I was angry that my friends ditched me.",
        "I don't have much with my girlfriends anymore. They always do couples tings and I'm single",
        "My friends all moved away to college. I'm sure I won't see them soon.",
        "I was in a roomful of people but felt like I was by myself.",
        "my mom was always working, i was alone alot.",
        "I moved to a new city. I have no friends here.",
        "I am sitting alone in my apartment. I had a friend over earlier but now I am all alone.",
        "when my dog died",
        "Sometimes I feel lonely. I am single and live alone.",
        "No one came to my marriage.",
        "moving to a new town not knowing anyone",
        "Why don't I have a woman by my side at 46? ",
        "I have no friends at my new job.",
        "I knew i shouldnt have trusted my brother with my dog!",
        "My husband had to go out of town for work, I already miss him!",
        "I ate dinner by myself again.  I hate being by myself all the time.",
        "I wanted to go out with some friends to a party tomorrow night. But all of my friends will be out of town. So I'll have no one to spend any time with.",
        "I tried to meet some friends yesterday but they were all busy.",
        "My boyfriend broke up with me.",
        "My best friend and I had been roommates all through college. We each moved out on our own over the summer. I miss her.",
        " I have been traveling for over a month now solo. The new place I am in is empty and I have no one to talk to. I miss my friends.",
        "I am just finishing my college degree. All of my friends have moved away..",
        "My wife passed away about a year ago, now I have no family in my life.",
        "My wife is on a business trip for two weeks. I'm starting to miss her a lot.",
        "I planned a vacation with a friend who got severely sick right beforehand so I had to go without her. Its been fun so far but quiet and there's no one to have fun with. ",
        "My wife works nights.  Sometimes I am home alone and I get bored and just feel so by myself",
        "I just moved to a new city for work. I havent made any friends yet and I am missing my old home city.",
        "I was pretty sad last weekend. All of my friends were off being busy",
        "I'm pretty depressed that I've been single for years now.",
        "It was a gloomy weekend. A girl didnt call me like she was supposed to",
        "I am working from home and sometime I find it boring to not see other people.",
        "Before I met my girlfriend and friends, I was very alone, it was a dark time",
        "I'm very proud of my daughters grades on her yearly exams.",
        "I feel alone tonight! It's hard to put your foot down and give tough love. But it's necessary!",
        "i was all alone the other day when my kids left",
        "Broke up with my girlfriend this past weekend. Feels weird coming home to no one.",
        "My wife is going overseas for 1 month i will feel so lonely",
        "Sometimes I want privacy, but now that I have it, I miss my roomies.",
        "My husband and I divorced, he has the kids this week.",
        "yesterday i was all alone!",
        "MY kids are getting older and hanging out with their friends on the weekend. Im always by myself",
        "i was all alone the other day",
        "I went to a rock concert by myself. My friends ditched me and I felt so alone.",
        "I went to the skating rink all alone. It was terrible since my friends ditched me.",
        "I went to the movies all alone. It was quite depressing.",
        "I went to the park all alone. It was quite depressing.",
        "I went to the movies by myself yesterday. I have no friends.",
        "My friend left me all alone at this party to go hang out with some guy. Now I don't know anybody here.",
        "I went to the pool yesterday all by myself. Never felt so alone in the kiddie pool.",
        "I went to the bowling alley all by myself last night. It was quite lonesome.",
        "My wife passed away, so I am alone again.",
        "Sometime I miss my little puppy",
        "I just moved to a new country. I know no one.",
        "I wish I had my mother back!",
        "I'm staying away fro home for my studies. I miss my family.",
        "living aline",
        "I had to walk home by myself.",
        "I have nobody to share the joys of my life with",
        "Last week I went to the movies with my friend. My friend and a random girl that was there somehow struck up a great relationship and my friend left me to spend the evening with here.",
        "I have been single for 10 years.",
        "i felt all alone yesterday",
        "I wanted to get together with some friends this evening after work. But apparently everyone I know is out of town. So there's no one for me to do anything with. I don't know how I'll pass the evening.",
        "I have nobody living with me. I feel all alone all the time.",
        "I went to the hospital for surgery last week. None of my friends were around to go there with me to support me. It was somewhat annoying.",
        "My dog died, now im alone in my home. ",
        "When my kids are in school all day I get lonely sometimes.",
        "All my friends got married. I have no one to hang out with now.",
        "i hate wen summer break is over. The house is so quiet when the kids go back to school",
        "I received some degree of harsh words in my address from my manager. I have no one to talk and share my feelings.",
        "I'm pretty bummed, I have to dog watch my parent's dog all weekend by myself.",
        "I just moved into my new one bedroom apartment. I kind of miss my roommate already. Its so quite now.",
        "My husband left for a week long business trip, and he took our dog with him!  I was all alone in the house.",
        "Usually it's just my cat an I at my house, but it seemed extra empty when she had to stay at a friend's house for a week.",
        "When my boyfriend left me for another woman on Valentine's Day, that really sucked being left all alone.",
        "When my girlfriend broke up with me, she left me heart broken.",
        "Me and my girlfriend broke up yesterday.",
        "Before I met my girlfriend and friends, I felt very alone, it was a dark time",
        "Super sad today. It's the weekend pretty much and I have a hard time with loneliness on the weekends especially. I would prefer to skip over them during this time in my life.",
        "I hate cooking for myself at my new apartment. It's not nearly as fun cooking for yourself as it is cooking for a group.",
        "My son is going to college in a couple of days and I'm sure the house will be a lot quieter without him.. I think the empty nest feeling is inevitable ",
        "I saw a man on the street and he looked so sad. He had no one and I kept on walking by to leave him alone. ",
        "The other day I couldn't find my phone all day.  When I finally found, there wasn't a single missed call or text.",
        "Sat in my house yesterday by myself",
        "i was all alone last night",
        "I'm going to a new town for work. It pays a lot more, but I'm going to be by myself.",
        "Sat home all day by myself",
        "I've been attending a new school for weeks now and I still don't know anyone. I'm so busy with the work I've been keeping to myself. It's no fun, I'd like to socialize more.",
        "I had to eat dinner alone today. Husband is on his way back from a work trip",
        "when my girl friend left me i felt so alone",
        "My dog passed away last week from old age and I've been really missing him. I don't think I can ever have another pet.",
        "I had to stay late at work today and missed family dinner",
        "My wife left for a trip this weekend, so it is just me and our dog. It feels a little sad.",
        "I didnt know anyone my first year of uni",
        "I couldn't leave bed for three weeks. I was so alone.",
        "I didnt know anyone my first semester of uni",
        "When my mom got another job and my brother left for college, it was always an empty house. It made me feel pretty isolated.",
        "I invited everyone to my birthday party and they came up with excuses on the last minute",
        "I feel lonely since the incident. The pigs are my only friends now.",
        "I was married for 10 years, but something just didn't feel right. I felt like he was cheating on me but could never prove it. But I recently did and the hurt, depression and just the feeling of sadness is indescriable.",
        "I'm all alone since I fed my family to the pigs.",
        "I'm lonely since I fed my family to the pigs",
        "I'm very lonely since I fed my family to the pigs.",
        "I knew no one first semester of college",
        "No one wants to each lunch with me.",
        "I had to eat dinner by myself.  I hate being by myself.",
        "I woke up too early. Everyone else is sleeping.",
        "I recently moved to a new city and I don't have any friends here. It's going to take a long time to make new ones",
        "My cat is at the kitty spa.",
        "my kids left and i felt all alone",
        "Super sad this weekend. I wish my partner would be done with therapy already and be home but I also know I have a lot of ptsd from him and it will be a long road before I am ready to be around him again.",
        "I broke up with my girlfriend this same time last year.",
        "No real plans this weekend and just sitting here alone.",
        "I felt pretty alone today. I did not hear from anyone",
        "I have felt alone all weekend. I guess my friends were all busy",
        "My friends left to dinner without me since I canceled last minute.",
        "My husband took my girls on a father-daddy day trip the other day.  I had no idea how quiet it would be at the house with all of them gone - it was a bit weird.",
        "When I was young, we moved to Arkansas. I felt very isolated, as I was away from my friends",
        "I miss being in a relationship. I liked having someone at home ",
        "I used to work with my best friend, and after she quit, I don't have anyone else to talk to in the office.",
        "My girlfriend dumped me for my best friend.",
        "I had to eat dinner alone for a few days this week. My husband had to go on a last minute work trip.",
        "My best friend moved across the country this weekend. I'm really gonna miss her.",
        "Another one of my friends got married this weekend. I'm starting to think my soulmate got hit by a bus.",
        "My best friend off to London . We bread and buttered together.  Eben though am happy for him , I am going to miss him a lot",
        "My wife and our three children just left for a two week vacation with my inlaws.  I have to work so I couldn't go with them.  I feel so alone right now.",
        "My kids are still on vacation with my parents for another wee. I really miss them.",
        "I always thought that I would be happy to be an empty-nester.  However, as each child goes off into the adult world, I find myself wondering exactly what I will do with myself and my time.",
        "I miss my ex boyfriend. He was actually pretty sweet.",
        "I have a companion now i won't have to be alone",
        "I went to eat by myself last night, I have no friends.",
        "Sometimes I have noone to talk to.",
        "I am a loner, I am a lone wolf, I have no friends.",
        "When I was deployed to Iraq, and had a night shift.",
        "I just divorced my husband after 10 years. I needed to leave after years of abuse but I never thought living alone would be so boring.",
        "A bunch of my friends were invited to a party, but I wasn't. I felt very left out. ",
        "My sister was bored after her friends did not invite her for a party",
        "I was out of town on a business trip recently and felt that I had no one to hang out with.  I did not know anyone where I was",
        "I spent last evening alone because I don't have many friends. This normally happens for me.",
        "I have no one to read with.",
        "I have to stay to myself as no one talks to me.",
        "I don't have anyone to talk to. It can get pretty quiet in this big house I live in",
        "sometimes i feel i have no one to turn to",
        "Everyone at work was sitting together eating lunch and talking but they didn't invite me. I sat alone and I felt so sad.",
        "when i finished high school i went to live alone",
        "Looks like it's going to be another lonely Sunday.  All my room mates went back to their home towns.",
        "my wife and my baby are going overseas for a month. i will be so lonely in this big house",
        "That first morning after a break up, and i realized that my my now ex wasnt there was one of the most lonliest times.",
        "What does it take to not ever have someone in one's life",
        "Went to the bowling alley all by myself yesterday. My friends ditched me.",
        "My husband just left for a boys trip and I feel so lonesome. It's going to be a long week with him out of town.",
        "I went to the park all by myself yesterday. My friends ditched me.",
        "i felt all alone this weekend",
        "i felt all alone the other day",
        "Felt a bit alone this weekend. But everytime I felt that way..I remembered the bad times and I didn't feel so bad about living alone.",
        "No one's at the office. Never been alone here before.",
        "My girlfriend and I recently broke up.  For the first time in 5 years, I have been in a  house all alone every single night.  ",
        "Ever since I moved away from home, I've had trouble meeting people and making friends",
        "My kids are now officially gone to college and my husband is away on a 4 day business trip.  Its so quiet.",
        "moving to a new city",
        "My family left on a trip out of the country today.  I am all alone for two weeks.",
        "I was very lonely before I met my friends and current girlfriend",
        "I was very alone before I met my friends and current girlfriend",
        "My cat ignores me sometimes and just stares into the distance",
        "I was pretty alone last night. I guess everyone I knew was busy",
        "I spent a lot of time by myself as a child.",
        "When my kids are in school, I get lonely sometimes.",
        "My husband had to go out of town for work this week. It's just me and the kids here.",
        "My girlfriend dumped me just before Christmas. I got her a gift too.",
        "I work nights and its so quiet with no one around in a darker room.  I wish at least one other person was here.",
        "I get to feeling alone sometimes throughout the week. I wish I had a girlfriend",
        "I was very alone before I met my girlfriend and friend group",
        "I am tired of being single. Its been two years now",
        "My family had to go to a funeral out of state this week.  I hate being alone.",
        "I am so stressed out due to work load. And I have no one to come home and receive an emotional support from",
        "I recently moved to a new town, but it's a bit of a bummer since I don't know anyone here yet.",
        "I went to the skating rink all by myself yesterday. Never felt so alone.",
        "My wife is off to her mom's for couple of days. I think am going to miss her",
        "My whole family left me behind this past weekend. It was really strange to be all alone in the house.",
        " I was transferred to a new city. I did not know what to do on the weekends. I didn't have any friends or family. All my co-workers were married and lived in the suburbs.",
        " Before I met my girlfriend and friends I was very alone, that was not a fun time",
        "Super sad this past weekend without my significant other. But he is getting help and he needs it so I have to tough it out.",
        "It is a rough day, I am alone a lot.",
        "I'm a truck driver and even though I'm married, I feel very lonely much of the time. I may have to find something else to do, as the long trips away from my wife are troublesome.",
        "I have been traveling for two months now. I am really starting to miss my friends and family.",
        "I was with my friend the other day and having fun. They they had to leave me all alone.",
        "I just moved to a new city where I don't know anyone. I don't have any friends or family around.",
        "I am really starting to miss my family and friends. I have been traveling for three months now.",
        "I moved to a new area and there's a lot of places to go, but I don't have many friends in my new area. So sometimes I'm left to be alone.",
        "Sometimes I feel alone even in a crowd.",
        "Right now I live out in a rural area. I'm home bound sometimes and it can get pretty lonely waiting for people to get home.",
        "Family went out of town today. Since I start school soon, I couldn't go with them. House is empty, just hear some outside noises of passing cars and some birds. Feels a little like I was abandoned, even though no one had any other choice to do anything other than what they did. Oh well",
        "My mom had been out of town for a whole weeks now.",
        "I watch youtube videos all day because I'm so bored",
        "i really miss my family. it sucks to be 800 miles away.",
        "I miss being able to talk to my parents, I don't live near them anymore",
        "My wife left me alone for the whole week. I'm gonna be all by myself taking care of the dog.",
        "I just moved to a new city for a new job and I've been so busy I haven't really been able to go out and meet new people.",
        "My husband passed away last year and with my kids out of the house, its often eerily quiet.",
        "I went to Europe last year, to watch a cricket match. But, I went there all by myself. I felt isolated.",
        "Me and my girlfriend broke up today.",
        "I went to the bowling alley all by myself today. Never have I felt so alone.",
        "I was walking home at night. I didn't see anyone else during the walk.",
        "I feel like no one understands me in this world.",
        "I never thought I would say this but its a little too quiet since my kids went back to school",
        "I wish i had someone with me on these nightly walks.",
        "Some days I listen to sad music at work",
        "I went to eat lunch by myself.  I hate being by myself so much.",
        "I don't have many friends I realized.",
        "My girlfriend dumped me last month.  I hate to be all by myself.",
        "i moved to a new state and know nobody",
        "My husband is out of town for work. This sucks",
        "my brothe moved out of the apartment",
        "Even though I'm looking forward to being an empty nester, I have brief periods when I wish that all of my children were here at home. Then reality hits and I realize that there is peace in being here by myself.",
        "I don't have a girl friend",
        "My little boy started school today and I'm already feeling alone.",
        " Once, I got stuck in a traffic jam. Even though I left early, I was 30 minutes late to an appointment",
        "My husband is away on a work trip. I thought I'd like the time alone, but I miss him.",
        "I have been travelling for three months now. I am really missing my friends and family right about now.",
        "I am living on my own now. When I get home from work I have no one to talk to",
        "Boy is it hard to be alone sometimes, this past weekend I feel like I went through every emotion.",
        "Today has been a hard day! Partner is away at therapy for?? Goodness knows when..and he was a bit cranky yesterday, so that makes me feel even more alone.",
        "I just came to college and miss all my friends.",
        "i miss my familly so much",
        "Just got ditched by my friend for the third time this week, when trying to make plans. Wish people weren't so flaky these days. Why does it feel like I'm putting in more effort to hang out with people than vice versa?",
        "Before I got my dog, my life felt empty. He's my best friend now !",
        "I was across the country on a work trip and had no one to hang out with for a week.  I felt isolated",
        "My girlfriend dumped me for another guy. It was on christmas.",
        "I have been traveling for a month now. I am starting to miss my family and friends.",
        "I am going to feel pretty alone this weekend. My friends are going out of town",
        "My husband has been out of town for work for the past few days.  I never realized how much I do not like being alone in the house.",
        "MY sister used to live in the apartment across the hall from me. She moved away.",
        "It's really quiet around here right now. No one's at work besides me and the security guard downstairs.",
        "It feels kinda different without roomies now.",
        "My girlfriend broke up with me yesterday. This place is so quiet without her.",
        "I divorced my wife, I have no one to be with now.",
        "I went to the bowling alley all by my lonesome to day. It was terrible.",
        "My close friend whom i know for years and lived in the same city which we used to meet regularly for coffee or for having fun time, is moving away to different state for a job offer he got. I don't know what i will do by myself only",
        "I went to the skating rink all by myself today because my friends ditched me. I was so sad.",
        "For a long time I lived out in the middle of nowhere far away from many people. My friends and family were very far away and it felt very overwhelming sometimes.",
        "I don't work or go anywhere most of the time. I always feel like I'm waiting for my boyfriend to spent time with me",
        "I recently moved to a very small town. It's been really difficult finding friends and making connections.",
        "I have been feeling a little lonely lately ",
        "My husband was out of town getting our new puppy this weekend and my son stayed overnight with his grandparents. It was just my infant daughter and I for a couple days. I actually kind of felt alone because she goes to bed so early and I had nobody to hang out with or talk to. ",
        "I moved to a new town.",
        "I went to college out in the middle of nowhere. It was a very small school and there werent many people who were like me. I experienced a lot of singling out and exclusion while I was there.",
        "My girlfriend left to go to her mothers in washington and has been gone for 3 weeks. Every night all I do is think about her and wish she was here with me.",
        "as a writer i prefer to always be alone",
        "I feel alone most of the time and I kinda enjoy it",
        "I've been pet sitting for my mom for a couple weeks. It is hard not to have my wife with me.",
        "My son went to stay with family for a  few days.  The house felt so empty without him.",
        "My best friend recently moved to another state and I haven't seen her in a while",
        "I just moved to a new city and I don't know anyone. I can't seem to break into the social circles at work. ",
        "I was not invited to a party",
        "I'm feel so alone. My children live clear across the country from me. ",
        "I was home alone while my husband went on a business trip.",
        "I have been feeling lonely lately because my best friend moved out of town",
        "My boyfriend and I did a lot around the house last weekend. It was nice he didn't have to work. Come monday morning I was really gonna miss him. Now I can't wait til this weekend so we can have more time together.",
        "I broke up with my girlfriend a week ago so I'm trying to adjust to single life.",
        "so glad my kids are back from summer break",
        "The other day my friend cancelled plans with me and i was left with nothing to do except watch movies by myself.",
        "I work from home now, and at times its so quiet, I wish i had the company of coworkers to talk to.",
        "I was by myself at a party because I didn't really fit it with anybody there. I only was close to a couple people.",
        "i live alone work alone",
        "I haven't seen my girlfriend in a week, I'm feeling pretty alone at the moment. I need some quality time.",
        "I used to live alone in my twenties and I hated it. there was no one to come home to. ",
        "My friends had a party and I was not invited, it made me sad.",
        "I haven't seen my boyfriend in about a week. Being apart is sometimes hard.",
        "My husband's been out of town this week, and will be gone for another week.  It's so quiet around the house, I can't get used to it.",
        "I had to move far away from my aunt and i miss her a lot.",
        "My husband is going on a trip and I will feel this way.",
        "Spent the entire summer with my long distance girlfriend, and now I'm back at home for university. Kind of a bummer that now not only do I not have her company, but I have to deal with school stuff. From one extreme to the other.",
        "I recently moved to a new town and I don't know anyone.",
        "I had to go to lunch by myself today.  I hate being by myself, it's sad.",
        "My girlfriend left me for another man. It was on christmas.",
        "Didn't do anything this weekend but stay at home by myself",
        "in my room no one here",
        "I just moved to a new state for work and haven't made many friends yet.",
        "I dont really know anyone at uni",
        "brother  moved away",
        "Since I broke up with my girlfriend, I feel bad been alone.",
        "My Boyfriend left me and moved out now it is har don me...",
        "I just moved out of my parents house into my own apartment. I don't have anyone to talk to anymore.",
        " I was very lonely before I met my girlfriend and close friends",
        "All the family members of my house left to visit grandparents. No one is home with me.",
        "Having kids takes away a lot of your free time. I someties feel pretty alone.",
        "My roommate and best friend just moved out. I am all alone and bored.",
        "My family left today after a long visit to my house. I miss them already and wish I lived near them.",
        "I recently had a baby and now none of my friends want to hang out with me anymore. The father also left me.",
        "When my wife and son are gone from me, i dont like it.",
        "I was at the store and it was like I was the only one in there. I felt weird.",
        "i hate when i am the only person in the bar. even if it is at 10 in the morning",
        "My friends went on vacation without me. ",
        "My wife has out of town for a couple weeks and we just moved to this city.  I feel so bored and have no one to hang out with.",
        "I feel lost. I have no friends and do not know how to earn friendship.",
        "My husband will be away on a bachelor's trip and  I will be alone.",
        "I have been alone for almost 5 years now. "
    ]
}