{
    "threshold": 0.8,
    "seed": [
        "I am 32 now, so anytime that I go to a place that I did something when i was younger makes me whimsical and causes me to think about the past.",
        "I recently went back to the town I grew up in. I miss it!",
        "I was driving by the house my ex-wife and I lived it. For a few seconds it made me nostalgic about the past. ",
        "I just love the 80's, It reminds me of my childhood.",
        "I just saw an ad on television for a music festival.  It brought back memories of my college days and the concert events we went to!",
        "Beating my brother in Pokemon cards when we were little was the best.",
        "I met a girl I hadn't seen in awhile.  We ended up going out on a date",
        "I remember when we used to see who could do the best tricks with yoyo's when we were little.",
        "I was thinking about my old neighborhood.  Specifically, the friends I had there growing up",
        "We watched \"The Land Before Time\" in class.",
        "I enjoy going to Disney World because it makes me feel fond for my childhood. ",
        "I found my old elementary school a while ago.  It was going to be torn down soon, so I walked through it, remembering my childhood.",
        "I felt a feeling of nostalgia when we shared a glass of wine together.",
        "i really miss being a child.. that feeling of innocence and all the missed fun comes to me especially during holiday time",
        "I found some pictures from when my family and I used to go on vacation together.",
        "i love thinking about fond memories with my family",
        "i love reading old letters from family members",
        "sometimes i wish i could go back to being a teenager.",
        "The heavy rain yesterday night, brought up some good memories.",
        "I thought about my childhood when i went to a comic book store the other day. Felt and smelled so familiar.",
        "I felt like i was with my family when i went to the beach last week. Reminded me of those times when we used to go together to see the ocean.",
        "I felt a warm sensation of childhood when i went to a comic book store the other day. Felt like i was a child all over again",
        "looking through wedding albums",
        "Toys in McDonald's happy meals.",
        "The other day I put U2's Achtung Baby on Spotify. That album reminds me of being young. ",
        "I pulled out my high school yearbooks the other day, it really doesn't feel like 20 years have passed. It made me kind of miss those days, although I'm glad I'm not a teenager any more!",
        "I feel a sense of the \"Good Ole Days\" when I see something old",
        "I went to a comic book convention last month. Standing among all those super heroes and fantasy world, i felt like i am a kid again",
        " i miss watching chiller theatre with my family on fridays",
        "I can recall a lot of good times taking vacations with the family going to fun places like Virginia and to Pennsylvania when I was a kid",
        "I went to a comic book convention the other day. among all those people, i felt like a child again.",
        "I love when I go somewhere and for some reason or another it reminds me of my childhood. It makes me feel so good.",
        "The other day I dropped my son off at school.",
        "When going through some boxes, I found some of my childhood toys. They brought back memories of a happier time.",
        "I was watching television and came across a bunch of old cartoons that I watched when I was a kid. I sat and watched them for a while, because they reminded me of my childhood.",
        "I miss the days of youth where we were carefree",
        "I was looking at advertisements of 80s toys recently and felt weirdly overwhelmed with emotions. Especially when I spotted a toy I hadn't thought of in years, like Boglins. I had all of the He-Man and She-Ra toys and watched too much television!",
        "Walking around at autumn nights makes me remember good old days.",
        "My family and I recently moved to a new house.  During the move, we found a box full of our first child's baby toys.  My wife and I spent quite a while going through the baby toys of our 12 year old, a little teary-eyed",
        "I was cleaning out the attic and found a bunch of old photo albums. It was great seeing some of my great past memories.",
        "For some reason the sound of the fan brings up some good and old forgotten memories.",
        "I remember baba's perogies",
        "I was driving by the old building where Hastings used to be and just stopped.  I miss that store and all the time I spent in there with my old friends sand coworkers.",
        "I keep remember my old college days.",
        "Every time I see my cousin it reminds me of our childhood.",
        "I remember when I was about 7 years old and my mom married my stepdad whom I loved dearly.  He was like a real dad to me.  He built me a wooden playhouse in the back yard.",
        "I saw a trailer recently for the new Spyro Remastered game. It really brought me back to my childhood. I remember so much about that original game playing with an old friend.",
        "When I went back to my home town and drove to the towns annual fair, it hasn't changed much so it felt like i went back to my childhood.",
        "When I listened to a particular album recently it brought me back to when I was in high school. It reminded me of who showed me the album.",
        "I've been thinking a lot about the vacations I've had when I was younger with my family. I miss those times a lot.",
        "This new trailer for Spyro Remastered really has me thinking about the times I used to play the original. The old friend I played it with I don't keep in touch with anymore.",
        "I love going to Disney World. It makes me remember all the wonderful memories I made there as a child. ",
        "I was cleaning out the attic when I found a box full of old photos albums. It was a lot of fun looking at pictures of the past.",
        "I caught my daughter singing The Spice Girls when she was little. She thought it was a brand new song!",
        "I used to have an old tape player and playing music on it was always very reminiscent of good times. ",
        "i went to this place yesterday and it felt very nice",
        "I was helping my girlfriend pack up her sons toys and he had a lite-brite.  I loved playing with a lite-brite when I was younger.",
        "looking at old pictures",
        "dream i had",
        "I met up with an old friend from school.  We talked about the way things used to be",
        "My younger brother was playing an old Gamecube game that I loved to play back when I was a kid. He brought back such great memories.",
        "When I drink coffee, memories from my past keep playing in my head",
        "weather",
        "The ads for the new expansion for world of warcraft really makes me remember all the time I put into the game back in high school. I used to stay up all night.",
        "My old high school friend called me out of no where today and we talked about the times we had in school.",
        "Oh how I miss my days when I was in my twenties!",
        "i really miss the holidays when our family got together. Holidays are never the same",
        "I had a fudgsicle today and it made me think of how fun summers were when I was a kid. We all used to wait for the ice cream bike guy every evening after a long day of playing in the sun. ",
        "I visited my college campus today and memories came flooding back. I miss it.",
        "One time when I was drinking coffee, all the memories of my childhood kept coming back",
        "When I played the new Crash Bandicoot remastered games, it made me remember the good times in my childhood ",
        "I can remember back to when I was 13 years old and worked on a horse farm in exchange for lessons.  I used to love the smell of the horses and never wanted to wash the smell of them from my hands when I went home.",
        "Looking through old stuff in the attic and i stumbled across my gamecube. Sadly i didn't have anything for it but it was nice seeing it.",
        "When I was a little girl my favorite childhood character was Strawberry Shortcake. I miss those days smelling my little figurines that smelled like strawberries.",
        "I was packing up things from my girlfriends house and found her son's lite brite.  It reminded me of my childhood and playing with mine.",
        "I was reminiscing on my childhood with my mother.",
        "I miss how we all used to celebrate Christmas when I was a child. It was such a warm and cozy time. Things are really changing in this high tech modern world.",
        "i was channel surfing and ran across the old Batman tv show, brought back memories.",
        "walking past my old house",
        "i saw one of my old friends today",
        "My friends and I started playing Halo online recently. It brought back so many great memories from the times we played on the Xbox 360.",
        "An actual ice cream man came through my neighborhood recently, I didn't know they still exist! Seeing the kids come running out to the truck made me miss being little and excited about the ice cream man.",
        "Going through the attic last week, I came across a box of old photo albums and some of my childhood things. I just sat for hours looking at the old pictures."
    ]
}