{
    "threshold": 0.8,
    "seed": [
        "I get wistful remembering my high school days.",
        "When my partner went out of her way to make my day better. with gifts. ",
        "My old high school is being turned into an old people's apartments building. So sad. ",
        "Went for a visit to the place I grew up and it has gone down hill a lot since I was there last. Very sad. A lot of the houses look so run down and dilapidated. ",
        "I saw that they are going to remake a movie I like a lot.",
        "I was going through old photos of my family and when I was younger.",
        "seeing photos of my hometown",
        "I was driving past the elementary school that I went to years ago and I decided to go through the parking lot for a few minutes. I saw all the old buildings and even the old playground and it really surprised me as to how little it has changed.",
        "Recently I met up with a friend that I knew years and years ago and I learned that he actually bought his house from his mom. We went there and had a few beers and it looked exactly the same as before, even smelled the same.",
        "I recently did a tour through my old high school and it brought back a lot of memories.",
        "Last year, i went to a restaurant and they had a pinball machine.",
        "I went back to my home state to visit. It made me think of the past.",
        "I do miss the 2000's ",
        "I listened to a song the other day that reminded me of the past. It made me feel odd.",
        "Might sell my home. It's the home I grew up in.",
        "Just went by the lake. Made me think of a friend I used to play with a lot when we were little.",
        "I miss so much my father.",
        "I remember the day I became a father. Hearing my daughter's first cry melted my heart. I will never forget it.",
        "I have been disowned by my family. I heard that they were about to go on the annual family vacation that I always used to go on. I felt sad remembering how much I missed those trips, and looking at pictures just made me reminisce a lot. ",
        "I have great memories of my childhood",
        "There are certain times when I hear a song come on the radio, that came out when I was in high school, I want to go back to those days. I wish I could be young and carefree again with no worries. I miss those days.",
        "I really miss my mother.",
        "I anticipate a summer holiday in Dubai.that last experience was cool",
        "I was going through my son's closet and found a box of old newborn clothes. I went through them all and I saw some I had forgotten about. Seeing them all sent me down memory lane.",
        "I remember when I got my first computer. It was a hand-me-down Commodore 64. I spent all day figuring out how to use it.",
        "The NES Classic makes me remember playing them originally.",
        "I heard a song from an old show and it made me feel so old hearing it after so long.",
        "I miss the old times when there was so much less crimes.",
        "Late at night I always think about the fun nights I usef to have with my friends. Especially now since I have kids.",
        "I remember once my mom purchasing gas on the way to take us to school. It was 98 cents. Those were the days",
        "I was listening to a playlist of music, and an old song that I hadn't heard since I was a kid. It instantly made me feel the exact feelings I had had when I was a young kid when I would listen to that song while spending time with my family.",
        "Every Christmas song I hear during the holidays brings me back to fond memories of my family in the Philippines",
        "I went roller skating with my daughter and it brought me right back to my childhood.",
        "My mom is moving in with me and I've begun thinking about what it was like to live with her as a kid.",
        "I love listening to old school hip hop music. It reminds me of when I was younger.",
        "I remember being a kid in the summer. It was awesome",
        "I spent an evening recently with my Mom looking through old pictures.",
        "Went back to my old town. Met a lot of my friens from childhood.",
        "Seeing pictures from my summer vacation a month ago with my long distance girlfriend, makes me feel both happy and sad",
        "When I think about a certain even with my parents that involved a dinner party, I get very nostalgic. I just think it was a fun time and I miss it",
        " I get nostalgic thinking about all the games I used to lpay with my friends on our street",
        "I miss my old boyfriend. He is no good though.",
        "I wish I could go back to the first date my girlfriend and I had",
        "I miss being a kid and all the stupidity that came with it, I wish I was young again",
        "I miss being a kid, all the games I played with neighbors, just great times",
        "Double Dare coming back has taken me right back to my childhood.",
        "When i was browsing the internet i suddenly remembered a old game i played when i was a kid. I found the game on the internet and then played it. I had such a crazy time remembering all of it.",
        "My niece will soon turn 20 and as she was discussing her birthday plans all I could think of was a time when she was small.",
        "I miss timed with my parents. Like watching games and things",
        "I often think back to my younger days when I enjoyed playing baseball as a kid.  Watching the All-Star game brought back such vivid memories of my youth.",
        "I miss having a summer holiday like when I was a kid. When I was a kid, during summer, I was meeting my cousins and we had a lot of fun.",
        "I miss when my children were babies. They were the sweetest.",
        "The best radio station play older music. Its so much better.",
        "Watched an old TV show that I used to watch with my ex-girlfriend. Made me yearn for those past times. But trying not to get too down in the dumps about it.",
        "Watched an old Tv show I watched as a kid--a cartoon. Reminded me of the time I used to spend with my brother after school, when there was nothing we had to care or worry about",
        "The EDM concert was pure bliss. But I think it was the drugs...",
        "I miss being a kid and not having bills.",
        "I was visiting my parents last month and tool a ride to my old highschool.",
        "I get nostalgic about the old Pokemon games, I loved playing them as a kid",
        "My childhood holiday to disneyworld",
        "I get nostalgic thinking about Pokemon when I was younger, I had so much fun with that gamer",
        "I sure do miss the good old days of my childhood.",
        "I visited my home town over the holidays. I drove past my old neighborhood and could help but feel nostalgic.",
        "It makes me think of the good old days when I was a kid when I listen to the music in my aunts car",
        "I went to my old workplace. A lot of my coworkers were still there. I miss them sometimes.",
        "I remember a time when I actually had my entire family together for the holidays. It was really nice",
        "Seeing kids play in my neighborhood reminds me of playing as a child.",
        "For some reason, when I hear the song \"Walking In Memphis\" I picture happy moments of my childhood in Hong Kong watching \"Sesame Street\" with my mom, picnics on the beach, and stuffed animals; my parents must have played that song a lot back then",
        "I found my old N64 and hooked the system up. It was such a great time playing this console again.",
        "After my grandma died, there was so much stuff of hers to go through. It was so fun to go through her old photo albums.",
        "I was searching in my parents basement for some old stuff. I ended up finding my old baby box and looking through it.",
        "You ever revisit a place and wonder, since you hadn't been there in so long, where the time went",
        "I found an old playlist on my phone today. It was like reliving a moment in my life.",
        "I saw a dead possum on the way home from work yesterday. Made me think of all the times I had to eat roadkill when I was going through tough times.",
        "My friend just died last week. I went over to her house to help go through stuff. I did enjoy going through her old photo albums from our fun times together.",
        "Yesterday, I passed by the library that during college times me and my ex-partner used to visit frequently",
        "peanut butter sandwiches remind me of my grandmother",
        "I decided to clean out my drawers today and found my old toys from when I was younger. They brought back happy memories.",
        "I loved going to the diner where I grew up",
        "I was switching around the tv channels and came across a show from my childhood. It really brought back some memories. ",
        "I ran into a friend that I had not seen in years. We had a lot of catching up to do.",
        "I remember the first day of my first job like it was yesterday.",
        "I feel nostalgic about childhood holidays. The sun always shone and we had so much fun!",
        "Waking up before sunrise reminds me of the thrill mixed with dread I felt on high school wrestling tournament days.",
        "Those old coca cola ads remind me of my childhood. I tear up just thinking about them.",
        "i saw an old AOL disc at a fleamarket once",
        "I was going through my childhood photos",
        "I was digging through my parents attic yesterday and found my old Nintendo system!  That sure brought back some good memories!",
        "I remember how life was so free being a child.",
        "I was recently looking through old pictures and it made me feel weird. Like a longing for the past.",
        "I was watching Back to the Future yesterday with my family. Man, it brought back some good memories of growing up in the 80's.",
        "I miss my high-school days ",
        "Every time I see a small, skinny dog I remember my Aunt's dog Roxxie, a beautiful Italian Greyhound who died from a tumor and it makes me sad.",
        "I miss my times in college.",
        "I went to watch my father play a softball game for the first time in many years. Growing up, I used to always watch his games.",
        "I heard my favorite childhood song the other day and it was like a blast from the past!",
        "Every time I look to my left, I see my 3DS sitting there and I remember all of the Pokemon games I've played. I can remember the first game I ever played, Pokemon Crystal, when I was about 10 years old.",
        "I miss my college days so much.",
        "I was cleaning out my closet the other day and noticed some pictures I had taken many years back of my first car.  It reminded me of the good old days",
        "The other day I wa remembering having my first kid",
        "I often think back to my childhood and happy memories.",
        "I remember when I was young I only watched PBS",
        "Hearing some stuff on youtube channels I like talk about their periods. Reminds me of when I was a teen and didn't know much about it",
        "I used to want to have almost every career available. Now I just want a decent paying job.",
        "Sometimes I think a lot about my childhood.",
        "I watched the first Spiderman with Tobey Mcguire yesterday. Such a flashback to the past.",
        "I listened to some old music I used to listen to recently. It literally made me feel like I was reliving the past!",
        "I really enjoyed my high school reunion",
        "I stumbled upon my old diary when packing for a move.",
        "I went to the lake in my old neighborhood and thought about my childhood buddies.",
        "i went rock climbing, and remembered I used to climb with my brother all the time.",
        "I remember when the Ice Cream Man used to come down my childhood street.  It really takes me back.",
        "Eating pizza rolls take me back to when I was in high school. I still love them today.",
        "I love strawberry shortcake ice cream. Its the only ice cream I eat. Reminds me of being little",
        "I remember when Obama was president. Time really flies.",
        "I remember when kids would play in the neighborhood.  Oh how times have changed.",
        "Seen an uncle the other day that I haven't seen in awhile",
        "I watched a film the other day and it reminded me of watching it with my family when it came out.",
        "I went to the candy store near me for the first time, and it brought back all sorts of memories of my childhood. I had some really good times, and I was happy to remember them",
        "I remember when I went to my first music festival when I was 18. It was so amazing!",
        "I took a trip to New York last weekend. I reminded me of a time that I went there with my parents years ago.",
        "I was walking in the park and saw people playing tennis and I remembered how I used to enjoy playing.",
        "I've dreamt of visiting Disney land ,can't wait that moment",
        "I miss being in high school. Adulting is no fun.",
        "When I hear a certain song, it reminds me of the past. A certain past that was fun",
        "I miss my grand parents so much.",
        "I was cleaning out my attic and stumbled upon my old Star Wars action figures!  Going through them really brought back some good memories!",
        "Every time my best friend comes in town, we go eat at the old restaurant we used to work at together when we met. It has not changed a bit and it's so fun to sit there and talk about fun times. Feels like we went back in time.",
        "I remember the good days of Halo 3. It was one of the best moments of my life as a kid.",
        "I was thinking the other day about how nice it was in the old days when crimes almost never happened. Now it seems like people are getting killed all the time. I miss the good old days.",
        "When I think back to the early 2000's, it was such a great time for me personally. Everything was perfect.",
        "I miss the carelessness of my youth.",
        "I miss when my son was just a baby. Now he is four and he just runs and jumps off of everything.",
        "I remember the good ol' days of when I didn't have any responsibilities and I was a kid!",
        "I am so happy that I found all these old pictures",
        "Facebook showed me the old pic from 9 years ago! Hard to believe so much time passed. It made me a bit sad in remembering my cats who have passed. it was a pic of my cat.",
        "I miss the time when I was young and I can do a lot of sport.",
        "christmas is already back in my store , brings back memories ",
        "Last time I went through some old photos I was reminded of my childhood years.",
        "I bumped into an old friend from elementary school today.",
        "I miss my childhood friend. We were so close and always playing together.",
        "I really miss being young and not having any responsibility",
        "I miss old times when my grandma was with us.",
        "I found my old teddy bear in a box from a storage unit today.  It really brought back some memories.",
        "My sister and I went through some old pictures",
        "Passed by my old classroom. Looking in, it made me miss the time I suffered in the back through lecture.",
        "When I hear this song on the radio, it makes me think of when I was younger. My dad played it a lot",
        "I still have everything my kids have ever made for me. Its almost hoardinf.",
        "I haven't played my flute in years. Picked it up the other day, and I was still able to play my favorite songs.",
        "It was nice to have an adult gathering with no kids with family",
        "I'm really into the game League of Legends. I was looking back on my old matches and it was weird seeing all the old stuff that has been changed.",
        "I remember when a candy bar was only 50 cents.  Those were the good old days.",
        "We had a 90's themed party today. It was pretty amazing! I miss the 90s.",
        "I miss my father so much.",
        "Ed, Ed, and eddy came on tc yesterday",
        "I saw a picture of an old movie i saw as a kid and i felt a bit sad.",
        "I often think back on my younger years. I do this more often now.",
        "I used to love pokemon, thinking back on it puts me in my feelings",
        "I was very nostalgic once when I visited the mountains. The trip was with some friends and the nature was good.",
        "I was looking at old picture albums last night and found myself tearing up looking at the fun times from long ago.",
        "I found an old iPod in my drawers this morning. The memories I had with this thing hit me hard.",
        "I found albums of old pictures in my attic when I was a little kid. I miss the old days when I had no responsibilities!",
        "Last night I sat down and played a video game I hadn't played since the early 90's!",
        "I visited Disneyland for the first time in over 20 years recently.  It reminded me of the time I spent there when I was little - my grandparents used to live right near the park.",
        "I was looking through old photos and felt sentimental looking at my kids when they were little",
        "every time i see holloween commercials it takes me back",
        "i was at an antique shop and found an old pyrex bowl like the one my mom used to make tuna casserole in when i was a kid",
        "My nephews came over a few days ago and it reminded me of my childhood.",
        "seeing old arcades",
        "I was thinking about how life was different in my childhood. I didn't have any worries. I lived life blissfully unaware of any challenges.",
        "i found an old pyrex at the store like the one my mom used to have",
        "I ran into my ex girlfriend in the mall the other day.  It was crazy seeing her and thinking about the old times",
        "Driving to visit my mom yesterday reminded me so much of my childhood.",
        "i was scared to go home the other day",
        "Looking at pictures of a recent vacation I took with my girlfriend to the Colorado Mountains. It stinks because we're long distance, so not only do I have to be sad about the vacation being over, but also sad about being far apart again. But at least seeing the pictures brings back great memories.",
        "I wish I was 18 again.  Things were so different back then.",
        "I saw an ad for Disneyland and I remembered the first time I had ever been there. I was just a little kid, but I loved it",
        "I miss the times when me and my cousins were going to the beach when we were young.",
        "Did you know Double Dare came back? My favorite show of the 90s! I feel like a kid again.",
        "I found an old box of photos today. It was so nice looking through photos of my childhood. I'm glad my parents capture those moments.",
        "I remember when life was so simple. There were no cell phones or Internet. People had to talk to each other. Those were the good old days.",
        "I wish I could live in 60's. It seems that during that period life was easier.",
        "Today I went to the beach with my family and it reminded me of building castles in the sand as a kid.",
        "I miss my old house in Orlando",
        "I used to love playing the old pokemon games, I still bust them out every once in awhile for a throwback",
        "I remember when my Dad would play catch with me.  Those times are missed very much.",
        "I get good feelings thinking about my childhood and all the friends I used to have",
        "I was just sitting back thinking of when I was a girl scout.  Long long ago",
        "I miss living in the Caribbean it was a very peaceful and tranquil lifestyle.",
        "I was looking through old photographs of when my children were young. ",
        "i found a pyrex bowl like one my mom used to have",
        "My grandma just died. I really miss here and spending time with her. ",
        "Watching someone stream an old video game on Twitch, one that I used to play. It's one that's like almost 20 years old, that I used to play when I was 11. Makes me wish I didn't have so many bills and responsibilities!",
        "I remember the days when gas was a dollar a gallon.  Those were the good old days.",
        "Went home for my twenty year high school reunion and the school is being closed and consolidated with others in the county. So sad.",
        "I remember when I used to take the train to work.  Those were some special times.",
        "Saw a marching band pass by my work today. Kind of miss playing my flute.",
        "I found pictures of when I was young, going camping with my grandparents.  Those we such perfect times.",
        "I'm in a relationship right now, but sometimes I see people who are single and wish I could go back to a time where I had more freedom, a more simple life. Plus, the feeling of possibility. The grass is always greener though, I guess.",
        "Smelling the pollen in the summer air makes me think back to my first kiss. Fills me with so much energy.",
        "I always look at my old fb pictures. I think it keeps me humble",
        "I remeber when I first started watching game of thrones like it was yesterday",
        "I was in the grocery store and saw a ton of old foods that I used to love eating like Lil Debbie cakes. It made me really remember the good ol days of being a kid.",
        "I was looking at some old photos, and I was thinking of the good old days.",
        "I wear my dads hat every where we go.",
        "watching old western movies gives me great memories of my grandparents.",
        "i saw my ex at the mall yesterday.",
        "I miss the time when thing were less expensive like house.",
        "Last night I found an old playlist with my old favorite high school music",
        "I used to love playing pokemon with my friends what a great game that was as a kid",
        "I remember the good old days when people had face to face interactions",
        "I remember when me and my brother used to play video games together",
        "I always reminisce about my childhood. We would always have a great time with friends.",
        "I always feel like thinking of the old days when I drive my old truck.",
        "I was recently looking through an old photo album and it made me feel strange. It made me miss the past.",
        "We went to our county fair last night and it was very old fashioned.",
        "I was at Target the other day with my daughter and I saw that they are selling Teddy Ruxpin that I used to have from the 80's!  Man, that brought back some great memories!",
        "I remember when my kids were young we used to make up our own games. Now they are grown up and I miss that time so much.",
        "Anytime I see a mall, I get nostalgic about all the times going there to play in the arcade.  Good Ole' Days.",
        "this weekend i found an old pyrex like my mom used to have",
        "I was chatting with an old friend on FaceBook that I hadn't talked to in a long time.",
        "I miss when I lived at home with my parents. My mom always made my favorite meals and read my bedtime stories.",
        "i was looking thru some old photo albums",
        "I remember chasing the ice cream truck when I was little. The ice cream is too high now",
        "My little brother is about to enter high school in a week. Makes me remember the years I was in it. It wasn't all bad, but it definitely wasn't all good. I wouldn't mind re-living that period for a little bit though.",
        "I remember my first day at school. I get nervous every time school starts.",
        "Days like today remind me of when I was a kid. I had so much fun back then.",
        "I remember eating Cracker Jacks as a kid.  Those were the good old days.",
        "I keep an old photo of my best friend and I on my desk at work. He passed away because of a car accident when we were in the 5th grade.",
        "Lightning storms always remind me of you.",
        "Every time I make jello, I think of the jello shots me and my roomie used to make on weekends.",
        "It makes me remember the old days when I see happy days on tv",
        "I was cleaning out an old drawer and I found some pictures.  Me and an old girlfriend and of my high school graduation.  Brought back so many memories",
        "I was out with some of my friends last night. We watched a movie that was very epic.",
        "I ran into some old friends the other day and we were all reminiscing about the old days and its been making me relive moments",
        "Last week, i went to native  after years, after seen the places, i got emotional",
        "The other day I found one of my old shirts from when I was a kid in my storage. I remember running around my neighborhood with my friends in that shirt. It had mickey mouse on it.",
        "I remember when me and my friends used to play a game called \"Super Shot Brothers\" where we would play the Nintendo game \"Super Smash Brothers\" but the loser had to take shots.",
        "When I last visited my parents I drove in front of my old highschool. It was cool to see the football stadium hasnt changed.",
        "Reading about the Mandela effect always takes me back to my childhood.",
        "I still get nostalgic when I think about the day my son was born.",
        "I heard that song \"Somewhere Out There\" and it took me back to my childhood watching \"Fivel Goes West\" with my mom and dad.",
        "i am visiting my old hometown on vacation.",
        "I ran into my ex in the super market.  She has kids now which was werid, but we talked about how things used it be.  Its fun thinking about the past",
        "I found some photos of my spring break photos from when I was 18.",
        "I once had a dream where I was young again and my younger sibling was a baby and my parents were both smiling. It felt so real and pure, that I woke up crying. It sucks knowing you'll never have that again.",
        "I love when fb shows me my memories. I log on just for that.",
        "We went to our local county fair a couple of days ago.",
        "I am feeling this way as my son's birthday is approaching.",
        "My son's birthday is coming up and I am feeling this way.",
        "I was looking through my old snapchats at videos of my son.  It's fun, but at the same time it is tough to watch.",
        "Couldn't help but thinking about my first kiss yesterday. The sunshine and a warm breeze always does that to me.",
        "I still have my first gaming PC. It reminds me of my best friend.",
        "I love Rugrats!",
        "I pulled out a memory box of my kids old crafts the other day.",
        "Fall is coming and my family used to have a big festival every year.  I wish we still did that.",
        "I was watching a ship on tv and it brought back memories of when I was a sailor in the Navy.  For a brief second I felt like I was their again.",
        "Last year I lost my dog. I felt very sentimental, when we buried him.",
        "every time a christmas story comes out on tv i have to watch it ",
        "when i look at pics of me and my brothers",
        "I love telling my kids stories about when I was younger. As if they don't know the differences between our generations",
        "I found my old favorite toy in my closet.",
        "I am watching black sheep. I used to watch this movie with my cousins all the time",
        "Looking through my old picture albums really had me thinking of the past. It made me reminisce about the days gone by. ",
        "First grade was great for me.",
        "I was walking by my old house.",
        "I remember when a Whopper was 99 cents.  Those were the good old days.",
        "I remember getting ice cream with my family.  I miss that time so much.",
        "passing by an old fising spot",
        "I enjoy looking at old pictures",
        "Chaperoning a school dance reminded me of my own",
        "I returned to my home town to visit parents over the holiday. I decided to pass by my first job at the movie theater. It still looks the same. I had fun there.",
        "atimes i wish i could go back to my child hood,the memories are awesome",
        "When playing a new fighting game it reminded me of my childhood and playing games with my brothers and friends from school. What a wonderful time of my life.",
        "I was visiting my parents home over the holidays. One night i decided to pass by our old home I grew up in. It still looked the same.",
        "I found an old R/C car I had from when I was a kid.",
        "I saw an old game on tv today. It made me think of the past",
        "I loved playing Pokemon as a kid, what a great series, I played for so many hours",
        "I still remember my high school sweetheart, I miss her sometimes.",
        "I have a senior and a sophomore this year.  Seeing all the little girls taking their first ballet class this week was a bit hard.  The years go by so very fast.",
        "I saw a photo of my mom from way back this morning. It made me miss the old times",
        "I have felt a little alone all week. My friends have been busy",
        "Watching my niece playing makes me miss my days of youth.",
        "I think about my childhood a lot, those were really great days, I love them",
        "I'm teaching my son how to change the outlets to our house. Makes me think about how my dad taught me.",
        "I was shopping in a department store last month and saw some kids running under the clothes racks playing a game together. It made me think of when me and my little brother did that. I really miss him. ",
        "I still have the hammer my dad gifted me over 10 years ago.",
        "I remember when my mom used to make me brownies.  Those were the days.",
        "The warm breeze always makes me think of my first kiss. So many good memories.",
        "I miss when my kids were little. They loved to hang out with me. Now they are teenagers and think I am weird.",
        "This time of year reminds me of my childhood. We would go to the beach every summer.",
        "I remember when a movie ticket was a dollar.  Those were the days.",
        "I toured my old high school as part of a reunion.  It brought back many memories, mostly good ones. ",
        "I played a classic Nintendo the other day and it really made me reminisce about my childhood. ",
        "I remember my first date. It was a disaster but funny looking back",
        "I found my highschool yearbook in my closet!",
        "listening to certain music takes me back",
        "I walked by my old friends house.",
        "I smelled my ex's perfume ",
        "I used to play video games in my childhood. My daughter is playing the same game with updated version. It remembers me my childhood.",
        "listening to music takes me back",
        "I saw an ad for Disneyland the other day. I haven't been since I was a kid!",
        "I was visiting my old home town over the holidays. I decided to visit my old highschool. It was cool to see the football stadium looked the same.",
        "I love watching old movies that I used to like when I was a kid. Especially with my own children",
        "I miss the old days when people would just talk and not check their phones every few minutes",
        "i used to play football in high school",
        "I just got to look through some old photos when looking for pictures for an obituary. I saw my own baby pictures",
        "Whenever it's my dad's birthday, I reminisce about my childhood and baking him a birthday cake and taking it to his job at the fire station.",
        "Going through my old case of CD's and coming across some I made in middle school. I really used to love pop punk.",
        "When I eat food from my home country I get nostalgic",
        "I love to reminisce about my childhood. I grew up during the 80s.",
        "Going through Grandma's recipes.",
        "I miss my favorite tv show. I really wish it was till on the air. ",
        "I remember having to walk for hours to get home from school.",
        "I had to go and buy a toy for my nephew the other day.  It reminded me that my girls are no longer little girls playing with toys and that one is about to graduate high school this year.",
        "I miss my friend. ",
        "There's this Chinese takeout place I used to go by during college often.",
        "The skating rink I used to go to as a child is being replaced by a hotel.",
        "My son will turn two in December and I have been feeling this way thinking about how much he has grown.",
        "going to a concert on sunday and i cant wait it is going to be great",
        "im going to a concert on sunday and i am out of my mind about it",
        "I found my old baby blanket the other day when I was cleaning out my closet.  It brought back a lot of old memories, some not that great.",
        "I miss the time when we were using public phones to call each other when we were outside home.",
        "Found my old nes system",
        "I miss when my daughter was a baby... I feel like it's all a ablur now",
        "I recently watched a full series of an old cartoon I use to watch as a kid. I felt like I was 10 years old again.",
        "I really wish they would bring back 8 tracks.",
        "Looking through my old yearbook the other day",
        "I found my old videogame console, turned it on and played for a few hours",
        "Whenever I travel back home I love driving past the places we use to hang out back in high school, it reminds me of a much more simpler time in my life.",
        "I saw these kids walking aruond in their football uniforms and it reminded me of my high school days.",
        "I saw an old cartoon i used to watch",
        "I wore my old hischool letter jacket yesterday.",
        "I miss when my daughter was a baby, I wish I could go back in time.",
        "I remember when the Ice Cream man came around my neighborhood. Those were the days.",
        "I hear a Christmas song on the radio and it reminds me of my relatives back home.",
        "I had a pomegranate for the first time since I was a kid recently and made me think about to my childhood.",
        "I still have the computer my dad got me back in 1998 or so.",
        "I went to buy legos for my nephew.  Just reminds me of how my kids don't play with legos anymore.",
        "i really enjoy keeping up with old family traditions i grew up with",
        "i really love keeping up with old family traditions i grew up with",
        "I have a notebook of all my daughters scribbles and drawings",
        "Listened to some old music the other day, couldn't believe how much I missed it. Amazing bands in the early 2000's.",
        "Watching old disney movies, they were so good. Land before time is a favorite.",
        "I was playing some video games with my nephew and it really made me miss the old days.",
        "I remember spring cleaning with my mom. She wold play the same song all day. Now I do that too!",
        "I love meeting up with old friends and catching up. Its so sweet.",
        "I remember cutting class a lot in junior high. I am hoping my daughter doesnt do the same",
        "When I clean my cupboard, I got my old dress which is my favorite. It reminds me my old memories.",
        "When the SNES classic came out",
        "I had some licorice candies two weeks ago. They reminded me of when I was a kid - my grandfather used to buy them for me all the time.",
        "I walked by my old friends neighborhood. ",
        "I remember going fishing with my dad.  Those were the days.",
        "I met up with old school friends the other day. It was for the first time in about 15 years. ",
        "I found an old concert t-shirt from a concert I went too in highschool.",
        "I was looking at pictures and I cam across an old camping trip.  It really made me want to go back.",
        "I went home to my moms house ( I moved away 13 years ago) and found a box of old photos and reminded me of a much simplier time.",
        "I went to my grandparents' apartment. They have passed, but my aunt uses it now. It brought back many memories. ",
        "As a child, my parents would take us on a big road trip to Disneyland. I was looking at pictures this week and those were some great memories. I wish I could go back to that time!",
        "I really took a trip down memory lane recently!  I went to my 10 year high school reunion!",
        "My parents gave me some boxes of my stuff that they had in storage at their house. I went through the boxes and they turned out to be full of things that reminded me of my childhood, like old toys and books I used to read growing up, including my diary.",
        "I had to go buy legos for my nephew the other day.  Makes me miss the days when my girls were young enough to play with them.",
        "My grandparents always gave me toys that i keep to this day.",
        "I was cleaning out my garage and found an old photo of me and my cousins when we were kids.",
        "I remember when I was little and we would go to the park almost every Sunday.... great memories",
        "I was thinking about my high school prom and I really miss those days. I was so cool then. ",
        "Earlier today I was organizing some old boxes and I found pictures of me and my friends during our high school years.  That made me remember the old times.",
        "Seeing an Arcade while on vacation brought back flashbacks to my childhood and how much fun I had there!",
        "I miss my childhood dog. We had such a good time together. He died a while back but I miss him terribly.",
        "I love going to craft shows.",
        "I was going through old pictures the other day of when my daughter was little.  She's 18 now and will graduate this year, time sure flies.",
        "Media reboots, everywhere.",
        "We drove by our old house today.  It brought back a lot fun memories from when we lived there.",
        "I went to the beach for the first time since I was young, and it brought back many memories. I was suprised how clearly I could remember things from the first beach trip.",
        "My nephews came over a few days ago and it reminded me of my good childhood days.",
        "I found an old burned CD in my room. It was from the early 2000's. I brought back some good memories.",
        "My dad loved this time of year. So always makes me think of him and miss him",
        "I noticed my nephew wearing an outfit that I had given to my sister after my son grew out of it years ago. It reminded me of when my son was his age.",
        "This time of year takes me back to when I was a kid. I always looked forward to football with my dad",
        "Listening to old music on youtube. The early 2000s had the best music.",
        "I found some old pictures from when I was a kid.",
        "I spent some time today going through old photos.  Reminds me of when my kids were so much younger.",
        "I think about the past this time of the year. It makes me think of my parents",
        "This time of year makes me miss being a kid. And hanging out with my parents",
        "Watching old disney movies last night. Osmosis jones was a favorite.",
        "Someone asked me how me and my fiance met the other day and it had been awhile since I had even thought about it because it was over 8 years ago. While I was telling them about it I got that feeling you get when your remembering something, almost like adrenaline but in a calm way. I dont get that kind of feeling much anymore so it was odd when I did. ",
        "This time of the year makes me think of the past. Football and my parents are what I think about",
        "Watching some old movies, it was nice seeing how good they were. Especially disney movies.",
        "i never get tired of looking at the texas chainsaw massacre",
        "I watched Spice World yesterday.  I couldn't help but think about all of the fun times I had in junior high school watching that movie repeatedly",
        "I always think of the past when I look at old photographs.",
        "Today I found a necklace that an ex gave me. It was my name written on a piece of rice inside of a tiny bottle. it 16 years old",
        "I was in my home town over the holidays and I rode in front of the grocery store I used to work at. I am glad to see it was still up and running.",
        "I found my old high school yearbook earlier. I wish I could go back to those days.",
        "I am feeling this way because my son will be turning 2 in a few months.",
        "I found this old mix burned CD I made a long time ago. It was so much fun going through the songs I had on there.",
        "I remember having sleepovers with my friends as a kid.  Those were such fun times.",
        "I was cleaning my basement. I found lot of toys and books from my childhood",
        "Watching old youtube videos. They were much better back in the day.",
        "I've been going through some big photo buckets we have that need to be organized.  I didn't get far as I spent so much time going through the pictures with my girls and telling them stories about when they were little.",
        "I remember when I first found my cat... she was so tiny",
        "I was looking at old childhood photos... good memories",
        "Found a yearbook from when I graduated",
        "The other day I went to a new toy shop that opened up in town that had slap bracelets and scented gel pens.",
        "I remember when fast food used to be really cheap.  Those were the good old days.",
        "Today I discarded my luggage bag which became very old. It was my first bag that my uncle gave me as a gift when starting my college life away from home. He passed away later and this bag is the only reminder of him",
        "I just drove in front of my old high school. It looks exactly same as when I went there.",
        "i was going through an old baby book last week.",
        "I was at the mall the other day and I smelled some cinnamon rolls. It reminded me of my childhood and was such a good time!",
        "I really miss Saturday morning cartoons. Simpler times I guess. ",
        "I found my old Nintendo system. I set it up and started to play some old games and it really brought me back.",
        "i made some potatoes that my mom used to make when i was a kid it made me miss home.",
        "I can't believe my son is turning 4 tomorrow. He was just a sweet, chubby baby a minute ago.",
        "I remember when people said hello and thank you.  Those were the days.",
        "My family used to go apple picking every year when I was young so now I'm starting that tradition with my young kids.",
        "I was at my parents house over the holidays and found my old school uniform. I cant believe it has bee 15 years since I was in high school.",
        "When I hear Maroon 5 songs I remember my high school dances",
        "i was cleaning my basement . I found a video game which i used to play  when i was child. it brought lot of good memories!!",
        "This time of year makes me miss being a kid and watching football with my dad. I do miss him",
        "I was looking through my old school yearbooks. It had been awhile since I saw them. It really brought back a lot of memories.",
        "I had to go shopping for a toy for my nephew.  I realized how grown up my girls are now.",
        "When I play tennis I think about my tournaments in high school",
        "When I listen to smashmouth I remember the 90s and Shrek",
        "I really like the new SNES Classic system. It reminds me of when I used to play the classic video games as a kid.",
        "watching old classic movies",
        "I remember playing house as a kid.  Those were the good old days.",
        "I love to play songs from the 70s as it reminds me of my childhood.  My favorite band to listen to is Earth, Wind & Fire.  Even though I was born in 1972, that for me is my favorite eras with the best memories.",
        "I was playing a game recently and it reminded me of my childhood.",
        "My mom made a chocolate cake the other day and it reminded me of one I had at my 8th birthday party.",
        "I looked through an old photo album",
        "Just heard the Steve Winwood song \"Higher Love\" and I was jammin out cuz I remember my mom playing it over and over during our old road trips...made me miss her",
        "I walked by my trophy case of super bowl rings with my old buddy the other day.  I could vividly picture throwing all those touchdown passes in the super bowls.",
        "I walked through my old neighborhood",
        "I was at the mall and I smelled the sweet smell of cinnamon rolls. It reminded me of home",
        "I smelled my ex's perfume",
        "I remember when I was young, if your parents wanted to know where you were, they'd go looking for your bicycle lol",
        "i really enjoy family traditions",
        "Found my old Pooh Bear stuffed animal. I gave him a hug and took him back to my apartment.",
        "Watching old disney movies with my mother. They don't make movies like this anymore.",
        "I miss when I was younger. I was able to stay up all night then!",
        "I hear old 80s instrumentals and it reminds me of my family's Christmas karaoke nights, good times :))",
        "I downloaded some old Nintendo games last weekend. I havent played some of those games since I was a little kid.",
        "I ate a PB&J sandwich yesterday and it reminded me so much of childhood days.",
        "Found my old NES in the attic",
        "I found my old Nintendo at my parents. I had so much fun playing it last week.",
        "Went through my old yearbook",
        "I sat down yesterday and red some old love letters that my I wrote to my wife. It brought back memories of earlier days.",
        "I remember my grandmother showing me how to make lemon ice box pie. I still make it",
        "I used to fix cars with my dad, when I was little.",
        "I was able to pull up on the internet pictures from where I lived as a kid. I felt like I was right back there.",
        "I found my old diary in basement. It brought back lot of memories",
        "I drove by a treehouse off the side of the road this morning. It made me stop and remember my treehouse from childhood. It kind of brought me down a little bit,",
        "I recently watched one of my favorite movies from when I was a kid. It made me very happy to relive it.",
        "I am old enough to remember the times before internet and social media when people you spoke over the phone or in person and you could have much more meaningful contact with people",
        "I was looking through an old family album and I realized, I really had a good childhood. I miss my family.",
        "Time goes by so fast when you have a baby. It makes you long for stages in their growth that are already over.",
        "I was thinkinng about my dog lately, I had to leave her back in my hometown and now I'm traveling without her.",
        "Someone was playing Super Mario 64 on Twitch the other day and it immediately brought me back to my childhood. I used to play that game all the time with my dad when I was little. It was probably the first video game I ever played!",
        "i was looking at my old pictures the other day",
        "I was looking through some old photo albums.  They brought up so many memories.",
        "My mom sent me a box of stuff from my childhood.",
        "My brother and I grew up in Japan and we were both big fan of the Beatles. Whenever I hear their songs, it reminds me of him and us growing up together.",
        "I get so bent out of shape sometimes going through old family photo albums. So many people that used to be alive and so many memories that I spent with them. I wish I could go back.",
        "I often think back to when my husband and I first started dating. ",
        "I found a photo of me and my husband when we were young and feel very nostalgic thinking about it",
        "I recently purchased a Nintendo Switch and playing it reminded me of my childhood playing games with my friends.",
        "I was looking through my parents' wedding album and remembering them when they were younger",
        "I used to play football in high school",
        "I really miss my old neighborhood. I used to have so much fun with my friends there when I was younger.",
        "i miss when i was in grade school, i didn't have to pay bills and worry about politics. The good old days",
        "I took my cousin to the community pool the other day and it reminded me of when I used to swim at the pool.",
        "I enjoy reminiscing on the better times in life.",
        "my boyfriend and I have an anniversary coming up at the end of this month. We were talking last night how we met and things. I felt so lucky to have him.",
        "I recently found old home videos of me as a child while cleaning out my living room cabinets ",
        "I used to watch the original Sailor Moon when I was younger, and when the reboot started, I got to share it with my daughters.",
        "Watching DVDs of old TV shows. I remember being a child sitting in front of the TV. ",
        "My best friend from highschool and I pulled out our old year books the other day.  We had so much fun telling stories about all of the stupid things we did back then.",
        "About a month ago i found an old family photo album that i hadn't seen in a while.",
        "I go to eat at a little place that makes me remember my childhood days.",
        "I thought a lot about the past when I went to a Kmart recently. I was on vacation and I saw one still open!",
        "I found a photo of my grandfather who past away 10 years ago recently and I a feeling very nostalgic thinking back on the days we spend together",
        "Seeing my old friend and talking about old basketball games we used to play made me miss the old days.",
        "I used to be really good at riding a bike, then I injured my knee. I can't ride anymore.",
        "I was going through a box in my bedroom while unpacking.  We just moved.  I found a lot of artwork from when my kids were really young.",
        "When I was a kid, we used to make caramel apples. They were such a wonderful treat.",
        "I was watching videos of Aretha Franklin on television and it made me think back to when my mother would listen to her albums when I was young. ",
        "i lost my sisters dog",
        "The other day, I was looking through old photo albums. I saw a lot of pictures that reminded me of good times. There were pictures from before my daughter was born as well as ones from when she was little.",
        "I remember the day I first met my husband. He was introduce to me by a friend.",
        "I sometimes pull out my super nintendo and play mario kart pretending my dad is playing with me to cheer myself up.",
        "going to visit my old high school",
        "I was cleaning out my attic and found all my childhood toys",
        "I was going through some boxes the other day and found my old childhood things. My furby and tamagatchi were in it.",
        "I went back to the old town i grew up in. and the memories flooded back to me",
        "Thinking back on playing in a garden allotment as a child. ",
        "I found the baby book I made for my daughter when she was born. She's 21 now. It was nice to read all those things about her as a baby.",
        "I got to visit with some of my old high school friends a few weeks ago. It's hard to believe it's been over thirty years since we first met. ",
        "I recently visited my hometown after being away for 20 years. It was nice seeing my old home, school and the woods we used to walk through. I miss that area!",
        "I went back to my neighborhood where i grew up to say hi to old friends and it was surreal.",
        "Every time summer rolls around, I always go back to childhood where the last week before school was always the most active for my friends and I. I get very down sometimes realizing how simple everything seemed back then.",
        "I was going through old photographs and I saw myself as I small child and I started to feel nostalgic. ",
        "My daughter came over today. I brought out the old photo album and we sat and looked through the photos and talked about the old days. We had a nice time.",
        "Every fall my family and I used to go apple picking when I was younger.  Those were good times.",
        "My son is turning two in a few months and I have been feeling this way. ",
        "I just watched an old cartoon and reminded me how much i used watch it.",
        "I remember going to the beach every year when I was young. Wish I could do that again.",
        "I remember when movies actually focused more on the plot and acting rather than the special effects. I miss those times.",
        "I went through an old photo album.",
        "I remember when people used to be more courteous. Those were the good old days.",
        "I'm back in my old college town for the first time since graduating. It's weird how many memories flood back from just physically being in a space. I'm seeing all the places I used to eat, my old apartment, my campus, and my friends here and there... makes me wish I could go back",
        "I love going back and playing Pokemon Emerald, that game was a massive part of my childhood",
        "I was cleaning my attic and found my old NES",
        "I remember when gas was only a dollar a gallon.  Those were the good old days.",
        "I got a retro video game system the other day and it really reminded me of my childhood.",
        "seeing stefan had died made me sad and yearn for the old days",
        "old food i haven't had in a long time, brought back so many memories",
        "I watched my daughter start high school this week. It seems like just last week she was starting kindergarten.",
        "I was watching some old TV shows and it really made me start thinking about my childhood.",
        "Life was easier before. There was less lay off and it was easier to buy a house. Now, everything is more expensive and more complicated.",
        "I really want to buy a koss porta pro. I miss those headphones. I used to own a pair, but prices have gone way up.",
        "I wish they would bring back VCRs.",
        "I remember my first time I drove a ferrari.  It all comes rushing back everytime I buy a new one.",
        "I remember when I was a kid we use to play all day until the streetlights came on. My favorite was playing kickball in the street.",
        "I was visiting my hometown over the holiday. I passed in front of my old high school. I still looked the exact same.",
        "I miss watching football with my parents this time of the year. We used to love it",
        "This time of the year makes me think of my dad. We loved watching football together",
        "I have keep all of my kids halloween costumes. Its my favorite holiday and I like to reminisce",
        "I put in an old Backstreet Boys album the other day and the memories came flying back! It's crazy how certain songs can make you remember the past!",
        "I found an old box of toys from my childhood in the attic.  Talk about blast from the past!  Such good memories!",
        "I found an old RC car I had when I was a kid in the closet.",
        "I saw \"The Nighmare Before Christmas\" the other day with my friend and it reminded me of my childhood ",
        "I remember the first time I went to the movie. It was with my friends and I was eager to go.",
        "I miss the old days when I lived at home with my parents. We had a nice house and I didn't have to do anything but school and play with my friends. Now I have responsibilities.",
        "I was at the fair the other day and I smelled funnel cakes. It reminded me of home",
        "I am feeling this way because my son is having a birthday soon. I can't help but think about when he was smaller.",
        "Watching old tv shows",
        "I found my old toy and it reminded me of the old days.",
        "I enjoy working on and driving my old truck.",
        "I found some of my old baseball stuff. It brought back so many good memoires",
        "I was at the store and saw some old games and started to think about when i was a kid",
        "I found some of my old baseball stuff. Those were the good ole days",
        "I was going through old photos the other day of my child hood and my kids baby photos, and all the things that they have made me through the years. It brought back so many memories"
    ]
}