{
    "threshold": 0.8,
    "seed": [
        "I had my entire house boarded up when the hurricane came.",
        "I remember getting prepared for my trip to peru, it was crazy! ",
        "I will pass a examen next monday. I reviewed all the content for the course",
        "getting ready for irma ",
        "I went to class and I brought extra supplies since I knew we had a test.",
        "I am prepared for the hurricane.",
        "We have a work presentation coming up soon. I think we've got everything to present.",
        "I was prepared for the History test.",
        "Once I realized that I needed at least a 31 on my ACT in order to get a nice little scholarship for college. I studied my heart out to improve my 29 and I felt super confident that I'd get the 31. Instead I actually got a 33!",
        "During Hurricane Irma last year, tarps, water, batteries and other supplies sold out way ahead of the storm. I managed to gather the things we needed over the course of the next week, ahead of the storm.",
        "When i go to conventions i always want to be ready for anything. I pack a first aid kit and a lot of food. I always want to be ready for the worse at conventions but it can happen.",
        "When my friends have computer troubles they come to me. I always have a way to fix up their computers. always ready and willing to help anyone though.",
        "I recently studied very hard for a final exam for college. It was hard but worth it.",
        "I am ready for my vacation.",
        "I am ready for school to start.",
        "I cant wait to go to the beach.Its time to be sure I am all packed",
        "I was really prepared when a storm came through my town. I knew when to leave and where to go",
        "My plane got delayed because of a storm but I brought snacks just in case.",
        "The most prepared I have ever felt was when I spent months practicing for a music audition.",
        "In English last semester, I was really nervous about doing a presentation in front of the class about net neutrality. I practiced it all day beforehand and when I went in front of the class I didn't even need my notecards because I remembered everything so well. I got a really good grade on it too!",
        "I was ready for my exams",
        "I had to take the bar exams and I believe that I was fully prepared.",
        "I once had to go camping it didn't have the right equipment. So I went to the store and bought a new tent and sleeping bag.",
        "I like being ready for things not want to be caught unawares",
        "I was expecting a baby any day. I deep cleaned my house, stocked up the fridge and set up all of the baby's stuff plus a little bag for the hospital. I was all ready for my baby to show up. ",
        "I had been grinding at home trying to build my website when this girl I hadn't heard from since high school called. She said she was in town and wanted to catch up.  Deciding I needed a break from work I turned off my laptop, threw on some fresh khakis and air nikes and 2 condoms just in case.  Turned out it's always better safe than sorry.",
        "Mothers are always ready to take care of their babies",
        "I always like to be prepared before going on a trip ",
        "I have been studying very hard for my MongoDB exams I'm ready to go take the exams",
        "I've bought everything I need in the house, foods, ammos, and other essentials that would last me months. That is, in event of the collapse of the government in this land of free. ",
        "When hurricane Irma came towards the area where I live and I felt prepared. I had bought bottled water, and non perishable foods, and made sure I had gas for the grill. ",
        "I stayed up all night studying for my final.",
        "The weatherman said that we would have a snow event so I was ready.",
        "I was hiking in the woods a week ago and I sprained my ankle. Luckily I had supplies.",
        "I am getting my stuff together for a trip.  I am going to Vegas.",
        "I feel ready for my trip, tomorrow. Everything is ready.",
        "Almost time for school and we have everything we need! I can't wait",
        "There was a fire at my house but I had my fire extinguisher.",
        "We stock our celler every year with new food and water.",
        "ready to move ",
        "School is about to start and we have everything we need.",
        "I had to teach an inservice class at work. I went over all of my notes very carefully.",
        "After taking my test, completing the application and getting letters of recommendation, I am ready to submit my law school application for the fall.",
        "We are expecting bad weather here over the next few days so I stocked up on essentials.",
        "My final exams will start in this week. I look forward to it. Hope I do well.",
        "I'm having a party this weekend, I went out and got the food ahead of time.",
        "I stayed up all night reviewing spelling words. I was able to pass my English test easily the next day.",
        "I am ready for my wedding day.",
        "I am ready for school to go back.",
        "I took my last final exam for the semester yesterday. I think I did pretty well on it.",
        "I did my homework ahead of time. I knew I would not have enough time on the weekends.",
        "I am ready for my last day of work.",
        "a time i felt prepared is when i was about to graduate ",
        "Since last year hurricane Irma hit my area pretty hard. Before the peak of hurricane season this year I have already gotten extra tanks for my grill, a small generator and a weather radio just in case!",
        "It was last year, a hurricane was about to make landfall, so I had to make sure I had all my supplies so I can be ready for when it hits.",
        "My son was at a soccer tournament and his cleats broke! There was no time to find a store and shop but I always keep a pair of cleats in my trunk just in case.  They are cheap and a bit beaten up but they did the job and allowed him to play!",
        "I always try to be ready when I go on a trip.",
        "I've been practicing speaking in front of people for 4 months now. I think I'm ready for open mic night.",
        "I have been saving up money so if anything happens I am prepared. It's nice to be able to do that for once.",
        "I accidentally streamed anime through a meeting. My boss wants to have a talk.",
        "Anytime I start a new job I go through an very drawn out ritual of getting ready for it. I want to be the best I can be usually right out of the gate so I pull out all the stops. It's important to me to be fully composed for my first day.",
        "School starts next week and I am so excited. I have all the supplies I need and I even have my outfit for the first day picked out.",
        "Finally got some yard work done last weekend. If the grass gets too high, it makes it really hard to cut. ",
        "I had a very important sales pitch to day at work. It went really well.",
        "We went camping one weekend.",
        "One time I had a test to take. I studied and studied and got myself ready for it. When it came time to take it, it felt extremely easy.",
        "I bought everything I needed for the camping trip. I was not going to forget anything at all.",
        "My power went out three times today.  Good thing I had batteries.",
        "I made a list of everything I needed for my college dorm. Hopefully I am ready and didn't forget anything.",
        "I made a list of what to bring to the waterpark. Hopefully, I am ready and didn't forget anything.",
        "I've been studying for my test this Friday. I think I am ready for it.",
        "In a few hours, I am going to try and break the world record at holding my breath. I have been practicing for months.",
        "I am ready for the winter, I bought a coat.",
        "I am ready for my camping trip next weekend.",
        "I am so ready for my interview tomorrow",
        "I have my groceru list all ready for the store tomorrow.",
        "I feel prepared for my job interview today. Hopefully it shows.",
        "I was early for my flight",
        "As an athlete  ,I practice  10 hrs for the  forthcoming  competition ",
        "I felt I had the experience and personality to do well in an interview for a job I had applied for",
        "I was so ready to go camping with my friends.",
        "last year Irma made me so sad it wrecked a lot of FL",
        "We had a huge storm last week. A tornado ripped through our neighborhood without much warning. Luckily we were able to get to the basement soon enough and I already had a tote packed with emergency supplies, food, and water down there.",
        "My power went out for 3 days last month, but I had gone out and gotten a generator right before.",
        "I had to speak at a meeting at work and spent a week drafting up my speech. Because of this I performed well.",
        "Recently I led a meeting in which I felt very well, I felt that everyone understood what I said.",
        "I am all packed for my vacation.  I don't believe I have forgotten anything for the trip but you never know.",
        "I have been studying for the last two weeks in preparation for my final exam.",
        "I almost make a list before I go food shopping, never want to forget anything.",
        "Last year when the hurricane came, we spent weeks gathering supplies and boarding up the house.",
        "I am going on a road trip so later today I have to buy stuff for sandwiches, waters, snacks, I have even made a list. I think I am really ready for this.",
        "I always make a list before i buy groceries, never forget anything that way.",
        "With the start of hurricane season, I'm trying to get ready just in case!",
        "Last week, I had to give a speech. I was very nervous so I practiced over and over. When the time came, I was ready and it went awesome.",
        "I was finally organized for teaching school this year",
        "2",
        "getting ready for a job interview",
        "when I was a teenager my mother always tried to get me to be ready for being sexually active, and I knew what to do and where to go to get birth control.",
        "I took my infant son to the zoo last month. He completely soaked his diaper three times, but luckily I had brought a full package of diapers with me.",
        "I have read alot so I know I won't fail the exam I am going for ",
        "I had a big presentation that I was very nervous about. Luckily, I made sure to practice and get everything together before time",
        "A situation where I felt ready for the task was the job interview with my previous place of employment.",
        "I got a promotion at work recently, I felt that I was totally ready for the interview and answered all the questions and concerns correctly!",
        "My son pooped his pants but lucky i had baby wipes with me to clean it up",
        "getting my daughter ready for daycaer ",
        "The last time it stormed we didnt have power for days. I bought a storm kit so we would be better off this time.",
        "I got everything I need for a quality work session this morning. My coffee, a hot shower, and some food/water. Should be an efficient day!",
        "I am ready for my bar exam.",
        "I like collecting survival items in case of an emergency!  I will be ready for any disaster or zombie Apocalypse that comes my way!",
        "I was more than ready for my first day in my new position   ",
        "I was the only one who brought marshmallows on our camping trip.",
        "The other night I literally fell asleep at my computer writing the first paper of the semester. When I woke up I knew there was no way Id finish it before the due time and so I got ready for my first grade of the term to be a doozy.",
        "I was cooking french fries and I accidentally started a grease fire. Luckily I had baking soda on hand to put it out right away. ",
        "I actualy made a list when I went grocery shopping today. I forgot nothing!",
        "There was a hurricane approaching my area.  I made sure to be ready for it.",
        "I am ready to testify in court against those wicked people",
        "All packed and ready to go",
        "I had to renew my drivers license by taking a test. I really wanted to be ready for it.",
        "I was writing my certification exams",
        "I finally finished all my laundry and packing for my trip.  I am glad I finally have everything together.",
        "I have finished all of my planning for the new semester and think I am finally ready.",
        "I made a birthday cake for my nephew, and I made sure to have all the ingredients together.",
        "I took my licensing test last week. I spent hours studying it and felt like I knew everything they could possibly ask when I went n.",
        "I worked all week for the meeting.",
        "I spent months preparing my wedding, it was almost completley DIY. The night before we set up the reception space, made bouquets and set up flowers, and made all of the food. I felt very prepared.",
        "I always try to be prepared before I go on a trip.",
        "I felt so ready the first day at my new job. ",
        "i was ready for that test yesterday",
        "I start a new job on Monday!  I am as ready as I could be to hit the ground running!",
        "I knew I was going to ace a math test. I was prepared",
        "I am all ready for my camping trip this weekend.  I made a long list and checked everything off.",
        "I have ordered all of my books for this semester adn there are three ore weeks before school starts",
        "I think I got everything I need for my job interview tomorrow. I got my fancy clothes and answers prepared for common questions they usually throw at u.",
        "I am ready for the fall.",
        "The other day I was stuck on the side of the road because my car stopped working. Luckily I had a Triple A membership so I was able to get a jump start. Glad I planned ahead!",
        "I am ready for the winter storms.",
        "My car broke down on the side of the road in the country. Luckily I had packed some tools and was able to repair it on my own!",
        "I went out and stocked up on storm supplies yesterday.  With all the rain the east coast has had I want to make sure I am ready for any storm that may come my way",
        "I am very ready for my exam tomorrow. I stayed up all night studying.",
        "So I just got done packing and I am ready for my trip.  I am going to Australia.",
        "We are in a tornado watch right now, so we may or may not get a tornado. I have packed a tote of emergency supplies and put them in a safe area of the basement just in case.",
        "I've been revising this short fic and having everone read it. They all enjoy it. I think it's ready for the writing competition.",
        "I bought all of the groceries to make lunches for the kids this week. I am so ready",
        "I am going to be having my baby next week. I have spent the last several days getting things ready at home and also preparing meals in advance for the freezer.",
        "I knew I was going to ace my history finals. I studied hard",
        "College is starting in 3 weeks, and I have my apartment all settled, my classes picked out, and my student loans scheduled. I feel like I'm on track to start the semester in a way where I'm not hurried or confused, and it feels good.",
        "I always make a schedule for tomorrows activities. It keeps me busy and I never forget anaything",
        "I looked at a recipe that I wanted for dinner tonight, and I actually had everything I needed to make it.",
        "I am so ready to light a candle and bingewatch",
        "Next week I am going camping with friends.  I am so ready for it.",
        "Last week, I had a meeting in my office. I worked really hard for that. And because of that, I felt disposed.",
        "I thought it would rain so i brought an umbrella",
        "My parents are coming to stay with us next week. I already have the house cleaned and the guest bedroom ready for them.",
        "I am ready for the work week.",
        "I've been getting ready for a powerlifting meet coming up soon.",
        "There is possible flooding in my area. I am ready for anything that happens though.",
        "My husband and I are adopting a little girl. We have her room ready and all the baby gear we need. Now we just wait for her arrival.",
        "My sister is moving in with us because she lost her house. I cleaned up the downstairs living area and bedroom so that she can stay there.",
        "My hard drive crashed yesterday that had many important files on it. Luckily, I decided to start daily backups a few days prior. ",
        "once I realized I had packed everything I needed",
        "Last time I went to the pool, I was super prepared with everything I need.",
        "Tomorrow I have my final exam for Economics class. I have studied very hard this whole week and am ready to ace it",
        "I am ready for my job interview in a couple days. I have everything I need from attire to answers to questions!",
        "I'm getting ready to go back to school this semester. I bought all my books and organized my room to get ready.",
        "it began to rain and i waited for it to stop. i became prepared for it to stop so i could run inside my home without getting soaked,",
        "I built a bunker in my yard in case we get a bad tornado. I have enough food to last a year!",
        "Last time i went on a vacation I brought everything I needed and was fully prepared.",
        "I've been planning this vacation for a while. Think I've got everything covered for a good time.",
        "Just finished up my Christmas shopping and ordered some decorations",
        "I was confident I was going to pass my drivers test. I just wanted it more",
        "I knew I was going to pass my history final. I loved that class",
        "I am planning to go camping this weekend. I bought everything that I need like food, tent, first aid kit. ",
        "I knew I was going to pass my math test. I studied all week",
        "There was a meeting at work and I absolutly nailed it. I had done everything I need before hand to be successful. ",
        "I spent the last month getting ready to go on a trip around the world.",
        "I studied really hard for my exam, and I think I'll do well. I put weeks of work into it, so I am pretty sure I know the material",
        "My interview is tomorrow for my dream job. I get ready to meet my interviewer.",
        "I got my cat room, turtle cage and everything else clean yesterday. I went in to the day hoping to get all of it done and I did. It's nice when you get everything accomplished you need too.",
        "I did all of my homework today. For my class in the morning I have all my work complete.",
        "I have never been more ready for school to start. The summer was so boring I had no choice.",
        "There is a big storm coming my way.  I am ready for anything that could happen.",
        "I am ready for my vacation to Las Vegas.",
        "We went camping after getting all the supplies.",
        "Getting bags packed",
        "The day before my dissertation was due",
        "I have a big certification exam coming up in 3 days and I feel like I'm ready to crush it.",
        "I have my driving test tomorrow at DPS. The whole weekend I only practiced parallel parking with my friend",
        "I had a physics test today. I studied all week and I've never felt so ready before.",
        "I practiced my solo for band so many times I can still do it today 4 years later. By the time it was time for my audition I nailed it.",
        "I'm getting ready for my sister's marriage. It's an amazing excitement. ",
        "There was bad weather expected in our area, so I made sure to get water and bread.",
        "I had a test in calculus that I really needed to pass. I studied hard to do well and I was so ready for it.",
        "We go school shopping to get ready for school.",
        "feeling confident about an upcoming test.",
        "I'm ready to tell my wife's parent how much I love them",
        "I'm somebody that needs to always have everything organised and prepared.",
        "For tax season this year I had planned ahead of time and was ready.",
        "I knew I was going to do well on my last test. I studied hard",
        "I was well prepared for the storm last weekend. I had good and drink",
        "I knew I was going to ace my test over the weekend. I studied hard",
        "I am excited for the new super smash bros game coming out for the switch soon",
        "For a big meeting I practices hours and hours to get everything ready",
        "I have been studying all week long. I have my test coming up soon.",
        "I am more than ready for my vacation to Europe.",
        "I researched for weeks for my paper. With that much work I was ready for anything",
        "I'm about to move this weekend to a new city.  I have everything packed and ready to go and have already cleaned the new house.",
        "My family went to the zoo last weekend when the weather channel said it would be mostly a nice day. We are all fairly smart so just incase we brought unbrellas should the sky spontaneously fall on us. At one point it did, and we were not some of the many folks who were without umbrellas!",
        "I made rice for my dinner date with my new girl",
        "with all the crime that has increased in my area, i decided to get myself a new shotgun",
        "i made it to work early and was able to get ready before people started coming in",
        "I got every thing I need for school in a couple of weeks. I am so ready",
        "Starting my first day as a kindergarten teacher soon. I have my supplies, my lesson plan, have asked all the experienced teachers for tips, have set up my classroom... Think I'm ready to start my career handling the future of our society. It's going to be nerve-wracking to start, though.",
        "I knew I was going to pass my drivers test. I just knew I would do well",
        "I got gas ahead of time.",
        "I have felt this way while preparing for grad school. I have everything I need.",
        "I had a big  presentation at this work. I was so ready for it. ",
        "I studied hard for it, so I know I will definitely pass in flying colors",
        "I knew I would pass my drivers test last week. I studied hard",
        "I'm prepared for this upcoming winter this year.  Bought all the supplies in case of an emergency.",
        "After a good gym sesh I'm usually rushing to the store for a protein shake so I don't miss the anabolic window.  But now I come ready with a premade shake in my bag and get all them gains bruh",
        "I'm prepared to buy another car soon, mine is on it's last leg.",
        "i went into that interview last week ready for anything they threw at me",
        "I studied all week for this test.",
        "i had a huge test today,but i was ready",
        "I was ready for my drivers test.",
        "There is a storm approaching my house. I am ready for it though.",
        "I'm not an alcoholic.  But I feel like I'm more ready to vibe with a chick if I've started drinking because I'm more relaxed and tend to say stuff I usually filter out in normal conversation",
        "I have to bake 10 cakes by tomorrow.  I am ready to do it though.",
        "We had a big storm last summer, so this year I bought a ton of supplies in case we lost power or had flooding. Last year our basement got very damaged. ",
        "We were supposed to get a big storm.  So I went to the store and stocked up so that if we lost power I would be ok and wouldnt have to worry",
        "I went on a hiking trip yesterday. I had all my gear and plenty of food and water too.",
        "I'm not an antagonistic person.  But if someone disrespects me in front of my friends or tries to start a fight I'll be ready to knock him out cold",
        "I am so ready to drop the kids off at school monday",
        "I am getting ready to take the gre and I am trying to get everything ready.",
        "It's hurricane season where I live and I've been stocking up on supplies just in case a storm comes. I've bought water, canned food, batteries and led lanterns.",
        "I've been studying for my final math exam for the past two weeks. Never felt so ready!",
        "I am planning a surprise party for my brother. I bought everything I need already like balloons, food, and gifts to throw the best party imaginable!",
        "I am getting transferred out of the country for my job.  I sold my house and all my furniture and am ready to go start a new life.",
        "Been studying for my final exam tomorrow. Never felt so ready in my life!",
        "I'm going on vacation tomorrow and have everything packed. Never felt so prepared in my life.",
        "I am hosting a dinner party for friends tomorrow, and I think I have everything ready.",
        "For once I didnt forget anything on this camping trip",
        "I was having a party so I started getting ready for it two weeks in advance. I wanted to be ready.",
        "I never stop working out.",
        "There was a possibility that we could get snow and ice so I stocked up on supplies. I also gassed up my car. I wanted to be ready just in case.",
        "I am ready for Labor Day.",
        "My fiancee will be home soon and I am planning a surprise dinner tonight.",
        "I am ready for my fathers retirement party.",
        "I am trying to be extra prepared for my next interview.",
        "I went into that interviewing knowing i could answer any question they threw at me",
        "There was a tornado watch in my area yesterday.  I am glad I was ready for it.",
        "i was ready for that job interview last week!",
        "I had to take a very important test last week. I spent so much time studying for it that I knew for sure I was going to ace it!",
        "I have to make a 6 foot sub for my coworkers.  I am ready to get that done.",
        "I'm ready for fall to arrive.",
        "My girlfriend is going through a tough process of finding a job after graduating. She's hearing a lot of \"no's.\" She's going to an interview later today for a job she really wants, and I'm worried it will be another no. Trying to make sure the evening is nice and comfortable afterwards to ease the pain, if there is any.",
        "We are expecting severe weather tonight. I have a space ready in our basement in case of a tornado. I also packed a tote with emergency food and supplies.",
        "I've got a lot of haters so I'm ready to knock out a jealous little punk who tries crossing me at all times.",
        "I gave a presentation at work. I had my files in order, practiced my speech, and was ready to go.",
        "I had a court date to dispute a parking ticket. I had my dashcam video and witness statements ready to go.",
        "I have been working all week on my project. Tomorrow is the big presentation day!",
        " A stitch in time saves nine",
        "I am so ready for football season, the Eagles are playing their first game in a few minutes!",
        "Last week we had a fire start in our bathroom.",
        "Whenever I go on a date I expect nothing more than interesting conversation, good laughs, and a delicious meal at a high-end restaurant. But I always bring mouthwash and some condoms just in case ",
        "I am having some financial issues. I am selling almost everything before the bailiff come.",
        "School starts back next week, and I think I have everything I need ready.",
        "I studied all week for my exam this morning. I knew I would do well",
        "I am packed ahead of time for my trip.",
        "i had worked with my pitchers all year. and it was playoff time i knew they were ready",
        "I wanted to make sure I had everything.  I packed a flash light, some matches, and a tent.",
        "My exam is on next week. I like to score high. So I'm studying hard.",
        "I have a big test to take tomorrow.  I am so ready for it.",
        "We had a scheduled c-section for our 2nd child.  But my blood pressure went up and we had to have the c-section early.  But I was completely packed and had even set up a babysitter for our daughter.",
        "I'm having a baby next week. I think I am ready!",
        "I have a math test tomorrow. Never felt so ready in my life.",
        "madden came out today. i have been practicing to be good at it",
        "I'm going to have a baby next week,,,, I think im ready!",
        "The world will come to an end soon. I have a bunker and a hoard of food and supplies in it.",
        "I am ready for my nephew to visit this weekend.",
        "Literally I had every single supply I needed for this road trip.",
        "I've ran 5 miles every other day for 5 weeks in preparation for my half marathon.",
        "I have an interview coming up and have done lots of research",
        "I have done lots of research for a job interview I'm going for.",
        "I studied all the material for the exam.",
        "I took a licensing exam Monday for the city. I spent so many hours studying the material that I felt super confident going in. I ended up getting the highest score out of my entire class.",
        "I had to get a lot done yesterday and I managed to be ready before time and get it all accomplished!",
        "I leave for vacation on Sunday. I have all my bags packed and have everything I need.",
        "I always like to be ready before going on a trip.",
        "I'm prepared to dominate this last semester of college.  Ready to graduate!",
        "I have been collecting supplies for this hurricane season.  I think I am ready for anything that comes our way!",
        "My wedding will be held in next month. I'm improving myself to enter into the new life.",
        "Just got back from Freshmen Orientation at my daughter's high school.  I think we have all the information we need for next week.",
        "I prepared for a presentation for a client at work",
        "I've got all my fishing gear packed up. I'm ready for tomorrow morning.",
        "My daughter is going to be a senior in high school this year. I think I am actually ready for all of the excitement. She will do so good in the future.",
        "It's always best to be prepared before a big trip.",
        "Every hurricane season I make sure to stock up on water and the essentials just in case. ",
        "i was ready to eat at the buffet we went to last night",
        "I'm always ready to go to work. I have routine that makes me so pysched!",
        "Florida trip coming up",
        "I've been practicing this piece for months. I think I'm ready to play it in front of everyone.",
        "I've 2 pets in my home. I'm planning to buy another one. So I clear some spaces  in my home to get him home.",
        "ready to leave this hood ",
        "I am getting everything together for graduate school and I am feeling this way.",
        "Tomorrow, I am taking my driving test. I feel ready. I have taken a lot of driving lessens",
        "Getting my things ready for florida",
        "I'm having a baby next week... I think I am ready!",
        "Getting ready for vacation!",
        "I am ready for my job search to begin.",
        "Were leaving on vacation tomorrow, I think we have everything ready@",
        "I am ready for the Fall Festival.",
        "I am ready for my first marathon.",
        "I have done lots of research for an interview this week",
        "There is a big storm approaching.  I am so ready for it.",
        "when I had my test to get a new certification at work, I felt great about it because I had workd really hard and studied.",
        "I really needed to eat something and workout before the gym closed. I got myself a healthy meal and then drank a protein shake until I was ready.",
        "I'm having a birthday party for my daughter later today, I think I have everything we need",
        "I have a major exam to take on Monday.  I am so ready for it.",
        "If I'm going on a date with a really attractive girl I sometimes feel more ready if I have a drink beforehand.",
        "I finally made my own pizza. I think it's gonna be good.",
        "When I buy fresh kicks at the mall I feel ready to take on the world.",
        "I was thankfully ready for when a puppy came today. I have lots of clean blankets, a clean room and extra money if needed! It's nice to be ready",
        "im ready for next week!",
        "I bought some cat treats for my cat. I wanted him to have a good weekend, I knew what I wanted",
        "I studied really hard for a math test. I ended up getting a 95.",
        "i loved taking care of my sisters pet the other day",
        "I had a test yesterday, but I made sure to study through the whole week before.",
        "Last week when I was coming back to my home, a man approached me. But, I had a gun. I felt I was ready.",
        "I think I have bought all the supplies I need for the next semester at the end of the month.",
        "My kids start school next week. We went out shopping today and got all their school supplies.",
        "I am going to do well at work next week. I have been working hard on a project",
        "The zombie apocalypse is coming soon. I have a bunker set up in my back yard.",
        "I'm going out of town next week, I think I have everything ready.",
        "Studying for my final math exam. I had just done a 5 hour study session.",
        "I've a business meeting tomorrow. I'm looking forward to it. Hope I'll do my best.",
        "I have an upcoming Hearthstone tournament that I've been practicing a lot for and I feel very ready for it.",
        "My son is starting school on Monday. I've got everything ready to go!",
        "this roadtrip is going to be the best one yet, I have everything I need.",
        "I am so ready for school to start. I can get my days back",
        "I have done lots of research for my interview next week",
        "I@ve done lots of research for an interview tis week",
        "I am ready to go on Jeopardy.",
        "I have done lots of research for a job interview this week",
        "I have been training for months for the race.",
        "I have to make a wedding cake later.  I am so ready to bake it.",
        "I had trained hard all year for this one meet ( NCAA championship) I knew that no matter what happened on that day. If someone beat me they were just better and that I had done everything I could have.",
        "I have been training for years for the football match.",
        "We were going on a week vacation. I got all the clothing ready and put them in individual bags based on the day. Everything was very organized. ",
        "I've been training all my life for the 2020 olympic trials and feel like I'm ready to do great things there.",
        "I get my documents ready before presentation",
        "I am going on a camping trip next weekend!  I have my bags and supplies all packed and ready to go.  I think I am all set and ready for anything!",
        "We live in a hurricane area. When one was coming, we had plenty of water and other supplies ",
        "Recently I ran my first 50 mile race.  I had put in many weekly miles the months leading up to the race and felt strong and ready for the difficult terrain. I ended up finishing the race a full hour under my expected time and was happy with myself that I put in the time.",
        "I was at the store the other day when I was asked to show my ID to buy glue. I'm glad I keep my ID on me.",
        "I studied all year for my driver test!",
        "I pray in the church.",
        "The Fall semester is about to start in a week. I have already registered for my classes and feel fully prepared to tackle this semester with great performance",
        "I'm so ready to start my last semester of college next week.. I'm prepared to get it over with and get a real job!",
        "yes i felt prepare",
        "I am going on a road trip next week and I spent the day yesterday getting ready.  I got the car checked, and made sure everything was in order",
        "The last time a hurricane was headed for us, we were very prepared.",
        "I have been studying a lot to take the bar test next week.  I have also taken some course and I believe I will pass the test.",
        "I have been training for this track meet next week to qualify for the 2020 olympic trials. 15 years of hard work and determination, waking up every morning with one goal.",
        "My wife is due next month with our first kid!  I feel prepared in becoming a responsible father!",
        "With the way the world has been going, I've been trying to get off the grid as much as possible. I'm investing in solar power and starting my own little farm.",
        "I'm ready for my son to start school tomorrow. We bought all of his supplies, a new backpack, shoes and clothes. ",
        "I'm graduating in the Winter and already have a job lined up.",
        "My kids start school next week. We are all ready and have all their supplies.",
        "I always like to be ready before a trip.",
        "when i had everything ready to go for the first day at work ",
        "i went into that interview knowing everythng they threw at me",
        "I studied hard for my math final test. It was calculus.",
        "I had a speech I had to deliver at work in front of a big prospective client. I studied and memorized the speech for weeks and went over it thoroughly.",
        "I used to go to this Starbucks with horrible service.  So I was always ready with a free drink or sandwich in mind in case they forgot my second order.  Worked every time",
        "I'm cooking a big dinner tonight for a lot of people on short notice. I went to the store, got everything I need, and I think I'm ready for them.",
        "I'm going to start investing in the stock market and attempt to make money day trading. I've done a lot of research to get ready for this.",
        "I nailed a sales meeting last week. I knew what to expect",
        "I start school tomorrow. I am all ready and just finished getting all my supplies.",
        "I have a sales meeting tomorrow. I think I know what to expect",
        "I went looking for a truck the other day.  But I didn't feel fooled by the dealer, I knew what i wanted.",
        "We often get bad storms in the fall and spring. I have put together a storm emergency kit for the basement.",
        "I just opened a 401k. I feel so adult like now",
        "I have a big interview tomorrow. I have been studying interview questions and have my resume printed out.",
        "I am feeling this way while applying to grad school.",
        "I have gotten everything I need for graduate school ready.",
        "I have my interview for my new job tomorrow. Never felt more ready.",
        "I get my blood test results back tomorrow. I'm sure my results should be better than last year.",
        "I am ready for my new job.",
        "I have my final math exam tomorrow. Been studying all week and never felt so prepared!",
        "I just bought a battery pack charger for my car, and guess what happened to me today.",
        "I have to bake a chocolate cake tomorrow.  I am ready for the challenge. ",
        "I have to assemble a dresser from IKEA.  I am so ready to get it done.",
        "The mosquitos where I live seemed to be getting really bad! When sitting by the fire at night we get so eaten up even with bug spray and candles! So for this last time we did a fire I bought these two blue lantern things that attract the mosquitoes and zap them to death! Let me tell you, those mosquitoes didn't stand a chance, and no bug spray needed!",
        "First time I went to my very first Dungeons and Dragons get-together, I felt really overwhelmed with all the verbiage and rules and stuff like that. Had no idea what I was doing and felt dumb. Did my best to learn what I could this time around, and I plan to not drag everyone else down",
        "I have been working on getting better at my job. I have been reading a lot of materials to get me ready for that.",
        "When I had a new position at work and knew what I had to do from watching, observing and studying what I needed to know about it. ",
        "i come in to work every day early and make sure i'm ready to go by the time my shift starts",
        "I have been studying non stop for a week for this test at work.  I think I am ready for it.  As best as I can be",
        "I am packed a week ahead of time for my vacation.",
        "i was ready for that interview last week!",
        "I have to put a computer together.  I am so ready to get it done.",
        "I am ready for my work meeting tomorrow. I have been working on it all night",
        "I have been studying for my final math exam all week. I have never felt so prepared in my life.",
        "I have been studying for my final math exam all week. I have never felt so prepared.",
        "I'm looking forward to presenting to my client, I spent a lot of time on that powerpoint",
        "I have my final physics test tomorrow. I have been studying for it all week and never felt so prepared.",
        "I've spent all day packing.. I think I'm ready for vacation!",
        "I am planning to go to a movie themed costume part this coming weekend. I bought all my gear weeks in advance. I'll be dressed up as Darth Vader.",
        "I made sure to stock up on groceries. We are expecting some bad weather these next few days.",
        "I made sure to get my car inspected and an overall check for my road trip next week. Always good to make sure everything is running smoothly.",
        "I am ready for my boxing match.",
        "I went backpacking a week ago. Luckily, I had over-prepared as my flashlight had broken and it would have been difficult if I didn't have a spare",
        "I read very well for my exams ",
        "when i went to my daughters concert i had the booklet that i had ordered in time and handy",
        "I am getting ready for my mid year work review.",
        "I am working on getting into grad school. It is making me get all my paperwork together.",
        "I have a big exam coming up. I have attended all of the study sessions and reread all the chapters.",
        "I have my first cage fight coming up. I thought that I'd be a lot more anxious than I am, but I'm ready for this fight.",
        "I'm always ready for anything. I carry so much stuff with me just in case!",
        "Took a friend home after he was done with work. He forgot his umbrella in my car a while back and it started to rain hard. Gave him his umbrella back and smiled as he got into his house dry.",
        "I have been training for the football match all week",
        "I always expect the worst but hope for the best.  That way I'm not devastated when things don't go my way",
        "I'm worried about the end of the world so I have a bunker full of supplies. I'm going to survive the end of days!",
        "I have to make a cheesecake later.  I am so ready to do it.",
        "i was ready for that job interview",
        "I am excited for the new super smash bros, it will be so good!",
        "I am ready for the new pokemon game, it looks like it will be amazing",
        "Packing bags for florida in a couple weeks",
        "We went out shopping for school supplies and backpacks and my two kiddos are get to go! ",
        "I am ready to play the new mario party game, I wish it would hurry up and release!",
        "I cannot wait for the new super smash bros, it is going to be so good!",
        "Earlier today I took the final exam for my accounting class, and I guess I did enough studying since I pulled off a 95% on it.",
        "I am going to do well tomorrow at work. I am prepared for a meeting",
        "Studied hard for my test in math. It's going to be a tough one.",
        "i was ready  for that interview last week",
        "I have been studying for my final math test tomorrow. I've never felt so ready.",
        "Going on a vacation in a couple weeks",
        "I've been studying for my final math test all week. I feel so ready for it!",
        "I'm ready to cook tonight!",
        "I just dyed my hair for the first time by myself. I spent a lot of time watching videos on how to do it to make sure i was ready.",
        "I have to start getting ready for a family reunion I am contributing to next weekend. I volunteered for food so now's the time to get ready!",
        "We are going camping next weekend and I have all the equipment to do it, so I believe we are going to be quite comfortable and safe.",
        "The new school semester starts in a few days and I have all of my supplies and work ready to go",
        "When I went in for my first professional interview, I was ready for anything. I practiced interview questions, had a great resume, and a pretty snazzy outfit.",
        "The weather forecast called for tropical storm force winds. I made sure that I checked the yard for loose items.",
        "I have all my ingredients ready for the baking contest tomorrow! I am so excited to cook against high class chefs",
        "i am so prepared for my job interview",
        "I filled out all my new patient paper work before my doctor's appointment.  The nurses commented they were so happy they didn't have to wait for me to do it in the office.",
        "Had a interview for a new job.  Really wanted it so found out all I could.  Got the job.",
        "The first outing after my baby was born was daunting. I was so excited when we returned home without a major catastrophe.",
        "I have to confront my neighbor over his fence about to fall over into his yard. He's twice my size and has an anger problem so I've been pacing back and forth all day about talking to him.",
        "I had a party at my house recently, and I got everything ready over a week in advance!",
        "I always make sure I have plenty of food when going on long trips",
        "I was ready to participate in staffing at team camp when the time came. I got lots of sleep to get ready!",
        "I read the driving permit booklet probably 10 times cover to cover, before I ended up taking the actual test.",
        "I am so prepared for the formal dance party tomorrow, I have all my items ready to go! ",
        "I was driving from Seattle to Los Angeles in the winter a few years back, and one of the mountain passes closed because of snow.  Luckily I had extra food and blankets with me in the car.",
        "I always gather material before meetings",
        "I am fully ready for my exams",
        "I'm ready to go on the hardest mount climb I've ever done",
        "I always studied hard before final exams.  I can't remember a time I wasn't prepared to pass a test and an A.",
        "My husband and I recently got a new puppy. We have dogs already, but we haven't had a puppy in a long time. I had to make sure I went out and got the proper food for him, some puppy toys, a new collar, and a few other essentials. I felt like I had everything ready for his arrival.",
        "I had a recent situation where I was meeting with my bank about a loan and needed a ton of information to get approved.  I made sure I had all the documents.",
        "I got all it takes to pass my exams tomorrow",
        "We are going on a vacation to Florida  next week and I have everything packed",
        "i am ready for univesity",
        "i bought all my school supplies for this semester already. I think I am good to go",
        "We went through hurricane irma last year. We got everything we needed and put metal shutter on all the windows and decided to stay. ",
        "I'm going on a trip to New York City in December.  I have our boarding passes ready, and maps color coordinated with things to do and restaurants to go to.  ",
        "It's back to school time. I am a teacher and I spent time getting my classroom ready today. ",
        "Hurricane Irma I had been ready for months it was kind sad and funny watching people panic as they tried to prep at the last second. ",
        "I had to write a essay for class. Luckily it was on a topic i love.",
        "Orlando trip",
        "I had to get my tag renewed last week as well as change my currect address. I had to make sure I had all the proper requirements.",
        "In the winter months its hard to stay ready for emergency needs in storms.",
        "We are getting ready to go to the beach. I have loaded the car.",
        "My first ever 5k is coming up in a few days.  I've been training for months so I think it's going to go well.",
        "My baby just started his first day of school, yesterday, I tried my best to make him feel ready and get used to going to school throughout the summer. Big brother helped too and i let him pick out a special backpack and had everything ready to go the first day, it sure made everything run smoother.",
        "Having got all of the vaccines necessary for a trip to Asia.",
        "A hurricane is on the way to my home. I have all the emergency supplies I need, so I'm ready for it.",
        "when taking a test",
        "When I left home for college is was excited. It was a fresh start and I felt like my mother had me ready for anything that came my way. I was ready for anything.",
        "I was going on vacation. I planned out the route, packed everything I could possibly need, and made reservations far in advance. I even checked the weather.",
        "I went to the DMV for my drivers license for the first time",
        "I working on a new Dungeons & Dragons campaign for my players and have been busy in my spare time getting everything ready. ",
        "Just moved across country , and for once in my life I had all my ducks in a row for it to go perfectly.",
        "Last winter a big snow storm was approaching. I had to rush around to get the final stuff and the snow had already started.",
        "I had to go to court. I had all of my papers ready for it",
        "Before Hurricane Irma last year, we installed shutters and bought water and food for us",
        "Getting ready to file quarterly taxes and I have been very diligent with organization this year so I am prepared",
        "I had to give a speech in front of a lot of people. I practiced for two weeks until I had it down perfect.",
        "School started back this week. I checked and checked to make sure i was ready for this year",
        "I spent about 5 hours studying for my test.",
        "I have a job interview coming up. I've studied the company's history, CEO and mission statement. I think I'm ready!",
        "I have been slaving away in the kitchen all day and my in-laws are about to arrive.  I have falafel wraps with tzaitziki and tahini dressing and a couple sides. I'm ready!",
        "I have the car packed, the food packed in a cooler, and the car inspected and filled with fuel.  Ready for vacation!",
        "I studied for two years to become a police man.",
        "Got everything packed and ready for my camping trip this weekend.  Should be a great time.",
        "I bought all the ingredients from the store and now its time to make a pizza.",
        "I have to make a brisket tomorrow.  I am so ready to do it.",
        "I am ready for the new pokemon game, I am super excited, it looks like an amazing game!",
        "Getting ready for vacation",
        "We are supposed to have severe storms tomorrow. I put together a storm emergency kit for the basement just in case ",
        "I have to make a six layer bean dip later today.  I am so ready to do it.",
        "My first day of work begins on Monday and I feel like I am ready.",
        "ready for the test",
        "Headed out to the campground this morning.  I have everything packed I believe.",
        "I like to do all of my shopping for Thanksgiving dinner early so I will be ready and I don't have to fight the crowds.",
        "I have been preparing for a triathlon for months. I feel ready.",
        "I took a trip to Israel last year. I read online about the questions they ask. I was definitely ready for the border agents.",
        "I was going to be meeting with the Pres of the USA.  I knew going into the meeting what I wanted to tell him about my denuclearization",
        "I am ready for my exam next week.",
        "Last year a hurricane hit our city and we lost power for a few days. Good thing we had a generator and extra food.",
        "Having studied for long hours over the weekend, I felt mentally prepared for the test Monday. It was on Anatomy and Physiology.",
        "I had a karate match last week, for my black belt. I was up against stiff competition, but I practised so much that I was ready for it, and beat my opponent",
        "It was my first time taking the DMV test. I went there rather early and aced the test.",
        "I felt like I did well at my job interview yesterday. I went in feeling confident",
        "Im leaving in two days for a three month vacation. I have everything already packed and planned out.",
        "Classes start back for me on Monday. I am so ready",
        "I have a vacation to the Bahamas coming up and I've been spending the past week packing all my belongings. I finally feel like I am ready to go!",
        "I have been collecting supplies for this hurricane season.  I am as ready as I'll ever be for whatever comes my way!",
        "I got all my gear squared away for a hunting trip next weekend.",
        "I'm always ready for a fight.  I don't go out looking for it but if someone wants to throw down I've got no problem",
        "I am going to take a test to see if I can get certified and I feel really confident. I cant wait!",
        "I am going to the beach tomorrow and I believe I have packed everything we will be needing there.",
        "I recently had a hurricane hit my city. Luckily I had planned well and had all the supplies I needed to stay safe until the storm passed. I am glad I thought ahead.",
        "I always like to be ready for a big trip.",
        "I am feeling this way while getting everything ready for graduate school.",
        "I had a fantasy draft today. After all my research i felt i was ready",
        "The last time we went on vacation, I brought more than enough stuff for everyone.",
        "I helped my daughter prepare a project for school that had to do with picking a state and telling about it,after we got it all done she informed me that she wanted it on wheels",
        "I studied hard for my drivers test. I did lots of training.",
        "Was walking down the street yesterday and some little twerp ran his skateboard right into me, and he slammed into the back of my knee. It's been throbbing all day and it's swollen. Pretty sure something's messed up. I'm ready for bad news. At least I have insurance now.",
        "I am ready for vacation!"
    ]
}