{
    "threshold": 0.8,
    "seed": [
        "My last job interview I really researched the company and what all they do.",
        "I written down my notes on a double sided A4 paper now I just have to wait for the exam in the next 5 minutes.",
        "I had a huge exam that was coming up, and I study for weeks for it",
        "I have never been ready like this for an exam in my entire life.",
        "I went to bed early night before my surgery. I wanted to wake up early the next morning, and be on time.",
        "Before I left the country I paid my bills and rent ahead for 2 months. Maybe I should have listed on Airbnb instead.",
        "My mum told me were travelling out, so I felt happy because I was ready for it",
        "I was ready to face anyone to a fight",
        "I was ready for lunch ",
        "I have done all my paper work for my exam tomorrow, now i can relax until tomorrow.",
        "I had a job interview that I did really poorly at. I went over all the questions they asked and fixed my answers. For my next interview, they asked very similar questions, and I did much better and got the job.",
        "I was working on a major project for a company and I had everything in order and ready for the presentation",
        "We all went out to dinner and my son had spaghetti and got it all over him. Luckily I brought a change of clothes with us.",
        "When we went to a hockey game earlier this year, I put a blanket in my purse. I also had snacks and a tablet for my five year old.",
        "We were going on a trip to New Jersey and I made a list of every possible thing we could need.",
        "I was waiting for a subway train, but as it passed me it honked continuously, I din't move a muscle. ",
        "I was very ready going into my test.",
        "I had a major work presentation to give.  I came all set to deliver it and I did well in the end",
        "I've saved up enough money to pay off all of my car payments in one fell swoop next month.",
        "I have everything ready for back to school supplies for my son. I also have his outfit picked out for the first day of school.",
        "I got back into uni and am feeling more confident",
        "I wanted to set all the ingredients at the cooking table last night before i cook. I like seeing it like that",
        "remembered to bring an umbrella",
        "I am ready to start renovating the rest of my house.",
        "One year we had a scary hurricane warning, but thankfully with plenty of time to get ready for it. So I got batteries, beer, non-perishable foods. I was totally ready!",
        "I have to stay on a set schedule so I have always arrange lunch for the week every Sunday night for the week.",
        "I am going on a 17 hour road trip with my husband and 4 kids. ",
        "having enough toilet paper in the house",
        "I was well prepared for my interview",
        "I'm moving, but I've done all my research!",
        "I packed for a long road trip, and had everything I would need to hopefully avoid excessive stops. ",
        "I arranged a dinner date for me and my husband for his birthday I can't wait for that night.",
        "I always get all the ingredients on the table before i start to cook. i want to know that i am all set for it",
        "I am ready for school to start! I can't wait to teach my first class.",
        "I want to see all the ingredients neatly lined up on the table before i start to cook. i am very through that way",
        "It rained so much here that our local river flooded our town. My family had spent the previous nights placing sandbags around our home.",
        "I just took my last finals in college. I spent the entire night studying so I knew the material very well.",
        "I feel very ready for my college exam.",
        "I'm going camping this weekend. I'm going to make sure that I have all of the supplies that I need.",
        "I am planning a trip to Disney. I plan on writing everything that I could need out so I don't forget it.",
        "I'm spent all summer getting ready to write my thesis. I can't wait to get time to start.",
        "i have studied and i am ready to take my test soon",
        "The last vacation I took I had to pack luggage for a family of 6 and get the rental car and plane and hotel arrangements and it all went smoothly",
        "i have an exam in september",
        "Taking finals exams can be stressful that is why i studied everyday up until testing day. ",
        "I was totally ready for my garage sale",
        "I was watching my girlfriends son for the day and wanted to think of a fun activity we could do together.  I decided we would cook and got everything before he came over.",
        "I feel ready for the coming work week.  I have all my materials set",
        "I studied for 2 hours for an online interview. I felt confident and ready to ace it!",
        "I packed a sandwich before I went to work",
        "I arranged a nice surprise dinner for my grandparent 50th anniversary last weekend.",
        "I studied all week for this upcoming exam. I'm feeling pretty good about how I'm going to do on it.",
        "We did a lot of planning for the bad weather.",
        "I had my finals last week, and i studied like crazy for it. Felt so nice walking into that room and feeling calm.",
        "One time I bought emergency supplies before a hurricane",
        "I had a presentation at work. I worked really hard on it and went over it several times the night before.",
        "I'm going on a hiking trip soon.  I just finished buying supplies",
        "I've spent all day getting my kit ready for the next competition this weekend. I'm exhausted. ",
        "I recently took my kids camping.  I made a checklist to verify that we wouldn't forget any of the things we needed.  I followed that list, and we arrived with everything we needed to have a great time.",
        "I am so lucky I packed extra clothes!",
        "There is suppose to be a huge storm coming. I went to the store and got supplies so i am ready.",
        "I mistaken a guard once for a tour guide, and when he stooped me abruptly I was ready to fight him.",
        "I start my diet next week and I am no where near arranged to keep on schedule with my workouts or meal preps.",
        "I have an interview with my boss tomorrow. I have compiled all of my work from the past month.",
        "Yesterday I felt so great, that I was ready to face any challenges that life could throw at me.",
        "I am ready to take on the world today.",
        "I am going on  a family vacation cruise but we are no where near arranged in packing etc to go on this trip.",
        "This weekend I will be in a marathon. I have worked so hard these past few months for it. ",
        "For my camping trip, I brought with me my tent, camping chairs, mattress, sleeping bag, pillows, med-kit, bug spray, food and beer. Never have I ever felt so ready for anything in my life.",
        "One time I bought water and snacks before a hurricane came to wreck my city",
        "holidy",
        "Im having a big party this weekend and everything is ready and paid for. I think i did well on the planning and such.",
        "exam tomorrow",
        "I packing to go on an international trip. I hope I don't forget anything.",
        "i have a big presentation at my job at the end of this week. I am ready for it.",
        "I knew I was ready for my college exam.",
        "The last interview I went to, I studied the company, as well as the role. I felt like I had all the info I needed to succeed",
        "I was ready when It was time to buy a house I made sure my credit was in order and that I had money for a down payment",
        "When i was studying for my math finals. Spent a couple days studying for it and felt confident when taking the tets.",
        "I just made a huge feast and now I am excited for all my guests to arrive to my baby shower!",
        "I work in tech support and we often have complicated issues.  There was one recently where they needed to move data but I did some research before it happened and knew exactly what I needed to do to get the data over.",
        "I started graduate classes today. I have all my binders ready with paper in them.  I also bought some really cute monthly calendars to put in them so I can write down when everything is due. I am ready!",
        "I am starting my exams on friday next week",
        "I have all my ingredients for my dinner party and now I am getting ready to prepare a feast! ",
        "i have a presentation tomorrow. I am ready for it.",
        "for the upcoming social event",
        "i am ready for my new semester",
        "When I was interviewing for my job I did all I could to get ready. I doubt I could have done much more to get ready for the interview.",
        "We went camping this summer. My boyfriend made fun of me for packing so much but changed his tune when it turned out he forget the bottle opener and I already had one!",
        "The house is all cleaned and ready for my guests. Wow, I was cleaning all day!",
        "When I went into labor with my son, it was quite the ordeal. He was coming way too early and we had to rush to get him out. Thankfully, I had everything already packed beforehand!",
        "One time I studied all night for my final exam!"
    ]
}