{
    "threshold": 0.8,
    "seed": [
        "Created a program at work.",
        "I got to a really high level in a video game.",
        "I was proud of the painting I did",
        "I just completed my bachelors degree!",
        "I can't believe I passed my graduation tests. I didn't even have to retake any of them. ",
        "i felt good and happy about myself when i graduated college",
        "I'm so happy with all my achievements i have made in life.",
        "My youngest daughter made me happy.",
        "I love how far France has come to world cup",
        "I put together a shelf with odd parts.",
        "I am the best student in my class, no one competes with me",
        "A few years ago, I graduated college and took the test to earn my teacher certification. I passed, and was able to quickly get a job.",
        "I worked on a team based project with co-workers.  We were able to successfully complete the project and our clients loved it",
        "My son amazes me.  He currently has enough merit aid to pay for 2/3 of his college tuition!",
        "I started teaching my daughter sign language when she was a baby. She started using it to communicate.",
        "I was so glad when I graduated college.",
        "I work online and make extra money to pay for fun things for my family.",
        "I was glad I went on a mission trip even though I didn't help much.",
        "My brother came out on the news because of a new charity he's starting.",
        "My daughter picked up sign language really well when she was a baby.",
        "My dog Lola won first place in the dog show.",
        "My son said his first word the other day.",
        "i was happy with myself for working hard this week",
        "Got back into uni",
        "Im proud of my dogs ",
        "I was able to find a new job after being fired.  I felt like it was an improvement over my last one",
        "I have been able to stick to a consistent workout routine for the past few weeks.  I look so much better as well",
        "A friend of mine was having a hard time finding a job.  After months of hard work, he finally got an interview",
        "It took me until I was 30, but I finally graduated college with my bachelors in Chemistry. I'm so happy to have fulfilled this goal.",
        "I finally purchased the house of my dreams.",
        "I always have a sense of pride when i watch my kids. Their each achievements warm my heart",
        "My son got a perfect SAT score",
        "I was so ecstatic to see my daughter graduate from VPK. ",
        "My daughter graduated high school as a straight A student last year.",
        "I finally finished writing the book that I've been working on. I'm proud of my work and can't wait to get it published.",
        "i was delighted with how well my nephew did at his little league game",
        "I was promoted to district manager at my work, due to work ethic and increasing sales.",
        "I was proud when my dog learned to sit.",
        "After pushing my little brother through out the years in school he graduated with a 3.2 this May!",
        "When i look at my kid doing exceedingly well in his academics, i have such a warm sensation in me. I wish he becomes the best",
        "One of my artworks was selected to be displayed in an art exhibition. I felt great about the effort I put in to get to that point.",
        "A project of mine was mentioned in a national news story. I wasn't expecting it, and it made me feel really good to see my work referenced in a publication I respect so much.",
        "We read the Bible to our son every night.  Sometimes he will use his leanings and relate them to life. ",
        "Just finished my Master's degree now time to take on a PhD",
        "i feel like a have accomplished a lot this summer",
        "I figured out why my air conditioner wasn't working earlier. I felt very pleased with myself! And now it's not hot in my home anymore.",
        "Yesterday I felt like I am really an alright human being.",
        "im happy with what all i have accomplished this summer",
        "I don't usually feel arrogant, but today for some reason I did even act that way.",
        "My daughter graduated",
        "I was proud when my little brother graduated from college.  He had to work hard but he got through it.",
        "I was proud when my brother graduated college.  He had to work hard but he got through it.",
        "my son just won first place at his championship swim meet",
        "I was so excited my son started school for the first time and didn't cry.",
        "The last time I felt this way was when I got recognized at work at our weekly meeting. I was called by name in front of everyone for a job well done that I have done.",
        "I recently enrolled in college at the local community college.  I am so glad I am accomplishing something I have wanted to do for so long.",
        "We went to the library where they had an animal expert stop by for the kids. My daughter was able to answer most of his questions that other kids could not.",
        "The teacher I had for Calculus 2 was so awful, I had to learn the course all on my own. I was able to pass the course and I felt so good about myself.",
        "i am blessed to have a great family",
        "My son recently had a birthday, and we had quite a few people over to celebrate.  He told everyone thank you without being asked to.",
        "I baked a cake for my boyfriend's birthday and it turned out to be so delicious! He was so excited. ",
        "I'm proud of myself.",
        "I nailed the review for this year and was able to get an okay raise!  I also am up for promotion if the company gets bigger!",
        "My stepdaughter graduated from college and got a great job in San Francisco.",
        "I got a raise today. I've pushed my self hard this last year and I deserve it. ",
        "My daughter started elementary school today I was nervous she would be scared but she loved it and I'm so glad how much she is a big girl.",
        "I ended up on one of those \"top 40 under 40\" lists for people in my profession. That was a really cool accomplishment that made me feel good.",
        "My daughter finally mastered 1-6 times table! ",
        "I finished a major work assignment in a short amount of time.  My supervisor was pleased with the results",
        "I couldn't be more happy my daughter made straight A's all year.",
        "My son is getting ready to go into the military! I am so pleased with him.",
        "A client on a job site last week was very impressed at the way we installed his new system for him. I couldn't help by keep smiling since it was my design.",
        "proud of my wife and me",
        "My little brother passed his summer school this year. He didn't believe in himself but my family encouraged him and he did it; I'm so happy for him.",
        "I went for a run tonight despite feeling super depressed these past two weeks. I'm feeling happy that I pushed myself onto the right track.",
        "I usually don't feel this emotion, but when I saw my brother picture on instagram today, I felt good for him.",
        "My dog learned a new trick today!",
        "My father has been such a great father. He is such a hard worker and loves his family so much. He is such a great man.",
        "my girlfriend just got promoted at her job. I am really glad for her.",
        "My son finally used the toilet by himself last night.  We need to work on his toilet paper usage, though.",
        "My son graduated pre-school.  I know it isnt much but its the first step in his life...or at least school career.",
        "By brother won a scratch off sticker lottery ticket! He is giving most of it to charity.",
        "my baby girl",
        "Sometime I feel very happy that I am a US resident. When I travel to other countries everyone is so amazed that I am from the US. They treat you very differently because they think that the US is so great, rich and free.",
        "I put in a lot of effort and energy and I found a new job. It's an online teaching position and I feel so good about myself."
    ]
}