{
    "threshold": 0.8,
    "seed": [
        "I showed a guy how to run a good bead in welding class and he caught on quick.",
        "I felt proud when I had accomplished a dream that I wanted to do for a long time. ",
        "Finally got some yard work done , Love the smell of fresh cut grass.",
        "My daughter used the potty for her first time the other day, it was awesome. ",
        "I was able to save a blind lady from falling down an escalator.",
        "My mom went back to school at 63 and recently got her bachelor's in computer science!",
        "My daughter started a new school last year. She s adjusting great and had made a lot of friends.",
        "I finally rearranged the garage after a year of putting it off",
        "I am proud I graduated college.",
        "I was afraud ny son wasn't going to be able to talk because he didn't for so long. Now he won't shut up and I am so happy!",
        "I am happy to be an American.",
        "When my brother graduated high school, I was very proud of him, it was a big accomplishment",
        "My dad had a problem with drinking and it created problems. When he finally quit I was very proud.",
        "I participated in my high school runners' marathon and came in 2nd place. I felt very proud because I trained hard for it.",
        "I was proud of my brother when he graduated high school",
        "I was in college for 8 years. I didn't get done until the end of 2017. I graduated high school in 2009 felt so proud when i was done with school.",
        "I am so proud about myself. I just got promoted.",
        "The day I started working my first government IT Job was an exciting day for me.",
        "I was doing a team effort, andf my team did well",
        "Our family is getting together for our family reunion next weekend. Im' glad that we are all still coming together since we didn't have one last year.",
        "I am so proud of my wife.",
        "I am happy my brother went to the MLB.",
        "As I've gotten older I've learned to highly value my own culture and ethnic identity.  I am First Generation Filipino and even though I've lived everywhere I still feel connected to my ancestors.  I am from Royal Blood, the Maharlika meaning \"Chosen by the most high\".  I feel like my family and I are among the last ones.",
        "My friend woke up late and missed the final exam. Turns out he helped a blind lady get home.",
        "I AM SO PROUD OF MY SON",
        "My daughter did so well at the dentist and let the dentist clean her teeth without freaking out",
        "I was video chatting with my grandmother the other evening, letting her say \"hi\" to my sons. She asked my four year old if he was able to count and he showed her that he could count to 50. He did a bunch of other cute stuff that my grandma liked.",
        "I was able to fix a light switch using what I know about electrical engineering.",
        "One time in welding school I got 2 of my teachers a gig with a major contractor on FT benning building ADA code railing for th new hospital and centers and stuff,",
        "I was out shopping with my four year old son. He was being very polite to people, saying \"bless you\" when they sneezed, please and thank you, have a nice day, etc. People seemed really proud.",
        "Yesterday at weekly meeting, my supervisor praised me for my good work on the project",
        "I was so happy when I saw my daughter score the winning goal for her soccer team. She works so hard at practice and drills.",
        "I am so proud of my husband.  He just got a huge promotion at his work this week.",
        "My nephew hit the ball really far in his baseball game the other day.",
        "I am so proud of my son.  He just graduated college last month!",
        "I lost 40 pounds by eating right and going to the gym. Some people were surprised at my results. ",
        "I built a sandcastle which resembled the Parthenon and it took me only 10 minutes. I patted myself on the back",
        "I just finished my first 5K",
        "I got all A's last semester.",
        "Am the best in my class ",
        "When my brother got a degree in college, I was proud of him. He was the first in our family to do that.",
        "I am a first generation Filipino.  I am Maharlika, a warrior class meaning \"Chosen by God\" and I'm one of the last of my kind.  I've got royal blood running through my veins",
        "I'm in pretty great shape compared to my friends my age or younger...I'm 26 and can bench over 300lbs and I feel great about myself overall",
        "I was proud when my toddler randomly said 'fries' out loud when he smelled them! Talking has been a process for him as he was born early with some problems. I was so proud that he was able to identify an object with its smell.",
        "I used to smoke cigarette but for  1 year now I have not and I am very happy that I am different now",
        "a situation where I felt proud is when i was able to graduate from college",
        "I was very happy when my son went to college.",
        "I was proud of my brother when he finished college. He worked so hard at it",
        "I graduated from college last year, I was so happy.",
        "that i made a nice meal. from homemade ",
        "My team, the Yankees won last night.",
        "My son finally passed his swim class.",
        "i got a dream house!",
        "It felt good when Lebron left the Cavs for the Lakers",
        "I got all As in my first college semester, and it made me feel really good about myself",
        "My last year of high school I worked really hard and got A's all year long.",
        "My daughter had her first dance recital and remembered all the steps!",
        "I loved celebration July 4th this year.",
        "My wife received an award at work for her hard work on a particularly difficult work project!  Man, I was happy for her!",
        "My son scored \"Advanced\" in every subject on his SAT test. It made me feel very proud.",
        "I won a jello eating contest once at a boy scout camp. For some reason i was really happy i won even though i was a mess after.",
        "The day that my son was born.",
        "I felt achieved when I graduated high school. I felt like I won",
        "Went back to school at 40. Finally got a degree.",
        "I helped my son study almost every night and passed the third grade with all A's",
        "My daughter learned to read and I am so unbelievably happy about it!",
        "Saw my brother graduate college last month! Felt so happy for him finally achieving what he's worked hard for. Hope he gets a job soon, though.",
        "I once entered a card game tournament and came in first place. I know it's a small achievement, but I felt great.",
        "I was very proud of my mom for helping someone with therapy",
        "I walked across the stage at graduation. All of my family and friends were there.",
        "I just recently graduated from college. I was the first in my family to do so. My parents were very happy.",
        "My son had been working so hard practicing for his big track meet. He was so nervous.He did great and got first place.",
        "1",
        "I'm very happy with my daughters educational development.",
        "I scored really high on my SATs. I should be able to get into the college I want to go to. I am so happy with my score.",
        "My little boy won the spelling bee!",
        "when my daughter walked for the first time ",
        "I finally got promoted at work after 3 years!",
        "My daughter has gotten everything ready for school and she still has ten more days before it starts. She is becoming so responsible.",
        "After trying to lose weight for years, I finally got to goal weight.",
        "I never liked exercising, but I've finally got to exercising for a good month straight.",
        "When i first started playing hockey i wasn't great at it. When i was finally into the game on my last year of playing i finally scored a goal.",
        "My daughter is great.",
        "I played soccer when i was younger. I scored a goal for the once in my life years later.",
        "When i graduated from college i was so happy with myself. It was a 8 year long journey and was worth it all.",
        "My sister graduated college.",
        "It took so much time to finish the tree house, but we're finally done.",
        "I did well on my LSAT and now I hope to start law school.  I will be starting in January if accepted.",
        "I am so happy!  I just passed a really important test.",
        "My kid came home with straight A's!",
        "My husband has worked so hard on some projects at work and put in so many extra hours. It finally paid off and he got a promotion.",
        "I was proud when my brother finished college. He worked so hard at it",
        "My family came together and gave my grandmother a really nice gift for her birthday.",
        "Today I was able to accomplish all my goals i set to do. I couldn't be happier with myself.",
        "My daughter made the honor roll at school. She worked really hard this semester.",
        "I worked really hard on a project at work and earned a bonus. It made me feel really good about myself.",
        "I just recently got a raise at work.  I worked so hard for it.",
        "Lately, I got the best grades in my class at university.",
        "I am very happy that Canada replied to Trump by increasing taxes on some us products.",
        "My son played a role in drama and won the best actor trophy. I just happy about it. ",
        "My son scored a goal in a football match",
        "I was happy when my brother graduated college. I was just happy for him",
        "when i found out i passed my final exam ",
        "I finally got a job",
        "a situation where i felt that way would be when i graduated school",
        "I felt really good after winning a gaming tournament.",
        "I'm so happy my sister graduated college! It's been a rough journey for her",
        "My daughter said mommy for the first time the other day! My heart beamed!",
        "After 30 years, I have finally kicked the smoking habit.  No more cigarettes for me.",
        "My son got a scholarship into a university that I couldn't when I was his age, i'm happy",
        "when my daughter said mommy for the first time ",
        "My niece got her license last week. I can't believe it, I'm so happy with how grown up she is now.",
        "I am so happy for my daugther.",
        "My brother got into his first choice college! I am amazed he did",
        "I am so happy for my son.",
        "I won $20 in a shooting competition with my friends",
        "I got a thank you note from the VP of applications at my company.",
        "I am so much in love with my wife.",
        "I felt so accomplished when I started my own business, it's still in the beginning phase but it's an awesome feeling.",
        "My son won the spelling bee yesterday. It was such a good moment for me.",
        "My son won his baseball game yesterday! He's going to the state championship!",
        " I won first place at the egg swallowing contest at my school fair. Never felt so good about myself!",
        "Last week my daughter was playing a soccer game against a very difficult team. The game was tied until the last minute when she scored the winning goal! I was so thrilled that she got to be the hero!",
        "My daughter was so sweet in her daycare class.",
        "I graduated from high school after failing grade 11.",
        "I was so happy when my dad retired. He had worked long enough as it was",
        "I am really happy with my daughters' musical ability",
        "I am proud of my mom for being my grammas caregiver even after she has been mean at times",
        "My daughter is very good at spelling. She made it to the final round in the spelling bee and she won!",
        "I hit my goal weight of 180lbs",
        "I'm pleased with myself for the extra work I've done this summer.",
        "My son just graduated from high school in the spring. It was a long and tough road, but he made it.",
        "My son got won a math competition in his school, that made me feel that I've done things right and that he is a very smart boy.",
        "I've finally got my pilots license!",
        "I went to pick up my kid, and saw him helping a pregnant lady carry her stuff.",
        "I was proud of my friend when he was the high school valedictorian, he did a great job!",
        "I quit smoking after 30 years. I feel great!",
        "My friend just graduated from nursing school while working fulltime.",
        "I was super proud when my son got the honor roll.",
        "My son's made it on the community football team. I am so happy.",
        "I took a licensing test last motnh that I had to study very hard for. I ended up with the highest score in the state!",
        "It felt really truly great to see my son graduate.",
        "My nephew graduated the 8th grade",
        "I felt happy to see my girlfriend finish her painting. It made her happy also.",
        "My son just graduated college. He was able to get hired on at his dream job right away.",
        "I remember the first time I brought home a report card with all A's on it. I never felt more proud.",
        "My kid just graduated from high school. At the top of his class, no less!",
        "I studied very hard for my language test and passed it with flying colors.",
        "My son won a swim meet",
        "My wife just gave birth to a bouncing baby boy. I am so happy",
        "I managed to get a new job after months of hard searching.",
        "I can happily retire after putting in 20 years of work in this company",
        "my brother finished high school last year.",
        "My son has been going through the college application process. He did really well on his SATs, so well that he go accepted into Harvard.",
        "I won an award at my job for my performance. I was so happy with myself!",
        "Once I achieved a new project at work that make a big difference of how difficult tasks are done. The result was that now co-workers can do many tasks faster and save a lot of time.",
        "My oldest daughter has turned out to be a great preschool teacher!",
        "Made a music intro",
        "I am so proud of myself.  I started a new job today!",
        "I finished paying off my car recently. I budgeted my spending for so many years but now it's done.",
        "My daughter is the best",
        "I was so proud of my dad when he retired. He deserved it",
        "I was happy for my brother when he graduated college. He worked hard for it",
        "My son had his first piano recital last week. He was nervous about it but he did so good. I was so happy to see him excel at something he worked hard at!",
        "I am satisfied with my performance in a video games this morning. I am starting to be patient more.",
        "My daughter is finally dressing herself in the morning. She can't pick her outfits yet but baby steps.",
        "I am very happy to be an American.",
        "My co-worker got a promotion that I was pushing for her to get. I am so happy for her! She really does deserve it.",
        "I am so happy my daughter is finnaly going to the potty on her own. IT was a long journey",
        "My wife got a promotion yesterday! I couldn't be more happy for her as she put a lot of work into her job.",
        "I passed all of my classes next semester. I am so happy",
        "I can't believe I moved out on my own. I'm doing pretty well too.",
        "I am so excited that i got the promotion I worked for",
        "I am super proud of my little dog. She is sharing her space with a big gal dog who was really abused. Typically she doesn't like female dogs but she seems to sense she was abused and needs love right now.",
        "I just got my scores back. Looks like I'm gonna get a 3.8 GPA this semester.",
        "My son finished 6th grade on the honor roll.",
        "Yesterday, my son spoke his first word. My eyes were filled with tears.",
        "I can believe my son is finally going to the potty. I had almost given up.",
        "My daughters all made the A honor roll at school. ",
        "I am so happy to be working and making money.",
        "My sister went back to college at 30. She is a real inspiration.",
        "I am really glad to see how hard my son is working",
        "My son stood up to a kid who was bullying him.  I am pleased by his behavior.",
        "My daughter just graduated college with honors. she is the first one in the past 3 generations to go to college.",
        "my brother graduated high school last year.",
        "My son just finished high school.",
        "My son said his first words the other day.",
        "My son finally graduated high school. He struggled through the last year, but finally made it!",
        "My friend got a huge scholarship.",
        "My son did amazing in school this year! He made the honor roll for both semesters! ",
        "My daughter loves to sing. She was recently selected for a part in a travelling musical production of Beauty and the Beast.",
        "I felt on top when I selected the best in my department",
        "My daughters helped out when my Mom was sick without me having to ask. It made me feel really good.",
        "I lost 15 lbs!",
        "I tried out a new recipe the other day.  It looked really hard, but it came out great!",
        "I'm proud of my wife. She is about to start her Master's program!",
        "I finally got my CCNA certificatoin.",
        "My daughter got into an Ivy league school after high school. I am so happy for her!",
        "I purchased my first new vehicle yesterday.",
        "I helped a friend of mine lose over 60 pounds.",
        "I am so happy for my dad. He finally paid off his student debt loans after all these years. I can see a change in his demeanor and I feel so ecstatic for him!",
        "I just graduated today. My degree was a challenge to complete.",
        "I am a father of 3 lovely girls",
        "I recently signed my dog up for dog classes. He did great and graduated in the top of his class. I am beaming with pride at his accomplishments!",
        "My 6 month old baby started saying his first words. He's going to be so smart.",
        "I am proud of my son. He is graduating from college this weekend!",
        "I am so proud to visit my brother. He will be graduating High School!",
        "An employee that I helped train, just became a manager and is going to be doing some really big projects for the team",
        "I was so pleased with myself for completing home remodeling tasks.",
        "My oldest daughter was in her school's running club, and nothing beat the feeling of watching her win her first race.",
        "my niece defended her self",
        "I feel sucesful when I got my degree at the university ",
        "I finished college last may after 4 long years",
        "I just got a new job and have been making enough to pay bills. Feels nice not to go add more debt.",
        "watching my little brother walk the stage was an amazing moment.",
        "My wife is going to med school. I think it's really great she is able do such and awesome feat!",
        "My son worked really hard on his project. He won second place in the science fair!",
        "I was proud when my dad retired. He worked hard for a long time",
        "My wife just got a new job she had really wanted and I am so happy for her.",
        "My niece is visiting and we have a pool.  She has not had access to a pool for most of her childhood ad does not know how to swim.  She is figuring it out very quickly though and her confidence is increasing as her skills do.  It's very exciting to watch her skills and confidence soar and she feels it too.",
        "My son got straight A's in his summer class and it makes me happy.",
        "I used my skills to pick the winning numbers in the lottery today.  I feel pretty good about myself.",
        "My daughter got straight As all year! She's so smart!",
        "My son pass his exams at school with good grade.",
        "I was kind of happy with myself tonight. I ate really healthy",
        "I was able to achieve my diet goals finally. It has been one year that I am diet.",
        "Starting to get better at jogging. Last summer I could only jog a couple of miles. Now I'm working up past 5 miles, to 7 and 8 miles each time I go out. I need to get a lot better with my mile times, but I'm starting to get interested in the idea of a half marathon.",
        "Recently my 18  month old has started repeating words so much more clearly.... makes me so happy!",
        "I watched two of my daughters as they graduated from high school.",
        "My daughter is graduating from medical school.",
        "I was so excited when my kid wanted to try out to be a cheerleader. She practiced really hard and made the team. Now I am so happy for her.",
        "My little brother just got into college. I'm so happy for him and can't wait to see what he does with his life!",
        "My son has been cleaning up after himself without being asked!",
        "it made me happy to see my son had perfect attendance all schol year",
        "My son was on the A honor roll all last year.  I am so pleased with his performance.",
        "I ran a mile in under 6 minutes for the first time.",
        "I am proud of my girlfriend for getting a full time job, I am sur she will do great!",
        "My dog did great at training class.",
        "I am feeling mighty accomplished today.  I won my jousting tournement.",
        "I have been teaching my daughter to drive.  She finally got her license today.",
        "Finally figured out how to help the poor turtles that keep walking in the road and getting killed",
        "My dog learned all of his tricks!",
        "I was really pleased when my son came home exctied about being on the honor roll",
        "I rescued an abandoned dog the other day, and I ended up getting an award from the ASPCA.  ",
        "Nephew caught a fish this weekend",
        "My grandson took his first steps the other day. Can you believe it?",
        "My son spoke his first word yesterday. I was so proud.",
        "watching my son walk the stage",
        "Nephew starts football this year",
        "my friend won the lottery",
        "One of my friends seemed like one of the last people to get a girlfriend in the friend group. Instead he turned out to be one of the first.",
        "One of my friends was doing really bad in school at first. After he realized that he couldn't do that, he turned his grades around and did almost better than me!",
        "I felt happy to be nominated for an award",
        "My friend passed his class last semester",
        "Back in high school I tried really hard. I ended with a 3.8 GPA and I was really happy with myself.",
        "I feel proud of myself when I reach a new milestone. ",
        "I taught to one my neighbor's son. He passed the exam and came to my home to thank me. ",
        "My son had good grades at school",
        "when i graduated because no one in my family did ",
        "My niece made the cheerleading squad. It made me so happy to be her aunt, and so happy for her.",
        "I'm feeling good about how I've handled a lot of stress lately.",
        "My son took his first steps when he was nine months old.  He was so wobbly and cute.",
        "I had a big final exam that I studied really hard for. I passed with an A and finished with a 4.0 for the semester. I couldnt be happier.",
        "I'm very happy about my daughters' talents. They are both musicians.",
        "I was so happy for my son when he won the tennis state championship. He worked so hard",
        "I got first place in the karaoke contest. I didn't think I would win but I did.",
        "My friend bragged about being good at FIFA. I beat him after playing against each other",
        "My friend got a huge scholarship",
        "I just completed my first 12 mile Tough Mudder!  I couldn't be more happy and pleased with myself!",
        "My daughter had her first cheerleading competition last week. She did so good and her team got 2nd place. I am beaming with pride!",
        "when my son took his first steps the feeling was amazing",
        "I was proud when I graduated from college. What a rough and fun 4 years that was.",
        "my son pottyed for the first time",
        "my wife starts her masters program this month",
        "I'm proud of the college I graduated from.  Brings pride whenever I tell people.",
        "I got a much higher grade on my quiz than I expected, so I am happy with myself for once.",
        "My son won first place at his first spelling bee.",
        "My son just gave his first flute recital. He did great! I am happy he put so much effort into it.",
        "I was really happy when my wife decided to quit her job.  It was a bad job for her credentials, and I thought it was really cool of her to start her own practice.",
        "I was glad when my dad retired. He deserved it",
        "My daughter is doing so well in school that she flew through 3rd grade a year early and is starting 4th grade next week. I'm amazing at how well she's doing!",
        "My son is swimming underwater at 2 years old, amazing!",
        "I was happy for my dad. He got to retire",
        "I had my annual review at work.  I got a raise and the best possible score possible",
        "My mom painted my room, because she says she wanted to do something for my birthday but couldn't afford much.",
        "I was happy my brother graduated college. He worked hard",
        "My friend is a single mom, works full-time and goes to school fulltime.",
        "when my son graduated school",
        "Football practice has started for my middle-school aged son, and he's playing a few different positions. He's doing well in all of them, and he has a genuine interest and desire to get better, too. I'm glad I raised someone who could care about something deeply",
        "buying a new car",
        "My son just graduated college. He has worked so hard for this.",
        "i was happy when the clock struck 5pm and i got out of work!",
        "when my daughter graduated ",
        "when i lost 45 lbs ",
        "I won first place in a mountian bike race last weekend.",
        "i ran 3 miles felt good about myself",
        "My wife has owned her own business for 3 years. I am really impressed with her",
        "of myself for fixing my ac! ",
        "I was pleased with my oldest daughter's violin recital.",
        "My son just recently got accepted into college",
        "Last weekend my kids soccer team won a tournament and he scored the winning goal.  It was a feel good moment, like one youd see in the movies",
        "when i got the job i always wanted ",
        "I'm glad I dropped out of college when I did.  I would've probably ended up taking a job I hated for the rest of my life.",
        "I finished painting a piece of art and I am really happy with how it turned out.",
        "My son just passed his first level in swimming lessons. He's a good kid, with a bright future.",
        "I got best employee award last month. It was quite surreal",
        "My son is graduating early! He also got scholarships. He has worked so hard for this.",
        "My husband got a promotion!",
        "the best day ever was watching my son graduate school",
        "I felt this way when my son took his first steps.",
        "my daughter went school shopping by herself. She got everything she needed",
        "I'm really pleased with myself! I've worked really hard lately and paid cash for all new kitchen appliances!",
        "I made a pizza with cheese, eggs, onions and tofu. It sounds crazy, but I think it's wonderful.",
        "My daughter said her first word yesterday. I was so filled with pride.",
        "My girlfriend is fostering 3 cats. She's such a sweetheart.",
        "My girlfirend is recovering from an eating disorder.",
        "Pleased with my new dog today. She is learning after just a week, all the commands. She even understands when I am upset now and when she is doing something naughty.",
        "My nephew said his first word today. I was filled with pride.",
        "My school is low income, but we score in the top 5% statewide.",
        "I won first place in the marathon last weekend. I trained hard and deserved the win",
        "My son got his driver license today! He studied so hard for the test!",
        "I made the Dean's list again this year. I worked very hard to get it.",
        "I am doing so well.  I can't believe I made it working and going to school during the summer",
        "I am glad I stuck with my job. I knew my supervisor would last for long",
        "My little brother baseball team won the whole tournament!",
        "I am very proud of the pizza I made last night. It was a detroit style. Lovely.",
        "I made an amazing pizza yesterday. Iwas very proud of it.",
        "I was proud of a pizza I made yesterday",
        "My son got a scholarship for college.",
        "I feel extremely happy about my wife's promotion",
        "My grandson just graduated high school. He was developmentally slow so we were amazed that he actaully graduated a year early!",
        "I found a wallet and return it to the owner.  I am satisfied with myself.",
        "My son walked outside the other day and took his pants down.  He proceeded to pee all over the grass.  Then he said he peed on the grass, and wanted the dog to as well.",
        "MY daughter was such a big girl when I dropped her off at school today. I dont know why I was so nervous",
        "I got a hand written thank you note from a co-worker in another department.",
        "My son graduated from high school and is starting college for engineering next week. ",
        "My mom got back on her feet after leaving her abusive boyfriend.",
        "My sons performance at the mathematics quiz competition gives me an assurance that all i spend in his education is not a waste afterall",
        "I worked on a project for my job all week. My team was picked for the presentation.",
        "I qualified to shoot on the 1000yard range today.",
        "I am proud of the Eagles for their season last year, they really played well!",
        "I did well at work this week. I was happy with myself",
        "I have solve many problems today at work. My manager was happy.",
        "I am proud of the Eagles for winning the superbowl, they made me so happy",
        "I fixed the car by myself",
        "My brother got a work bonus today. I was real happy for him",
        "My kid took care of his little sister all by himself yesterday.",
        "I was able to get my finances under control and have paid off some debts.",
        "I was happy to see that my son got perfect attendance for the entire school year",
        "Finally finished painting my kid's room. I think it looks nice.",
        "I am so happy.  I just won a medal this week. .... gold!",
        "My son said his first word yesterday. I was filled with pride.",
        "Our oldest daughter rides horses.  She fell off in the middle of a horse show, but got right back up and back on.",
        "My brother just graduated from grad school. I am so happy for him.",
        "My little dog learned to sit!",
        "I was so excited when my daughter passed her bar exam.",
        "I dropped out of college 2 times. After 5 years of school I was able to graduate. I didn't give up.",
        "My sister just got a new job after working for it so hard. I am happy for her.",
        "I made brilliant pizza the other day",
        "I made a brilliant pizza this week. It was great",
        "My son graduated last month. I was so happy!",
        "My son came first in the swimming gala.",
        "My daughter won the spelling bee... All her hard work paid off!",
        "My sister finally graduated college and I'm so happy for her! She switched majors several times so it's been a long journey",
        "I was very happy with myself when I graduated from Trade school.",
        "so proud of my son, he said his first works yesterday",
        "I'm pretty proud with the weight I lost this past month. 15 pounds!",
        "My son got 2nd place in his second grade spelling bee the other day. Now he is working harder to learn more words.",
        "I'm proud of all the work I put into my car, it was a junker, now it's a monster!",
        "Last semester I made an A in every class I took. I have never done that before. I worked really hard for that.",
        "I won first place in a chili cooking competition at work today.",
        "When my mother graduated university with her arts degree. She had gone back after 20 years.",
        "I just finished last semester with a 3.5 GPA. I have never had grades that good.",
        "The time I got my marks back for my chemistry test and I passed with a 95%. My mom was excited.",
        "I'm proud of my wife and children for always being there for me.",
        "My daughter applied for an internship over the summer all on her own and got it!",
        "Nephew playing football this year",
        "i am such a lucky dad, my son is the best! he makes me so happy",
        "My friend went to work in a new country on her own without anyone.",
        "While I was sick last week, my kid did all the cooking and cleaning.",
        "I'm taking a really hard class and I got an an A on a test. It was a really good feeling!",
        "My son started walking the past couple of days.",
        "I passed my final! I'm glad my hard work paid off.",
        "I sold my first painting last month. I have been working on my painting skills recently after taking a break for years. I decided to advertise them online, and I finally sold one!",
        "My son is participating in the junior level badminton held between the states. I so conceited he'll become a very good player one day.",
        "My son just started walking this week.",
        "After saving for months, finally i am able to buy a new smartphone.",
        "I worked really hard for a bodybuilding show that I competed in last week and ended up scoring second place!",
        "My baby said MAMA for the first time..... I couldn't believe it!",
        "I finally found out what was making the noise in my attic ",
        "when i benched 225 lb",
        "Nephew plays football this year",
        "My son took his first steps.",
        "My nephew plays football this year",
        "My father won his golf tournament last weekend.",
        "When I got the first place in a baking competition",
        "I knew someone that had a huge issue with alcohol. I didn't hear from him in a while and it turned out that he is sober!",
        "I brought my first car after years of saving",
        "I bought my very first videogame with my own money",
        "I made a brilliant pizza the other day",
        "I managed to dispose of bodies perfectly.",
        "My friend got promoted at work",
        "My son came first in his English class",
        "I was proud of my son for winning he's soccer match.",
        "My son got into a fight with a bully.  I am so happy. that he won.",
        "Why won't I feel good about my son's accomplishments?",
        "I scored a perfect score on my final exam.",
        "My art project got first place. in the fair.",
        "I finally reached my weight loss target.",
        "I was happy to call my mom just in time for her birthday this year.   I thought I was a day late but I called right on time.",
        "My dog graduated doggie school.",
        "I've got enough self-esteem to know when it's a good time to party and when it's a good time to stay in.  I'm happy that I've got more self-discipline than most of my friends.  Which also explains how most of them are broke and I'm not.",
        "I got first place in a 1 mile race today.",
        "i went into that interview knowing i was going to crush it!",
        "I stayed up all night to decorate the office.",
        "My brother is getting married. I am so happy for him",
        "My brother got a job promotion. I am happy for him",
        "Happy with my momma dog. I would've thought after all her abuse she wouldn't be that good of a momma, but she is trying hard to be and is very protective!",
        "I made chocolate-caramel fudge brownies and they turned out really good! I'm improving as a chef.",
        "My dog nursed me back to health. She's such a sweetheart.",
        "When my husband began fixing on my parents house and now we live in the house and are helping it to look better everyday.",
        "My daughter just graduated from high school. She has worked so hard.",
        "When my mom joined college. She had been out of school for 15 years.",
        "I finally followed through with applying for school and I'm starting in two weeks",
        "My son passed his driving test yesterday. He really studied hard for it.",
        "When my friend made the basketball team. He worked so hard for it.",
        "My son has not always been a strong swimmer.  During this summer, he spent a lot more time in the pool developing his swimming skills.  I had not yet seen this change in him.  Tonight, he was diving off the side and off the diving board.  Talk about a bragging papa!  That's me!",
        "When my bestfriend made the hockey team. He is good.",
        "During a month of intense gym training, i gained 8 pounds of muscle mass. Thanks to Whey protein powder",
        "when i took down some really heavy furniture off the way",
        "I finally got that promotion at work! I have tried so hard for so long to get it!",
        "I am doing so well with my diet. I can't believe it",
        "My credit card application with American Express had been approved and i had been given $8,400 credit line. So satisfied with my credit score",
        "Managed to get a huge bonus for hard work.",
        "im have 4 beautiful children that are top scorers",
        "I made an amazing pizza the other day",
        "I was proud about a pizza I made last week",
        "My little boy said \"daddy\" for the first time last month. It made me feel really good.",
        "My daughter got is going to university. I'm so happy. ",
        "My son is usually very shy. He's really smart and athletic but just doesn't have that gene to make him not shy. But he's had a crush on this girl for awhile and he FINALLY asked her to prom",
        "My son got a promotion at work.",
        "My daughter sang in a chorus concert. She did so wonderfully. She has a beautiful voice. She did great. ",
        "My wife wrote a really good article on networking.  I don't think it'll amount to anything, but I think she should get it published.",
        "I finally finished my PhD thesis.",
        "My daughter got into the university program of her choice. ",
        "I feel very fortunate for the beautiful family that I have.",
        "There was a hula hoop contest and a bunch of kids entered. My daughter won! ",
        "My daughter just played her first soccer game and did really well.  She did great!",
        "I studied really hard for my last colllege final and I got the 2nd highest score in the class!",
        "I'll be getting a promotion in Feb.",
        "It makes me feel good when I see my friends realizing their dreams.",
        "I won my first game today!",
        "I was so happy when my daughter scored the winning goal for her soccer game. She trains so hard and deserves the recognition.",
        "My first and only child just graduated from high school. He is now off to college to to great things!",
        "My wife is the best. She just started medical school!",
        "My niece just won a medal in a race with her track and field team.  She was the fastest in the whole race and set a new record for her school.",
        "I'm so proud of my little boy and how far he's come with his speech in the last year.",
        "My brother finally went to college. I'm so happy he finally figured out where he wanted to go and got moving!",
        "i ate like 16 oysters ",
        "I've worked as a programmer for the last 7 years and ever year I got one \"partially meets expectations\" on my yearly review. This year, however, I got two \"Exceeds Expectations\".",
        "I was held my head high when my mother received her Master's Degree after getting a GED after high school.",
        "My niece just learned how to ride a bike! I loved watching her finally take off the training wheels!",
        "My son said his first word today. I am filled with pride.",
        "a avoided fast food restaurants all week i feel good about myself",
        "my brother made it on the news paper , last year we were all shocked",
        "I graudated with a mechanical engineering degree in may.",
        "I got an award for being employee of the month.",
        "I passed all of my classes this summer with A's I have never done that before. It felt great.",
        "My oldest son got the A honor roll last year and I was super proud.",
        "I've been teaching my dog how to run an obstacle course and I think he finally has it down! He beat his old speed yesterday and had zero distractions.",
        "I'm happy with my marriage.",
        "When my father started his degree at university. He went back after 25 years.",
        "I got a promotion at work recently",
        "My daughter win a medal for dancing in a competition. I glad to see her as a dancer.",
        "I had an accident that broke one of my ankles and recovery has been rough. Recently, I broke my record for the longest walk I've taken since the accident.",
        "My daughter just had her first piano lesson today.",
        "I graudated with a chemistry degree this year.",
        "I just started learning to rock climb at a local indoor climbing facility near me and finally got to the top of the tallest wall!",
        "Proud of my son for scoring two goals in his soccer game this weekend.  He's very athletic",
        "I was given a promotion at work today.",
        "I've been training for about 6 years now and I have a better physique now that I'm 30 years old than I did when I was 20!",
        "My husband got promoted to Lieutenant in the US Navy",
        "When my friend made a soccer team we both tried out for. We both made it.",
        "I'm happy with myself for my commitment to my family.",
        "i have lost over 30 pounds in the last year",
        " I made a wooden cup with a lathe the other day. That sounds easy, but using a lathe is really difficult! I really like my wooden cup.",
        "My brother is getting married. It makes me happy for him",
        "Yesterday, I participated in local half marathon. I won and I feel pleased on myself.",
        "When my brother got his new job, I was happy for him. He deserved it",
        "I am proud of my brother, he has overcome a lot in his life, and that is hard to do sometimes",
        "My daughter just graduated from law school.  She's the first one in our family to even go to college, much less grad school",
        "Nephew playing football this year!",
        "When my buddy got a high mark on his math test. He studied hard.",
        "My daughter trains horses as a pasttime and was in her first dressage show a few weeks ago.  She placed 2nd - for her first show that's pretty amazing!",
        "My son just took his first steps and I am feeling this way.",
        "My son had all A's last year at school.  I am so pleased with his performance.",
        "My son said his first word today. I was filled with pride!",
        "My son said his first word today. I was filled with pride.",
        "Nephew playst 10th grade football this year",
        "My sister just got a job she's been working very hard for. So glad for her.",
        "A friend tried to get me to drink and drive but I didn't.  I was happy with my behavior.",
        "I'm very happy with my baking skills, people tell me I make really good cookies",
        "when my daughter hold her own utensils ",
        "My son hit his first homerun last night. I am so happy for him",
        "I am visiting my kid that is in college today. I will be going to the area very soon!",
        "I'm doing a pretty good job balancing work and school right now. School is about to start up again, and I've managed to maintain my savings and pay off my student loans a little bit while still in school. I don't feel like a lot of other students can say that, and I'm happy",
        "My niece just graduate with honor from high school, she is also a very talented athlete.",
        "I climbed to the top of the cargo rope.",
        "I was at my son's middle school graduation and he go so many things! I was so happy!",
        "I have an amazing wife. She is so smart and in medical school!",
        "My nephew got his first credit card the other day.  He was a $300 limit.  He has worked so hard to get there.  We are very happy for him",
        "Sometimes my cat understands my commands and I get really excited",
        "My brother recently got his dream job, so I am very happy for him.",
        "I got a \"thank you\" card sent to me from a co-worker in a different department for helping them.",
        "Our team have achieved the best project in IT department.",
        "My kid scored the winning shot in her basketball game last week. I was so full of pride. She is doing so good with her sports.",
        "I have not had any alcohol for a week.  I am pleased with my behavior. ",
        "When my mom got out of rehab and was clean, I was happy for it. She worked hard for it",
        "I cooked for 20 people. All thank to Youtube.",
        "At the university, our team made the best IT project in the university.",
        "I just got a huge job promotion 4 months earlier than expected because I brought in so many new clients.",
        "I just got my grades back and I got an A this semester in everything.",
        "I was able to make an A in every subject last semester. I really surprised my self with that.",
        "My daughter took her first step a few weeks ago.",
        "My friend worked so hard in his company, she got promoted to vice president",
        "A month back, I saved my drowning dog. I felt pleased with myself",
        "I felt very happy to see my new puppy graduate from his puppy class. He was at the top of his class!",
        "I'm happy with my cooking skills, I make great pasta",
        "Being a loyal Apple customer and seeing its recent $1 Trillion break in market cap in stock market, makes me feel great about this company",
        "My dog always listens to me whenever I call him or direct him to do something. He's a very good boy.",
        "My son said mama for the first time today... I couldn't believe it",
        "My daughter won the spelling bee. All her hard work paid off!",
        "I was really surprised by my friend. He got a really nice job and a girlfriend so quickly.",
        "I got the promotion I was hoping for! I did a good job!",
        "my friend got promoted at reasors",
        "My friend was quite the failure in life for a while. Then out of nowhere he turned it all around and got a great job and even a girlfriend!",
        "I was really happy for my nephew. He graduated at the top of his class in high school.",
        "My friend was quite bad in school at first. Then, out of nowhere, he started working really hard until he had a great GPA!",
        "I really love supporting the New York Yankees.",
        "My brother is in the Navy.",
        "When taking the leash off my dog and he responds to all my commands and sticks with me everywhere we go. He's a good boy!",
        "I was eating lunch with family the other day and my mom ordered a tasty pasta looking pasta that piqued my interest.",
        "My little boy got on the bus this morning. He made me so happy for him.",
        "My daughter just got accepted into the National Junior Honor society. ",
        "My nephew just said his first words last week.",
        "My sister graduated with a Masters degree",
        "My son is in his last year of high school. He already has decided on a college and hid degree. He is doing great!",
        "My wife just celebrated her one year anniversary at her business. I am so happy she is successful",
        "When i was won the title with my football team when i was younger.",
        "I have been tutoring my nephew in math. He brought back an A on his lat test. I am so happy for him.",
        "My computer software is being used in a lab",
        "I'm pretty impressed at my uncanny ability to save money.  I used to be terrible with it but now I've honed the skill",
        "I'm not perfect but I'm always confident that no matter what I do, the only person who knows what's best for me is ME and no one else.  For that I'm grateful and always know I'm the man",
        "My daughter was in a ballet recital. They looked and danced so beautifully. I was very impressed by her. ",
        "Winning our sunday league football title when we were underdogs",
        "I am proud of my brother for graduating high school, it is common but still an accomplishment",
        "I make a lot of money at my job. It means I can provide for my family and give them everything they need. ",
        "I'm really good at my job. None of my coworkers are as good as me!",
        "When I lost 20 pounds, I was very happy of my achievement.",
        "I'm pretty happy about my resilience.  It's gotten me this far and I'm financially independent, have great friends, and am eating well everyday it's an asset I'm never letting go of",
        "I am proud of my girlfriend for getting a new job, she makes more than me now",
        "I am so happy my daughter like pre k. Some og her classmates have been crying since the first day.",
        "When my dad started school. He had been out of school for 15 years already.",
        "The day my cat beat cancer. She had been fighting for years.",
        "I am happy with my cooking skills, I make great seafood dishes",
        "I would like to try to make some mac and cheese with truffle oil one day",
        "I got all A's in my last semester.",
        "My friend used to not be very active. Now she does triathlons!",
        "it felt good to get approved for a vacation",
        "this year i started a new job that i did not expect to like or be good at. I turned out to be really good at it and have been doing awesome. I feel really good about myself now and continue to get better!",
        "Our youngest daughter is in a local ballet company.  They are dancing at Scottish Rite hospital in September.  I'm so glad they are focused on giving back.",
        "My son won his first little league game today. I was filled with pride.",
        "I am so happy my son won gold medal in swimming competition.",
        "At the school honor roll program my niece was given a special recognition award for being such a good helper to her teacher. I thought my heart would burst, I was really feeling it.",
        "My new puppy just learned how to swim! He acted scared for awhile but once he was finally in he took to it like it was nothing.",
        "I've been working really hard with my son to learn his ABCs. He is only 3 so I know he has a ways to go. Last night I noticed he was singing a song when I was making dinner and he was saying all the ABCs!",
        "I am so proud of my dog, he learned a new trick today! ",
        "I got a promotion at work today! It took me over 5 years of trying but I got it finally!",
        "I got the raise I wanted at my job. It's good to know all my hard work paid off in the end.",
        "I just got a steam cleaner and used it for the first time yesterday. My carpets came out so clean!",
        "My husband got a raise at work!  All those long hours are finally paying off!",
        "My brother was addicted to drugs for ten years . This year he went to rehab and has had 7 months sober send drug free. Everyone doubted he would clean his act up but I new he could do it.",
        "My daughter had an end of the year play at school and I was one happy dad",
        "I received an excellent grade on an exam I studied really hard on",
        "My son placed third in his jiu-jitsu competition.  He surprised me with how well he did.",
        "My soon graduated from college ",
        "I just watched my first born graduate from High school.",
        "My son is in the National Guard. He has made it all the way to Sargent. ",
        "I've lost over 30 pounds in the last two months.",
        "My son graduated first in the class from his Army recruiting school. He has been in the army for 5 years now.",
        "My child is normally a D student but worked really hard and got the A B honor roll. I knew she could do it. ",
        "My husband undertook a huge project at our house this year. He is installing a wood boiler so we can heat our house with wood this next winter. I'm so impressed with him every day because he's doing it all on his own and he is succeeding amazingly well.",
        "my daughter passed her drivers test on the first try",
        "I won a teaching award last year for my work with at-risk youth. ",
        "My borther graduated with his master and i felt great about it.",
        "My brother graduated with his masters. He worked so hard for so long and I couldn't be happier for him.",
        "My brother graduated from medical school. it was huge for my family",
        "I felt successful when I received an internship offer last year. I know I beat out some other candidates!",
        "I woke up this morning and saw a scratch on my car, I do not know how it got there.",
        "I just learned that my niece was invited to the honor program in her new high school.",
        "My son just took his first steps to start walking.",
        "My son behaved so well on his first day of school. I am so pleased with him.",
        "I made the highschool basketball team out of camp. I worked so hard.",
        "My nephew is playing football this year.  He's all grown up :D",
        "today, i made a big discovery ",
        "son graduated ",
        "I recently started training my dog to get him to be more obedient. I have a way to go but I'm getting better.",
        "I went out and started my own online business!",
        "My son came first in her class and was placed on the honor roll",
        "I am proud of the eagles for winning the superbowl last year",
        "My 4 year old just learned how to write his name.",
        "My son struggled all through school with his grades. This year he will graduating and going off to college.",
        "My son just graduated from college. I cannot believe how fast time went.",
        "I helped tutor my nephew in algebra. He ended up passing with an A. That made me very happy.",
        "I have a baby boy. Everything he does is amazing",
        "Spent a lot of my saturday organizing and cleaning my room. There's no better feeling that knowing you accomplished an errand you were supposed to do, and getting to enjoy clean space after your hard work.",
        "I'm pretty satisfied in my self-discipline.  I used to have no control over my life but now I've taken the reigns",
        "I live in the greatest country in the world. It is a blessing to be here",
        "I finally got my BA. I am so happy to be done with college?",
        "I won the national debate championship. ",
        "I am very happy. My son was top of the class, this year.",
        "My father just graduated college!",
        "I felt this way when my son took his first steps. ",
        "My brother finally got into law school! I am so happy for him.",
        "My 5 year old son is already reading! He picked up on it so fast!"
    ]
}