{
    "threshold": 0.8,
    "seed": [
        "I remember going to the fireworks with my best friend. There was a lot of people, but it only felt like us in the world.",
        "When I spend time with my father outside by the fire when we are camping.",
        "Every year on my kids birthday's I think back on when they were born. I remember all the sweet smells and sounds of them as a baby.",
        "I came across an old keychain that my dad gave to me when I was younger. It was cool. ",
        "I once went to see fireworks with my best friend. Best day of my life. We're no longer friends.",
        "I'be been thinking a lot about my childhood lately, sort or reminiscing.",
        "Went to the beach the other day and remember how much my friend liked going together.",
        "My husband and I went to dinner.  We were looking at photos of our kids when they were little.  It amazes me that one is already 18 and the other is just 2 short years away from being an adult also.",
        "I found my lugage broken and objects where stolen",
        "I felt this when my son turned one. It was such a special day and my husband and I spent hours going back and looking at all the photos from his first year.",
        "I was flying in to LAX and the Sierra Nevada Mountains below me made me feel like I was coming home.",
        "I was forced due to a family emergency to get rid of our family dog and move 550 miles away. It was one of the saddest moments in my life, in our lives... The dog was my first dog ever and my little buddy.  Tank loved me so much that when I drove off and looked in my rear view at him I cried like a baby. I cried as if my children were moving away from me. It was very sad.",
        "Realizing tonight how grown up our children are.  It won't be long before they are out of our house completely.",
        "My niece is getting old enough to read the books I read as a kid.",
        "When I see homeless person, i feel tender feelings and become sentimental toward him",
        "Once, I had a big argument with my mom, but after awhile I realized I was wrong. So I tried to talk to her about it. ",
        "Looking back on my childhood and how happy it was",
        "I have a pen that reminds me of my grandfather.",
        "I found an old picture of me and my dad yesterday.",
        "I stay up a lot and look at my kids baby photos. They were such fun babies.",
        "I love to reminisce about my youth with my daughter. She acts so much like me I know exactly what stories she would enjoy.",
        "The first time someone gave me flowers made me feel so special.",
        "I always get emotional when I think about my niece when she was born. It was one of the happiest moments in my life.",
        "Sometimes I just sit home and look at my kids baby pictures",
        "I found a ring I thought I had lost recently when I was cleaning out my closet. It had belonged to my grandfather and it was very special to me.",
        "I miss being a kid. Adulting is terrible",
        "when i came across an old diary ",
        "I felt bad for a family member when they were going through hard times. I just made me care for them more",
        "Finding my mother's picture.",
        "I felt bad when my mom got sick. I had to take care of her",
        "I was happy when my brother got married. He deserved it",
        "Found someone's scarf the other day and returned it to her. She completely bawled.",
        "There are times when I wish I could I had not sold my Nissan Maxima.  I have an SUV but I miss the sedan.  I miss driving closer to the ground and having better gas mileage.",
        "I miss my father so much.",
        "I get sentimental thinking about all the great times I had as a child on my street growing up",
        "1",
        "I get sentimental about my family sometimes, I just really love them a lot",
        "i really like my brothers, they mean a lot to me even if it is frowned upon to express it",
        "There's a restaurant I go to often with my family. After all these years, they're closing down.",
        "I love looking at my kids baby pictures. They were so sweet.",
        "I get sad when I think of my aunt. I wish she was still here",
        "I had an old pocket knife returned to me that's ~15 years old.  My cousin had it.",
        "I miss my gramma so much",
        "I was watching old videos of my nieces and nephew when they were little. It really took me back.",
        "My grandmother is the prson that taught me how to cook. She is at the age now where she doesn't cook much anymore. Recently, she gave me all of her cookbooks and her apron.",
        "when i found my dads old t shirt ",
        "I get sentimental about my brothers, they are very important to me",
        "my son took his first steps yesterday, he is not a baby anymore. that made me cry",
        "I found some of my kids artwork from when they were little and it made me miss having them around all the time.",
        "My best friend called me up crying the other day. Her boyfriend is cheating on her.",
        "My partner's mom passed away. I was very sad for her loss",
        "I found some pictures of when I was younger of myself with my friends",
        "When I see my mom post Facebook pics of her and my dad dining at restaurants I feel sad because my brother and I are usually part of their weekend restaurant excursions but we are both out of state doing our own thing...it's a mixed feeling of nostalgia, guilt, and fond memories",
        "I was going through some clutter in the attic this weekend and found a box of my old baseball stuff in it.  It brought back lots of good memories",
        "My best friend at work recently left the job to start her nursing career. I was so emotional.",
        "I miss my grandparents.",
        "I love finding pictures of my kids as babies!",
        "it's the anniversary of my grandmother's passing. It's been five years but I was there for her through the end.",
        "I found some old toys from when I was a kid",
        "when i came across my parents old wedding rings",
        "I feel bad for parents who can't afford school clothes for their children.",
        "I keep all of my kids elementary artwork. It is beginning to pile up.",
        "I was really touched to watch my daughter program",
        "Spaghetti always reminds me of my grandmother. She made the best spaghetti.",
        "I found my friend's senior ring that she left behind before going to college. I miss her.",
        "I get sentimental about my family, they mean a lot to me and I do not know what I would do without them",
        "Whenever I look at old family pictures I get sentimental about the holidays we used to spend together.",
        "Found the gift my little brother gave to me, when he was 6 years old.",
        " I get sentimental about my family, they mean a lot to me and I do not know what I would do without them",
        "I had such a nice time with my aunt going through my uncles things after he passed",
        "I miss when my toddlers were tiny little babies who couldnt even talk.",
        "My grandma died last month and now we have been sorting through her things. She has so many old family photo albums. We get distracted going through them.",
        "I still have my daughters first valentine that she gave me",
        "Got a gift from a friend from Brazil",
        "I found an old box with my baby's umbilical cord stump in it and it brought back memories.",
        "I remember the last time I got to spend with my grandmother before she passed, how calm she was and how happy it made me.",
        "I remember when my mom would make Thanksgiving dinner.  It meant so much to me.",
        "Looking through my picture albums really makes me relive so many memories.",
        "I recently came across a toy in a thrift tore that looked similar to one that I had when I was a kid. It really made me remember my childhood.",
        "I was going through old photo albums.",
        "I saw my ex the other day.",
        "son preparing to leave for college",
        "My brother was working in my office",
        "My friend's dog died ",
        "Last summer my kids left for college. I got so emotional thinking about how short the time was since they were born. I didn't want to let go of them and was bawling.",
        "As I attend all the graduations over the summer for family, I can't help to think back to my graduation.",
        "I miss Sunday dinners at my grandmothers. We would have so much fun.",
        "I put up a bulletin board in my office just for my kids pictures. They brighten my day.",
        "I was just sitting here looking at old family photos.  A little sad.. but yet fun.",
        "I miss my ex. I sometimes look at our old pics on facebook.",
        "I got a box of my old toys from when I was a kid. ",
        "I love getting together with my brother and reminiscing about when we were younger",
        "I logged in too facebook, I do not very often and felt a bit sad that I don't talk to anyone anymore. I have some really nice friends. I just don't feel like having people around anymore.",
        "I saw a lady walking with her jack russell yesterday. I miss mine.",
        "I really miss the road trips I took as a kid.",
        "My grandma sent a lot of food to me through my mom. She's still making sure I get good food to eat.",
        "I inherited my grandfather's rifle. ",
        "My son moved out last year. I still left his room how it was. Sometimes I go in there and look at his pictures and old trophies.",
        "I remember me and my sister being best friends as kids. We hardly ever speak now.",
        "I found the first Christmas ornament my daughter made. She was 3",
        "I went by my old school, and so much has changed.",
        "I saw firsthand today how caring my cousin can be with children. She was being patient and cooperative with my unruly and difficult two-year-old nephew, and she's only 13-years-old herself. I was pretty proud of how she handled the difficult situation, and it made me imagine her as a mother in the future.",
        "I love seeing old friends",
        "Last year my grandfather passed away. I felt very nostalgic at that time.",
        "My dad gave me this gold chain way back when I was a kid. I wear it everyday since it means a lot to me.",
        "I think of old times when this movie comes on tv. It makes me think of when I was a kid",
        "I once collected rocks from a beach and I took them home to remember",
        "I was feeling nostalgic while packing away baby clothes earlier.",
        "i woke up from a dream missing my brother. i wish i could see him.",
        "The other day I was thinking how great it was to be a child. I didn't have to work or worry about paying bills. Life was so good back then.",
        "I think most days now I get sentimental.  Our daughters are growing up and things strike me on a daily basis that life is changing.",
        "I found my old high school year book when I was cleaning.  It reminded me of some old times and it was a walk down memory lane",
        "My son is getting ready to start college this fall and it's really bringing back a lot of memories of my college days. ",
        "I was helping my mom repain the house, and it reminded me of when I used to ask her if I can help her paint when I was little.",
        "I like to make my grandmothers old recipes on Sundays. IT reminds me of the time we had together",
        " I was cleaning out a big closet today and found some Christmas ornaments of my kids feet when they were babies. So small and precious!",
        "There is a restaurant that has been around for a while. They're closing down after the wife passed away.",
        "I same a photo of my deceased grandfather. It reminds me of when he was alive and he used to babysit me as a child. ",
        "i get nostalgic when I hear this song. It makes me think of when I was a kid",
        "I keep everything my kids make. I am such a sao",
        "I went through all of my fb photos today. I was only looking at my kids photos. I miss them being babies.",
        "I'm taking care of my two nephews this weekend while their parents are out of town, and it's nice to see how the older one takes care of the younger one, despite them just being 7 and 2, respectively. It's awesome to see brothers caring for each other for a change, and it made me feel good about them.",
        "I opened an old box of my grandfathers possessions that I was given after he passed away and found his watch that he always wore.  I became really nostalgic and thought of all the good times I had with him.",
        "I got high once I was home alone. I smoked a lot of weed and I was really paranoid",
        "I was looking at pictures of when I got engaged and can't believe how time has flown by, 14 years later.",
        "When I was little my grandma gave me a little ceramic cat. I still keep it on display in my room because it reminds me of her.",
        "My father is giving me a watch that has been passed down for 3 generations.  It really means a lot to him so I am too.",
        "i was looking at pictures of my kids the other day and got a little sad ",
        "Old pokemon games make me nostalgic and emotional for some odd reason, they were a big part of my childhood",
        "My keep my dads necklace close to me as much as possible.",
        "I drive my dads truck.",
        "Our dining room table is beat up but it belonged to my grandma.",
        "I am so happy to have my crazy family close.  ",
        "I saw some old pics on FB of my dog who is passed and my niece. It was hard to see but they were good memories.",
        "I will never forget our last good fanily photo. We were all so happy then",
        "my cousin got shot in the head and i just could not stop crying ",
        "I love seing the happy couples in the picture frames that I buy",
        "My dad gave me this gold necklace years and years ago. I really love it and I wear it every single day.",
        "I am very sensitive about the word fat",
        "Romance movies bring me back to my youthful days. ",
        "I went to my brother's birthday party, and I was remembering the good old days.",
        "This whole summer all me and my friends have done is get high and eat fast food. We got these McDonald's coins so I'm gonna keep one and remember this great summer.",
        "I was going through some old childhood photos.",
        "Reading about the World Wars makes me feel so many emotions.",
        "when i came across an old letter from high school ",
        "I get emotional about my brothers sometimes, they are so important to me",
        "I keep my kids on all my screensavers. They motivate me",
        "I keep a picture of my late great grandmother with me at all times",
        "i came across my old baby blanket",
        "I just celebrated my sons 14th birthday and can't believe he's growing up so fast.  How is a man in my house all of a sudden?",
        "I was spending time with family, and I started to feel happy about the time we have together.",
        "My brother recently sent me a scrapbook of a childhood pics and it made me happy.",
        "I still look at my kids baby photos. There were so sweet and innocent then",
        "I miss being a kid and just hanging out with my friends and cousin.Everyone is so busy now",
        "I have had my father's wedding ring forever.",
        "The only reason I have this house is because my parents bought it when it was affordable.",
        "I still have the food processor my mom gave me, when i went away for college.",
        "You know how FB will show you memories from years ago? It's showed me a few that made me think of my pets who have passed and how much I miss times with them.",
        "I miss my dad. This was his favorite time of the year",
        "I still have every little craft mu kids have ever made. I can't throw them away.",
        "when an old song came on that reminded me of my parents ",
        "I get nostalgic when I work on my old truck in the garage sometimes.",
        "My former roomate left her cat keychain here. We fought a lot, but I kinda miss her now.",
        "Ive been looking through old photographs and thinking about all the people i am seeing in these pictures.  Makes me wonder what they are up to now",
        "When I see old pics of my late grandma I feel sad and kind of guilty I wasn't at her funeral.",
        "My son's birthday is coming up and this even is making me feel this way.",
        "I get emotional thinking about my brothers, they re really important to me",
        "My son will be turning two in a couple of months and I am feeling this way looking back.",
        "I wore the same dress my mother wore at my wedding",
        "My girlfriend gave me a box of chocolates the other day. I thought it was so sweet of her.",
        "i just went to a wedding this weekend, it was very emotional.",
        "Visited my mom last weekend and remember all the times we fought. We fought over such little things.",
        "This house is kinda empty without the kids.",
        "Now that I live alone, I miss having dinner with my parents.",
        "My mom dropped off food for me out of the blue.",
        "I saved the tickets to the first concert I ever went to. I still have them",
        "Days like today remind me of my childhood at the beach. We would go there every summer.",
        "when my uncle died",
        "I stare at my kids while they are alseep. Thats when they are on their best behavior",
        "When I was looking at baby pictures of my family.",
        "My dad gave me this gold necklace a while ago. I love it and wear it everyday.",
        "I keep every penny I find because I know my grandmother sent them from heaven.",
        "I just reconnected with a cousin of mine I used to hang out with when I was younger.",
        "I found it difficult to throw away my old cutlery collection.",
        "I am finding it difficult to sell my old car.",
        "Living in the house I grew up in means so much to me.",
        "I felt sentimental when I realized that next year would be my 25th year after graduation from high school.",
        "My grandmother passed away a long time ago. She left me her bible that helps me remind me of her.",
        "My dad passed away last year. He left me his watch that wear everyday. Its a nice memento.",
        "I saw a homeless man sleeping near Walmart when i came out after shopping. It was so sad to see him in such situation",
        "I would still take a bullet for my ex and her family.  Even though she blocked me on Facebook.  Call me a sucker but that girl was my first love and she gave me so much I wouldn't be here today if it wasn't for her",
        "My mother passed away a while back. I still use all of her favorite cooking pots when I cook. Its a great reminder.",
        "i'm feeling mixed emotions about not having children",
        "I felt bad when I saw a stray dog. I almost had to stop",
        "I saw a picture of my mom. It made me miss her",
        "I saw some old pictures of back home. It made me miss it",
        "I feel something when I think back to where I came from. It makes me feel nostalgic",
        "I felt bad when I saw a homeless man on the side of the road. I wanted to help",
        "It makes me feel great to drive my old truck.",
        "I miss being a kid. I saw a show on tv that reminded me of that",
        "wataching an old tv show",
        "I have all of my kids first day pics in an album. I get emottional every first day of school",
        "I was looking at some pictures recently and got sentimental about my childhood.",
        "I was thinking about my pets a lot the past few days and how I will always be dedicated to helping animals.",
        "I miss when I was younger and living at home. It was such a innocent time. No worries about bills or anything like that.",
        "Tomorrow is my last day of work. I am going to miss my coworkers.",
        "Went through all my daughters ballet tshirts from the time she was 2 until now (15).  Reminded me of how little she was at one time.",
        "My girlfriend bought me a box of chocolates yesterday. It was so sweet of her!",
        "I found a box of old photos, brought back a lot of memories",
        "I love watching the movies I watched as a kid with my kids",
        "I really miss going to the park with my grandpa when I was little.",
        "I am finding it hard to sell my grandfathers cadillac ",
        "I am finding it hard to let go of my old car.",
        "Yesterday I caught up talking with my cousin... it brought back so many good memories",
        "My daughter is starting high school next week.  I can't help but think back when she was first born on a day like today.",
        "sometimes i miss the old days when there was no social media",
        "I moved away for a job last year. My friend gave me a painting right before I left. Every time I look at it it reminds of my friends.",
        "My neighbor just had a baby and thinking about a friend that recently passed away I had to go grab bagels to take to the hospital. She always did that when someone had a baby.",
        "I found my deceased grandfathers watch in an old box in my parents attic.  It is actually quite valuable, but I don't think I could bring myself to sell it.  It has way too much meaning to myself and my family.",
        "My grandma passed away earlier this year. We used to always get together as a family and play cards on sundays. This sunday is the first time we're doing it again without her. It will feel weird, but nice to be with family again.",
        "I need to upgrade my phone soon, but I have an attachment to it that I can't let go of.",
        "I can't believe my favorite restaurant is closing. I am going to miss that place",
        "When my partner bought my a birthday present it made me very emotional.",
        "I always feel great when I think about old times.",
        "My dad gave me an old coin that used to belong to his grandfather.  I don't think it's worth much money, but it means a lot to me.",
        "Tomorrow is my 14th year anniversary married to my wonderful husband.  I can't believe it was that long ago. What a wonderful day.",
        "I remember when my kids were young and once fall came, we'd go to a pumpkin patch festival for a weekend.  Those were sweet days!",
        "I haven't been the greatest person, but my family always sticks by me.",
        "I am feeling this way because my son is turning 2 in a couple of months.",
        "I wonder what my friend is doing now on the side of the world.",
        "My oldest daughter will graduate high school this year.  I'm having to pull old baby photos of her to put together the slide show for her homeschool graduation ceremony.",
        "I was looking at pictures of my daughter when she was born... crazy how time flies",
        "My uncle passed away from heart attack. He was only 35 and he left behind a 3 year old daughter",
        "I spent time folding up all of my daughter's old dance shirts today.  Makes me remember when she first started dance at age 2, she'll turn 16 next month.",
        "Everytime I see roses I think of my grandma.",
        "My sister is getting married next week. Though i am happy for her. I feel like am losing her and am going to miss her",
        "My dad gave me a necklace years and years ago. It meant a lot to me and I now wear it every day.",
        "last night i met my friend after a long time.its so sentimental and excited to meet her at the spot",
        "I can't let go of my old car.",
        "My dad bought me a necklace and put his 21st birthday charm on it. I wear it every single day now.",
        "I miss my coworker. Her replacement just isn't the same.",
        "When I was growing up, my brother had to raise me because my parents were so busy working. I felt terrible because he did everything he could and more to give me the best life I could have. And for a few years, I felt resent towards him for not doing more. But he put me through college and helped me so many times, I love him so much.",
        "I've got these shoes for over 5 years now. The sole is all worn out.",
        "im happy that the kids will be returning to school next week!",
        " i really love to look at old photo albums and see how everyone has grown and how things have changed",
        "I miss my dog this time of year.",
        "I get very nostalgic when I think about this time of year. Makes me think of when I was younger",
        "I miss being a kid with no responsibility",
        "My mom gave me a box of old toys I used when I was a kid.",
        "When my grandma passed away, I was given her jewelry which I wore on my wedding day. ",
        "I saw a blue 1967 mustang drive by earlier and it reminded me of my dad's. He had it when I was a child.",
        "My daughter is turning 2 next week. Times goes by too fast.",
        "I found old family pictures... It's so bittersweet looking back",
        "I wish my mom had made a scrapbook of my childhood. I like passing down things",
        "I went to my college yesterday. It makes me nostalgic about my college days.",
        "I always feel weird when driving by my old high school",
        "I dont want to sell my old Cadillac.",
        "I went to the race track. We used to go there with my grandparents when we were kids. It made me think of them. ",
        "My husband and I just celebrated out ninth wedding anniversary.  We've been through a lot of changes but we still love each other just as much.",
        "I went to St. Augustine, where I had visited as a child. It made me think of my family trip there when I was younger. ",
        "One of my friend shared a post of Syrian children being hit by bombs on Facebook. I feel so sad for those innocent children",
        "I get nostalgic thinking about my grandmother.",
        "I miss my mom and grandma",
        "I keep all of my pictures with my family.",
        "I was using a quilt the other day and it made me think of my great grandmother, because she made it for me.",
        "I always get sentimental when I look at old familly photographs.",
        "I read the best book the other day! It made me cry so hard and I was so emotional the rest of the day!",
        "I looked back at some old photos and remembered all the good times I had. ",
        "I had my first conversation with my two year old the other day.  He asked where the cat was, and wanted to go outside when I told him the cat was outside.",
        "I was looking through some old photo albums and it was so cool. It brought back a lot of memories. ",
        "That scene in bambi, where the mother dies!",
        "I was looking at some of the old photos I have of my grandpa. He passed away, so I've been reminiscing over him.",
        "I'm going off to college soon so I'll be moving away from the small city I grew up in. It's a bit tough because I loved living here.",
        "I miss when I was young and my parents took me to the fair. I loved to go on the rides and eat candied apples. Those were the best times.",
        "The backyard makes me miss my dog.",
        "I miss my dog every time I see a dog.",
        "I was skipping rocks with my son the other day. That's something my grandfather used to do with me. It made me think back on the times I had with him.",
        "Having this new baby puppy around reminds me of how fragile life is. I remember when my other animals who have passed were babies. Circle of life.",
        "I had an awesome dog as a kid. He was such a great dog and I miss him. ",
        "This time of year always makes me reminisce.",
        "I was going through some old stuff in the attic the other day and found an old quilt from my grandma.  ",
        "My dad and I were talking about the past, just reminiscing a bit.  His mind is going quickly, I know I won't have many more conversations with him like this.",
        "I always look back at the days fb memories. They are so cool",
        "I lost my key chain which my grandma presented for my 10th birthday!!",
        "going through my childrens old clothes",
        "I found a old tool box with my grandfather's tools in it in the garage.",
        "In inherited my grandfathers watch. I wear it when I feel like I need some extra luck.",
        "when i came across an old photo book from high school ",
        "I inherited my fathers watch. I like to wear every now and then. Its a great reminder of him.",
        "I was going through a box with old papers in it and I found some old letter my Grandpa wrote me when I was a child. ",
        "When I hear some songs I remember my time in high school",
        "I just found an old report card. It makes me miss elementary school before",
        "We found old pictures of grandparents while cleaning out my house.  It was crazy seeing them so young.",
        "I got a little sappy when I saw a puppy on facebook. It made me want a dog",
        "My mom dropped off some food for me out of the blue. I miss her cooking.",
        "i held on to my first Nintendo even though it doesnt work anymore. I just like how it reminds me of my childhood.",
        "My friend is going to across the country. I miss seeing her almost everyday.",
        "I miss my mom. Can't believe I used to be so annoyed seeing her everyday when I was little.",
        "I've been feeling so down, I miss my family. I think it's time to go visit.",
        "I've got a big tote of photos that need to be organized.  I was looking through them today and could only see how much my girls have grown.",
        "When i see old people in roadside, i have tears in my eyes",
        "I live away from family, when ever i see kids on the roads. I think about mine",
        "I miss my two dogs that live with my parents",
        "I was playing a game recently and a reminded me of childhood.",
        "box of baby stuff i keep",
        "Even though I have no intentions on getting married, watching proposals or weddings make me feel really warm inside.",
        "I talked to my brother about our childhood the other day. It always make me happy to talk to him.",
        "I found some photos of my father from when he was my age.",
        "I wa just going through some of my old things at my parents house. I cam across my old school uniform. I did not want to get rid of it.",
        "When I see little girls around town the past week it makes me remember mine and feel sad but happy. I am happy for them..sad mine didn't make it.",
        "I found pictures from my prom the other day.  I reached out to my ex and we talked about the old days",
        "I was a dog on the side of the road that got hit by a car, and I was so sad",
        "i am on some meds that are making me feel totally off",
        "I visited my old high school yesterday. Man, it really brought me back",
        "i really miss my family",
        "I inherited my grandfathers watch when he passed. I like to wear it as a reminder of him.",
        "I was reading a card from my mom and got teary eyed. I wish I could visit her more often.",
        "Fall is coming and it'll be getting chilly outside.  I remember my mom making mulled cider every autumn.  Wonderful memories.",
        "My mom used to make me fried rice all the time, when I was little.",
        "My dog is getting old. She still acts like a baby though.",
        "I've spent so much time the last few days going through old photos and trying to organize them.  But today I stopped and looked at all the pictures of my girls when they were so very little.",
        "I really miss living in Montreal, it was a fun city",
        "I really miss my grandma",
        "I saw my sister after a long time. As soon as i saw her unknowingly i got tears in my eyes",
        "I miss my old dog. I was thinking about getting another one but it won't be the same.",
        "Kids grow-up so fast,  It seem like yesterday that mine were babies, and now the oldest is beginning high school.",
        "I love looking at old photos. Makes me miss the good old days. ",
        "I read some letters from a friend.  They are extra special since he passed away a few years ago.",
        "My new neighbors have a dog that looks just like my childhood dog.  When I first saw it I felt like I was time traveling for a second..",
        "I have a box of items that I can't part with. It's all papers and silly things, but they are precious memories. ",
        "My father sent me a photo of a letter I wrote for his birthday when I was a child. ",
        " As I get older, the more I remember my childhood",
        "I saw a dog on the side of the road that had been hit by a car, it was so sad",
        "I was going through some pictures of when my children were young. I can't believe how little they were! It made me think about the past. ",
        "my cat just recently died and I am very shaken up about it.",
        "Someone I know lost an expensive phone. She told me about it and started crying.",
        "When my daughter was born, I didnt want to sleep. I wanted to sit and watch her sleep.",
        "When I see how quickly my son is growing, it makes me appreciate the time I have with him. I want to make the most of it.",
        "Lately I was sharing memories with my wife from before we got married and it was heartwarming.",
        "When moving out of my old family home, I came across a few bags of stuffed animals I had as a kid. Probably 20 animals total. ",
        "I was throwing away my old stuff when I came across my old toys but I could not throw them out because they meant so much to me.",
        "My father had just passed away and we were going through his things. I found a box and he had kept every single card that I had given to him since I was born.",
        "The other day I was going through my things and I found my old Gamecube. I remember all of the fun times I had playing with friends.",
        "A few months ago I found some old family pictures. It made me miss old times.",
        "My children watched a movie with me the other night and we really enjoyed it.",
        "My mom sent me a package of my old comics from when I was a kid.",
        "My grandmother passed away 20 years ago this month.  I recently found a quilt she made for me.  It has holes all in it, but I refuse to get rid of it.",
        "My 25th wedding anniversary, my husband and I renewd our wedding vows",
        "When my daughter was about a year old, we took her to see the circus shows at Circus Circus at Reno.  The look on her face must have been what I looked like at that age",
        "I was pretty emotional leaving my hometown 10 years ago. We moved across country to a completely different area.",
        "I found a baby picture of my son and it made me miss him. He went off to college and I don't see him much anymore. ",
        "I found my son's old report cards from school. He was always into mischief.",
        "Me and this girl been dating for some time and finally said we love each other.",
        "Someone broke into my hose and stole my record player . It was a piece that use to belong to my mom and the only thing I had left that was hers.",
        "My sons friend was killed in a car wreck a few days ago. I can't imagine the pain she is feeling. Losing one of my children is one of my worst fears.",
        "I was playing a game recently and it reminded me of old times playing with my grandpa. We'd play Chess for so many hours.",
        "I was looking through a pile of old stuff and found some love letters that my boyfriend (now husband) had written me.",
        "my mom gave me some earrings that been in our family for years, im truly honored.",
        "The other day I was watching the show \"Hey Arnold\" I used to watch this show as a small child and it gave me such a nostalgic feel. I started browsing through other older Nickelodeon cartoons and found myself in a binge watching \"As Told By Ginger\" and the \"Rugrats\".",
        "My heart melted when my boyfriend gave me an expensive gift and he wrote a romantic note with it.",
        "We sent flowers for my grandmothers funeral",
        "I will always feel attached to my childhood teddy bear, Fluffy. He still smells sweet, like my old house growing up.",
        "I am not usually someone who holds onto things, but I recently found my old school tie and photos.",
        "When Christmastime comes along I often get sentimental. I miss spending Christmas with my parents who are no longer here.",
        "I remember I remember when I had my little Labrador puppy. But I had to give her away.",
        "I am feeling wistful about my oldest son starting his senior year in college. I can't believe his childhood is over.",
        "my cat died last week, and i'm not over it",
        "I saw my stepmother for the first time in 15 years since my daddy passed away. ",
        "I saw some children begging for food, I felt so pity on them",
        "I watched a baseball game last night and it made me think of all the times my father and I would goto games growing up. He passed away over the winter so this is the first baseball season not watching games with him.",
        "I recently went on a trip with a group of friends and had the best time. After the trip I printed out a group photo for everyone and mailed to them with a little note telling them how much I appreciated their friendship. ",
        "I went to my moms house last weekend and w=she gave me some picture of me when I was a child. it was nice looking through the old photos",
        "I went to the pount to find a new dog and i felt sorry for all of the dogs. They were so cute and nice but no one wanted them. ",
        "The last time my mom came to visit, she brought along a few photo albums from my childhood.  Memories of her Very Big 80s hair flooded back, like it was yesterday.",
        "I found an old stuffed animal in my closet. It made me yearn for earlier times.",
        "Over the weekend, I watched a really sad movie and felt thankful and grateful for my parents. ",
        "My stepmother just died. I am very sad",
        "I was once given a watch and I got the opportunity to make a lot of money off it, but I kept it for it's emotional value.",
        "When I think about my high school days it can really bring up some fond memories.",
        "I was looking through some old photo albums.  They brought up so many memories.",
        "Everytime I visit my parents house I get all emotional looking at old photos.",
        "Big family dinner tonight and we were looking at family pictures remembering the past",
        "Last year, my great grandfather passed away. I was very nostalgic at that time.",
        "I was going through some old boxes the other day and found a bunch of notes that were passed to me from my girlfriend in high school..... ahh, first love....",
        "Sometimes I look at the chess board and remember the games I played with my dad. I miss him.",
        "I was given a gift from my spouse, someone wanted to borrow it but I could not lend it out.",
        "My grandmother dies recently. Every time I think about how our time was spent together, I am sentimental about the past.",
        "I recently drove past my old high school and had a nostalgic feeling. I started thinking back to when I was a teenager and memories of my old friends. ",
        "I found an old sketchbook that I have owned for years and flipped through it to see a ton of drawings I did when I was much younger.",
        "My first dog was the greatest dog ever. Just thinking about her makes me smile.",
        "My son starts high school this year. It seems like just yesterday, that he was a toddler in pre-school. ",
        "I became very choked up when I opened an old box my dead mother had given me. In the box, I found a hand written note I'd never read before. ",
        "nothing like visiting a place you used to live",
        "My hubby is out of town for my birthday week! He sent me an I love you bouquet of roses.",
        "My husband gave me a ring that belonged to his great-grandmother. I hold it dear to me. ",
        "I found an old family photo album at  my mom's house recently. It was really nice to go back through it.",
        "I keep a old bottle of my dad's cologne I smell sometimes to remember him by.",
        " i love to have things personally .. some times they seemed to  be my lucky charm..",
        "a picture i just recently came across had me remembering my first trip overseas. ",
        "My grandmother passed away two weeks in 2005.   She had given me all of her Christmas decorations a few years before that.  Her death made me appreciate that even more than ever",
        "Had my daughter over a couple weekend ago. She had brought a scrapbook she put together herself of us. It was so nice of her.",
        "my husband gave me his grandmother earrings",
        "I saw a child help another child across the street the other day.",
        "I wear a necklace my grandfather gave me , and feeling it reminds me hes with me.",
        "My boyfriend surprised me with a promise ring after I came back from a month long trip ",
        "My best friend proposed to me recently. I am so excited to get married to her.",
        "I felt so nostalgic the other day when I was looking at old photos of a pet who has since died.  I still miss him even though he died over five years ago.",
        "I found the mug my grandfather used to use all the time. It was hidden in a box in the attic. Really brought back memories. ",
        "I recently stopped at Sonic and got a car hop classic. t",
        "My son recently bought his own house.  I miss not having him or his friends around.  It's so quiet around here.",
        "I have just got the news about my grandmother. She is not gonna be improving and will be dying.",
        "I remember playing catch with my dad.  Thinking about it takes me to a special place in time.",
        "Tomorrow we celebrate my daughters 16th birthday.  I can remember when she was 6 and obsessed with unicorns.  Time moves so quickly.",
        "I don't want to sell my grandpa's car.",
        "I found the baby braclet they put on my father when he was born at the hospital.",
        "me and my mom have been very sad , every since my brother moved out",
        "My mom just texted me a picture of her and I when I was really young. I'm on the other side of the country right now, and it made me miss her badly. Wish there was a way I had money to surprise visit her.",
        "My son is turning 2 in a few months, and I am feeling this way.",
        " I found my grandfathers old watch he passed along to me years ago. It finally fits me and I think I will start wearing it for luck.",
        "My son has been playing tee ball just like when I used to play.  Those were great times for me.",
        "I don't want to throw away my son's old trophies. ",
        "I was recently looking through my large family photo book and remembering the birth and childhood of each of my 4 children.  It brought tears to my eyes as the last one just recently moved out on his own.  ",
        "I got a birthday card from an uncle that I haven't heard from in years",
        "watching old tv shows",
        "I get sentimental about my girlfriend, she means a lot to me",
        "Every time I watch baseball, I think of my grandpa.",
        "I found my old high school year book recently. Was such a trip down memory lane.",
        "I had to buy some toys for my nephews birthday the other day.  Made me miss when my girls were that small.",
        "I got a gift from my late uncle. It was a clock.",
        "My youngest niece will be 17 soon. I find myself thinking back to when she was little and I just get teary eyed.",
        "I remember singing in the choir as a child.  It takes me back to a special time.",
        "staring at the ocean at night ",
        "A lot of my old friends have moved away or gotten married. I miss the old days.",
        "I've always been something of a nostalgic person. Yesterday always seems better than today to me.",
        "When I came across my parents old wedding rings. ",
        "I found some old pictures not too long ago and it reminded me of my childhood",
        "My grandma passed away a couple months ago, so we have been going through her things. It has been fun to look at all the old photos and letters that she saved.",
        "I miss the 90s. I wish I could go back.",
        "This time of the year makes me think about my dad. He loved football",
        "I love looking at facebook memories. Its like watching my babies grow up all over again.",
        "I read a book the other day and it made me feel all warm inside. I love books and movies that evoke many emotions.",
        "When I was a kid I would always be super honest and open about my feelings.  Now I control my emotions around people",
        "I like too see pictures of my kids when they were babies, but it always made me cry a little remembering the all times.",
        "I saw a family on their porch while I was out on my morning jog and I thought about when my daughter still lived at home.",
        "I get emotional about my family and friends sometimes, I am lucky to have them for sure",
        "I really miss my man, he went on a business trip to Europe. So I am here wearing his shirt.",
        "I love looking at old family albums. Takes me back",
        "I studied for 4 year at the university. I will be graduating this year with honors.",
        "I am feeling this way because my son's birthday is coming up in a few months.",
        "I found a old ring that was passed down to me from my grandmother the other day.",
        "My friend is having a baby. I don't know what a nice gift to get her would be.",
        "My grandpa gave me his pocketwatch. I love that thing",
        "looking at old baby items",
        "I decided to do some cleaning. Was trying to get rid of some old stuff and I could not find it in me to throw some of the stuff away",
        "My brother got hurt badly and i felt so heartfelt for him.",
        "I was going through some old stuff in the attic and found some of my childhood toys.",
        "I miss the smell of burnt hay in the fall, my hometown farmers used to do it every year.",
        "My grandfather gave me a pocket watch he has had for years",
        "I can't get myself to throw away my dogs toys. ",
        "I found my grandfathers old watch he used to wear all the time. It really reminds me of him a lot.",
        "My son is turning 2 in a few months and it has me feeling this way.",
        "Football season is about to start. I used to always watch the opening day games with my dad. I'm halfway across the country now though, and we won't be able to do it in person for a long time. Makes me miss him",
        "I love so much my wife. She has been so caring and kind with me.",
        "My mom gave me an old photo album the other day. It really brought back the memories.",
        "I found some pictures of my grandma in the attic last night"
    ]
}