{
    "threshold": 0.8,
    "seed": [
        "When my dog died, I felt lost. I also felt like I just let him live when I should have put him down due to his health.",
        "My mom came to visit in March for a couple of weeks. She helped out a lot around here and then she had to leave and go home miles away.",
        "My favorite shoes wore out. They no longer make them.",
        "I was looking through some of my old pictures a week or so ago, and saw a picture of my grandmother who passed away a few years ago",
        "I felt depressed today when I realized I was so non tech saavy. I can't figure out how to download a game. This is just bad.",
        "i lost my cousin last month. i feel so devastated",
        "I was unhappy when my girlfriend broke up with me",
        "Seriously, is not a good situation to be.",
        "I didn't like it,my team lost during yesterdays match between England  and Croatia",
        "I sometimes feel sad about things when I shouldn't It might be depression.",
        "I lost someone special long time ago, I felt so gloomy and depressed",
        "I feel sad that I am spending so much time this late on the internet. I really could use some sleep for tomorrow.",
        "My cat died.",
        "My hamster Donatello just died.",
        "One day I saw a video of a grandparent playing with my grandkids and I realized I was no longer able to do a lot of those things.",
        "i fell in sick for the past two days. i feel disgusted",
        "My grandmother recently passed.  We were close, so it's been hard.",
        "I was upsetwhen my dog. I kept her on the bed for a whole day. Didn't want to lety her go",
        "My dog died after 13 years, and it broke my heart.  Burying him was one of the hardest things I have ever had to do.  Gut wrenching to lose something you love.",
        "My boyfriend and  his family went to a Christmas party one Saturday and I had to stay home and work.",
        "I felt pretty down when I found out that I was losing my job. It was pretty disappointing. Tomorrow's my last day.",
        "I have to work all weekend. I just want to sleep and do nothing.",
        "one day my relation is road crossing to them accident.my family is very sad.",
        "I think that even when you feel down, its a great opportunity to go deeper into yourself.",
        "i was sad to hear my mom is in the ER again",
        "i was upset i woke up so late today",
        "i recently lost my dog.  i had him for 12 years.",
        "I remember feeling not quite right a day ago, but as day progressed I felt better.",
        "Heavy clouds make me feel bad for some reason.",
        "My dog died this past December and I've had a really hard time getting over it. She was our family pet. ",
        "my doggie recently passed away.",
        "My dog died last year.",
        "A years ago I had to put my cat down. Actually she was my mom's cat I inherited when my mom died. I'd known the cat for her entire life, and for half of mine.",
        "a good friend is moving away",
        "My dog got hit by a car. Unfortunately he did not make it.",
        "I was sad when I had to put my dog down last month.",
        "I still have another 75k on my student loans to go before I can afford grad school.",
        "my father recently passed suddenly, i was devastated.",
        "i am not going to be able to see my favorite band when they come to town.",
        "im feeling blue because my days and nights are mixed up.",
        "Memories of my dog always break my heart.. She passed away last month",
        "I feel down and blue whenever thoughts about my brother pop into my head. We lost him 5 years ago",
        "My rabbit died last year, I miss her to this day.",
        "My father was diagnosed with stage 4 brain cancer. It only took a few months for him to pass away because of it.",
        "I took my cat to the vet because he wasn't acting normal, and we found out he was going to have to be put down.",
        "im upset that my neighbor's dog is sick",
        "I just realized today I have not been home to where my family is from in  a little over 10 years.",
        "My 19 year old cat died recently. I was devastated. I still think about him a lot.",
        "My cat I have had for the last 14 years got sick and passed away last month. I lost a great friend.",
        "Last year it rained so much that my basement flooded. A lot of photos and other things were destroyed that I can never replace.",
        "One time I went to a restaurant to eat by myself. I felt sad and lonely",
        "A friend of mine is moving away.  It's a shame because we were close for a few years",
        "My cat got cancer and had to be put to sleep.",
        "One time when I was letting my cat outside, it ran out into the streets and got ran over. ",
        "My girlfriend broke up with me recently.  Things just didn't seem to work out",
        "My girlfriend's cat has cancer and we cannot afford the operation.",
        "I was upset when I found out that my favorite coworker was transferring to another department. ",
        "My dog, who had been with me for 13 years, died a few years ago.  It was so difficult to wrap him in a blanket, and bury him.  I was heartbroken.",
        "My sister's cat got sick and had to be put down last week. Feels bad. I'd known the cat for 14 years and was always her favourite person",
        "My mom called me last week to let me know our childhood dog passed away",
        "One time I saw a stray dog walking around a restaurant looking for food",
        "We had purchased and raised several chickens. One evening, I forgot to put them back in their coop. Something killed all of them.",
        "I packed up all my things and moved out of state.",
        "My little brother failed his french class and had to spend three weeks in summer school. It hurt my heart seeing him have to go to school while all his friends were having fun.",
        "I got news that my grandfather passed away. Nobody saw it coming.",
        "My dog is really sick. I don't know if he's going to make it.",
        "I saw a deer get hit by a car yesterday.",
        "Earlier this week, my cat Sam passed away. He was 17 years old. It's been odd not having him asleep at my feet while I work.",
        "I live in Florida and right now the crime rate is so high it is heart broken the past weekend a 7 year old lost her life from a stray bullet broke my heart.",
        "I am so upset I lost my phone while doing errands today.",
        "Last month my dog Skippy died. He was 18 years old.",
        "I am so upset my dog died today.",
        "Last month, my dog Duke passed away. I got him when he was only a puppy 17 years ago. I still almost call him when I go to bed at night.",
        "I was driving around my old neighborhood and notice the house that I grew up in had burned down. I hated seeing somewhere I spent so much time as a child gone.",
        "My mother is getting very old, and isn't in great health. I don't know if she has much longer to live.",
        "We had to put our dog to sleep. I am so upset.",
        "Due to heavy rainfall last month, my hometown was almost completely flooded. Most of the houses in the small town are no condemned and the whole area has been declared a disaster area.",
        "I am upset that I crashed my new car yesterday.",
        "Over this past weekend, I found out a friend of mine from school had passed away. Even as I get older it is still shocking to see people I went to school with passing.",
        "I am upset that I have to tell my young daughter her hamster died today.",
        "I lost $100 yesterday I am so unhappy still what a big lost can't believe I did that.",
        "Now that I know that soon I'll need to move to a different city, I feel a bit down.",
        "My dog was stolen while we was out shopping I have been so down and heart broken ever since. ",
        "My girlfriend's cat is sick with Cancer. I don't think she's going to make it for much longer and I'm really shaken up by it.",
        "Today was my coworkers last day of work. We both got along so well. Im upset she is leaving us. ",
        "I remember when my friends were helping me move out of our hometown.  We were riding in the moving truck and had to drop them off and say goodbye and we all felt terrible.",
        "I'm still upset over Lil Peep's death. He died too young and his music really resonated with me.",
        "Yesterday was my last day at my job. I will miss everyone. I got so emotional driving home. ",
        "My pet cat died recently",
        "I was upset when I did not do well on a test.",
        "My cat passed away because of old age",
        "our company is firing people",
        "My dog died in my neighbors electrical fence last night. I am devastated!! I don't know what to do.",
        "i miss my old pet dog, i feel so empty without her around",
        "I was recently hoping to get a promotion.  They gave it to someone else.",
        "I'm trying to transition my dog into not sleeping in my room.  The other night he tried following me in and kept scratching at the door.  I know he just wanted to be by me.",
        "My guinea pig had 5 babies but all of them died. I don't know why...",
        "saturday and bad income ",
        "i am starving and nothing to eat",
        "Ever since I started taking medication for anxiety and depression, I've been gaining weight. I've been a skinny boy all my life, and I still am but this extra chub has me feeling down.",
        "my pet dog is getting older. I know one day she won't be around anymore"
    ]
}