{
    "threshold": 0.8,
    "seed": [
        "I was walking through my hallway a few week ago, and my son was hiding under the table and grabbed my ankle. I thought i was got. ",
        "My girlfriend came up behind me without making any noise.",
        "We adopted a new kitten after our beloved cat ran away. The day we brought our new cat home, our old cat showed up. ",
        "I love surprises, and on my birthday, my girlfriend waited until the last minute to give me something. I honestly thought she had forgot.  ",
        "A situation in which friends organize a birthday party for you when you did not expect them to do so. You walk in a dark room, turn on the light and all your friends jump out and say \"happy birthday\" and present you a cake.  ",
        "I just walked into work and got a raise. ",
        "The night of my wedding proposal i was not expecting my boyfriend to get down on one knee and ask me to be his wife",
        "My husband always knew I wanted to go on a cruise. And for our anniversary we are finally going! ",
        "Well, this isn't going to make me sound like the manliest individual ever, but I think I need to tell it to someone. A few weeks ago, I was driving home from work. It was late. i was tired. So I wasn't my usual self. ",
        "I love it, though most times it could be killing.",
        "i felt surprised when my parents wanted to buy me my dream car",
        "last friday i was invited to a wedding shower. The place amazed me because it looked so elegant and classy. I am still astonished on the elegance of the event",
        "My friend arranged a trip to Vegas for my birthday ",
        "I felt really surprised that I was finally getting some work done today. It's been a taxing past week.",
        "I was surprised my brother joined the army.",
        "One time someone knocked down part of our brick mailbox with their car.",
        "A you tuber bought me a car,it totally caught me off gurd.",
        "I was amazed when my dad bought me a new car",
        "I was surprised this night that I'm so awake. I really haven't slept well lately.",
        "I was pretty amazed when my grand father bought me a gold wrist watch",
        "I was amazed yesterday ",
        "My parents threw a party for my for my 25th birthday. I had absolutely no idea it was happening,",
        "I cant believe I flunked the test I studied all night for.",
        "A friend through a birthday party for me.  I had no idea he planned it out",
        "A friend who I hadn't seen in awhile showed up at my doorstep.  We ended up going out for drinks",
        "I can't belive my brother went on the roller coaster with us. He's usually afraid of heights.",
        "I need to use my car to drive somewhere.  When I walked over, I saw that it had been hit",
        "My daughter recently said the f word.  I'm not sure where she picked it up, so that definitely shocked me!",
        "Got on the scale today. Lost 15 pounds",
        "As I woke up today I found out it was still dark and very early nevertheless, I felt good.",
        "Friends and family threw a party for me. It was unexpected and fun!",
        "I unexpectedly got a raise in the past, and that was great!",
        "i'm trying to recover a videogame account and the customer support is just so surprisingly stupid, theyre asking me for my game code when thats what i dont have and why i contacted them",
        "My friends planned a second baby shower for me without me knowing.",
        "The other night we went out for ice cream. Our son walked up to a cop and told him he wanted to meet the mayor, the cop said he could make it happen!",
        "My mom told me at Christmas that we would be going on a cruise vacation. I couldn't believe it!",
        "I couldn't believe it when I heard they are making even more star wars movies",
        "i couldnt believe it rained this afternoon after such a sunny morning",
        "My dad paid for the rent deposit on my new place, and I was going to pay him back. He only made me pay back half.",
        "Man I did not expect to see a bear on the road today.",
        "i was pleasantly shocked when my dad bought me my first car.. it was a graduation present",
        "i couldnt believe how good my nephew is at little league",
        "i was shocked by how many people showed up to protest",
        "i found a spider in my bathtub",
        "When I visited the old capital after the earthquake I didn't expect for many temple to be intact.",
        "I found my old friend working at my new firm. I was pleasantly shocked",
        "i recently ordered earphones from online",
        "I didn't expect my grandma to send money with my birthday card.",
        "I helped out a doctor's office that's located within my office tge medical assistant wasn't good at phlebotomy and old comes over and ask me for my help i had no problem helping .. During Christmas they dropped off a gift for the providers and myself .. I was totally surprised.",
        "won $100 on a scratch off card",
        "My brother in the army showed up at my football event.",
        "my husband treated me to a week at disney, i had no idea!",
        "Last year for my birthday a coworker brought me a bottle of my favorite beer and some cheese. It sounds silly but it was so perfect for me, she really put some thought into it and I wasn't expecting it.",
        "i was shocked to learn that i had been called to serve on a jury !",
        "The other day I got a gift card in my email I wasn't expecting from someone I had done some freelance work for. It caught me off guard but I was super happy!",
        "I had mentioned to my friend that my computer was pretty much dead.  Later I found he had sent me money to help me buy a new one.",
        "I entered a raffle at a local fair and actually won $1000.",
        "I received flowers at work just because I was so astonished when the deliver guy brought them to my desk.",
        "Won a gift voucher from a survey I completed online",
        "My boyfriend gifted me an iPad one year for our anniversary. I did not expect something so lavish at all.",
        "I've met a girl whom I haven't seen for ages in a big town once, by a complete accident.",
        "My wife told me she's pregnant.",
        "Recently on my birthday, I didn't expect to receive any gifts from my fiance since he's been pretty broke. He ended up getting me a bouquet of flowers and taking me out to dinner, which I wasn't expecting at all.",
        " I went to my first concert last month I seen beyonce I was so amazed such a good show.",
        "I was so happy to see that my friends threw me a party for my graduation. I was totally not expecting that when i got home.",
        "i was shocked when i heard that i had won the lottery!",
        "i found 100 dollars in an old coat I had in storage! ",
        "There was a time that I came home to find my Grandparents from New York at my place and I hadn't seen them in a really long time, i'm talking years and it was quite shocking definitely wasn't expected",
        "I bought a used car a few years ago and found 500 dollars tucked in the back seat!",
        "I bought a lottery scratch off ticket and won $5000. I was so happy.",
        "After tellinh my husband I did not want a gift for mothers day. he still surprised me with a gift and dinner.",
        "My friends threw me a baby shower that I didn't know about.",
        "My boyfriend proposed to me when I wasn't expecting it. I thought he'd never propose, so it was exciting!",
        "I went running for the first time in months. I could not believe it. I was able to run a full 8 miles with out taking a break. ",
        "Got on the scale today. I've only been on a diet 2 weeks and I'm down 17 pounds.",
        "My family threw me a surprise birthday party last month I was so amazed when I walked in.",
        "I was very shocked when i learned that  my wife cheated on me ",
        "i was shocked how nice the weather has been the past couple days",
        "I was mowing the lawn today and it started storming out of nowhere! ",
        "My son starts kindergarten this week. I got an email saying that he may have a substitute teacher until they hire someone.",
        "I woke up and saw my car had a flat tire.  I wonder what happened",
        "I was once stuck in traffic for like 2 hours.",
        "For my anniversary at my job, all my coworkers threw me a party. I had no idea until I walked into the office at lunch.",
        "on my birthday my wife presented with a gift",
        "I bought a scratch off ticket on the way to work last week and won $500 on it. The most money I have ever won on one.",
        "I was out in the yard and I found a rabbits nest with a bunch of babies in it right in the middle of the yard!",
        "i couldnt believe how beautiful the weather was when i woke up today",
        "i was shocked at how bright and sunny it is today",
        "A friend who I hadn't seen since school started work at my job.  He was the last person I expected to see",
        "My coworkers threw me a 20th anniversary party at work last week. I had no idea it was going to happen.",
        "I didnt study for my test and I felt I bombed it, but when I checked my grade I made an A!",
        "My dog just learned how to ring the bell on the doorknob when he needs to go out",
        "I was shocked by my present",
        "It's hotter in the summer in Massachusetts than I thought it would be.",
        "I was happy when my mother gave me the gift",
        "One time I looked at the mirror and thought I saw a monster",
        "I had a lunch at a hotel yesterday, I ordered dumplings, they actually turned out to be alright.",
        "I was surprised by how easy it was to quit smoking!",
        "I didn't know that my boyfriend was coming home from his trip early, so I was shocked when I came home from work and he was home.",
        "My boyfriend came home early from a trip unexpectedly.",
        "A friend of mine got all of my friends together to throw a party for me on my birthday. I never expected it as I typically don't do much for my birthday.",
        "I found out two weeks ago that I am going to be a father.  It came as quite the shock, because we have been unable to conceive for the last 3 years.  I'm stoked.",
        "I was shocked that the parade had many people attend considering the rain pouring down. ",
        "I woke up one morning to make a sandwich. The sandwich meat made me sick! I knew something was wrong so I took a pregnancy test. We now have a 10 year old surprise!",
        "I didn't really think I would win tickets from the radio.",
        "I was looking through some old clothes and found 40$ in the pockets, made my day!",
        "i was shocked how nice the weather was this morning",
        "Last week, my coworkers all got together and had a party for me for my 20th anniversary at work. I had no idea they were doing this.",
        "I found a 10 dollar bill in my mailbox this morning! I have no idea who put it there, but it was a nice thing to find.",
        "1",
        "I lost my phone. I thought it was gone forever but then I got a message on Facebook \"from myself,\" the person who found it was trying to get it back to me!",
        "I lost my credit card this past weekend in Walmart someone turned it though I was so stun but happy.",
        "I was shocked my husband brought me flowers today.",
        "Today is my anniversary! My husband brought me chocolates and is taking me to a concert this evening.",
        "I had my front door open and a cat (not mine) ran in my house.",
        "A while ago i was walking to college and j-crossed the street, to my shock I got a ticket.",
        "My wife had a birthday party for me that I didn't know about. I was totally taken aback when all my friends showed up.",
        "My husband just shocked me with tickets to a Taylor Swift concert.",
        "my husband threw me an unexpected party for my birthday!",
        "i was so surprised on my birthday",
        "I went out today and was astonished by how beautiful and sunny it is, even though it was supposed to rain.",
        "My birthday is in 2 weeks and my wife got me a gift early yesterday and gave it to me. She bought got me a brand new laptop and gave it to me early.",
        "I can't believe my husband is taking me on a vacation he planned all by himself. ",
        "My coworker constantly calls in. The past 2 days he had called in and we made a friendly bet that he wouldnt be in the next day.  He actually ended up coming in today.",
        "An eagle landed on my flag pole in my front yard last week!",
        "I told my family I wanted nothing a few Christmas' ago. They ended up getting a an Xbox One, and I had no idea how much fun I'd have until I received it!",
        "I went for a run last month and the most unexpected thing happened to me. I saw a deer on the sidewalk, in my small suburban neighborhood",
        "today i saw one of my old friend",
        "A co-worker of mine was fired at our work.  He seemed to be doing a good job though in terms of performance",
        "surprise birthday party in which i got cake thrown at my face",
        "my abilities",
        "Just found out my wife is pregnant. ",
        "I passed my midterm exam it had 200 questions and I only missed 7 I was so stun.",
        "My boyfriend came home from his trip early.",
        "My boyfriend came home from his trip early. I wasn't expecting him for another two days. I was excited to see him.",
        "My boyfriend came home from his trip two days early. I wasn't expecting him for two more days. I'm very excited.",
        "My boyfriend came home from his trip two days early. I was very excited to see him.",
        "One time I saw a giant cockroach under my desk!",
        "I could not believe that Donald Trump won the election.",
        "One time I found a cockroach in my hamburger!",
        "It was my birthday and my whole family threw a party for me after work. It was so unexpected!",
        "a job I applied and interview for a couple of months ago offered me the job. It was unexpected.",
        "I had a meeting this morning, which is typically pointless. However, they actually followed the agenda and had some meaningful conversations.",
        "We just got a new puppy.  My older dog knew to let that one out first when I get home from work.",
        "My dog just had a baby and I did not even know she was pregnant! What!!",
        "coffee finished ",
        "I was so happy to come home the other day and everything was clean and dinner was already one the table. What did I do to deserve that?",
        "I made a new friend at a convention I was volunteering at. I was shocked, I haven't made any friends in well over a year because I'm awful in social situations."
    ]
}