{
    "threshold": 0.8,
    "seed": [
        "I had just moved to Texas and my boyfriend took me to Kemah boardwalk. It made me think of times I spent vacationing back home.",
        "My grandmother gave me a rock.",
        "I was looking at old photographs of my son yesterday, and almost started crying. I still remember those days, and started looking at all of his old baby clothes",
        "I heard one of my grandmothers favorite artists playing on the radio on the way home and it made me think of our car rides together.",
        "I was going threw storage and found a tube of things my grandfather game me",
        "I was looking through some of my sons old toys, and I felt sentimental and couldn't give them away",
        "I saw an article of someone I went to high school with.",
        "I felt this way when I discovered some old childhood toys and memories in my basement.",
        "I found some old toys of mine.  It made me feel very nostalgic",
        "I watched my little brother graduate last week.",
        "I keep a lot of random things to scrapbook. For instance I save tickets to concerts. ",
        "When we take a trip, I normally save what some may think of as trash.  I will scrapbook it later.",
        "I was going through my cloud and found pictures of when i was little.",
        "i have good memories when i see photos of my grandmother",
        "I was thinking about how I missed my grandma",
        "i always feel sad around the holidays.. my dad passed away around christmas",
        "I was reading through some of my old school papers.  It transported me to a different time and place",
        "i used to take my children to disney when they were little. we always had a great time.",
        "I was watching some stray dogs the other day, one of them was full of ticks I felt sorry for her.",
        "When I listed to the guitar yesterday I felt some tears coming out.",
        "We got everything ready for the yard sale, but I just couldn't part with my kids baby items. ",
        "I was helping clean out my parents' house the other day and found all my old high school year books. ",
        "i miss my childhood and living with my parents",
        "I was going through my storage the other day and came across a bunch of things I wrote in elementary school. It made me miss being that little, when the world still had so much possibility.",
        "In the past the smallest things would make shed tears.",
        "i felt nostalgic looking through old photos today",
        "i feel nostalgic going through old boxes in my basement",
        "I miss the days when I didn't have financial worries",
        "I wish i could see my father one more time.",
        "I always get sad thinking about my mom.. She passed away when i was 12.",
        "I found an old picture of me with my grandmother. It brings back good memories.",
        "I'm feeling nostalgic today",
        "I was doing a big clear out recently and came accross a big old suitcase in the attic which happened to contain all my childhood toys, medals, photos, school reports - everything! My mum must have gathered them up over the years.  It was lovely to sit and look through them all, bringing back all the memories of school, childhood, my teenage years.  It got my feeling so nostalgic.",
        "recently my sister got married",
        "After my granddad passed I kept his necklace it means so much to me even though I get emotional over it.",
        "I found some old school papers of mine.  I thought about how far I've come as a writer",
        "I had to take my beloved dog to the humane society when I had to move back in with my mother after my terrible breakup with my ex.   SHe said I absolutely couldnt have her at her house.",
        "In 2011 I put my beautiful daughter emerson up for adoption.  THis was the hardest decision I have ever had to make.",
        "Everytime I see the Animal Rescue commercials I get so emotional and want to cry.",
        "My best friends mother got diagnosed with cancer last month. I feel bad about it. ",
        "When I saw my mom after a long time I feel something",
        "After my mom died I found all our old cassette tapes in her storage unit. It was nice to be able to revisit the music we used to listen to on road trips when I was younger.",
        "Drove past the area my Middle school was in today. It was gone. I hated it when I was in school but now that's it gone I'm sad.",
        "I keep the ticket stub of my first concert in my wallet.  It reminds me of good times with my friends.",
        "my grandmother died last week",
        "Every time I see my wedding picture around the house I think back to that day.",
        "When I was growing up I was always told that being emotional, is something that's reserved only for the girls.",
        "My husband is in the service so when he is away I sleep in his shirt to feel close to him it is so dear and tender to me.",
        "I found an old stamp booklet my girlfriend and I filled out before we started dating. I felt so warm and fuzzy on the inside.",
        "I found my old yearbooks in a closet while I was packing up to move. It's weird to see how far my friends and I have come in the past years.",
        "My son recently turned 4.  It's hard to watch him grow up so quickly.",
        "I love going back to visit the house I grew up in.",
        "I will be moving next week and as I was packing found old pictures from when I was in middle and high school. It made me think of those good times.",
        "I watched a movie the other day and it really had me in my feelings. It was about a guy who finally found out who ended up getting reacquainted with his birth mother.",
        "I was doing a big clear out recently and came accross my high school year book.  It has been many years since I left school and it was wonderul to find it again.  I spent hours going through it and looking at all the people long gone from my life.  Such a feeling of nostalgia and some sadness. Though it evoked happy memories too especially of prom night and our final year leaving party.  Some stories could be told about that!",
        "I keep a stuffed animal I've had since I was young around.  It's still in pretty good condition and reminds me a lot of my childhood.",
        "when she talked about her feelings i was very emotional",
        "I found a picture of my daughter and me from when I took her to a waterfall a long time ago. It brought tears to my eyes.",
        "Saw an old cassette of my cousins fifteens and I saw my mother before she passed away. I felt nice seeing her again.",
        "I had a lot of feelings when I found pictures of my dog who has passed.",
        "I finally bought a back up drive to store my photos on. I spent a lot of time looking at old family photos and organizing them. It made me wish I could go back in time!",
        "My dog is feeling sick and I don't know what is wrong.",
        "I found some pictures of my dog I had to put down. I miss her.",
        "i'm moving out from this house and it's just very emotional",
        "When I had to clear out my old bedroom when I left home, I really found it hard to throw away a lot of the stuff in there! ",
        "I have a wonderful set of memories when I was growing up with family vacations and going to cool places like Virginia",
        "I have a stuffed animal that my old dog used to lay by.  He's dead now but I still keep that stuffed animal in my room.",
        "I feel so bad to see so many homeless people on the streets these days. I hope I am never homeless.",
        "I had an awesome childhood. I think about it consistently.",
        "I went through my childhood photos and items I was kind of emotional and nostalgic.",
        "I was riding down the road the other day and passed by a few mimosa trees. The little pink flowers made me think of my childhood house and made me miss my grandmother.",
        "the other day I was looking at old pictures of a car i use to own. I miss that car.",
        "Very often I get very emotional when things go wrong. I think more emotional than most people.",
        "i felt nostalgiac going through old childhood belongings",
        "I found some of my old toys that I had passed down to my younger brother today while cleaning up his closet. Suddenly I was overcome by wonderful and touching memories.",
        "Last month when I was cleaning out the attic I found a box of old photo albums. It was really good to relive all the old memories.",
        "One time my cat got ran over by a car",
        "old images from the past wall",
        "When bad things happen I get too emotional. I think more than other do. Sometimes I think I am crazy.",
        "My girlfriend made the cutest and most touching card for my birthday. I practically cried reading it.",
        "I ran out of laundry soap the other day and grabbed a brand I used many years ago from the store. It was so interesting that the scent of that laundry soap brought me right back to where I was all those years ago, crazy how a familiar smell can do that.",
        "I miss being able to take my children to the park."
    ]
}