{
    "threshold": 0.8,
    "seed": [
        "One year during christmas, i did not get a single gift. It was a rough day for me.",
        "I got recently got three rejection letters for 3 different jobs in a matter of a week and a half. That was a painful experience. ",
        "I felt sad when my dog passed away. It was a pet that I had since I was 3 years old, and was one of the saddest days of my life.",
        "I was in a situation where I missed out on making some money, that caused me not to be happy.",
        "When I realized all the chocolate was gone, after a long day. ",
        "I just found out they are not making a sequel to a movie I like.",
        "A few years ago when my grandmother died unexpectedly.",
        "I shouldn't have to cook on my birthday. This is when I miss having a boyfriend.",
        "My mom has arthritis in her neck, and the pain seems to be traveling down now.",
        "My birthday was last weekend, and no one wished me a Happy Birthday.",
        "I was told my cat only has a few weeks to live.",
        "when my dog died ",
        "I lost my cat to old age and cried all night about it.",
        "I lost my wallet and had to get all new cards",
        "I was sad when my grandma died.",
        "I really got close with a girl that I met from Tinder, to the point where we were \"dating\". Then randomly, after like 4 days, she says that she doesn't want to date anymore and then just stops talking to me.",
        "I am trying to sell my house for 89k dollars, I have been in a bad financial situation, my nephew knows it, and now he is trying to buy my house just for 75k, trying to take advance of my situation ",
        "I was sad when my grandmother passed away. I was still a child",
        "I recently had to put my cat to sleep. It was an emotional day.",
        "I was looking forward to spending time with my friend Megan today, but I had to put it off again because I fell ill this morning.",
        "I recently found out my mom was very sick. SHe has stage 4 liver cirrhosis.",
        "Recently my refrigerator broke.  I had to throw away all of my food and spend $1400 on a new one.",
        "I cried when my grandma died.",
        "I cried when the Jonas brothers broke up.",
        "My father in law was diagnosed with pancreatic cancer when our daughter was 9 months old.  He passed 9 months later when she was 18 months.",
        "I cried when my brother passed away.",
        "1",
        "I try to forget my ex and move on.  But every day I wake up and see several things she bought me and I feel like a sledghammer hit me in the chest and stomach.",
        "My grandmother passed away when I was 30.  She really didn't get to know my girls very much at all.",
        "I miss my dog, Baby Girl, poor thing passed away last year after 15 years.",
        "I'm turning 40 Saturday and I'm feeling old.",
        "I am very sad these days.",
        "I broke my favorite drinking glass.",
        "Last week I had to put my dog to sleep.  It was so sad.  I had her for 15 years",
        "I am so sad.  My husband needs a lung transplant.",
        "My cat dissapeared after 14 years one day. He never came back.",
        "We (family friends) planned a holiday trip to go for the last weekend. I was preparing for that like packing dress and getting ready to it. Unfortunately one of my cousin was unable to come due to his personal reasons. So we just cancelled the trip. I was feeling sad for this trip cancellation. ",
        "I was reading the news and I saw some terrible news about some Christians being persecuted in Nigeria. I heard that 6,000 families had been massacred and it made me feel heartbroken.",
        "Some angry mob came to the mull yesterday",
        "A hungry man is an angry man",
        "My dog died last week.",
        "I feel depressed. I might be kicked out of house soon, live on my own without wife and child. ",
        "When my dad died randomly a few years ago, it really made me sad. I was just not ready for it to happen.",
        "when i found out that my daughter had a bad reaction to her shot. it was scary ",
        "MY dauhter is growing up too fast. She is going to leave me soon. ",
        "I broke my ankle a few weeks ago and am unable to compete in a run I signed up for.",
        "I recently learned that a close friend is getting foreclosed on their home. They were diagnosed with breast cancer 2 years ago and I think it drained the family of their money. I wish I could help but I don't have any money to give them. It is just a terrible situation.",
        "Yesterday I saw that bugs had eaten my dandelions in the garden. I had spent so much time watering and taking care of them. I was devastated.",
        "I was unable to help my friend who's in need. But I tried my level best to help her to solve the issue. She understand and get the issue solved through our another colleague.",
        "I'm a bit unhappy with Summer being almost over.",
        "I just celebrted my first birthday without my grandmother.",
        "I lost my dog a few days ago. It was really sudden.",
        "I was disheartened to learn the tv show colony wont be coming back",
        "My best friend just left for Europe. She'll be gone for 4 years.",
        "I moved to another state and my family was left behind.",
        "My sister had a miscarriage ",
        "My dog died. She was 20 years old.",
        "I forgot about my best friend's birthday last week and I felt like I betrayed him by forgetting about our long friendship.",
        "My best friend moved away, I am not happy.",
        "My dog passed away and I cried.",
        "I was reading the news and came across a story about children being killed in a fire. It hurt my heart to think about it.",
        "I was upset when the spurs traded away Khawi Leonard",
        "had to leave my long distance girlfriend to go back home, after I had spent a month of time with her",
        "the day i had to put my dog to sleep ",
        "I didn't get the promotion I worked so hard for. ",
        "My girlfriend of 10 years broke up with me yesterday.",
        "My cousin moved to another state. I miss her so much",
        "I left my phone on the bus last night as I was coming home, I am still very upset,",
        "My girlfriend of 3 years broke up with me the day of going to college. I couldn't focus that day and i felt depressed.",
        "I was devastated when my dad passed away. It was just hard",
        "One of my good friends moved a few states away.",
        "I ma devastated.",
        "I was upset when my dog ricky went missing",
        "Yesterday, I got fired from my job. I was so sad.",
        "I didn't do well on my job interview.",
        "All of the good shows are ending. It really ruins tv for me.",
        "I am upset Brian Lawyer died.",
        "Yesterday, my grandmother was admitted to the hospital for cancer. I was sad.",
        "I couldn't find my debit card all week and I've finally given. I think I have to get it replaced.",
        "My dog died last week. It was one of the worst days of my life.",
        "My dog is missing. We have been looking for her for almost a week. He is a three year old rescue dog that we have only had for a few months.",
        "I miss my grandmother. She passed away last year.",
        "My grandmother passed away two weeks ago. I used to see her everyday and its been really hard lately.",
        "I was sad when my grandmother passed away, that was not a good time in my life ",
        "In school, people would always bully me.",
        "I had 20 dollars sitting in my car and I opened my windows. Next thing you know, the 20 dollars flew out the window.",
        "My dog is getting old and is having trouble walking, it's tough to see.",
        "My turtle ran away yesterday. I am so sad.",
        "When my grandmother died i was depressed and sad. I couldn't leave my room for a week because i was so sad.",
        "My wife left me last year.",
        "I get very depressed seeing roadkill when driving. Such a sad way to go.",
        "I am sad tonight.  I am broke until next week.",
        "Summer is almost over. I'm not happy about it.",
        "I just preordered Black Ops 4. I can't play until October though",
        "A girl I asked out just rejected me. Feels bad man.",
        "It makes me depressed seeing homeless people. I wish I could help them but I am going through tough times too.",
        "My grandmother died several years ago. We just got her house cleaned out and had to sell it. We have so many memories from that farm. I will miss it so much.",
        "I was very interested in a girl that lives near me. I can't seem to muster the courage to talk to her so I'm feeling pretty down in the dumps. Hopefully, one day I can let my mind stop racing and just go for it.",
        "I remember being really upset when we had to move away from my very first best friend when I was 10",
        "I lost my dog last year, I cried so hard.",
        "I wish my grandma was still alive.",
        "I cry every time I think of my grandmother.",
        "I saw a kitten get run over by a car.",
        "I cried all night, my brother is going back to Iraq.",
        "My dog ran away today and I cant find her.",
        "I studied all week last week in preparation for my midterm, but when I got the results back, I was disappointed to see a low mark.",
        "I was really broken up when we had to put our family dog to sleep",
        "I miss my old job. It was fun.",
        "I miss being in a relationship sometimes.",
        "I was very sad when I watched the ending to Orange is the New Black. They told the Mexican prisoner she was free adn tehn she wasn't.",
        "My dog just passed away.  I am so hurt right now.",
        "When i first joined college i failed most of my units because i had underestimated how good someone needs to prepare before going for an exam paper",
        "I feel sad when I left home",
        "I lost a dear friend 2 days ago",
        "My 15 year old cat just passed away.  I feel so empty and down in the dumps without him.",
        "I got into an argument with my husband last night.",
        "Before I met my girlfriend and friends I was very lonely, that was not a fun time",
        "My girlfriend dumped me the other day.",
        "My wife forgot it was my birthday.",
        "i was pretty devestated when robin williams died",
        "My grandmother died when I was 10 and I was devistated.",
        "I've been feeling blue since my great grandmother passed away.",
        "A while ago one of my friends died from an overdose. I knew that she was fun and adventurous, but I had no idea that she was into stuff that could cause her harm.",
        "I recently attended my grandmother's funeral. Although she had just turned 93, I definitely miss her. ",
        "My wife got sick about two weeks ago and it was something serious.",
        "Yesterday I found out that my best friend was stealing money from me. I thought I could trust him but I guess not. I am devastated that he was ripping me off.",
        "My grandfather passed from medical malpractice a year ago.",
        "I felt sad when my cat sylvestre died.",
        "It was mothers day and I was feeling bummed because she won't speak to me. ",
        "I watched a st jude infomercial last night. It tore me up inside.",
        "My pet snake died :(",
        "I was very depressed and upset when my partner left, we've been together for years and I feel like my time has been wasted.",
        "I was upset when my grandma passed away. It was very random",
        "My aunt died",
        "so sorry apple has hit the trillion dollar value today, i think they are an evil company who bring out the same product year in and year out and call it groundbreaking",
        "when i had to get rid of my animals ",
        "A man in our community was hit by a drunk driver the other night and didn't make it.",
        "MY sister used to live next door to me. Now she has moved across town and I hardly ever see my neice.",
        "I've been a bit down lately and I don't know why.",
        "when my mother passed away ",
        "My friend just went through a break up. Think some good movies and food are in order.",
        "I was sad before I met my girlfriend, I did nothing interesting",
        "I missed the sale at the supermarket.",
        "I think my brother's children are going to have to be put up for adoption soon. He and his wife just aren't fit for parenting, as they fight and get drunk all the time. It's a shame, because I love the two nephews myself, and I hate the thought of not being able to see them again. But it may be for the best...",
        "Yesterday I was notified that I didn't get a promotion. I was upset.",
        "I've been feeling pretty down since my dog passed away.",
        "Had to attend a funeral",
        "I proposed to my girlfriend and she said no.  I am so hurt.",
        "I wish I can stay just one more day i'm so unhappy that I will be leaving today",
        "One day I couldn't stop thinking about my estranged family and how much I missed them.",
        "I dropped my favorite perfume and it broke",
        "I am not too happy that I didn't drive my mother to the airport",
        "I was about 8 years old and my mom left me all night with her friends. I cried myself to sleep.",
        "I lost my favorite watch the other day. I've had it for years, so it hurts me to not have it anymore",
        "Watch my dying dog",
        "I am a little down because my computer stopped working yesterday.",
        "My wife is leaving town next week.",
        "I feel sad that I don't have a social life.",
        "My roomate is leaving at the end of the month. I won't be able to hang out with him as he is moving up north.",
        "My friend got a new job and is moving to Vegas. I am going to miss her.",
        "My boyfriend broke up with me and stile my rent money. I am going to be evicted.",
        "I felt sad once when I went to the store to buy some of my favorite candy. When I got there they were all out!",
        "My dog is walking a bit slower these days, he's 15.",
        "When I had to give away my dog Omar, it was sad. The place I was going did not allow animals",
        "It's tough seeing my dog get old and have trouble walking now.",
        "My pet turtle apparently died 2 weeks ago. I was just now told by my parents who were holding on to me while i was away.",
        "My best friend and I have lived 5 minutes or less away from each other for the past 20 years. Next week she is moving an 11 hour drive away from here. I don't know how I will cope.",
        "My daughter is growing so fast. She is almost taller than me already. I'm not ready.",
        "My daughter lost her last baby tooth today, she's growing up.",
        "I just moved out of the city. I am going to miss all of my friends.",
        "I have been watching dramas all week. They are so heart warming.",
        "I miss kids everytime they go to sleepovers. I'm such a sap.",
        "I was super sad yesterday when someone I know ruined the little bit of trust I had in them. I allowed them back in too rebuild..and they ruined it again",
        "My best friend will be going to school in another country for 4 years.",
        "I cried the night I found out my best friend died.",
        "We just found out my cat has cancer. We are going to have to put her down soon.",
        "I am super sad that people do not want to change their destructive behaviors. It's very sad especially when you know someone was abused for so long and they just keep ruining their lives. Almost like they are continuing the abuse on themselves.",
        "I broke my phone today. It was the worst.",
        "My dad left for deployment to Afghanistan yesterday. I am so depressed.",
        "I just had to bury my Golden retriever today.  I had him for 10 years.",
        "My turtle ran away today. I was fraught with despair.",
        "ive been losing a lot of weight but i gained a bit this summer.",
        "My Venus fly-trap plant died yesterday.  I am very hurt it happened.",
        "The anniversaries for my Daddy and my sisters passings are coming up this month.",
        "It was a surprise to me when I found that my grandmother had passed away",
        "My cat died.",
        "I was talking to someone and we had great chemistry then  they went ghost on me.",
        "when i lost a close friend i felt bad",
        "I hate seeing my best friend depressed. I've seen them so happy in life but seeing them like this now makes me feel unhapypy.",
        "My neighbor died in a car crash.",
        "I've lost a couple of loved ones last year and I'm having a hard time getting it off my mind.",
        "I just earth about and earthquake in indonesia,it seem that many people died there.  ",
        "I watched the movie the notebook the other day it was not a happy movie",
        "I just found out that my cousin passed away after his battle with colon cancer. He was only 27. I am so upset!",
        "My cat passed away this morning. I had her for 11 years. ",
        "Yesterday my pet hamster died. He just turned two and was not moving very much. I was tearful when I felt his body and it was cold.",
        "My pet turtle died the other day. I will miss Petey so much. We were best friends!",
        "i watched a depressing movie",
        "My 13 year old dog had to be put down.",
        "My best friend moved away when I was 10.",
        "My local store stopped carrying my favorite spring rolls.",
        "I am sad the summer is ending. I had so much fun with my kids",
        "My daughter is graduating middle school this year. I have always been stressed about her going to high school",
        "My girlfriend and I had an argument this afternoon, while she's about to go away to see relatives for a week. It's kind of a bummer because we don't really communicate that well, especially when it comes to arguments. It usually devolves into us rather not talking instead of trying to fully speak out our issues.",
        "I moved to a different state for my husband's job and left the rest of my fammily behind.",
        "I have been struggling with a flare up from my Lupus after I had such a long period of feeling good.  Its depressing to be in bed all day and fail your family in what you need to be doing.",
        "My cat is very sick. We are going to have to put her down this week.",
        "My pet ferret Fuzzy died recently. I was devastated. Me and Fuzzy go way back.",
        "My cat passed away today...",
        "I had a rough time in the hospital back in march of last year. I got pretty sick and was stuck in there for a week.",
        "I feel for my ex again. I know he is no good. I am doomed",
        "I got locked out of my house today and couldn't shower despite being really sweaty.",
        "I purchased a robot. And the robot got broken after using it for just one week.",
        "My dog had to be euthanized last week.  I am hurting so bad.",
        "MY kids are just growing constantly. I want them to be babies again.",
        "My wife is thinking about divorcing me.  I am really torn up about it.",
        "I am upset that I have been used for so long. After you get out of a situation you realize how bad it was.",
        "I never get to go to the movies.",
        "I lost my job.",
        "Took my dog to the vet today.  They had to put him down. ",
        "I just found out my brother had to get checked into rehab!  I had no idea he had a problem and am quite upset over it!",
        "My tree died a few weeks ago.",
        "my brother is in the hospital really sick",
        "My friend died in a car accident recently.  I am so hurt over it.",
        "I am getting older and it's hard to think on how many bad things I have experienced. Life really doesn't always turn out how you think it will or how you want. It's a series of unfortunate and traumatic events a lot.",
        "Life can be really not a happy place. It pains me that so many don't love or care and hurt others.",
        "Life doesn't always turn out how you expect it to be. You have to make the best out of lemons but that is hard sometimes.",
        "My pet goldfish died recently. I was devastated. I really liked Goldie.",
        "I was devastated my pet gerbil died recently. I loved him so much. I don't know what I will do without him.",
        "My emu ran away  last night. I was quite saddened.",
        "I cant belive my friend is getting married. He fiance is terrible",
        "My mother passed away today. It was awful.",
        "I saw a kid who is crying extremely since her mom beaten up her. I feel sorry for the kid.",
        "They stopped making donuts at my favorite bakery.  I am so hurt thinking about it.",
        "she was m only true friend",
        "I am watching old episodes of game of thrones. its bittersweet",
        "Way back in the day we had this rabbit and I loved it so much. When it died I was so sad for weeks.",
        "I really needed to pass this class so I tried hard to study for it. In the end I barely did bad enough to not pass the class.",
        "I'm going back to college in a few weeks and I really like it over there. Despite this, not seeing my cat will be really sad.",
        "no one came to my birthday",
        "I have to go back to school and leave all my friends in 2 weeks",
        "I felt bad while watching my sick father on the bed",
        "when it was my dads anniversary of death every year in july ",
        "I was really disappointed to hear that the woods near my childhood home had been razed to build new homes.",
        "A character that I loved was killed off of one of my shows that I always watch. I cried like a baby.",
        "I was upset when my parents told me we would be moving, we went all the way to florida",
        "I get depressed when I run out of dr pepper. It is my coffee",
        "I was hurt when my grandmother passed away a few years ago",
        "Robin williams was my hero, still so sad he passed",
        "My best friend is moving away. We have lived close to each other for 10 years",
        "so sad robin williams has passed away, i miss him",
        "Harvey weinstein was such a good studio , they just ruined their business and now there arent any good movies",
        "When my best friend passed away I was devasted",
        "My little boy is starting Kindergarten in a few days",
        "My childhood cat died while I was away at college.  He was 15 years old.",
        "One time I wanted some ice cream very bad. By the time I got to the ice cream store they were already closed so I didn't get any ice cream.",
        "I failed my driving test today. It was my second time trying",
        "I broke my new phone yesterday. I was very upset.",
        "It is so unfortunate about  how ladies treat men's heart these days",
        "I am sad that my favorite TV show Seinfeld isn't on anymore.",
        "my grandmother has major back surgery next week, im not looking forward to it",
        "It's sad thinking about my parents growing old and not how I once remembered them. I guess that's life.",
        "seeing my son grow up so fast isnt easy",
        "It's always sad to see someone you liked from work find a different job.",
        "my brother is in rehab after 2 months in the hospital",
        "I miss living close to all my friends. We never see each other any more",
        "I was sad about the past this morning. I hate then when you wake up and remember a lot of bad things that happened over the past few years, the trauma hits you in your weakest moments.",
        "it upset me when i saw my food was taken out of the fridge at work today",
        "I woke up feeling down today. Some days the past you are trying to get over and heal from just hits you in moments of weakness",
        "You ever have those mornings where old memories come up..or old traumas..and it just makes you feel so bad.",
        "I saw a kitten hurt on the side of the road... unfortunately I was in a taxi and couldn't stop to help it",
        "I was pretty sad when my dog died. He was my friend",
        "It's been a long week already and it's only Tuesday! Trying to heal through trauma and dreaming of it, really is unpleasant!",
        "I'm sad I didn't get the job I really wanted. I prepared and practiced interviewing for so long.",
        "My friend is moving away.",
        "Our chihuahua dog had an autoimmune disease.  We lost her in February and it's still hard.",
        "I found out that someone that I knew from high school is really sick and might die soon",
        "When I was walking I saw a dog that got hit by a car. Seeing that mess the rest of my day up.",
        "My pet died last week. His name is Jack",
        "pans labyrinth bumbed me out",
        "I had an old hard drive with tons of pictures on it and it just gave out on me.",
        "My cat just turned 23 last week. She has been really sick. We have to put her down next week.",
        "I just got back from a vacation. I found out that my pet is now dead.",
        "My pet budgie bird died this morning. I had him for 10 years, and used to spend a lot of time with him.",
        "I lost my cell phone today. I can't believe it",
        "I was upset when I found out my job does not pay for you to take a lunch break, that ruined my day",
        "I am so devastated because I lost my pet turtle recently. I think he escaped from the yard. I miss him so much!",
        "My kids are getting so big, They aren't my litlle babies anymore",
        "I am having to be strong and not respond when it comes to a person I care about at times. It is hard to not be an enabler sometimes. It requires a LOT of strength and tough love. I",
        "My friends went out drinking last weekend without me. They didn't even both sending me a text to see what I was doing.",
        "My dog ran away yesterday. I am so saddened.",
        "I was so devastated when my pet parakeet died. Polly was such a good bird to me. I will miss her so much.",
        "I was watching a TV show and the couple were getting married. It was so sweet that it made me cry.",
        "I feel like I will be in this apartment forever. I really want a house",
        "the boy in the striped pijamas bumbed me out ",
        "A good co-worker friend is leaving the company, so I am bummed about it.",
        "I get so sad watching st jude commercials. I always watch them though.",
        "My friend had to cancel plans the other day",
        "I am upset I didn't get my scholarship.",
        "I cried when I found out my uncle passed away.",
        "I felt sad when I watched a show last night. It was about school shootings in Texas.",
        "when my dog died",
        "I cried when I heard Top Gun 2 was being made.",
        "my friend died",
        "I was watching a show last night. It was about a school shooting in texas.",
        "Today is my last day working. I am going to miss my coworkers.",
        "parent passed awy",
        "I woke up to something quite terrible this morning.  My vegetable garden has been ravaged through by some strange animal.",
        "I felt sad yesterday. At work our computer systems went down and customers were mad",
        "i didnt win the lotto",
        "i feel down after getting fired",
        "My pet turtle died.",
        "I keep thinking about my grandmother. She passed away last year and I do not know how to cope with it.",
        "Losing your family pet after 10 years is one of the hardest things I have had to do. I am not sure I can recover",
        "my brother is sick",
        "The rain today made me feel down. I just could not get going",
        "I'm feeling down because I was supposed to go on a trip with some friends from this Friday, but I have to work late, so I can't.",
        "My cat died the other day. She was 24 years old.",
        "I was upset as a kid when the Eagles lost the superbowl, I cried a lot",
        "I was pretty sad when I had to give me dog away. She was a good dog",
        "I get sad when I think of my parents. They have been gone for a few years now",
        "My friend's girlfriend cheated on him. I've never seen him so destroyed.",
        "I really wanted this coconut pineapple cake, but they ran out.",
        "I am not happy that the summer is almost over.",
        "My daughter's chihuahua had an autoimmune disease.  She passed away in February",
        "I am getting older and to still see that people can be so untrustworthy and that they will be such betrayers and so hateful over nothing is hard to see",
        "I got really upset when I had to move away from my childhood home.  all my memories were there.",
        "My rent is going up and I can't afford it. Now we will all have to move",
        "I need to put my dog up for adoption.  I am so devastated thinking about it.",
        "My pet rock rolled away yesterday. I was quite saddened.",
        "my friend left my job",
        "My pet rat died last week. I loved him so much. I cry all the time.",
        "My pet fish ran away today. I left him in my room like I always do and when I got home he was gone.",
        "my favorite show is ending. I will be lost",
        "I cried when I had to return to work after my vacation.",
        "I'm bummed that it is supposed to rain here all weekend.",
        "I cry every time I think of my sister.",
        "My sister left for college.",
        "My son just left for college.",
        "i was not happy when i couldnt get out of work on time",
        "My girlfriend is going away this weekend to visit her family. I'm very upset that I won't have anyone to spend the weekend with!",
        "My birthday was yesterday. I didn't get a single happy birthday message from anybody family or friends. That was really depressing.",
        "I had a watch my grandfather had given me when I was a kid, but I seem to have misplaced it. I really liked that watch and I'm unhappy that I can't find it",
        "My cat passed away last weekend. It has been a rough week for me.",
        "My dog died. I loved him, and I miss him.",
        "I can never figure out why my wife is so grumpy.",
        "I do not want my vacation to end. I would like to stay here forever",
        "I am having a hard time coping with having to kick someone out. I know it's been necessary for them to get better but it doesn't make it any easier",
        "My 2 youngest children will both be in high school this year. I can't believe they have grown up so fast. Time has flown by and I just want it to slow down.",
        "My cat died last year",
        "I don't think I'll be able to go to the lake this weekend, I'm pretty bummed out.",
        "I can't believeI will be moving away soon. I will mis the city life",
        "My nephew died in a car wreck.",
        "I really miss my kids being babies. They were so sweet then",
        "When my sister passed away from cancer. She had been diagnosed 3 months ago.",
        "I moved a great distance away from my family, and even though I enjoy my new location, I miss them.",
        "My pet dog passed away two weeks ago. He was 12 years old. ",
        "Don't you hate it when you're feeling confident in a new hairstyle or some clothes you're wearing, and then someone makes fun of you? Had that happen the other day. Makes you want to be able to hide in the background and never try anything new again",
        "When my cat passed away after being hit by a car. It was just after my hockey practice.",
        "I am bummed out today.  I failed a big test and my co-worker passed.",
        "When my stepdad told me we couldn't play baseball anymore. I had just got injured.",
        "When my father went into hospital, after he fell down the stairs, we had no idea he had cancer.",
        "My dog passed away a few weeks ago. She was 12. I really miss her.",
        "My favorite watch broke today.",
        "Yesterday my sister left to go back to her state. I wanted her to stay longer",
        "My 15 year old dog just died.  He was my buddy and I am all broken up because of his passing.",
        "My aunt died and it was reallu upseting. She was my favorite aunt too. ",
        "I think my friend stole some money from me. I don't know what to do.",
        "I had to leave my parents behind in the country I grew up in. I haven't seen them in 12 years and I cry a lot thinking about them",
        "My little boy is starting Kindergarten and I'm sad he's growing up so fast.",
        "I wish I spent more time with my dog while she was still with me.",
        "My cat is really sick and old. She is not going to make it much longer.",
        "Our little dog got pancreatitis.  She never recovered and we had to have her put to sleep because she was in so much pain.",
        "I felt this way when I had to leave my son for the first time to go to work.",
        "I had a pet hermit crap that died this morning. I got him when I was on vacation in Hawaii. ",
        "when i see young people asking for help on fb or donations instead of working ",
        "My daughter started kindergarten today.  I know we aren't supposed to cry, but I could not help it.",
        "My uncle died last year",
        "The summer feels like it just started but its about to end now. I'm gonna miss my friends for most of the year.",
        "I cried when my best friend moved away.",
        "I really wish summer wasn't ending.",
        "My close friend is moving away to another state. I think I am going to miss him a lot",
        "My friends dad died last month",
        "I cried when I found out I couldn't attend Harvard,",
        "I was so lonely when my brother left for college. It made me pretty bummed when I got home from school.",
        "Looking in my yearbook and seen a lot of people that passed away",
        "Someone ran over my dog and then ran away",
        "My friend wants nothing to do with me anymore.  I am so hurt about it.",
        "My girlfriend left me for my best friend",
        "My girlfriend dumped me yesterday.  I am so hurt right now.",
        "Thinking about really morbid stuff always makes me upset. Like how we all die one day and things like that really make me upset from time to time.",
        "My pet hamster died the other day.  I am so devastated. ",
        "I hate having to go back to college sometimes. It always makes me upset when I have to leave all my friends.",
        "I found out I did not win the lottery.",
        "my friends uncle died last year",
        "I had to put my dog to sleep yesterday.  I am hurting so bad right now.",
        "My old car finally died last week.",
        "I lost my wedding ring.  I am so hurt over it.",
        "My dog is getting old, and I can tell he isn't going to make it much longer.",
        "It was my last day of highschool, It was such a bittersweet moment.",
        "My dog is getting older and is starting to walk a little slower these days.",
        "My nextdoor neighbor is getting dementia.",
        "Life can be hard sometimes or even often. I just don't understand why people can't just be kind and good and instead want to hurt and destroy",
        "My external hard disk has stop working. I had very important on it. It can't be fixed.",
        "I was a little upset earlier. My brother was not able to meet me for lunch",
        "I get a little upset this time of year. It makes me miss my dad",
        "i was not happy when i was told i had to go into work on saturday",
        "I get sad this time of year. It makes me think of my dad",
        "i wasnt happy when i had to go into work on saturday",
        "A day before yesterday, my cat died. I was very very sorrowful.",
        "I am watching alpha dogs. I always get emotional at the end of this movie",
        "i really miss my family. it's hard to be 800 miles away",
        "I didn't get the job I applied for. It was given to someone else.",
        "I really hate that my kids are growing up. I wish they were still babies.",
        "All of my friends are married now. I am the only single one",
        "I can't believe my sister is moving. I am not happy",
        " I went to Whataburger a few days ago and they messed up my order, they put onions on my burger and the taste of onions make me feel sick.",
        "We had a trip planned to the beach today but sadly it was storming all day and had to cancel",
        "My dog was attacked by a coyote yesterday and she's been in the hospital ever since. I don't think she is going to make it.",
        "I miss being a kid. I hate all the responsibility I have now",
        "My laptop is very old and is making occasional problems with running. I do not have enough money to buy a new one",
        "My favorite tea cup was broken. It makes me worry a lot.",
        "It might sound silly, but I am really down about this next season of Game of Thrones being the last one.",
        "I cry every time I think of my late cousin.",
        "My dog had to be put down the other day. I'm heart broken.",
        "I had to put my cat of 13 years down. She has been with me forever and was my best friend",
        "My car stop working last week. I took it to the mechanic. It need a lot of money to fix it.",
        "im not about that I have to give my spot to someone else ",
        "My birth flew away",
        "The anniversary of my father's death recently passed. It has been a process adjusting to things without him.",
        "A few years ago my dog got into rat poison and died.",
        "I'm upset that my daughter suffers with allergies.",
        "My dog got very sick the other day and had to go to the vet. He is my best friend.",
        "I lost all of my money at the casino.",
        "My dog ran away from home!",
        "My dog is 16 years old. He is starting to have health problems.",
        "I had to tell my son that the dog wasn't going to be with us anymore.  It was tough to see him so upset.",
        "My pet goldfish just died. I cried for 2 days. I don't know how I will go on without Goldie.",
        "i'm really close with my sister, but she is moving away in september",
        "I just ordered food and it came and it's totally the wrong order.  Now I have to wait another hour for it!",
        "When my dog passed I was very emotional ",
        "I'm really bummed out today, I had to get rid of my dog because I had to move across the country.",
        "I found out yesterday that my dad had a stroke last month.  No one even told me until now!",
        "When people buy assorted doughnuts, and somebody eats the only flavor you like.",
        " I was really sad when I was 15 and my dog that I'd had since I was 4 died.",
        "I am moving hundreds of miles away from my friends and family to start a new life with my husband. I am not excited to be leaving. I hope it gets better.",
        "My cat has been battling cancer for a couple months. She already had two surgeries. Next week she will have to be put down.",
        "My dog died 5 minutes ago. I am so distraught.",
        "I saw a dog that got hit by a car on the die of the road.  It was very upsetting to see.  I cried a little bit thinking about the person who lost their dog",
        "My dog pooped on the rug today. I was so distraught.",
        "It really sucked when my rabbit died like 10 years ago. That was probably the most upset that I've ever been.",
        "My car broke down this week and there is nothing that can be done.  The mechanic said it was done for",
        "My dog died 10 minutes ago. I am so saddened.",
        "I am upset, my dog passed away.",
        "My dog got out and I haven't found her yet. I hope she's ok",
        "I am having a hard time with someone who keeps repeating the same mistakes. It's hard to see they keep going back to the same path.",
        "My friend of 4 years ended last weekend.",
        "So hard seeing homeless people around",
        "i was disappointed when i couldnt go home",
        "My favorite steak and cheese place is closing down.",
        "When i see beggars on the road i feel so pity and i just want to do something for them",
        "I lost my lucky pen. I worried for it.",
        "It was really hard to say goodbye to everyone at the end of the family reunion. It had been so long since we were all together.",
        "My Pet parrot died yesterday.",
        "I dropped my phone in the toilet and I didn't have insurance on it. It was a pretty expensive phone too.",
        "I dropped a bowl of mashed potatoes and it smashed all over the floor",
        "I'm a bit upset that summer is almost over.",
        "It was a bit of a rough weekend. Partner is working hard at therapy most days but he isn't even close to being okay yet. I just don't know if I could ever trust him again.",
        "My manager has taken my coworker for a work trip to New York. I was also suppose to go with them.",
        "I keep seeing a poor little black kitty running around outside every night. You can tell they are hungry. He won't come near me and my house can't hold another cat.",
        "My pet gecko died :(",
        "I'm sad, tomorrow I have to go back to school and I'm going to miss the summer with my old friends.",
        "My dog snoop died after a long fight with cancer. He was so loved.",
        "I'm a bit down that Fall isn't here yet.",
        "When my aunt passed away. She had colon cancer.",
        "My favorite shade of lipstick was discontinued today. Now I have to find a new one.",
        "I do get a little sad this time of year. My dad used to love this month ",
        "My cat died yesterday.",
        "The rain yesterday made me feel a little down. I wanted to be out and about",
        "I had to take my dog to the vet today.",
        "I just had a birthday and now I feel old. Its depressing",
        "My mother's husband got alzheimers and went downhill really fast.  He passed away about 8 months ago and she's  not doing too well with it.",
        "I lost my Grandpa 2 months ago.  He died within a week all of a sudden and I miss him every day.",
        "I feel bad.. I had to leave my husband in the ICU and come home without him.",
        "My dog died this time last year.",
        "I'm pretty bummed I didn't get to see my sister when she was in town.  I don't get to see her often.",
        "Our little chihuahua got pancreatitis this past year.  She passed away in February and it's been hard.",
        "My goldfish ran away yesterday. I was so distraught!",
        "My dog ran away yesterday. Never been so sad in my life.",
        "My dog died today. I am so distraught.",
        "I'm feeling pretty bummed after seeing a photo of myself 4 years ago, I gained so much weight!",
        "My iguana ran away today. I never have been so distraught. ",
        "My favorite donut shop went out of business.  I am devastated that it's gone.",
        "My friend's little kitten got hit by a car, it was so tragic and sad. I was crying for my friend.",
        "I'm sad, tomorrow will be the last time I get to see my friend before she leaves for college!",
        "My favorite pizza place closed down last week and I am still bummed out about it.",
        "when my grandpa died i couldnt take it",
        "My youngest son is going into kindergarten and I'm a little down.",
        "i was upset when i couldnt get the day off",
        "when my bird cage didnt come in the mail today like it was supposed to ",
        "Last week my mother passed away. I am so devasted",
        "My pet iguana just died. I'v had him since I was 5.",
        "My first date with a woman that I met at a party didn't go as expected. ",
        "Kind of bummed. I was supposed to meet my best friend tonight, but he got stuck at work.",
        "I just got back from a three month trip. I am really missing all the friends I made along the way.",
        "I am upset I didn't get to go to Hawaii.",
        "My hamster passed away.",
        "I didn't get into my first choice school.",
        "Gotta admit it hurt a lot to find out that my ex had moved on so quickly.  But looking back it probably wasn't meant to be...and now I'm living my best life really",
        "My armadillo passed away today. I was so distraught.",
        "I just lost my grandfather a month ago.",
        "My goldfish took his journey into the afterlife today. I was a traumatizing day.",
        "I dropped my 5 dollar ice cream as soon as I left the store",
        "Sometimes I cry when I watch sad movies",
        "Today was my favorite co workers last day, I'm going to miss her",
        "My dog ran away today. I was so distraught.",
        "I lost my wallet the other day, I think I left it on a bus",
        "I was really upset when my rabbit died a few years back. My brother wasn't nearly as upset but I couldn't help it.",
        "My dog passed away this morning. He was 13 years old, a golden lab. I'm just happy he's not in pain anymore.",
        "my favorite show is being canceld ",
        "I recently changed jobs for a better opportunity with more pay. I'm very pleased with the new job, but I did feel bummed about leaving my former co-workers behind. We had a good time and I liked those kids.",
        "I finished my favorite show a few days ago. I was really angry but happy at the same time",
        "My dog has cancer. The surgery did not fix it so we have to put her down.",
        "i was upset when i had to my sons game",
        "My best friend is moving far away. I am going to be so miserable.",
        "My neighbor passed away a few days ago. She was a nice older lady who'd always greet me when I saw her in the hall. Didn't know her that well, but she seemed lonely. I feel kind of bad for not getting to know her better when she was still alive",
        "I miss my Grandma. She died when I was a kid. ",
        "My friends dog ran away.  we looked for him all day but we couldnt find him.  I was pretty upset about it",
        "My cat got hit by a car. I had just got home from hockey.",
        "I am sad, it is my birthday and I feel really sick",
        "I had to euthanize my dog",
        "i knew i shouldnt have trusted my brother with my dog",
        "My car fuel gauge is not working. It left me on the side of the road without gas in the middle of nowhere !",
        "The doctor recommended hospice for my grandad today. Today was not a good day.",
        "My dog passed away last month. I am still feeling pretty down about it.",
        "My cat ignores me until she wants food from me",
        "I was feeling down after hearing that my friend's dog passed away. He was such a great dog to everybody.",
        "My hamster died yesterday. I was so distraught.",
        "My cat has to be put down next week. She has been very sick for a month and not improving.",
        "The doctor said my grandfather needs hospice today. Sad day for my family",
        "I'm upset that my husband is lazy",
        "My goldfish died yesterday. I am so heartbroken.",
        "My wife is off to her Mom's. I will feel alone and lonely",
        "My pet toad died, I am sad.",
        "My wife's grandmother passed away recently. She was the family matriarch and I actually felt very close to her as of late. She will be greatly missed.",
        "I feel so far away from my family. I hardly ever talk to them anymore. I miss them.",
        "Today is the anniversary of my fathers death. He has been gone for 18 years now.",
        "I am so sad, my mother recently passed away from a heart attack",
        "We had a flood in our basement and I lost a bunch of old photos.  These were taken before digital cameras so there are no backups.",
        "I can't believe our little girl is all grown up and going to colledge . We are going tyo miss her so much.",
        "I just found out that I'm not getting the promotion I thought I was going to, and now I can't take my girlfriend to Disneyworld",
        "My landlords do not approve of dogs in my house so I had to leave my dog with my parents.",
        "when i left my family's house to study in another city i got upset",
        "I am depressed most of the time",
        "My dog died today. I had him for over 12 years and he was the best dog I ever had. I'm heartbroken today.",
        "I lost my cat. It just disappeared one day and I can't find her.",
        "My favorite cake stand was stolen.",
        "I saw a cat get hit by a car this morning",
        "I found out that my grandma has Dementia and is deteriorating pretty quickly.",
        "My son went to stay with family for a  few days.  I really missed his hugs while he was away.",
        "I can't stop thinking about my dog that died a year ago this week. ",
        "I lost a bet with a friend",
        "I got some bad news today. It has made me feel down and depressed.",
        "I missed my favorite show on TV.",
        "My husband and I were really struggling to get pregnant with our second child. It had been over a year and I was feeling really down about it. I ended up having to go to the doctor to try and figure out what was going on. ",
        "My dog is 10 years old. He has been getting more infections in his ear and sleeping alot. I don't think he has much time left.",
        "Growing up, my mom always played a lot of Aretha Franklin. When I found out that she passed I was bewildered.",
        "my dog got hit by a car when he got out of the backyard gate",
        "My grandma died the other day.",
        "When I moved, I had to leave my dog behind that I got when my father died.",
        "my dog passed away. I am really distrout over it",
        "I was a little depressed a couple weeks ago when my dog died. He livd a good life but only to age 8.",
        "My cat was run over by a car. I found her on the street, what was left of her. It was heartbreaking.",
        "I lost my mother recently. She had hypertension and diabetis",
        "My 10 year old cat is starting to get sick a lot. I'm worried about her.",
        "I broke my laptop screen. ",
        "I am feeling this way because my son is turning 2 soon.",
        "My mom is starting to develop dementia early. I feel like I'm losing such an important figure in my life much earlier than I should, even though she's still alive. Like, she struggles so much with daily activities and remembering who I am.",
        "I recently lost my job adn i feel horrible.",
        "My favorite football team lost tonight.  It makes me feel so unhappy.",
        "My cat got ran over by someone. He sped off like it didn't matter.",
        "I came home and my goldfish have died",
        "where is the love ",
        "I dont really know anyone at uni",
        "My doctor told me to give up caffeine to help with my anxiety.  I really, really miss my morning coffee.",
        "My pet lizard died he was 15 years old. it has been hard on me",
        "I bought a new puppy about three weeks ago. When I came home from work I found it dead in the living room.",
        "I was heartbroken when my grandmother passed away, it was so sad",
        "My dog passed away a few days ago, we had him since he was a baby.",
        "I am starting school again next week. I am not going to have any free time now",
        "I just got a new puppy last week and now he's dead. He got hit by a car.",
        "I used to be miserable when no one would text me and I'd spend the weekend solo at my parents' house...now I've got to turn off my phone just to get away from it all",
        "My house caught on fire and I lost all my belongings. Im so upset right now. I dont know what I am going to do.",
        "When i was 10 my cat went missing and i found her ran over in the road.",
        "I just found out the small company I work for is going out of business.  I cried all day Friday when I found out because I love working for them.",
        "My best friend just moved to another state. I don't know what I will do without her",
        "My friend was hit by a meteor. ",
        "I had a necklace that my mother gave me before she passed away, but I just lost it.",
        "One of coworkers passed away. I dont want to go back to work.",
        "I ruined my favorite shorts today. i sharted",
        "My dog of 10 years recently passed away. I felt so down.",
        "This week, my manager told me bad comments about my work performance. It made me feel bad.",
        "I totaled my brand new car.",
        "My dog died right after my cat died. ;(",
        "My friend's grandmother passed away and I felt this way.",
        "My 12 year old lab just passed away.  He was my buddy and I am really upset about losing him."
    ]
}