{
    "threshold": 0.8,
    "seed": [
        "when I was younger, my parents picked me up from work with a new car, which really surprised me, I was so excited to have my own car!",
        "I woke up early today for work. My children were still up watching cartoons!",
        "The other day I was surprised with a big bonus from work. ",
        "i applied for 200+ jobs and still didn't hear from none of them!",
        "My brother usually doesn't do anything for me unless asked. After 3 decades, he actually took me out for my birthday.",
        "I was thrown a surprise party for my 30th birthday.",
        "I was thrown a party yesterday and had no idea it was happening.",
        "When I was a child and found out my friends could come over. ",
        "I was surprised when I was accepted into Harvard.",
        "I got in my car and my son left a note on my seat.",
        "Got asked to my boss' office. Thought I was getting bad news but turns out I was offered a promotion.",
        "I was surprised when Trump won the election.",
        "I am shocked it hasn't rained today.",
        "I was surprised when my parents picked me up from work in a new car for me. I did not expect that at all!",
        "A friend of mine recently got married. I hadn't even know he was engaged!",
        "My friend's parents are missionaries and therefore go to Africa all the time, so it was no big deal when I heard he was going to Samoa for a while. What I didn't know is that he was actually moving there for a few years, which I really didn't expect.",
        " I was surprised when my parents bought me a car. I did not expect it at all",
        "I was shocked when I got a new car. My parents surprised me so well!",
        "When i was younger i wanted a gamecube for my birthday. On my birthday my parents told me to clean the bathroom. Ended up in the bathroom was a gamecube with 4 games. ",
        "Whenever my girlfriend at the time broke up with me and ghosted me, I had no idea what to make of the situation. I never would've expected her to do that, since she seemed really into me.",
        "I was surprised when I went on a beach trip and my good friend from Florida was there but we lived two hours away by plane.",
        "I am surprised England Lost to Croatia on the World Cup",
        "I was really amazed to see my kid snowboarding so well during last winters ! Must say he's a quick learner.",
        "My coworkers threw a party for me recently for my birthday. This was very unexpected.",
        "I was so surprized on the night of my graduation my parents bought me a new car!",
        "The other day I found out that LeBron James joined the Lakers instead of going to Houston or staying in Cleveland!",
        "My husband bought tickets for us to see the Pittsburgh Steelers in Jacksonville for my birthday. I was shocked! I can't wait!",
        "I tried online dating the first time on POF.  The girl was decent looking in the photos.  But when I met her in real life she was a bombshell.",
        "One Christmas i was really into the holiday season. I was a kid at the time and well i didn't expect my parents to buy me certain gifts. Ended up i got both Pokemon games and went crazy happy from the gift.",
        "My husband brought me a present for my birthday.  It was a iphone 8 and i love it",
        "I went to work one day and all the management had been fired to my surprise, we had the option to stay or leave with severance pay.",
        "I can't believe my friend Joe died.",
        "I ma surprised by the elimination of the British team from the world cup.",
        "Once I got a big gift in my mail. It was from an anonymous person. I never found out who gave it to me.",
        "When my dad bought me a truck when I was 18 and I was not expecting it.",
        "My friend just told me she likes me as more than a friend.",
        "I really love the snow but it never snows here.  A few years ago, I got my wish, but it was also horrible.  Lots of people stranded all over, including my husband and daughter.",
        "The other day I was walking down the street and a cat fell in front of me.",
        "Being a male stripper was fun.  Besides walking out with at least $500 a night I was hanging around some gorgeous girls who I had initially expected to be sad, lonely old cat ladies wanting some company...but nope, most of them young college chicks in their early twenties. ",
        "My parents bought my brother a new puppy. He had no idea it was coming!",
        "One time my girlfriend hid around the corner and jumped out at me.",
        "I can't believe it is the middle of July already!",
        "I won an NCAA basketball bracket challenge back in 2013. $1,000 cash.....it was awesome to win something like that.",
        "My van did such a good job on a 5 hour trip lately, I had a doubt it'd make it because it's been breaking lately.",
        "A birthday bash was organized by my colleague without my knowledge",
        "When I got an A on my math final I was super shocked, thought I did terrible.",
        "I feel surprise when new gifts are offer me anyone",
        "I made a Tinder out of curiosity, since I had never done a single thing with a girl. I expected to get like zero matches but I actually got a solid amount.",
        " I ran into my old school mate outside the country. I could not believe my eyes; we were in a different country",
        "I was shocked when I was able to pass my history class so easily when I didnt study much ever.",
        "My friends had a surprise party for me on my 25th birthday.",
        "I tried tea for the first time and it tasted much better than I expected.",
        "I am surprised to see croatia went to finals in the world cup",
        "I didn't expect my wife to buy me a new car for my birthday.",
        "For my 30th birthday my friends threw me an unexpected party that was a lot of fun.",
        "I had a baby last month. We were planning on spending the time privately as a family, just my husband and I. Suddenly our grandmother showed up at the hospital with a plan to stay with us for the week to help out. ",
        "When my girlfriend told me she was pregnant.",
        "I once won an award for writing a poem in a competition I didn't enter.",
        "I was so shocked to see how much it snowed in my city back in 2011. It was so crazy.",
        "I was surprised when Roger Federer lost the 2018 Wimbledon quarters.",
        "Yesterday was sure shocking to watch on C-SPAN. I never thought that Strzok's dramatic show would show the true evil during the testimony before Congress",
        "It is really a 'wow' moment. It is nearly a year since we have adopted kid, and she grew up so much. ",
        "Yesterday in the mall I met a friend I had not seen in years and she was buying the same shirt as me, And it was in a small town were I recently moved.",
        "I was surprised when my aunt came to my birthday party when I turned 18. I was not expecting her to come and i was a nice surprise.",
        "I was riding my motorcycle when a car came aggressively up next to me at a stop light. I thought he was upset, but he just wanted to talk about my bike.",
        "When I found out I was pregnant I was quite aghast. We weren't planning on kids.",
        "My daughter wants to join the lacrosse team this year. She has never liked sports.",
        "My computer had slowly been dying on me. And I had helped my sister in law tremendously by getting her into college. So behind my back she bought me a new laptop as a gift.",
        "Once for my birthday my sisters did not tell me anything about a party and I was completely caught off guard with what they had planned.",
        "Once i was going to a friend's house a couple of days after my birthday. When i got to my friend's house everyone i knew was there and yelled surprise! never had a surprise party before.",
        "My friend shocked me by coming back from her months long trip early!",
        "I had a birthday party recently, it was great",
        "Was invited to a friends house after work.  After he let me in he took me to the back yard where there was a bunch of people.  It was party for my wife telling me we were haveing our first baby.",
        "I was shocked when the Eagles won the Super Bowl.",
        "I won a 500 gift card for answering a question at the site on  a vendor we use at work",
        "I found $20 on the side walk today",
        "on my 25th birthday party",
        "I didn't expect any free movie tickets when I went to the movies yesterday, it definitely caught me off guard. ",
        "I was at home and at the last minute my father took me to the Yankee game.",
        "Found out my roommate got a cat while I was gone, which was a little shocking",
        "My husband has never planned a date on his own since we were married. This weekend he is taking me on a trip, I'm so excited.",
        "I got my paycheck and there was more money than I was expecting.",
        " was surprised when my parents gave me a car as my graduation present from college",
        "I can't believe my electric is bill is so high this onth.",
        "My long distance girlfriend surprised me when she flew in to visit me this past weekend",
        "that i got accepted into college ",
        "I can't believe Matt Ryan got 30 million a year.",
        "my daughter remembered my bday",
        "I found a winning scratch off ticket on the side of the road!",
        "There's usually too much catfishing on Facebook and Tinder.  So I was amazed when I met my date and she turned out to be actually better looking in person.",
        "Last Monday was my birthday, and when I arrived home at night my family and friends had gathered at home for celebrate.  I wasn't expecting them",
        "that i found money on the ground ",
        "I was shocked when my aunt made my birthday. She lived so far away",
        "I was happy to see my dog returned home",
        "was happy to see my dog ricky return home",
        "Went to Texas, and it was raining pretty hard the whole time I was there.",
        "This past year I had to work on my birthday. When I arrived all of my coworkers decorated the place with balloons and got me a cake. I was not expecting that.",
        "My friends threw a party for me when I got promoted at work. I couldn't believe it.",
        "I can't believe I am still in school and doing well. I quit things a lot.",
        "I love Stephen King new show. I can't believe Im not as afraid as I usually am.",
        "When someone stole my lawn mower.",
        "I was surprised out water company started on my street and tore up our whole street replacing water pipes",
        "Got hit with a parking ticket the other day as the lady was writing it. I begged her to stop writing it in the middle of it... and wouldn't you know it, she did! So thankful.",
        "About a month ago, I went and got my mail like I always do, and there was a weird looking envalope that looked like a check. I figured it was bogus and set it on the counter. My fiance got home and opened it and said it was not bogus, it was actually a settlement check for $500 from a company I worked for 5 years ago that did not comp overtime correctly!",
        "A month ago, my parents surprised me with a visit for my birthday. I was so shocked!",
        "I was pleasantly shocked when my boyfriend came home with a puppy and flowers for me one time. It was very touching and a great present.",
        "I can not believe Prince died.",
        "Was driving my sister to her friend's house today and the car almost hydroplaned because the streets were wet. Cannot believe I didn't crash into the car in the other lane",
        "This school year my daughters book a quite cheap. I spent over $300 last year.",
        "Last week was my birthday and I just moved to a new town. Two of my friends made the trip to see me and did not tell me about. ",
        "I actually lost weight.  I didn't intend to at first, just went through a rough patch, but then realized I was losing and kept at it in a better way.  And a lot of other issues eventually went away becuase of it.",
        "When my mom bought me  bunch of energy drinks and I didn't have to get any myself. Relief!",
        "I found 6 puppies on my doorstep.",
        "I can't believe my son is being so stubborn about the potty. My girl was much easier.",
        "Someone hit a coworker's car in the parking lot, and everyone came together to chip in for the deductible.",
        "My new neighbors are actually nice. I've never had nic neighbors.",
        "The other day when I got to work, my co-workers threw me a surprise birthday party. I was so surprised!",
        "I walked in on my parents making a baby.",
        "I was not expecting to win. When I scratched the last bubble in the lottery ticket, I realized I won 20 bucks!!!",
        "My best friend that lives far away, was sending her daughter on a plane by herself to come stay with me for a couple weeks.When I was waiting for her daughter at the gate, I saw her and then saw my best friend had came with her. I was so happy.",
        "When i was younger i wanted to have a party for my birthday. I ended up not hearing about a party for days then suddenly on my birthday people showed up randomly and we had a party. ",
        "WHen i turned thirty, my husband planned a huge surprise party at the beach. I was shocked!",
        "My father is visiting me!",
        "I was shopping for grociers and I saw someone wearing a dog costume, pretty unexpected.",
        "Everyone has already left the office. It's oddly quiet.",
        "My oldest girls are just over a year apart. I wasn't expecting to have another baby so soon.",
        "I was going to have dinner with my family, but we're on the highway to New York it seems.",
        "I can't believe I found a 20 dollar bill outside my house. It was not expected at all.",
        "I was shocked when my dad got me a new truck for my birthday",
        "I can't believe I won 50 bucks on the lottery ticket I just bought. Did not expect it.",
        "I can't believe I actually lost that much weight. It's only been 2 months",
        "I can't believe how big my dog has gotten. 7 months ago, she was a small, clueless puppy but now she is a big one!",
        "Last christmas i got a car!",
        "My internet service provider cut my internet last week. I was shocked because I didn't miss the payment so I knew it had to be an error.",
        "I can not believe the summer is almost over.",
        "I was shocked the US didn't qualify for the World Cup.",
        "I haven't gotten my period in two months. So I got a pregnancy test at the dollar tree because I am broke and it came out pregnant. ",
        "Last week my friend I have not seen in a couple years surprised me at my doorstep. It was awesome seeing them again.",
        "I was so amazed when the magician made my hat dissapear.",
        "I had a surprise birthday party when I was 22!",
        "I bought a lottery ticket and won a prize. I never win so this was unexpected.",
        "I can't believe my daughter loves her new school so much. She doesnt like anything.",
        "I was surprised that a British rider won the tour de france again.",
        "I remember for my twentieth birthday I had expected to celebrate it alone. But lo and behold when I returned from work my family and friends had waited around in my house for a party just for me. It ended up being a heck of a night, along with a full cake from my favorite bakery. ",
        "I came home and had no idea my friends had thrown me a party for my birthday.",
        "I recently found out that my wife is pregnant.  I was so shocked by the news.",
        "My sister never has money but last month she got me an expensive lawnmower , i was shocked",
        "I was living at a backpackers and had tried talking to this cute German girl but she just ignored me all the time. So I thought she hated me.  Until she decided to open up one night and let me get to second base. ",
        "my sister gave me $400 once but she's always broke",
        "my car made it all the way to Texas even though its a 1990",
        "My birthday was a few days ago and my friends planned a party for me. I had no idea!",
        "The first time I played the Nintendo Wii I thought i was going to kick my little brother's butt...he flipped the script when he started whupping me at boxing, soccer, and tennis...I was mad but I gave him props",
        "My friend was making fun of me one calling me a lightweight because I was buzzing after one glass of tequila...she's pretty good at holding her liquor but when we started drinking beer I noticed she was really drunk. Then I had the last laugh",
        "I was susprised when Nintendo announced the new super smash bros a few months ago",
        "i've seen a lunar eclipse i didn't expect it to look that cool",
        "I could not believe that Philadelphia pulled out a Super Bowl win.  I am now a huge fan!",
        "I am astonish by Trump.",
        "I am astonished at the Russians",
        "We sold our house last year and received above asking price, which was unexpected.",
        "One fond memory I have was my 6th birthday party. I was on my way home from school and my mom told me she had baked a cake and got the present. But I could only open it after I was done with homework.  When I got to my room all of my friends from school were there.  We ended up ditching homework and playing games the whole evening.",
        "My boyfriend took me out to my favorite restaurant to celebrate my promotion at work. I was not expecting this at all!",
        "Last week on my birthday, I came home to a dark house and all my friends waiting for me. When I walked in, they jumped out. I was so happey.",
        "I went home from work the other day and found that my garage had been broken into and a lot of expensive equipment had been stolen",
        "I was walking along in the woods and then I seen a snake. It was a big one and surprised me!",
        "I got an invite to go camping this weekend",
        "I make it a habit of not telling people when my birthday is.  This year however, a friend from work got me something,even though i thought he didn't know when my birthday was.",
        "It was shocking for me to see my beautiful city at night from a plane.",
        "I got called into the CEOs office and thought something was wrong. They offered a promotion.",
        "The other day I saw a man take a dog from the street, I've been seeing that dog for a while and in a couple of days I see this dog on the streets again, poor little thing.",
        "For my 16th birthday I received a brand new car! It was a red convertible.",
        "I went into the living room there was a big party waiting for me for my birthday. I was beyond elated. ",
        "I went to my bathroom and a snake was there.",
        "I got an extra day off this week. It wasn't expected but I'm happy for it!",
        "There  was no traffic on the way to work today.",
        "I was shocked in a good way when my dad got me a truck for my senior year. I had no idea that was going to happen",
        "I was surprised when my partner sent me a card in the mail while away.",
        "Yesterday someone pulled up beside us in the gas station, blasting rap music. I was shocked when a middle aged white guy stepped out.",
        "I didn't know my brother was coming in to town!",
        "when my neighbor wanted to buy my house ",
        "I was very surprised when my mom brought me dinner the other day and she knew just what I wanted, without asking.",
        "I am shocked when the US hockey team won gold in 1980.",
        "I was floored when I found out I won an award at work",
        "I felt surprised when I got home and saw my house was robbed.",
        "I was a little on edge when I dropped my daughter off at a movie with her friend alone for the first time",
        "when i came home to a clean house, and dinner made after a bad day ",
        "I ordered a lot of food from a restaurant with coupons yesterday. When I got the food, they didn't even ask for the coupons! I did not expect it.",
        "I was surprised to walk up on a snake a few days ago.",
        "I owe my friend a pretty big amount of money. I was supposed to pay this week but they said they will give me another month. Did not expect that at all.",
        "When I was still in the Navy, I never studied for promotion tests, so you can imagine my reaction when I was always selected my first time I was eligible.",
        "I was shocked when I wsa told my boss was let go",
        "I did not expect France to win the World Cup. It's been a while but I still can't believe it considering a lot better teams made it to the semi play offs.",
        "I was shocked to get a letter in the mail today.",
        "The other day I was watching the news and they were interviewin someone that I realized is my neighbor, ",
        "I was startled by a snake in my yard a few days ago.",
        "Got home and everything looks like it got a fresh paint.",
        "I can't believe game of thrones is ending. I thought it would come on forever like the simpsons.",
        "There were 6 kittens in front of my doorstep this morning.",
        "I tried spinach alfredo h other day and couldnt believe that I actually liked it.",
        "My friend gave up his dream school to go to a local college so he can stay close to his mom.",
        "Just came home to so much cake!",
        "The local restuarant near us is closing. I thought business was good.",
        "I came home the other day to find my brother waiting for me!  I had not seen him in almost 5 years!  I couldn't believe it!",
        "My friend told me that she has a crush on me.",
        "I was shocked when I realized I had a $100 bill in an old pocket.",
        "My friend got me a new phone.",
        "I was about to go to bed when I received a phone call. It was my mother in law who I hadn't talked to in awhile, and she had interesting news.",
        "The first time I stayed at my boyfriend's apartment, I realized he kept good secrets from me. There were flowers waiting for me throughtout the apartment. There was also chocolates and snacks as well as treats and toys for my dog",
        "I was shocked when I realized I left my door open at night",
        "My parents threw me a surprise party last night. It was really nice of them and I was blown away.",
        "I was at my mother's house the other day and while waiting in the garage she pulled up in a brand new SUV she had bought.  I was blown away about how nice that thing was.  Can't believe she actually spent the money on that!",
        "I was in shock when I saw an accident. It was a car accident on the highway.",
        "I was surprised when I thought I bought 5 packages of gluten free cookies. They weren't!",
        "My friends threw me a surprise birthday party. I was so shocked and felt so incredibly loved. It was amazing.",
        "A friend of mine organized an impromptu celebration for my birthday. It was very considerate of her to do that.",
        "My mom gave me an unexpected gift this past Christmas. It was a family heirloom that is quite valuable.",
        "I am shocked at how fast my hair is growing these days",
        "I got take out and when I got home I had an extra dessert. I was quite pleased.",
        "Was promoted at my place of work barely a month of joining the company",
        "It's not unexpected that you are the best",
        "My nephew gave me an unexpected birthday gift. It was quite cute!",
        "I heard a ring ,moved towards the door ,open and it was....",
        "My sister who is living overseas sent me a package with some presents the other day. She did this without telling me and I was really happy to get it.",
        " In the fall, i had a week off and I didn't make any plans because I was pretty broke. My oldest and best childhood friend flew in from where they live in Europe to spend the week with me- they didn't tell me they were coming. It was wonderful!",
        "I was shocked when I didnt win the lottery!",
        "I was shocked to see my dog missing the other day!",
        "I can't believe they threw me a party for my birthday!",
        "One time in high school, I received an award unexpectedly. It was for the work I did on the school year book. ",
        "when i woke up this morning to a large bonus from work. ",
        "I was startled to find a snake in my yard a few days ago.",
        "i was shocked when i saw my dog missing the other day",
        "I couldnt believe i got a bonus at work!",
        "I was very surprised when my neighbor told me he still had his dogs. I haven't seen them in a week or so. So I have been worried!",
        "I was super surprised when there was a cute skunk in our yard last night! Everyone got away safe even though I had to go grab my dog half dressed.",
        "I was so shocked when my aunt got me a computer for college. I was just happy",
        "While I was taking my dogs out to potty the other morning I came in to find a note left by my spouse that said pick one of these shirts and be ready by noon. It was quite wonderful and unexpected we went for a really nice lunch and had an amazing day together.",
        "My sister gave me $500 she won the lottery ",
        "It was my birthday last week. I didn't think any of my coworkers remembered. I sure got big shock when the whole office started singing Happy Birthday and brought me a cake!",
        "I had to hire a plumber last week for a leak in my kitchen sink.  Everything was great until I saw the bill.  Talk about sticker shock!",
        "My girlfriend came home with a giant box. It had a little kitten in it!",
        "I ma surprised at the economy.",
        "I couldn't believe that I got a call from an old friend",
        "I am shocked the Red Sox beat the Yankees today.",
        "when we got engaged I was not expecting it.  we went to a bed and breakfast",
        "I didn't know the show POWER was going to be so good!",
        "I won 20$ off a lottery ticket this morning. Didn't expect it to be honest!",
        "I was so excited to see my kids when they came home!",
        "I randomly bought a lotto ticket the other day and won $50!",
        "I found a gift card I forgot I had in a drawer",
        "1",
        "I found $100 in an old pair of pants.",
        "I was shocked my brother came to my birthday party.",
        "I have some stock that I forgot I had. Turns out they're worth 20k now.",
        "Came home to absolutely no one. I wonder where they all went.",
        "Met my friend way back from elementary school. She grew up to be a hottie!",
        "I was excited that my neighbor came to my door",
        "I just celebrated my 40th birthday, and my wife took me on a surprise vacation with 5 of our best friends!",
        "I saw a mom and baby bunny around 8 and they were letting me talk to them. It was a bit shocking as usually bunnies take off whenever they see or hear anything. They were so sweet!",
        "I was surprised when I saw two bunnies..a mom I assume and her baby, running around. They stopped to listen to me talking to them too.",
        "Last week, my husband surprised me with a trip to Charleston, South Carolina next month. I am so excited! We haven't had a vacation in years so I can't even believe it!",
        "I got a bonus in my last paycheck. I was so shocked at my manager's generosity.",
        "I was happy to find that at work my coworker prepared a birthday party for me.",
        "I couldn't believe my friend started working with me",
        "My friends threw me a surprise birthday party. I was so shocked and happy.",
        "This bird chased my cat on our walk.",
        "Just got back from a grocery store. A girl was actually hitting on me.",
        "I was very shocked that they had a bunch of deli turkey on clearance with so many people shopping today! I can usually find it once a week but this is the second time! Jackpot!",
        "I was so shocked when my aunt came to my graduation, She lived far away",
        "A possom was waiting outside my door.",
        "I had lost my iPad in an airport a week ago, and even though it had my contact information, I wasn't sure it'd be returned to me. I just figured it was gone for. But it showed up today, in the same condition!",
        "I woke up one morning and found a puppy in my bed.  I wasn't expecting that!",
        "I was walking back home today, and I had to go through the front yard. The summer time means lots of rain, and so the grass gets a little tall. While I was walking through it, I stepped on a snake! I screamed like a little baby and jogged away really fast.",
        "Last week was my birthday. When I got to work, my office was decorated and there was a cake and some gifts on my desk. I wasn't expecting it.",
        "My husband and I don't usually get each other gifts for Christmas but last year he got me one, it was a pet puppy. I could not have been more shocked. ",
        "In the world cup 2018, I never thought that, France would win the cup. I was so amazed.",
        "I can not believe my dad was fired.",
        "My partner invited all my relatives to my birthday. I was not expecting them",
        "I found a twenty dollar bill on the ground today.  I was shocked to find it.",
        "I still can't believe my dad bought me a car.",
        "I thought that physics was gonna be a really simple class. Contrary to this, it was really tough and was one of the hardest I was in.",
        "I received a bonus from work the other day. I actually couldn't believe it, but it felt nice to be appreciated!",
        "I am baffled about the USA economy.",
        "I just moved into my first house by myself. I haven't had time to clean or unpack. My mom came over while I was at work and she cleaned and unpacked the entire house!",
        "Once a friend of mine showed up at my door, I hadn't seen him for years",
        "Once my brother bought me an exbox for no reason",
        "A girl kissed me",
        "Found a chest of old comic books and toys from when I was a kid.",
        "My girlfriend got me a Playstation 4 for my birthday. I did not expect it at all.",
        "My friends have prepared for me a surprise birthday party at a friend home. It was unexpected.",
        "I was happily shocked my aunt got me a laptop. It was for school",
        "to see a new car in my yard",
        "I watched the UFC fights last night and was shocked by the outcome of the main events. The champ lost in one of the fights.",
        "i feel amazing when i visit the pairs ",
        "i was schocked to see my favorite band wasnt coming to my city this tour",
        "I was shocked when I found out that my cousin was having a kid, I didn't see it coming.",
        "I had a low average in one of the harder courses in my bachelor's program. It was not looking good until the final exam had bonus opportunities. After receiving my scores, I was able to achieve an A in the course.",
        "my friend got asked to become a manager ",
        "I thought everyone forgot my birthday. No one wished me a happy birthday at work. Then I saw my coworkers gather around and start singing Happy Birthday. I was shocked that they remembered!",
        "A few days ago my friends threw a party for me. I was not expecting it, so I was quite shocked",
        "I had a dream where I felt like I was getting rained on. I woke up and saw that my dog as licking me all over. I was so shocked to see him doing that!",
        "Last year on my birthday I really wanted to get a new gaming system. I didn't think I would get it but my parents had it wrapped with the rest of my gifts!",
        "I got a text message from my ex the other day telling me that she was still in love with me.  I was pretty shocked.",
        "I opened up my fridge the other day and couldn't believe my eyes when it was completely empty. Turns out I was the victim of an April Fool's prank by my kids! They got me good!",
        "Our daughter's dance program sent out new tuition notices.  They decided to change the entire pay structure and it's going to cost us a lot more to send her now.",
        "Once my wife surprised me with a cruise vacation to the Caribbean. I had no idea she was going to do that. We had a great time!",
        "I'd never had a new car, always used.  When I married my husband, that's what he did, bought me a new car for a wedding present!",
        "I ran across a snake it our backyard.  I shocked me.",
        "I just found out my boss is getting married and I had no idea she was even dating anyone.",
        "I was out to lunch and this waitress asked me for my number.  At first i thought she was just being nice to get a tip, but then she texted me later that night",
        "my husband started doing online work which caught me off guard",
        "I just found out that I will get to travel abroad for work and it really took me off guard (in a good way).",
        "I was checking my lottery ticket this morning and found out that I won $200. I'm going to buy myself some new video games!",
        "I woke up to breakfast in be this morning.",
        "Came home to all my family here with a hot pot going!",
        "I was shocked when my dad got me a laptop. It was for school",
        "it was suprising to see my dog find his way home the other day",
        "Wonder woman is an awesome movie. I can't believe I am just now seeing it.",
        "There was a party at work today. Totally unannounced.",
        "I ordered a pizza, but the delivery person gave me an extra one.",
        "I was surprised when I got elected class president. I did not expect it",
        "I can't believe my daughter wants toplay bass guitar. That's so weird to me",
        "I was a little shocked when my brother paid for a vacation for my birthday. It was so nice",
        "I can;t believe I like the show Power so much. I was never really into shows like that",
        "I was shocked when my aunt made my graduation. She lived out of state",
        "My friend randomly gave me a gift out of nowhere. I wasn't expecting it at all as there wasn't any specific occassion",
        "For my last birthday I told my husband I didn't want a gift but he got me a laptop... I was very happy!",
        "Yesterday I was doing shores outside and was just finishing up when a lizard jumped on me out of nowhere!",
        "I have been high nutrient vegan for 3 months now and got on the scale today only to discover that I have lost 34 pounds! I was shocked!",
        "I got a raise lately and I wasn't expecting one this big!",
        "Was grocery shopping, and saw my old best fried in the dairy aisle. Haven't spoken to them in like ten years, even though we used to be really close. We caught up a little bit, and exchanged numbers to talk more later. Funny how small the world is sometimes.",
        "A few years ago, my best flew down from New York City to spend New Year's Eve with me in city, and I had no idea.",
        "I got a really high score on my last exam despite not studying enough.",
        "I had a roommate up until about a month ago. He decided to outfit his car to travel across the country and sleep in it. He's been successful thus far.",
        "my little niece started speaking english fast i was surprised ",
        "My parents surprised me with a trip up to see me for 4 days.  I was so shocked and am so happy they are here!",
        "One time I bought a five dollar lottery ticket. i didn't expect to win anything but I ended up winning five hundred dollars.",
        "I can't believe game of thrones is ending. I am not happy about it",
        "im surprised my nephew just started jui jitsu",
        "My friends randomly stopped by to check on me as I had been feeling bad. I have such good friends!",
        "I won a trip to disneyland.",
        "I was a bit shocked that someone was so nice this morning after being so rotten yesterday. I can't deal with people with such huge mood swings.",
        "The other day someone flipped out on me all of a sudden. It's not really any fun to deal with someone who has so much baggage and childhood issues.",
        "My mom is taking me on a cruise!",
        "I got into a small fender bender and i was so surprised to see how expensive it is to fix a tiny scratch",
        "My grandmother is excited to see me! I went to her home without any intimation. She is happy to receive me after a long period.",
        "I had been away from my friends and family for about 3 months while at my new job. SInce it was 300 miles away I had not been back home nor seen anyone up til that point. Upon my arrival to my new home one night a group of my closest family and friends were awaiting my arrival at home. The smile on my face beamed around the room!",
        "They're buying everyone shakes today at work.",
        "That my house got an offer on it from the neighbor. ",
        "I won a trip to las vegas.",
        "I was surprised when I was gifted a car for my graduation gift!",
        "I was susprised when my parents let me get my license the day I turned 16, that is not really like them",
        "My parents won the lottery last week.",
        "My wife threw me a big birthday party without me knowing!",
        "Today I came home, got my mail, and there was a check for 100 $ in it.",
        "I won a scratch ticket last week. It was a nice change in luck.",
        "I saw Henry Winkler at the airport the other day! The Fonz! He came walking by, and other people were asking him for a picture. He sounded very approachable and genuine, and accommodating. I was only 30 feet from him, but I didn't want to be yet another person to ask for a picture.",
        "I never new I was adopted!",
        "Went fishing this weekend",
        "I can't believe that Robin Williams died.",
        "I went into work this morning and had an unexpected bonus sitting on my desk!",
        "Last week I entered a contest to win an ipad at work and today I got the news that I won!",
        "I was feeling ill and fatigued the last couple months and just found out that I'm pregnant. Wasn't expecting that!",
        "I got a $50 bonus and it was very unexpected AND needed!",
        "suprise on my birthday",
        "My white dog doesn't want to go outside lately but once he is out there, he is fine like he normally is! I don't understand what is going on.",
        "I got a promotion at work today.  I am so shocked.",
        "My son just said his first words this weekend.  They just came out of nowhere.",
        "Last night I was walking my dog and I saw a dark furry animal in a garbage can. I looked closer and it almost jumped on me. It was a raccoon and scared the pants off me!",
        "Went to a local concert, and so many people were there. All the bands were unknown.",
        "My friends gave me a nice impromptu birthday celebration last week. They took me to my favorite restaurant and gave me gifts.",
        "My coworker went into labor, and we somehow all brought a baby into the world",
        "My friends threw a huge surprise party for me the other day. I was so shocked and happy.",
        "Friends threw me a surprise birthday party. I was so happy and shocked.",
        "I planted a plant in my garden a week before. Today morning the roses blossom in the plant. I get happy to see it.",
        "I saw a guy drop his phone and kick it back into his hand",
        "I met a girl on Tinder and we were having a great time, even started dating. Then suddenly she dumped me and I was shocked.",
        "I just found out I had more than enough money to pay my loans",
        "I really liked this girl that I matched with on Tinder and she seemed to really like me too. Then all of a sudden she ghosted me and it really shocked and made me sad too.",
        "I got a free giftcard in the mail!",
        "I ordered pizza and got drunk one day and we ordered some donut holes with it. We get the door and they gave us way more food than we ordered, which was amazing.",
        "It's expected that I will get a raise ",
        "It was really fun to see my niece be born. I really had no idea what I was in for when I went to the hospital at first. I think it was a really educational experience. ",
        "I was shocked when i got invited on a random trip",
        "My father bought me a new car which I had not expected.",
        "My nephew made me an unexpected birthday gift! I was really happy about that.",
        "I was surprised one day I scratched a lotto ticket to find out I had won £100.",
        "My sister bought tickets for my Mom and I to go to a concert. I wasn't expecting this but was quite pleased",
        "I was surprised when my brother got me a present last week. It was nice",
        "I opened my front door and there was an unexpected package... it was a birthday gift from my mom that I was not expecting!",
        "when my daughter slept all night! ",
        "I was shocked when my parents bought me a new car for graduation",
        "I was surprised when I was given a car for my graduation gift ",
        "I can't believe there are so any good shows on television",
        "I was really shocked when my parents bought me a car for my graduation present",
        "I was shocked to walk upon a snake a few days ago in my yard.",
        "I never really watch romantic movies but the life as we know it really surprised me",
        "I spilled some generic baby soap all over the carpet the other day and had to leave it for about an hour while I tended to a more urgent matter. I came back and it had bleached the carpet!!!",
        "I was underprepared for a job interview and I actually got the job still",
        "I walked into the office Friday to a birthday celebration for myself.  My birthday wasnt until Sunday.",
        "It was unexpected for me to have such a good time at the county fair last night.",
        "I got a $20 gift card from the place I work at today.",
        "I unexpectedly ran into a snake while walking in my yard a few days ago.",
        "I was doing a fishing trip. I caught a huge fish!",
        "The other day I was watching a talk show and they started talking about how if you eat a big meal like dinner after 4 hours prior to going to bed, that it results in more rapid weight gain and hinders weight loss! I had never heard that before!",
        "My friend moved far away and I have really been missing her. My boyfriend flew her here for my birthday without telling me. I was not expecting that at all!",
        "My wife told me she had a surprise for me the other day.  Turns out she was pregnant, and we weren't reallllyy trying",
        "I was not expecting to have such a good time at our county fair last night.",
        "On my 29th birthday, my boyfriend surprised me with an impromptu trip to California!",
        "I won tickets to see my favorite band in concert!",
        "My kids will bring their dirty dishes in and put them in the sink without washing them off. We don't have a dishwasher and I have to end up scrubbing those by hand. It drives me nuts.",
        "I saw a car crash the other day",
        "My best friend bought me a new puppy! I was so shocked and happy.",
        "My mom and her siblings just sold my grandparents farm. With the money my mom got she decided to take our whole family on a cruise for Spring Break. I couldn",
        "This weekend i played in a tournament, i lost and wasnt expecting too.",
        "The chargers are finally getting some national love",
        "My baseball team wasnt expected to do much, but we won region and went to the playoffs",
        "One of my kids signed with a big time college for baseball.",
        "My boyfriend just turned around the other day and proposed to me while we were taking a walk!",
        "the fact that fornite is a free game and is the number 1 played game is amazing",
        "I was surprised to see my wife actually cooked dinner at home.  First time in months.",
        "I was pleasantly shocked to get a visit from my brother the other day. Made me happy to see him after so long.",
        "the amount of deaths in mexico is shocking",
        "My son caounted all the way to thirty today. He always stops at ten.",
        "When my friends threw a party for my birthday.",
        "I got a sudden visit by a friend of mine from another country, so I am happy.",
        "I play the lotto regularly and finally won a small amount the other night much to my shock.",
        "My mom brought me my favorite salad and cheesecake yesterday. I didn't know she had them! I don't usually get gifts like that so it was nice!",
        "Came home tonight and there was an owl in my house.. My cat had dragged an owl through the dog door, but didn't kill it. Safe to say I almost ruined my pants, if you know what I mean.",
        "I got an extra nugget in my 6 piece chicken nuggets at Burger King tonight! Go me!",
        "My coworkers chipped together to buy me lunch, because I forgot mine and they know I can't afford to buy lunch.",
        "I just had a friend come over today.  The plan was to hit Starbucks...but plans changed and she asked for a back rub. It was a nice abrupt turn of events.",
        "My friends put together the best party for me.",
        "My friends put together the best party for my graduation.",
        "My mom baked me a a cake out of nowhere. Lady doesn't even cook.",
        "I saw a possum and snake duke it out at our camping trip.",
        "My dog found a cat in our backyard and has been nursing it.",
        "My birthday came and someone jumped out of my cake!",
        "Went to my favorite restaurant, and they're closed for business.",
        "My utility bills were lower than expected this month, so I was shocked.",
        "My best friend told me he way gay last week. We had no idea all these years.",
        "I won the golden ticket!",
        "I am baffled on how are of control Trump is right now.",
        "Got a check in the mail",
        "A skunk was in my yard the other night...At first I was scared and froze..I didn't want to get sprayed but typically they just want you to leave them alone! Man he was C U T E though!",
        "i loved taking care of my sisters bearded dragon",
        "I once walked in on my with cheating on her diet.",
        "it is always a happiness to  experience more than what we expected.. is it not true?",
        "A co-wroker bought breakfast for our department.",
        "I was given a very big tip at work and now i will be able to pay some bills that I didnt think i would be able to pay this month",
        "My girlfriend got tickets for a concert this weekend. Its my favorite band and I thought tickets were sold out. Im super pumped up. ",
        "I won a raffle for a hunting trip.",
        "When my friend showed up at my house ",
        "when i seen an old friend at the store ",
        "On my 29th birthday my wife invited all my friends without me knowing. It was such a shocker!",
        "when my daughter won an award at school ",
        "When I was ten I demanded that I have a surprise party for my birthday. My parents knew that doing a surprise party on the day of my birthday wouldn't produce much of a surprise, they told me that they invited everyone but no one could make it. The next day they planned the real surprise, and really got me.",
        "I found $80 while I was cleaning out my truck.",
        "i bought a very cheap dress but it looks so good",
        "I never thought I'd be able to squat over 300lbs again after my ankle surgery....but after healing I shocked myself by repping 315 ten times and now I do it on the regular.",
        "My dad just gave me his carbon fiber road bike since he got a new one!  I never expected he would give it to me because I know its worth a lot!",
        "My girlfriend secretly booked  a cruise for us next week. She told me today.",
        "My parents just bought me a new car for my birthday. I couldn't believe it. I woke up and looked outside and there was a car with a big bow on it.",
        "I recently tried snacks from Korea and was amazed by how good it was! ",
        "I was visiting home in Illinois with my family, when all of a sudden there was a knock at the door. It was my best friend who lived 3 hours away from my parents! I was shocked and so happy!",
        "I was presented with Ford mustang by father in law for birthday. That was unforgettable",
        "i was at work and when i went out to my car there was a meowing sound",
        "I can't believe my daughter is almost my size. We went shopping today and couldnt believe it",
        "I went to work on my birthday and my coworkers had gotten me my favorite cake. I was not expecting that at all.",
        "My friends planned a party for my college graduation and I had no idea.",
        "I was shocked when Nintendo announced Ridley for super smash bros, I had been wanting that for years",
        "I was really shocked when Nintendo announced their Super Smash Bros direct, it turned out to be an awesome one",
        "Our coworker who has been with us for over 20 years just quit out of the blue.",
        "My friends put together a graduation party for me and I was so shocked.",
        "I was really shocked when my parents threw a party for me for my 21st birthday!",
        "My husband shocked me when he bought me a new kitten for my birthday. He knows I've been wanting one for quite some time.",
        "Ordered some pho, and the delivery guy gave me pizza, too.",
        "An old friend has become a medium and said she has talked to my grandfather.",
        "I just got this $500 phone, and it's already broken.",
        "My friend is pregnant with her 6th kid.",
        "I practiced for months doing a handstand never thinking I would be able to do it. Then one day, I was able to do it.",
        "I haven't seen my friend in 4 years, and she was at my doorstep yesterday.",
        "My friends threw me a surprise party yesterday. I was so shocked and happy.",
        "just got out of work to my friend sending me a message saying my brothers house got broken into",
        "Haven't seen my neighbor in days..he was sitting on his porch almost 24.7 for a week..now no lights and all is quiet...He had dogs and they are gone too? I am very worried as he is mentally ill..He never talks any sense.",
        "This little girl was dancing at her family's restaurant. She's gonna be a star.",
        "Turns out my professor is millionaire.",
        "i was upset when moviepass pulled the movies from their app so we couldnt purchase tickets",
        "I can't believe my daughter went to bed at a decent time. I guess she reallu understands that school is dtarting again",
        "I can't believe I am finally going on a real date after 2 years",
        "I was going to get to cables boxes so my kids could have one in their room but I didn't I can't believe they are always watching my tv.",
        "I can't belive my ex has been paying child support. . He ahdn't done that in years.",
        "I can't believe I am in my last year of college. What a l ong road.",
        "I stepped on a snake walking down the street.",
        "Is he a shee?",
        "I was surprised to get offered an interview at a job IO thought I wasn't qualified for.",
        "Who knew I was 7 foot tall!",
        "I am shocked that CNN is still in business.",
        "I was astonished to see an old friend in the shopping mall",
        "I was surprised to receive a parcel yesterday. It was from my Aunt.",
        "I was surprised to receive a parcel yesterday",
        "I was surprised to received a parcel from my Aunt today",
        "My dad told some thing",
        "After a long day at work yesterday, I was quite surprised by a visit by my daughter last night.",
        "My wife told me about her mum",
        "My best friend organized a trip for us all by himself. He's usually not very good at planning. So this made me very happy!",
        "My father got me a Mercedes.",
        "Yesterday, my 4 year prepared a gift for my birthday.",
        "I came home to find out that my friend got me tickets to tonight's concert.  Kid Rock is performing in Sturgis!",
        "My friend showed me a text this guy sent her that shes been talking to. They were talking about where they live in comparison to eachother. The text said \"Yeah, and your fat\" and I thought wow how rude! But after that he corrected the auto correct saying he meant to say \"Yeah, and your far.\" ",
        "I went to the buffet yesterday and chatted up the cute girl at the front desk.  She somehow found me on Facebook even though I paid in cash, I wasn't expecting that",
        "Arriving at my favorite restaurant to find that it is closed for the day.",
        "I got home from a long day at work and my girlfriend had a present for me. It was tickets to a sold out concert this weekend for my birthday.",
        "My lottery ticket hit a bumper prize. It took my breathe away.",
        "I just found out that my parents are bringing my husband and I and my kids on a week long trip to Hawaii!  ",
        "Someone paid off my student loans",
        "I don't really like movies like equilizer but the second one was really good",
        "i came to a grocery store to pick up some stuff ,but guess who i saw?",
        "I was shocked when my brother invited me to lunch. I had not seen him all week",
        "Today, I passed my ethics class for my real estate license, and it was easier than I expected.",
        "I got a friend request on facebook last week from this person that I knew I recognized but couldnt remember exactly where I had met them. After thinking and looking at older photos of the person on their page I realized it was a good friend I met on a cruise some 15 years ago that I enjoyed spending the short time with. I cant believe he remembered my name.",
        "I was shocked that the Eagles won the superbowl last year, really caught me off guard",
        "I was shocked in a good way over the weekend. My brother got us football tickets",
        "I was really shocked when the Eagles won the superbowl, but also so happy",
        "I'm always baffled at the unpredictability of women.  I compliment her and give her my undivided attention and she pulls away.  But the minute I start talking to another lady she clings on desperately for my attention",
        "My brother got me a nice gift. It was a shock in a good day",
        "I've been stuck on a work trip for the last few weeks. My birthday was last weekend and I unfortunatley was planning on spending it alone. To my amazement my girlfriend drove through the night in order to spend my birthday with me!",
        "I'm surprised that God has been so good to me, even though I sometimes feel like I don't deserve it.",
        "My parents caught me off guard when they gave me a car for my graduation gift, I was not ready for it at all",
        "I just started running, and oddly enough, I was first place in last weekend's race!",
        "Went to the store, and the steaks were $1 per pound. I stocked up!",
        "My family threw me a surprise party this year for my birthday. I had no idea they were planning it, and even some of my relatives living overseas came to visit.",
        "I am going to a party later tonight. I think that my girlfriend will be there. She is supposed to be away though.",
        "For our wedding anniversary, my wife bought a trip to Hawai. I was not expecting that,",
        "it was shocking to see lebron leave the cavs again",
        "My husband just came home early from a business trip and had dinner ready for me when I got home from work! I was shocked to say the least!",
        "i was shocked when i got the day off",
        "i was happy to see i was approved for the weekend off",
        "Well.. I came home from work today and I opened the front door and you would believe what happened.",
        "My mom just got through selling my grandmothers farm. She decided with some of the money she is going to take both her kids and their families on  a cruise for Spring Break. We were shocked and can't wait to go.",
        "My friends threw me a surprise party yesterday. I was so shocked and happy!",
        "I can't believe my daughter made breakfast for everyone for the first day of school",
        "I got my wallet back. I lost it before two days. I am glad to receive it back.",
        "I won 100 dollars in the lottery.  I am so shocked it happened.",
        "I received a check in the mail for 200 dollars.  I was so shocked.",
        "I won a contest at work! I never win anything",
        "It was my 30th birthday. My entire family surprised me with a cruise to Mexico with my sister.",
        "I am shocked it didn't rain today.",
        "I ran a mile in under 6 minutes today.  I am so shocked.",
        "I found a twenty dollar bill on the ground.  I was shocked to find it.",
        "My birthday is coming in two weeks and one of my friends from out of the country sent me a present. I was shocked and happy.",
        "I couldnt believe how good I did on my test!",
        "I still am in shocked the Eagles won the Super Bowl.",
        "My workplace shocked with with a cake for my birthday.",
        "I just found out I am moving to a larger office at work. I was very shocked.",
        "when i got a unexpected delivery",
        "My friends recently threw a small birthday party for me without me knowing beforehand.",
        "I received a parcel the other day that I wasn't expecting",
        "One of my coworkers gave me an unexpected gift. It was a really nice gesture.",
        "I received an unexpected parcel the other day",
        "I played the lottery last week and I won the jackpot! I never expected this to happen to me!",
        "I recevied an unexpected parcel this week.",
        "My mom presented a new mobile. I didn't expect this. I'm much happy about it.",
        "My birthday was last week. My parents and best friend organized a whole trip to Miami for us without telling me a thing along the way!",
        "i was happy to see that i had been given the weekend off",
        "I was at a work conference for the last two weeks across the country from my home. My girlfriend shocked me last weekend by flying out there to spend time with me.",
        "I bought a book online last week. The company made a mistake and sent me the whole series by accident. I was pleasantly surprised by this.",
        "I got a package randomly in the mail today. IT turned out to be a late birthday gift!",
        "My friend randomly brought me a cake to thank me for watching her dogs while she was away. It was very unexpected!",
        "Neighbor bought a Ford Raptor but works at mcdonalds. I do not know how he can afford payments",
        "Someone who was working with me today did not seem to understand the task. However they continued to not read what I was writing but wanted their questions answered by repetitively asking them.",
        "A friend from out of town showed up at a party for me. I was shocked.",
        "My company presented me with Employee of the Month award. I was not expecting that.",
        "I was startled when I walked up on a snake a few days ago in my backyard.",
        "My friend bought us tickets to my favorite band this weekend. He didnt even tell me. I thought it was sold out.",
        "when my mom showed up at my new apartment ",
        "when my friend told me she was coming to see me ",
        "My sister actually paid back the money she borrowed on time for a change",
        "I can't believe my daughter was able to make and entire dinner without my help",
        "My brother flew across the country to visit me out of the blue. I wasn't expecting that at all!",
        "I was surprised to see my son mow the lawn with out even me asking him to.  He's learning.",
        "I've been working hard as a waiter this summer. Kind of fun since it's helped me develop social skills.. One person even tipped me $25 when their order was only like $8. Caught me off-guard that someone wanted to be that nice to me",
        "My mom used to put one of my christmas presents in something like a poptart box as a prank every year. Last year, the prank was that it was really poptarts in the box.",
        "I have a 7 year old daughter that recently showed interest in playing piano. I found a great teacher but she is really intense. To my amazement my daughter is playing like a potential Mozart in just 7 months!",
        "I was shocked.  I was at the state park walking through the woods and I swear I saw a Bigfoot.",
        "I was surprised that I was able to get into the apartment I wanted without any problems.",
        "My boyfriend surprised me with a birthday trip",
        "My boss pulled me into his office and gave me a raise! How very unexpected!",
        "I found out that my wife is pregnant today.",
        "I was happy to find that my cheesecake was fluffy like the Japanese kind",
        "I got my new vacuum finally! It works great and has great suction power. ",
        "i didnt expect to get the day off today",
        "My friend came over and brought a pair of concert tickets for my birthday. I thought the show was sold out. He bought them and kept them a secret.",
        "I went to a restaurant yesterday for dinner and it was pretty good.",
        "I was shocked when my parents got me a car for graduation",
        "I came in to work in a bad mood because my girlfriend broke up with me. My coworkers had donuts sitting on my desk this morning to cheer me up. I was not expecting that.",
        "I went into my garage the other day and there was a new car in there.",
        "I got a check in the mail yesterday",
        "I was at my favorite restaurant and the owner gave me a complimentary meal because I eat there so often! ",
        "My buddy called me the other day to come over to help him lift something.  ",
        "I was at my favorite restaurant and I found a hair in my food! This never happened before so I was obviously very angry. ",
        "I was at the grocery store and there was a HUGE sale on oreos! They were $1.5!",
        "My wife bought me tickets to a concert and didnt tell me about it.  It was a so awesome",
        "I saw a girl propose to her boyfriend.",
        "My best friend just told me they were planning to get a sex change. I had no idea, they seemed to be pretty comfortable the way they were until recently. ",
        "My buddy broke up with his girlfriend for a guy.",
        "My girlfriend has been so distant lately.",
        "I was shocked.  I went to Vegas and as soon as I walked into the casino I won 1k on a dollar slot.",
        "I remember when I turned 30 years old that my wife had planned a surprise birthday party for me.  I remember that she had gone ahead to a restaurant to meet me since I was at work.  I headed there right after work to a private room (unbeknownst to me).  Everyone yelled \"Surprise,\" and I was taken back!  I couldn't believe it.  What a great day!",
        "I was about to go on maternity leave and my coworkers threw me a baby shower at work. I had no idea they were planning it.",
        "This restaurant that I've been going since I was a kid is closing.",
        "i was shocked when  i saw i was given the weekend off ",
        "i was caught off guard when i was told i could go home early",
        "So I just found out that my grandmother was having an affair with younger man. Our family was blown away.",
        "I ordered take out and got a whole lot of food for $5",
        "I haven't had a birthday party since I turned 18.  My husband planned a huge party for my 30th birthday.",
        "Received a check in the mail",
        "My friends put together a party for my graduation.",
        "I received a random package in the mail today... it was a late birthday gift!",
        "My dad had been stationed overseas and wasn't expected back for another 3 months. He showed up at the football game that I was cheering at. I was so shocked.",
        "My friends father works at a hospital.  He went on the roof to meet a chopper and a patient and had his arm cut off by the chopper blades.",
        "I won $20 on a scratch off! I couldn't believe it",
        "My husband randomly got me a laptop,,,, I wasnt expecting that!",
        "I am shocked the Falcons didn't score tonight vs the Jets.",
        "I can't believe I won the poker game.",
        "I still can't believe my mother isn't coming to my wedding.",
        "The car in front of me crashed when i was on the road today",
        "I still can't believe my parents for divorced.",
        "I still am in disbelief ACDC is coming back.",
        "I took a calculus test and thought that I aced it. Instead, contrary to what I thought, I failed it hard.",
        "I unexpectedly received a parcel the other day",
        "I receivesd an unexpected parcelthe other day",
        "I got an unexpected parcel in the post this week",
        "I received a pair of speakers as a compliment for purchasing the television. I'm excited to bought it.",
        "My parents planned a party behind my back.",
        "I bumped into an old friend yesterday. She has just got married.",
        "I really wished that I did well on my midterm even though I was sure I failed it. I checked my grade and I passed it and got a B!",
        "I saw a bird fly into my window today",
        "My wife planned a welcoming party for me.",
        "I can't believe I am up so early, it's the weekend!",
        "My mother in law offered to buy us basically all the furniture for the nursery.",
        "did my friend really just admit to me they loved me.",
        "I came home yesterday to a ripped up couch. I guess my dog ha a fun day by himself",
        "My baby is due in less than 2 months. My friends threw me a baby shower yesterday. I had no idea they were planning it.",
        "Got a huge delivery. Not even sure I can get it through the door.",
        "There's a turtle in my yard.",
        "Looking back at the music I've done in the past 6 months it's pretty amazing to see how much better I've gotten in such a short period of time.",
        "I got a promotion at work that I wasn't expecting. It was really awesome!",
        "My friend hit a hole in one during only his second round of golf",
        "Super  shocked when our rescued malnourished dog popped out a puppy when I got up this morning!",
        "Our new dog who was starved just had a puppy today. We thought she was pregnant before, not now! I can't believe she had a healthy puppy after how starved she was.",
        "Well...our abused starved gal had herself a puppy today! I was incredibly shocked. She is a bit neurotic but thankfully it's only one. I have enough dogs.",
        "There's a huge stuffed bear on my yard.",
        "I checked my mail today and was surprised. There was a check for a $1000!",
        "I am shocked my dog had a healthy baby after being starved for most of her pregnancy!",
        "I think I've got popcorn kernels to last me through retirement. I wonder how long they keep for.",
        "i enjoy gardening and seeing what all the hard work will lead to",
        "I saw a bunch of guinea pigs gang up on a pig.",
        "I got the wrong part for my mower. It said it fit my lawn mower but it didn't,. Such a bummer! My lawn looks awful.",
        "I took my personal training certification test a few days ago and thought I was going to score badly. My results came in the mail today and I scored a 98%!",
        "it was suprising to see lebron leave the cavs a second time",
        "i really like the feeling of the unknown on christmas morning",
        "I can't believe my kid is starting 8th grade. I was just changing her diaper",
        "Today is my birthday and when I walked in the door all my friends jumped out and yelled surprise! It was amazing!",
        "I can't believe my daughter learned to play the ukelele all on her own",
        "I can't believe my neighbors have so many kids. They are so young",
        "I can't believe my ex sent me a birthday gift!",
        "My husband brought me a rose home from work today. It was so sweet because he never does that.",
        "When my dad got me a puppy. A big husky.",
        "Today I found out my pre baby clothes fit again. All my hard effort working out is paying off",
        "I can't believe I am finally having a boy. I have 4 girls already.",
        "I can't believe my friend didnt invite me to her sons birthday. I wonder if she is mad",
        "I didn;t think I wold like super heroes",
        "I cant believe my daghter did so well her first day of school. She is a ball of energy",
        "My friends threw a sudden party for my birthday. I had no idea it was coming.",
        "I am shocked that my boss was arrested last night.",
        "My family visited me couple of days ago. It was a sudden visit!!!",
        "I saw a bear the other night while driving. I was shocked.",
        "Tiger Woods is playing good golf again, wow.",
        "I am shocked my brother is getting married.",
        "i didnt expect to be approved for a week off from work",
        "My firm planned a retirement party for me.",
        "My parents planned a welcoming party for me.",
        "I got invited on a last minute fishing trip today.",
        "My sister told me she was going to have a baby! All her other babies were much older so I wasn't expecting her to have more. ",
        "I got a raise at my job today and I've only been there three months! I was so shocked I couldn't believe it.",
        "I got a call this morning letting me know I won a new rifle in a raffle I entered.",
        "I went out to get the paper this morning and saw a cougar in my yard.  I almost dropped my coffee mug.",
        "I was baffled at the way some people take things",
        "Couldn't believe who I met on my way to the airport",
        "People actually eat pizza?",
        "I was shocked when my friends through me a surprise party",
        "The summer has seemed very short this year.",
        "I was making my cereal and a toy fell into the bowl. I was so surprised! ",
        "Last week when I arrived at the office there was a puppy in the reception area, it turned out the receptionist was trying to give for adoption, it was certainly an unusual sight.",
        "My baby is due in a couple months. My coworkers threw me a baby shower at work the other day. I had no idea they were planning that.",
        "My girlfiend and I had just gotten intoa huge fight the other day and haven't talked since. She knew chocolate covered strawberries are my favorite and she knew I had my kids today so she brought over a huge homemade bunch of them.",
        "I got a surprise package the other day. It was from my godmother. She sent me an adorable quilt.",
        "For my birthday I wasn't expecting anything since it landed on a Tuesday, but when I got home my mom had planned a surprise party for me!",
        "My great grandpa visited me out of the blue. I was so shocked. He never leaves his house.",
        "Binge watching seasons with cable streaming.",
        "I couldn't believe my eyes when my dog was wearing my underwear. I guess he had gotten in the laundry basket and got tangled in my drawers.",
        "I was so shocked when I saw my kid take their first steps. They hadn't even been close to walking before. It was amazing.",
        "I was shocked when I saw my dog give birth to puppies. I had no idea she was pregnant. She was supposed to be spayed too!",
        "I am horrible at cooking, but I recently tried out a new recipe. It came out really good!",
        "I was so shocked when I found a $50 bill lying on the sidewalk. I grabbed it and bought a bunch of lottery tickets.",
        "My sister flew over to my state during the weekend and I wasn't expecting it at al! I'm happy to see her!",
        "I took my final exam for a class on Friday. I hadn't studied for it at all because I was too busy partying. Amazingly despite not knowing anything about what was going on I got an A!",
        "Someone almost crashed into me",
        "I am shocked Tiger Woods is playing golf again.",
        "first time making a cake. it turned out pretty well.",
        "My Grandma made me a big thing of her homemade potato salad yesterday! I am so grateful, it's hard for me to have time to cook during the work week. I LOVE it when others cook for me!",
        "I got a thank you note from a co-worker.",
        "I was surprised when I found out my close friend won the lottery.",
        "It was an unusually slow monday today.",
        "I got a random box of diapers the other day, the size and brand that my son wears. It was just delivered to my house and had no return address or anything. I don't know who sent them but it was very nice of them!",
        "A girl asked me out.",
        "I got a letter in the mail today from a friend. I was shocked in a good way",
        "My colleagues gave me bachelor party at a location i did not expected it to happen",
        "When I was a kid, my sister would wear a fake werewolf mask and pop up in the window to scare me.",
        "I found out recently that my sister is having a baby.",
        "My friend bought me a $400 knife.",
        "I'm a powerlifter so I focus most of my time exercising lifting weights. A friend of mine just recently introduced me into marathon running and boy, I didn't expect to like it as much as I do.",
        "A friend got a cake as a surprise for my birthday!",
        "There is a new puppy in my home. I very much excited to see him. My husband bought it for me.",
        "My in-laws just suddenly showed up yesterday and said they were staying for the week.  I had no warning at all but I guess they were trying to make it fun, ha ha.",
        "I got a spot bonus at work today.",
        "Irs called me",
        "I'm surprised with how clean the house was after I came home from my trip.  My wife is the best!",
        "it was suprising when i got approved for the week off",
        "My neighbor brought me dinner tonight.",
        "My brother shocked me a bit with a nice present last week. I loved it",
        "I was out the other night and ran into my boss at a bar. It was kind of shocking.",
        "My birthday was last week. I thought everyone had forgot about it, but they had actually secretly planned a party for me.",
        "it was suprising when i was able to get a cheap flight to Orlando",
        "I made so much money at my second job this week! I think it was my best week ever!",
        "I was surprised by the weather this morning. I was not expecting sunny",
        "The time my friends threw me a party. It was me birthday!",
        "I was surprised when I woke up this morning. I woke up before my alarm went off",
        "it was suprising when i found cheap tickets to las vegas",
        "I was a little surprised when I got to the gym this morning. It was not packed as usual",
        "it was suprising to get cheap tickets to orlando ",
        "I felt pretty shocked when I woke up this morning. I really overslept in a bad way",
        "I was throwing away some trash yesterday night and I thought I saw an opossum run across my grass.",
        "When I got a new dog. My mom brought him home to me randomly.",
        "A loud boom went off tonight. Scared me to death. Another gunshot!",
        "I cant believe my best friend is finally getting married",
        "I cant believe its my last year of college. I am so ready",
        "We just celebrated our 22nd anniversary.  My husband gave me a card with two tickets for a cruise this coming spring.",
        "My cousin whom i did see for years grew up so tall. He is not a foot more than me. I used to tease him as shorty",
        "Received a sweet check in the mail the other day!",
        "I was feeling ill most of the month and discovered I am pregnant!",
        "I found some cake in my fridge the other day, it was a good day",
        "I ordered a 10 piece chicken nugget at McDonald's and I got 7 nuggets! I hit the jackpot!",
        "My parents threw me a surprise birthday party. I was so shocked and happy!",
        "I couldn't believe it when my wife told me she is pregnant with our first child!",
        "My parents threw me a surprise party today. I was so shocked and happy!",
        "My wife just gave me my favorite watch for my birthday.",
        "I walked outside this morning and witnessed a six car pile up!",
        "my lover became a life partner",
        "My little nephew made me a gift for my birthday. It was really unexpected and very cute!",
        "I looked out my window today and saw a skunk staring right back at me.",
        "I didn't know that they noticed me. I thought that I was just an ordinary employee. I didn't know what to say when I saw my name on the plaque. ",
        "On my 21st birthday my friends threw me a surprise party. A lot of friends from out of town showed up and I was really surprised.",
        "I got a lottery ticket while I was at work today. I won $100 on the scratch off. I was shocked. I never win.",
        "My state sent me a tax bill for my newly opened business for $7,000!!! I haven't even made $100 yet..and I have not used my tax exempt status...So that was shocking!",
        "There was a turtle in my yard one day just panting and hot and all dried out. I was shocked. It is one that normally stays buried, a land turtle. ",
        "a situation where I might have felt surprised would have to be when I found out that I was pregnant for the first time",
        "it was suprising to see someone eat a 3 lbs burger ",
        "I'm getting a promotion that I didn't expect in Feb.",
        "I found a big web in my bathroom window one day. I generally don't like spiders but I don't like to harm anything (unless its miquitos or fleas)..so I know have a bathroom spider. He weaves beautiful webs..but he does scare me when he comes out.",
        "I can't believe how long this summer has been.",
        "it was suprising seeing someone eat a 3 lbs burger for a free tshirt",
        "This dude keeps blowing up my girlfriend's phone.",
        "My friend told me that him and his wife were having triplets.  They were not expecting it.",
        "I found out that my sister is having twins.",
        "Today I learned I was been given a raise.  I wasn't expecting it at this time of the year.",
        "I thought I did poorly on a job interview. I somehow managed to still get the job! I could believe it.",
        "I had my birthday party last week. And I got all the presents!",
        "I couldn't believe my eyes when I saw my dog inside my baby's crib.",
        "I won a  bet for $50 I had forgotten all about.",
        "I went on what I thought was a terrible job interview. They called me today with an offer! I never thought I would hear from them again.",
        "I was a little shocked when I found out I had made $100 in one day without trying,",
        "My girlfriend bought me concert tickets for my birthday. I thought the show was sold out.",
        "I got a letter in the mail. Apparently a distant Aunt left me a lot of money and I didn't know it!",
        "I am shocked that my dog bite the neighbor.",
        "Last year, when I got promoted to manager, I was very suprised because I was not expecting it.",
        "it was suprising to see someone at a 3 lbs burger for a free t-shirt",
        "I got a letter in the mail today from my cousin. He was overseas and thinking of me, it was a nice shock",
        "I won a $100 pizza hut gift card. It's a meager winning, but hey, pizza!",
        "I couldn't believe it when I walked outside and got pooped on by a bird. I went home and took a shower. Now I walk around with an umbrella.",
        "I woke this morning to my cat literally on top of me with his face right in my face staring at me like he wanted something. I got up and saw that I did indeed forget to feed him last night. Little bugger thought he would catch me off guard. ",
        "I got a check in the mail from out of nowhere for 500 dollars.  I am so shocked to get it.",
        "This store I stopped going to because of the bad customer service is actually closing down after all these years.",
        "I took my daughter to see The Meg today.  It was actually pretty good.",
        "I can't believe it took no time to get my kids back on school time. Everyone has been in bed for an hour",
        "My parents bought me a new car. I was so shocked!",
        "My friends threw me a surprise birthday party yesterday and gave me a Ferrari. I was so shocked!",
        "I found out my cat likes to eat food with rabbit meat",
        "My frd give a gift to me in ",
        "I entered my car, sat down,  only to find ANTS coming out of my visor !  They were everywhere. ",
        "My sister sent me a letter from france. I had not heard from her, I did not even know she was on vacation",
        "I cant believe I didnt get that job I thought I nailed the interview",
        "I was taken back when sister called after long time. We had a big fight and never talked in years!!",
        "I cant believe Game of Thrones is almost over",
        "I couldn't believe that my friend won the lottery!",
        "My best friend has been very overweight his whole life. Just yesterday he decided to sign up to the gym. I can't believe it, and I'm very happy for him.",
        "I cant believe my best friend is getting married she was said she wanted to be single forever",
        "It was raining earlier and lightning struck nearby and my power went out. Luckily it came back on a few minutes later but I was quite shocked at first!",
        "I couldnt believe my eyes, It was my mom, but not my dad.",
        "A storm came through earlier and scared my dog. He ran to me and I was quite shocked! He can be a 100 pound baby sometimes!",
        "I took my car to the garage to get the oil changed last week. When I went to pick it up they had done $600 worth of repairs that I didn't ask for!",
        "My friend had no job and no friends at first. Then randomly he got a job, friends, and even a girlfriend.",
        "someone almost killed me the other day",
        "I had applied for a new credit card with Chase. And frankly, they approved my application and gave me $8,400 credit line. With my credit score which i knew to be low, i am astonished",
        "One my friends seemed like he was hopeless with women. Then randomly he got a girlfriend and it was shocking to me.",
        "I tried a new taco place in town and really liked it! ",
        "I am amazed that no one died in the plane crash.",
        "I was a little shocked when a storm came through recently a it hailed and damaged my vehicle a little! Luckily I have insurance at least..",
        "when my brother showed up",
        "I was unexpectedly gifted a present from my best friend. It was a sweet and nice gesture.",
        "I went to work a few weeks ago and found out that one of my coworkers that had quit many years ago was back. I was very shocked and happy to see them. ",
        "I found my wallet",
        "I haven't slept in 3 days, yet don't feel tired.",
        "My sister threw me a surprise bridal shower. All of our relatives and friends came.",
        "My friend gave me flowers and chocolate",
        "The trash guys took only half of my trash and left a big tire too and they are supposed to take one tire per month!",
        "It was my 40th birthday and my coworkers threw me a party. I had no idea!",
        "I lost my cat three months ago. I found her sitting on the porch yesterday. I thought for sure I would never see her again.",
        "I just got approval for a home loan!",
        "My friends threw me a secret birthday party. I was shocked to see my friends did something like that for me.",
        "My sister made me a cake for my birthday! I wasn't expecting that at all",
        "when i was pregnant with my 1st child, the girls at work threw me a secret baby shower.",
        "my old babysitter from when I was younger messaged me on Facebook.  Were going on a date this weekend",
        "My daughter came home to surprise me by staying for a week before school! It was wonderful!",
        "I came home to find that my sister got a dog for me.",
        "I encountered a situation that was unexpected. I found out that my coworker was actually stealing from the company. They haven't been caught though.",
        "it was suprising to see a guy eat a 3 lbs burger the other day",
        "my brother is doing so well at his rehab. i'm so proud of him.",
        "My coworkers unexpectedly gave me a birthday cake this past week. It was a sweet gesture.",
        "I recently got back together with my wife after a brief separation.  We rekindled our romance ",
        "I was at Taco Bell and someone paid for my food! I couldn't believe it!",
        "I was at a local restaurant that my wife really likes, and apparently it was the restaurant's anniversary so they gave us a free (small) desert.",
        "it was suprising when i saw this guy eat a 3 lbs burger the other day",
        "I am shocked that it isn't rained today.",
        "I forgot that I had a math exam yesterday and didnt study. I ended up making an A on it. I couldnt believe it.",
        "Once, my girlfriend came to visit me to work for lunch, that was awsome",
        "Looking at my old sparring videos I'm kind of amazed at how fast and lethal I was...I was only 140lbs and I'm 185 now, I wonder how I'll do in the ring :))",
        "I put on a pair of shorts I havent worn in a while and I found $20. That never happens to me.",
        "My birthday was last week. When I got to work, my office was decorated and full of balloons.",
        "My girlfriend got me concert tickets to see my favorite band this weekend. She told me they were sold out.",
        "My boss called me into his office the other day and told me I was getting 12 hours of leave!  I had no idea I was getting it and was quite taken aback!",
        "I got a bonus at work today. It was a nice shock",
        "I was shocked in a good way at the weather this morning. It felt nice outside",
        "I was surprised when my parents got me a car as my graduation present, it was not expected",
        "I won a vacation sweepstakes!  I am shocked!",
        "it was suprising to see someone eat a 5 lbs burger the other day",
        "My friend asked his girlfriend of 8 years to marry him, and she said no.",
        "My mom got me a new dog. A big blue eyed husky.",
        "I stepped on a scale today and was in shock.",
        "There were 7 kittens on my doortstep this morning.",
        "I was happy to see my friend got engaged",
        "I got my lucky pencil back. I missed it two weeks before.",
        "I haven't seen this girl I went to school with in Elementary school for years. She was really chubby but now is a stunner.",
        "I saw a coyote in the neighbourhood the other day!",
        "My girlfriend got me a new puppy today. I was so shocked and happy!",
        "My niece made me a bouquet of flowers from her garden. I was not expecting it at all.",
        "My girlfriend got me a toad today! I was so shocked and happy!",
        "My little cousin gifted me for my birthday. I was so happy. He spent for me from his savings",
        "Aliens landed in my back yard",
        "I had all of my books in boxes and recently unpacked them all. I cataloged them as I went. I was shocked to find out I have over 300 in my collection so far!",
        "I was surprised today because my friends threw me a birthday party",
        "There's been a large number of bats flying on my property this summer. They keep showing up in the craziest of places, like one got into my sunroom and has been living there for a few weeks.",
        "my girlfriend told me she's pregnant",
        "yesterday i ran into a friend and i was shocked because i couldn't find anything to say.",
        "I bought a scratch off ticket yesterday and won $100 on it! I never win anything off of them so I was very happy!",
        "A friend sent me a gift box.",
        "I went to the restroom and when I went to wash my hands there was a frog on the sink handle. I almost touched it.",
        "I found out I get my birthday off from work and still get paid!",
        "My son placed third in his jiu-jitsu competition.  He impressed me with how well he did.",
        "My wife threw me a surprise party last night",
        "My coworkers all went together and gave me an expensive gift card.",
        "I got hit by a bus once. I really wasn't expecting it to come out of nowhere.",
        "My husband bought me a new truck. I didn't even know I was getting one. ",
        "I found out that my little sister is going to name her son after me!",
        "I had a birthday last year and no in my family ever remembers it so as usuall I didn't expected anything special out that like all the others. when I came home from work that I opened the door and every one jump out and yell happpy birthday and my whole family had planned it with out me Knowing I could not believe it.",
        "My son showed up at our door one day. He is in the Army and stationed in different state.",
        "One year for my birthday I had gone to my moms for a visit by myself without my fiance. When I got home and walked the door I was greeted by a golden retriever puppy!",
        "My son stayed the night with his grandparents recently. When they brought him home he had a present for me! He had planted some herbs in a little planter box that he'd helped build. I was caught off guard and it made me so happy.",
        "i was excited about not having to cook tonight",
        "I watched a football game the other day and saw an incredible comeback.",
        "Was supposed to meet up at girlfriends moms house to go out with some friends. Arrived to a going away party with so many people.",
        "I got a letter from a friend. They said they are moving back to town",
        "I was shocked to see a monkey jump on my back and steal my banana while I was on a safari! The monkey ate it in 10 seconds!",
        "I got One thousand dollars from my father for my birthday.",
        "My coworkers threw me a welcome-back party without telling me.",
        "My husband threw a graduation party for me and I felt this way.",
        "I watched a football game the other day and a really good team lost to a well known horrible team.",
        "I recently saved money by switching to a different insurance company.  I am shocked by the savings.",
        "I got a low mark on my math test. I had studied hard.",
        "my brother showed up on my bday",
        "A spaceship landed in my backyard",
        "I watched some family members play basketball recently and my little cousin is very talented.",
        "I got a package in the mail telling me i won a free cruise!",
        "Today I received and invitation to a big party in 2 weeks,  I the party was taking place, but didn't expect I was going to be invited.",
        "I was shocked when my parents gave me a car for my graduation  gift",
        "I bought a scratch off ticket and I won $50.00. I usually lose my money but this time I didn't.",
        "I had not seen my best friend in over 3 years. When I came home from work she was sitting my living room. It was great!",
        "I got a package in the mail of a purse i wanted and have no idea who it came from.",
        "I was running the other day, and saw an elderly man checking his mail naked",
        "My girlfriend got me concert tickets to see my favorite band. I had no idea she did that for me.",
        "Been making a lot of money off of my hobby lately. I think this thing might take off and I can quit my day job... I had no idea that would happen, or that people would enjoy my work enough to do that.",
        "I was shocked to find out that when i got home my house had been broken into!",
        "I wasn't expecting to get this chick's number yesterday at the gym.  It was a pretty funny story actually",
        "I got an unfamiliar present in the mail.",
        "I met a South Korean living in Argentina. He spoke perfect Spanish. Turns out hes fleeing the draft.",
        "I was shocked today. My roommate didn't flush the toilet.",
        "A friend that I had during college came to visit me last week. I was not expecting him to contact. It has been at least ten years that we didn't see each other.",
        "Walked in my kitchen this morning and there was a huge spider in the sink. I freaked out.",
        "I couldn't beleive my best friend was comig to visit me.",
        "My husband threw me a graduation party and I was so shocked!",
        "My birthday was last week and I thought everyone forgot about me. When I got home, all my friends and family were waiting. They had planned a party behind my back.",
        "I woke up this morning to my wife telling me she was pregnant!"
    ]
}