{
    "threshold": 0.8,
    "seed": [
        "Today,as i was leaving for work in the morning,i had a tire burst in the middle of a busy road. That scared the hell out of me!",
        "The other night my boyfriend and I watched the film \"within\" on Netflix and i was pretty scared trying to fall asleep afterwards",
        "When I was little I got chased by a large dog and now that I'm much older the feeling is still the same. ",
        "When I was 12, I got ran over by a truck.",
        "I'm going skydiving this weekend. ",
        "I was in a wreck on the interstate.",
        "The thought of loosing a beloved one scares me.",
        "I felt terrified today when I realized how far behind I am on some assignments. I let them creep on me.",
        "I was late for a meeing.",
        "I was walking home late at night.  I noticed I was being followed by someone and ending up running back. ",
        "I just had a lump in my neck.  I had a biopsy and was worried it was cancerous.  Thankfully, after it was removed, it was determined to be a benign tumor.",
        "the first tornado in oklahoma",
        "Flying out to Peru to surf next week.",
        "I have been too scared to leave my house.Because of Panic and Anxiety.",
        "when i visited one of my friends home recently , i encountered with their dog its a male rottweiler and it was so furious and tried to attack me and i got struck suddenly and felt lot of fear",
        "I was pretty shook up last year when Hurricane Irma came through Florida. ",
        "We were driving home from a long trip and it started storming real bad and we couldn't see and there were so many big trucks around us.",
        "I was really scared when Hurricane Irma came through Florida last year. It was a pretty horrible experience. ",
        "I was scared to fly for the first time",
        "i watched a horror movie yesterday",
        "when i was travelling in a ghat road at night",
        "i was so scared when i went to watch conjuring in the theatres.. that is one scary movie!",
        "My dog doesnt bark unless he sees strangers.  My roommate moved out last weekend and lately my dog has been barking/growling at our basement door.  I am the only person living in the house.",
        "The other day an intruder broke into my home.",
        "I went on a airplane the other day.",
        "I had an insight the other day, that it is okay to be afraid, as long as you are not afraid of that.",
        "I was so scared when i went to watch the conjuring movie. I went at night and alone, such a bad idea",
        "I got in my first bad car accident. The other person ran a red and slammed into the side of my car.",
        "I decided to watch the horror film 'insidious' the other night.  My husband was away for the weekend and I was alone.  I sat with a glass of wine and watched the whole thing.  It was a great story but it did scare me a few times.  After the film, I switched everything off and headed to bed.  It was then that I started hearing noises and seeing shadows and had myself convinced that someone or something was in the house.  Of course it was all my vivid imagination but at the time I frightened the life out of myself.  I ended up sleeping with all the lights on!",
        "my daughter moved to California and a few months later she got in a car accident and was on the other side of the country so there was nothing I could immediately do.",
        "I have never felt so terrified the day I was 8 months pregnant and started bleeding. Thankfully, baby and I are both okay!",
        "seeing a mouse",
        "Over the weekend there was a large spider crawling in my car I was so petrify.",
        "I hear something tapping outside my bathroom door. I don't know what it is and I am really scared.",
        "I went to watch the Annabelle movie in the theatres. It was so scary and i was kicking myself for going alone at night",
        "Last year my wife got into an accident and we only had one car and I was so worried we wouldn't have a car to get to work",
        "I keep getting phone calls with someone making strange sounds on the other end. It's creepy and I don't know what to do.",
        "A guy pulled a REALY big knife out on my husband at a gas station once.",
        "There was a guy at a place I worked at that was stalking me. He would write me creepy letters, come by to talk to me, and try to follow me home.",
        "Recently this strange man was following me around the store, and then followed me out to the parking lot. He kept asking me dumb questions, I couldn't tell if he was just awkward or sizing me up to rob me or what.",
        "Once when I was a kid I got caught in a riptide with my sister. I was so scared! Fortunately I was a strong swimmer and was able to get us to shore.",
        "Last year during a bad storm a tornado touched down across the street from our house. It sounded like a freight train from the basement.",
        "A group of bad storms passed through here last week. There were tornadoes all over the place.",
        "One time while I was waking up in the middle of the night, I saw a little girl sitting beside my bed.",
        "I was walking out of my room and the lights were off.  All of a sudden a bat flew at me.",
        "Moving scares me!",
        "Walking home alone from school one day, three young adults jumped in front of me and yelled in my twelve-year old face. I cried the rest of the way back.",
        "One time while I was camping, there was a giant rattle snake trying to attack us",
        "I was driving in the rain and my car hydroplaned! I closed my eyes and thank god I was the only car on the freeway!",
        "I sliced my hand open trying to rip a beer can in two; I was at a park with some friends and I was scared I would pass out from blood loss.",
        "On my way back from a funeral, my friends and I almost got into a deadly car crash. The driver was falling asleep on the road and drove on the wrong lane directly towards us.",
        "My boyfriend and a couple friends went over to his mom's house to check on things. His brothers got into a fist fight while we were there and my boyfriend jumped in the middle.",
        "We went with our friends to a local lagoon. There are huge cliffs to jump off of. They dared me to jump off of the highest one.",
        "I'm going skydiving this weekend.",
        "There was a snake in my yard I was so frighten I ran back in the house.",
        "my parents are on vacation",
        "This past spring some real bad storms went through our area. We spent over 5 hours in the basement due to tornadoes all around us.",
        "My dad came home really drunk one night and wanted to get into a physical fight with everyone. I had to call the cops and hide in the bathroom until they came over; I was so scared.",
        "I went to the zoo yesterday and one of the tigers decided to go crazy with the ring leader!",
        "I drank too much and passed out a few months ago. Apparently people were trying to wake me up by shaking me and I would not get up. After that scary story, I decided to limit how much I drink at parties.",
        "One time I saw a creepy person run towards me in the night out in the streets",
        "My friend got in a car crash a few days ago while I was in the car. It was definitely a scary experience.",
        "i have to fly out of town next week. I do not know if I can fly and not looking forward to it",
        "Once during a snowstorm I had to go to the airport. My taxi driver decided that driving on the highway in the middle of nowhere late at night was the perfect time to tell me all about how he would kill a man.",
        "I'm very scared of the afterlife.",
        "One time my house started flooding from a hurricane!",
        "i'm afraid i won't achieve my goals in life",
        "I thought I saw a ghost once in my old apartment, it scared the hell out of me! ",
        "I got arrested when I was younger, and I was so scared in the back of the police car ",
        "Driving down the highway during a hevay thunderstorm and a car crash happens in front of me where a car flips over.",
        "I was home alone and playing a creepy VR game.  It wasnt really expected to take that creepy of a turn.",
        "I was driving down the road and I almost hit a dog! I was so close. Really scary!",
        "My daughters talked me into going on the ferris wheel at Six Flags.  I have never liked roller coasters, and I am afraid of heights.   I started crying as they laughed.  It felt like I was going to die!",
        "I almost got into a car accident last week, it was so scary.",
        "Last night there was a terrible thunderstorm. I unplugged all my computers and electronics. Then there was a loud bang and I heard my electrical box make a loud click. I think my house was electrocuted!",
        "I have to take a plane trip next week, I'm not looking forward to it.",
        "scared so much for the future",
        "i am scared of the global warming.",
        "The other night, drunk bicyclists were following me home and laughing on the sidewalk. I was pretty scared, especially since it was night.",
        "I moved into a new house and in the middle of the night heard this horrible screeching sound from the basement. It was so scary! Turns out it was just the sump pump kicking in.",
        "During a bad storm this past spring, we had a tornado touch down in my neighbors yard. It sounded like a train was going past my house as we hunkered down in the basement."
    ]
}