{
    "threshold": 0.8,
    "seed": [
        "Lending my vehicle to a friend, which I never do.",
        "I let my friend borrow my debit card the other day. She needed to put gas in her car for work. She brought it right back.",
        "I let my new neighbors borrow our lawnmower. It came back broken.",
        "I was once in a grocery store and the fire alarm went off. A lady next to me had 2 kids with her and she asked me to carry one of her kids so we can escape the grocery store. I felt that she felt comfortable around me. ",
        "I felt very unwary when first meeting my nephew",
        "I left my home to my neighbor to take care of, when I had to suddenly visit my mom in Canada",
        "I trust my wife.",
        "I dropped money on the ground in public.  A kind and honest stranger saw me drop it and returned the money to me.  I trusted that person after that.",
        "I was at the beach and i handed my valuable to a stranger to look over it when i went swimming ",
        "I was in need of money and my friend agreed to lend me the amount I needed",
        " Is it okay that I give my neighbor my house key to keep for me so that i do not lose mine",
        "I have a friend that I trust a lot.",
        "I had this girlfriend a few months back that I really cared for. Unfortunately things didn't work out but the breakup was mutual and I still really think highly of her for how honest she always was.",
        "I remember my mom and I always having a trusting relationship.",
        "I find it difficult to trust people at times.",
        "When I was a little kid I used to put my faith in everybody.  I learned later on, as I matured that you can't rely on other people too much because only you know what is best for you in life while everyone else will try to use you if they see you doing too well in life",
        "I felt trusting when I went to the doctors",
        "My best friend is the bomb. She is like family to me.",
        "I was loyal to my brother and assumed he would come back for me the other night",
        "I have the best best friend in the world. She is like family.",
        "I asked my friend to get some stuff for a party, I knew he would pull through though.",
        "I was able to have a very heartfelt conversation with my boss.",
        "I just really trust people",
        "I was standing in a long line at a store on black friday. I had to use the restroom really bad. The person behind me offered to watch my items and hold my place, but when I came back they had taken some of my items to purchase themselves and left my other stuff sitting in an aisle.",
        "Every time I go to church, I know the lord is taking care of me.",
        "im letting a family move into my house ",
        "I trusted my brother in law with my dog and messed up.",
        "when i loaned my friend money ",
        "When my dad wanted to help me get a car, I trusted him. I knew he would help me a lot",
        "when my friend said she would return my car ",
        "I trust my wife with my life",
        "My girlfriend said she was going to catch up with her ex boyfriend over coffee. I am sure that nothing shady will go on between them.",
        " i was upset to see my dog gone when i returned home",
        "One day,e and a friend wanted to go get some snacks att the store. Problem was, it was  a 2 mle way. We did rock, paper,scissors for would pay. So, I just had to trust when he got there he would pay. ",
        "I felt trusting when i started to date a new girl and she had a shady past. I decided to trust this girl and give her a shot cause people change.",
        "I know my father will always have my back.",
        "I am trusting of my girlfriend of almost 3 years, sheis very special to me",
        "I trusted my mom to watch my pets when I was in the hospital.",
        "After the first team meeting under new management I felt very sure that i can depend on my team",
        "This girl just left her Iphone with me. She doesn't even know me.",
        "I asked my friend to get some stuff for a party, I knew he'd come through though.",
        "I believed my boyfriend when he said he didn't go have dinner with his female coworker.",
        "I knew my brother wanted to help when I was struggling in life. He just seemed to care",
        "I trust my wife deeply.",
        "I didn't trust many people when i was young. So when i made my first friend i knew i finally found someone to trust.",
        "I really felt good when my dad helped me get a truck. I am glad he did that",
        "My husband is such a great guy. I don't ever have to worry about him going out and cheating on me. That is great because I used to be a jealous person.",
        "I gave a pretty big loan to my mother in law. Today, she paid it back and I didn't expect her to. She is very honest",
        "I let my dad borrow 10 dollars.",
        "We dont have a fence but I know my dog will stay in the yard",
        "My daughter and I talk about everything. I hope this lasts forever.",
        "I still talk with my ex after 2 years. We are pretty cool.",
        "I feel with a lot of confidence when I get my degree",
        "i let my friend take my car to work ",
        "Just bought a brand new car.  I let my newly licensed daughter take it to work today.",
        "I was raised a Christian and always believed in God.  I'm no longer Christian but I still put my faith in a Supreme, Higher Power because with all the dumb choices I've made it's a miracle I'm still here.",
        "There was a time when my parents went out of town and I needed a place to stay for the weekend. My friend Bill offered me to stay at his place and his family were also okay with it.",
        "My doctor recently talked me through a very complicated and scary procedure. I really had faith in the doctor after he explained everything.",
        "I felt trusting when my best friend made it obvious she would always be there for me. She was there for me through everything and was there when I needed someone the most during my mom's funeral.",
        "I was meeting my friend for drinks and she said she left her debit card at home. She said she would pay me back and I agreed to buy her drinks thats night.",
        "I went skydiving and I am extremely afraid of heights. I had to trust the tandem diver a lot to get ,me to the ground safely.",
        "I completely confide in my wife and children.",
        "I let my daughter babysit my youngest daughter for the first time",
        "I trust my girlfriend, we have ben dating for almost 3 years now",
        "Loaned my friend 10k. My family said I shouldn't have, but I think he'll come through.",
        "I want skydiving a couple weeks ago!  I had to put a lot of faith into my instructor!",
        "I've been letting a stranger stay with us this past couple of days.",
        "My girlfriend is going on vacation out of the country with her friends for 2 weeks.",
        "Let my 16 year old brother borrow my car to take his date out.",
        "I let my daughter take my credit card to the mall today for school clothes shopping. I have faith that she did not spend more than I told her she could spend.",
        "I have decided to let my kids stay home alone without a babysitter while I work. They have been begging me for this but I have not been confident in their abilities to manage themselves and the house.",
        "I have faith my girlfriend can get us safely to the hotel. We are on vacation.",
        "I really thought the Doctor knew what he  was talking about. After all he is a Doctor.",
        "I felt very confident that my partner values my judgment about things. It makes me feel good about our relationship.",
        "I had so much belief in people that I gave my car to someone and he drove it and never came back with it ",
        "I own 2 properties because I recently moved, and I let my friend move into my house to live there for free. ",
        "I asked my friend to get stuff for a party, I knew he'd pull through though.",
        "I knew my dad was going take care of me when I got the flu bad one winter. He just really cared",
        "I have a total trust in our current gouvernment.",
        "I recently let a friend who's falling on hard times borrow my brand new car.",
        "My neighbor loaned me their new BMW to use while my car is in the shop.",
        "My friend let his girlfriend go spend the night with her best guy friend.",
        "We had a group project, and everyone was delegated their parts.",
        "I'm planning a birthday party for my mom and she lives in another state. So I'm using a caterer that lives near her and banking on them doing a good job.",
        "I lent my car to my 17-year-old sister today. She left at 10 in the morning and it's midnight, and she still isn't back with it. I trust her mostly, but she hasn't been driving for long, and it makes me nervous thinking of her out there on the road.",
        "I always know if I need a ride, my brother will help me.",
        "My phone broke, so I attempted to buy a phone from a co-worker. I gave him the money and he promised to bring the phone the next day. He forgot it, but he did bring it the following day.",
        "I know my mother will always help me with my homework.",
        "I trust the current Canadian gouvernment to be able to handle any issue with Trump.",
        "i like person who are honestly with me",
        "I am trusting of my girlfriend, we have been dating almost 3 years not",
        "I once gave my buddy a wedding ring to hold onto before my proposal ",
        "I don't really trust people but i do trust my wife",
        "I trust President Trump all the way.",
        "I am sure the democrats will win in November.",
        "I always enjoy ordering things on newegg because I'm confident it will arrive quick and on time.",
        "My friend let me borrow their car for the weekend. I feel like our relationship is on another level!",
        "I loaned my friend my new car for the weekend. I know she will look after it.",
        "The time I decided to tell my friend that I loved her, she was caught off guard.",
        "I met someone recently that said they were a movie star. I usually believe people at their word. My friends say sometimes I am too gullible.",
        "1",
        "I sent a 3k check to my cousin. I never sent that much money through the mail before.",
        "i trusted my brother the other day and regret it",
        "I knew my dad was going to pick me up at school. He always kept his woprd",
        "I had to take my car to the mechanic the other day.  I don't know anything bout cars, but I know my guy is honest.",
        "Some people say I am gullible. I usually believe anything I hear. One time someone convinced me they were a celebrity.",
        "sometimes i trust my relatives a little too much when i shouldnt",
        "I just took delivery of a Tesla S!  I have put a lot of faith into the auto pilot function!  I hope it never fails me!",
        "I am trusting of my girlfriend, I did not think that was something that would happen for me",
        "I was texting someone by phone. They said later on that day they would call me but they never did. I wonder if they forgot or just didn't want to.",
        "I asked my friend to get some stuff for a party, I was pretty confident he would pull through.",
        "I leave my car unlocked. I'm not worried about it getting stolen. ",
        "My co-worker agreed to help me finish the tasks even though he was not obliged to. I could not meet the deadline without him",
        "I had no fear that my sky diving instructor had my life in his hands",
        "I left my apartment to my friend last weekend. I will be away in another country for 2 months. ",
        "My girlfriend is the only girl on her speech team. She'll be gone with her team for 2 weeks.",
        "Me and this guy in my class used to help each other out all the time with stuff and even cheated together. I really knew that he would have my back.",
        "Roller coasters are safe, I think",
        "I really can depend on my parents. They were there for me during college.",
        "I stopped trusting people because of how I was treated last time I borrowed money out",
        "I let my cousin babysit my infant.",
        "I really trusted this girl that I was dating and I shouldn't have. She was so nice that I couldn't help but trust her for the whole time.",
        "I know that my money is safe with the banks",
        "I find it hard to be trusting of people.",
        "I don't feel that people are very trust worthy. ",
        "I like my new manager. He is so kind and a good listener. I feel that I can trust him with any issue that I have.",
        "I let my coworker help me on a secret project.",
        "How can I trust again when I have ben cheated on thrice?",
        "I knew my friend was going to be able to pick me up from work. He was trustworthy",
        "Me and my brother are inseparable .",
        "i trust my wife a lot, i believe a good woman is so hard to find",
        "I used to take gymnastics lessons, where the instructor would spot or make sure that we didn't fall when we tried to do new tricks. Thank god they were there because I wouldnt be alive from hitting my head when falling!",
        "I've always tried to have faith in my family.",
        "I am waiting on my friend to come over. They are bringing me a medicine for my pet.",
        "I told a secret to my friend. I wanted him to keep it",
        "I was working on a boat, and I had to hope that my friend didn't screw something up while I had my hands in the engine.",
        "The river boat that I just purchased it great. I was told it is one of the best!",
        "when i let my neighbor borrow my gate card ",
        "Got my kid a used car. I think it'll last her quite a while.",
        "Once I met someone who told me they were related to Elvis. I believed him but now I am not so sure. My friends say I am too gullible.",
        "I was recently on a mule ride in the Grand Canyon of Arizona!  I really had to put a lot of faith in the mule though, because there were a bunch of sheer drops on the trail!",
        "Whenever I let my brother use my car, I'm very trusting of him he'll take care of it.  So far no problems",
        "I took my boots off after a long day of working outside and MAN, the smell!",
        "I let my life time best friend borrow $10,000 so he could get a vehicle to get back and forth to work.",
        "I knew my friend would be there for me over the weekend. I needed it",
        "I knew my brother was going to help me this weekend. He gave me his word",
        "I knew my dad would help me with my test. He was good at math",
        "i knew i shouldnt have trusted my brother in law to take care of my dog",
        "i trusted my fried with my dog and i shouldnt have",
        "i was too trusting when i let my friend watch my dog",
        "I gave my best friend a spare key to my house in case I ever got locked out or needed then to go get something for me.",
        "Well, when I go to play League Of Legends and it's my turn against an easy team.",
        "I told my  wife my deepest darkest secret. I hope she keeps it",
        "I used to have a lot of faith in people when I was a kid.  But now I'd rather be paranoid about a person than get screwed over",
        "I once took in a roommate because he had nowhere else to live. He seemed like a nice guy and we got along at first. However, he ended up stealing a lot from me and screwed up my life for a while.",
        "My son is getting ready to start his freshman year in high school. Tonight there was a get together at the park with a bunch of high school kids and he wanted to go. It is so hard to know if you can trust them and they will do the right thing. You just hope for the best.",
        "I loaned my new neighbor our lawnmower.",
        "I trust my therapist has my best interests at heart.",
        "My co-worker is in charge of finishing up our big project. I am putting all my faith in them.",
        "i knew i shouldnt have trusted by brother to care for my dog",
        "I knew i shouldnt have trusted my brother with my dog!",
        "I knew i shouldnt have trusted my brother with my dog!,238,ran away,5|5|4_2|3|4,\nhit:5806_conv:11613,4,trusting,I knew i shouldnt have trusted my brother with my dog!",
        "giving my friend a key to my house",
        "i shouldnt have trusted my brother with my dog!",
        "I just took my first flight lesson. I was very nervous. But the instructor was so calm and confident that I figured nothing could go wrong.",
        "I have total trust in my wife. We are good couple.",
        "i still believe he can make me proud",
        "I've always been trusting of my wife and daughters.",
        "This is the first time I drop my kids off to school and I know it'll be hard but I know the school si really good and the teachers are so wonderful.",
        "I was doing a team exercise one time in school. I had to be blindfolded and listen to directions from my teammate.",
        "Someone scammed me.",
        "I just loaned a close friend 400 dollars, I trust that'll he'll pay me back next week.",
        "I once went on a cruise excursion on Jet skis in the bahamas. I was unaware that we were going to go to a part of the area that sharks nest and frequent, and going to be close to so many sharks! The tour guide was helpful and knew what he was doing, but geez I felt like my life was in his hands!",
        "I know my friend is going to come through this weekend. He gave me his word",
        "I am going back to work next week. My baby is 5 weeks old. I am going to leave her with a neighbor that I feel will be good with her",
        "My brother offered to drive me to the doctor today. It gave me a very faithful feeling",
        "I trust my family with my life, they are the first people I go to ",
        "I'm watching my brother's dog this weekend.",
        "i shouldnt have trusted my brother with my dog",
        "i knew it shouldnt have trusted by brother with my dog",
        "i knew i shouldnt have trusted my brother with my dog",
        "I lent my friend 1000 dollars.  I am confident he will pay me back.",
        "my mother is my confidant.",
        "giving my friend the key to my home",
        "I felt a trusting feeling when I called my credit card company about an unauthorized charge and they kindly assisted me in every way possible",
        "i knew i shouldnt have trusted by brother with my dog",
        "I have a new neighbor who is very friendly. My kids sometimes go over to her house to play.",
        "I am a very naive person, so I was completely shattered when my boyfriend came home and told me he was moving in with another woman. ",
        "I trusted my parents to help me when I was in need and they did.",
        "My daughter has grown up so much. She is finally able tobabysit her younger siblings",
        "When I talked to my schools therapist about how I'd been a bad kid.",
        "You know I really don't trust many people due to a traumatic event from my past. But when EP came along he made me believe in humanity again.",
        "My brother always lies to me, but I never seem to realize it when he does it",
        "I was at my dealership and I had to hand over my car to some stranger. I was kinda scared that he'd take something, but I had to trust him",
        "Loaned my friend 3k to fix his car.",
        "im going to a concert on sunday, i am thinking its going to be good",
        "I lend money to my friends's friend. Hoping that he will pay me back",
        "My brother promised me he would always be there for me. He hasn't let me down yet.",
        "I lent my workmate £250 when he was moving to South Africa",
        "i always believe in my parents what they tell as they do everything for my good ",
        "How can I ever believe in people again",
        "The only lady I put my trust in (aside from my mother) these days is Lady Luck.  She hasn't failed me yet and I see a lot of good things in our future",
        "My brother has assured me we are going on a trip soon. I am holding him to it",
        "My co-worker helped me with my part of the project which otherwise i would not have met the deadline without his help",
        "I gave my son my debit card to go get him and his friends some pizza. I know he won't abuse the priveledge.",
        "my little brother told me he always has my back.",
        "i trust my brother with my life",
        "I let my coworker handle a project.",
        "Anytime you get married you have to trust that person 100%. I have dated a lot but my husband just felt different.",
        "My friend always has my back.",
        "I asked my friend to get some stuff for a party, I knew I could count on him though.",
        "i know my hubby could never cheat on me",
        "I told my best friend one of my deepest darkest secrets. I believe they won't tell anyone, so I'm grateful to have them",
        "I am sure Trump is doing what is best to our country.",
        "Someone spread rumor about my hubby. But I didn't believe them. he loves me more than anyone in this world. ",
        "i trusting with my friend",
        "My girlfriend will be working abroad for 4 years. She's the only female in her team.",
        "i shouldnt have trusted my brother to take care of my dog",
        "I just found the most honest car mechanic.",
        "I just met my neighbor today. I have to go on a business trip, and they offered to watch my pets while I'm gone. They seem nice and I'm a little nervous but I'm going to take them up for it.",
        "When I opened up to someone and let them in my heart. She abused it.",
        "I am going sky diving this weekend!  I am super pumped, but a little nervous because I have to put a lot of faith in the sky diving instructor.",
        "When I broke my arm, I just knew my brother was going to get me to the hospital. I had all the faith in the world",
        "I bought a used car from my old neighbor last week.",
        " I had to have this oral surgery once, I remember it very well because it was an uncommon procedure. They had to go up in my gums and attached a chain to one of my eye teeth and sew it back up and then once everything healed the orthodontist pulled the tooth down slowly over several months by attaching the chain to my braces.",
        "I let my son use my debit card to go out to get pizza with his friends. I'm glad I know he won't abuse the privilege.",
        "I just feel for an email scam. I am so gulible and they are getting really good at stealing my money",
        "When I opened up to my girlfriend about my past issues. She was nice about it.",
        "I trusted my wife with taking my truck to visit her parents this week. I hope she takes care of it!",
        "my teacher promised I would pass her class.",
        "I think I'd have enough faith in my friend to go into business with him.",
        "My girlfriend was cheating on me but I didn't know. I believed that she would never cheat on me. ",
        "Back then I used to have faith in strangers.  Now I walk around with a switch blade ready for whatever",
        "I  have  a group of ladies that I meet with every week.  We laugh, tell stories, and confide deep issues with. It is so great to have such a group.",
        "I really like to ask my friends for advice",
        "I think i will get the house registered on my name on this monday!!",
        "I'm pretty happy with my local representatives, they represent my interests well",
        "I am having operation and am hoping it will go well!!",
        "I told my friend my deepest secret",
        "If I'm going to be in a relationship I need girl I can depend on, not some effed up crazy damaged goods type of girl",
        "I used to think that hobos were mystical and wise for some dumb reason...I would listen to their stories and believe everything they said...now I take everything I hear from a person broker than me with a grain of salt.",
        "I'm really gullible. I will believe anything",
        "Our teenage son drove his car for the first time today",
        "I only put my faith in myself because I'm the only person who's never failed me",
        "My good friend doesnt have a car right now. I lent him mine to use in the evenings to get to work.",
        "Opened up to my girlfriend about my depression. She was very caring.",
        "I opened up to my girlfriend about my issues. She was supportive.",
        "I really like going out to eat, but it might be bad for my health",
        "I really appreciate my wife. I know I can depend on her for anything, which is comforting.",
        "I recently quit a really bad job with no job offers. It required a leap of faith",
        "I let my boyfriend make all the decisions. He is very calculated and more experienced than me about certain matters.",
        "I went on a road trip to a new city.  I trusted my husband to drive us there safely and not get lost.",
        "I went skydiving. I had to trust in the tandem partner I had to not kill me.",
        "The first time I went on a motorcycle, I was scared. But I knew my husband wouldn't do anything to hurt me. I trusted him with my life.",
        "I had a boyfriend who cheated on me. He promised not to do it again, but then he did. ",
        "I felt trusting of my uncle when he volunteered to fix my car.",
        "I put snow tires up for sale on craigslist. It's my first time in many years selling on craigslist after having some bad experiences before so I hope it goes well.",
        "I had never let my son stay the night at anybody's house before. For my anniversary with my husband we really just wanted to have a night to ourselves and thought we should let our son stay with his grandparents. I was nervous but I had faith that they would take care of him well.",
        "I believe that most people are good people, deep down.",
        "I love to rely on my friends for advice",
        "I had the chance to look through my girlfriend's phone while I was in the shower, I decided not to because I felt I could respect her privacy.",
        "I wanted to go out but needed someone to watch my kids. No one had ever babysat before. I let my sister watch them because I knew she would do a good job. ",
        "One time I let this guy crash on my couch. He seemed like a nice guy, but he took advantage of me. I found out he was eating all my food and stealing money from my room.",
        "I remember at scout camp we had to do a trust fall exercise where one person would fall and the rest of the troop would catch them. ",
        "I thought my son was capable of cleaning the kitchen. Apparently I was wrong.",
        "Once when i was young and i didn't know how to swim I jumped in the pool knowing my dad was watching me.",
        "I told a very secret story to my husband and It made me feel good that after 12 years he has never told anyone about it.  It made me feel as though he was true to his word, to me.",
        "I have had a job working out of town the last  3 years. Once before I left  the money with my girlfriend to pay the water bill.",
        "I asked my friend if I could use their car. I was trying to travel out of town for a couple of days and my car was at the dealership getting repaired. I knew my friend for at least 5 years and they were not hesitant to lend me their car. Right away, they gave me the keys to the car.",
        "My nephew's car broke down last month and he needs a car to get to work.  His money is tight because he's getting married in the fall and can't really afford to rent a car for a week and a half, so I loaned him mine.  I know he'll take care of it.",
        "I knew my wife's family would help with the money for our marriage.",
        "I recently quit my job without having another job lined up.  My friends and family encouraged me to quit because of the environment I was in.  I'm going to attempt to do work-at-home gigs while I figure stuff out.  It's scary, but I'm trying to remain optimistic that this was the right thing and everything will work out.",
        "I really believed my boyfriend when he told me that he loved me.",
        "My son went on a field trip at school.  I had no change, so I had to give him a $20.  I was nervous he would spend it all or lose it.",
        " I let a stranger borrow my cellphone to make a phone call, but he ended up dashing off with my phone.",
        "I was scared to skydive, but the instructor reassured me with his 15 years of experience. ",
        "A coworker of mine was asking me questions about an argument that happened between me and another coworker and I told her what was the problem and then we talked a bout it, I thought she was concerned because I seemed upset but the next day she started  telling everyone to make me look like a bad perso.n",
        "I trust my best friend to keep my cash at her house",
        "Giving a friend access to my car thinking he'd take good car of it",
        "Today I needed to take my dog to the vet but I couldn't so I asked my sister to go. I am sure she will be able to handle it.",
        "My son was extremely sick, but I had to be at work so I had to leave him with my mother in law",
        "I trusted my vet when my dog got really sick and things turned out well",
        "At work sometimes I put a lot of faith in my coworkers. I work in small groups on a daily basis and my ability to meet the day's goals depends on being able to trust my coworkers to help me succeed. ",
        "I was at a company picnic with co-workers. I walked away from the picnic to another area of the park with 3 co-workers I felt trusting with and even felt they were friends. The 3 guys ended up attacking me and leaving me for dead. I'm not so trusting now.",
        "I had just gotten out of a bad marriage and started to date again. When you've been cheated and abused its hard to even think about bringing someone else into your life and start dating. But I did and its been the best year of my life!",
        "i trust my wife so much",
        "I always give my paycheck to my wife.  I honestly don't even know how much I make.  I rely on her to do whatever with the money.",
        "i feel very hopeful for the future.",
        "I trust my boyfriend so much when he lives in Holland and I live in the UK",
        "i've never kissed a girl before and my girlfriend and i are going to kiss for the first time tomorrow night, and i know she's going to make me feel safe and special",
        "Once I was working on a big project with a bunch of people and made a mistake. One of the other people working on the project covered for me even though they didn't need to. ",
        "I lost a job I had for many years. I wasn't sure what I would do, but I felt things would work out",
        "My best friend wanted to borrow my cool sports car to impress a girl. I let him use it over the weekend.",
        "I was driving to a new destination and I kind of knew the directions. My mom did not turn the navigation on and she let me drive there.",
        "I was told from a little girl that my greatgrand parents farm would one day come to me. I believed it all my life and never questioned it. Momma sold it out from under me 2 months ago.",
        "I as considering a job change, leaving somewhere I had been for 16 years. I wasn't sure if it was the right thing.",
        "I went skydiving many years ago and jumped out of a plane with someone strapped to my back. They had the parachute. They could have let me loose anytime they felt like it. I had a lot of trust that they were going to get me to the ground. ",
        "I decided to go skydiving one time and I was really nervous about it. I was so freaked out but my instructor was awesome and I finally was able to complete the jump.",
        "We had to move from Hawaii to Mainland because my husband lost a job. We didn't really have a job lined up, but we've decided to move to Nashville. We just had to believe things would turn out ok.",
        "Once I had a box of random things I needed to give away, so I put it in my driveway and made a Craigslist post to come take whatever you want.  Luckily they only took anything extra.",
        "i felt trusting when my dad and my mon care for me",
        "when I was stuck on the side of the road",
        "Whenever I leave my children with my parents, I feel I do not need to worry about them at all. I know these are people who will take care of them like they are their own. ",
        "My partner and I both work 24-hour shifts and tend to alternate shifts (I'll be at home hwen she's at work and she'll be at home when I'm at work). This can lead to some insecurities sometimes because not only are we away from each other alot, but we have a lot of time by ourselves where anyone could come over if they want to. I feel so lucky knowing that my wife has my best interest in mind. ",
        "I let a close friend of mine borrow my car. He's had a couple accidents under his belt but it's been awhile since that's happened. He told me not to worry and it will be fine.",
        "I had a good amount of money saved up and I was  planning on buying a vacation trip in the next month.  A friend of mine asked if he could borrow a large sum of money from me and then pay me back shortly after.  I felt okay with loaning this money to him because I knew he would pay it back immediately",
        "My husband took the baby out by himself to go grocery shopping.",
        "I let someone borrow a $230 tool and had to trust them to bring it back.",
        "I have given someone I did not know who was done on their luck some money for food. ",
        "I left my son with a babysitter for the first time recently.  It's the first time someone who isn't family has watched him.",
        "I let my dog off the leash in the park the other day and he never strayed too far from me the whole time. He came any time I called him and is such a good boy!",
        "I trusted a stranger with my cellphone and he ran off with it! ",
        "When my boyfriend and I had been dating about a year he wanted to move to my town, but his credit was so horrible that he couldn't get an apartment. I decided to help him by cosigning for the apartment.",
        "When I had many problems or I was sad, I knew God was with me and the things were going to improve.",
        "I believed a friend who was always telling me lies.",
        "The first time I traveled out of the country I went with my boyfriend. He had been out of the country before and was comfortable traveling internationally.",
        "I recently lent my car to a friend over the weekend so they wouldn't have to wait while their car was in the shop. ",
        "My wife knows I could seldom lie to her,she can vouch for me",
        "When me and my wife first got together we had a long debate about money. In the end we decided that since i was at work most of the time she would handle all money matters and have most say in things. ",
        "I needed some milk from the store, but I was sick. My neighbor was going to the store, so I asked him to pick me up some and gave him my credit card to use for it.",
        "I trusted my brother would pay back the loan I gave him",
        "Recently, I decided to accept a job position that I did not want in order to please my father. My first day is today.",
        "I asked a woman to keep an eye on my bag whilst I went to the toilet.",
        "I was walking back to my car 1 day and a guy ran over asking if he could hitch a ride about half a mile down the road. he told me that his other half is  pregnant and can not walk any more as she was aching and tired. he offered me some money but i refused and said \"just hop in, and show me where you need to go\" I felt I could be trusted by the stranger I had never met before as he put his partner's life as well as his own into my hands of driving safely to their destination.",
        "I believed that my son would behave responsibly when I left him home alone for the weekend.",
        "I used to be very trusting but my friends and family used it to hurt me all the time. Now I don't trust anyone anymore. I am more careful with people.",
        "I made a new friend recently who is into rock climbing. She asked me to go, and I was so nervous but she coached me through it. I ended up having fun!",
        "I went skydiving a few years ago and it's probably the craziest thing I've ever done. I went tandem with the instructor as it was my first time. I really had to have faith in him that he knew what he was doing and wouldn't make any mistakes. It was a thrill!",
        "I've had a slight financial struggle recently. I don'tdon't see a way to get out of it  I've got to put my trust in God now. ",
        "I sent a parcel to my cousin recently and it never arrived. It cost me $50 ",
        "My wife went out drinking last night but she would never cheat on me. She's always put our relationship first.",
        "There was recently a policy change at work that resulted in me getting extra money for my per diem.  I did nothing to earn or ask for it, God just blessed us.",
        "I hired someone to clean my house the other day and I wasn't going to be home.  But they had good reviews on Facebook.",
        "Theres this particular staff of mine that i can rely on,others have disappointed me",
        "My friend promised to take care of my pets for me.",
        "I had a co-worker that became a good friend. THen she stabbed me in the back and cost me my job.",
        "I tend to allow my better half make all the decisions. He likes too and I don't mind because he is much more experienced than me.",
        "My husband is going to take a job that takes him away from the family for 2 months.  I'm sad but just have to believe it's the right move for us.",
        "I once admitted to a friend my feelings for a girl i was in love with, letting him in on a deepest secret ",
        "A friend of mine looked after my house while I went on vacation.",
        "I thought I could rely on my friend to keep my secrets.  Boy, was I wrong",
        "One time within the past year my nephew and I were playing around in the house, and he was looking around for things to mess with as usual. He found these old porcelain pug dog figurines that I thought about taking away from him. But as I saw him take them I just decided to let him play. It worked out fine, and he didnt break either of them.",
        "When I was at school I had a friend who would tell me about all her troubles and anything that changed in her life, she always told me I could tell her anything.",
        "I found a wallet and returned it.",
        "My family knows almost all of my secrets",
        "Disloyalty in a department must be so difficult.",
        "I need a good babysitter.",
        "Had a flat on the interstate today and a huge man stopped to help",
        "My checking account was closed due to unforeseen circumstances and I needed to move a lot of money fast without anytime to open up an account. My best friend offered to put the money in their extra account and it would be safe until I was ready to move it.",
        "I gave my wife all my social media passwords",
        "Once when I was a child, I went with my big sister through a bad part of town, but she took care of me.",
        "I hired a new money manager.",
        "There are many ways to go life ways do it yourself do not ask help from any and do not believe any one ",
        "My sister came to visit over the weekend , when she got here her car broke down,we called a mechanic and he said it would take three days to fix it. She asked to borrow my car for the day so she and her husband could go site seeing and I usually don't let any one borrow my car , I told her it weas something I don't do for any one but I would let her and I would just have to believe she wouldn't and she would bring it back the same way it was when she took it.",
        "My friend always listened to me and kept my secrets safe.So i always can talk to him about everything",
        "I once trsuted my dog to not run off. he is a good boy.",
        "I know my wife daughter doesn't lie to me. She has always been so honest.",
        "once upon a time my car was break down in middle of the high way at night 2 pm there is no one else to help me. on the time i was workshiped god suddenly one car was came infront of me and help me to lift my car . ",
        "I had to make sure that I had someone to pick up the kids from school. I trusted that my mother would pick them up on time.",
        "I recently moved over 650 miles away from my hometown and all of my family. I moved here for my husbands work. I have faith that the decision we made was a good one and that he has our best interest at heart. I hope I can believe him when he says this will be good for us and our child.",
        "I went to someone's home who was going to buy a guitar from me after confirmation that he would be there. ",
        "On our last vacation we used Google Maps to get home. Except it messed up and added 9 hours to our drive time without us noticing.",
        "I sort of put all my eggs in one basket. I relied on a woman I know to rent her home to my family, but she started to ignore my calls and will not return them.",
        "Not long ago a met a woman and felt totally in sync with her, right off the bat. We started dating and things were going really well. ",
        "I met a stranger who offered me a ride to go to work",
        "I let my friend take my expensive car. I thought she would take care of it. ",
        "When I was little my dad asked me to jump into the deep end of the pool and he would catch me.  I didn't know how to swim yet, but I knew I could count on him, so I just jumped.",
        "I was trusting of my roommate and found out she was going through my stuff. I set a trap to figure it out.",
        "Last time I went to the store to buy breakfast, I trusted the bakery had fresh glazed doughnuts left.",
        "I was worried about getting an extension to submit a project I worked on for 6 years. I had been told extensions were rare and it was not likely I would get one. My boss told me not to worry, to keep working on the project with no funding and no assurance I would be able to finish. I believed him that an extension would happen and kept working instead of looking for a parachute.",
        "My sons biological father recently came back into his life and I have been doing my best to be okay with the fact that he can see him now and have visits with him. I'm learning to put faith in him to do the right thing",
        "Being with a close friend",
        "My mother had my car and I wasn't worried.",
        "My daughter has been asked out on her first date. She and her boyfriend from school have been going out for a while now. He was very respectful by asking me if it would be ok.",
        "my husband works out of state",
        "i trusted my friend with my credit card",
        "Whenever you start a new job you must depend on your trainer to show you the ropes. Moving into the fast paced world of retail after being away for years I really relied on my trainer. ",
        "I did a trust exercise where I fell back and my friends caught me.",
        "I went skydiving for the first time. I had to strap myself to someone I didn't know, and jump out of a perfectly good plane.",
        "I recently took my dog on a walk with out a leash and he did great.",
        "I lend money to a friend. I needed the money back by next month and I got it back.",
        "I ordered a Lyft for my 15 year old son to go from one friend's house to another.It might seem weird for him to ride with a stranger, but I was comfortable with the syste.m.",
        "I trusted my son to drive while I slept.  I always drive and get nervous when riding with someone else driving.  He did really good.  He didn't even wake me up.",
        "My girlfiriend told me she is going to meet up with a boyfriend from when she was a kid.",
        "Once my car stalled at a store when I was alone.  I felt pretty comfortable accepting his help, because he seemed sincere.",
        "My friend had a secret they were nervous about. They told me about it and I haven't told anyone yet.",
        "I have had many family problems over the years and had to cut ties with them over alot of things well last year my mother decided that she wanted to leave my father and move in with me and my family but no matter what I did she still turned on me and my family in the end ",
        " I have a friend who came out to me about their sexuality. I was the first person they had ever told other than the people that they dated.",
        "My husband went away for a bachelor weekend with his friends.",
        "My friend told me a secret about his girlfriend and i didnt tell to anyone . He always tell me his secrets .",
        "I had surgery on my knee. I researched the doctor thoroughly and felt confident he'd go a good job.",
        "I had to buy a new tv recently. I spoke with the saleperson.",
        "I asked my friend to get some stuff for a party, I knew I could count on him.",
        "My fiance is having her bachelorette party. I'm excited for her.",
        "I lent my friend a thousand dollars.  I have complete faith he will pay me back.",
        "When the aliens came and said they wanted to show me their spaceship I went in.  I asked what the tool were for, but they said something unrelated to me.",
        "I loaned a friend $100 believing he would pay me back in a week. I never got it.",
        "I let my son drive the car for the first time.",
        "I trust in my brothers, they very rarely let me down",
        "I trusted my mom to help me when things went wrong with my husband but she let me donw.",
        "I'm leaving some expensive exercise equipment in the possession of my brother. He's a little flimsy as far as honor goes, and he disappears a lot. ",
        " i just got off a call with a kid in a university , he said he would pay me 5 bux i trusted him",
        "I have to go back to work soon after being off on maternity leave. I will be leaving my baby with a neighbor.",
        "My nephew took me riding with him after he got his drivers license. I had to believe that he would keep us safe.",
        "I felt this way when I was lost and needing directions.",
        "My wife and I have been married 10 years.  I have faith in her that she's loyal.",
        "The other day I went to make a purchase for some new flea & tick medication for my dogs.  We I arrived home, I realized that the employee had given me a larger supply of medicine than what I had actually ordered and paid.  By the time I had returned home, the store had closed.  I had to wait until the next morning to correct the matter, but I did go back to make the matter right.  It is important to me to be honest and trustworthy.  Not only this, but my son saw this display; and, thereby, I am teaching him to be both honest and trustworthy too.",
        " I let my brother take care of my dog when I went on vacation.",
        "I got lost in an unfamiliar part of town and I had to rely on someone else to help.",
        "I know my wife with be there for me, good or bad.",
        "allowing my neighbor to babysit my twins",
        "I recently gave my best friend a key to my house. We have known each other our whole life and I am confident he won't betray me. So happy to have such a good friend.",
        "My dog saved my life by scaring away home intruders. i love him so much.",
        "My friend is watching my dog for the weekend.  I have faith he will take good care of it.",
        "I was at a crowded coffee shop last week and decided to to run to the bathroom leaving my macbook behind. I never thought about someone stealing it.",
        "I had my friend watch my house and feed my dog while I was on vacation. He did a great job.",
        "in my partner can always rely on her",
        "I opened up to my girlfriend about my past. It was difficult to do.",
        "I once loaned my car to someone and worried the whole time that they wouldn't bring it back.",
        "I started learning free climbing without ropes from a professional!  I hope he really knows what he is doing!",
        "when i let my neighbor borrow my gate card after we had just moved in. ",
        "My brother has offered to drive me somewhere tomorrow for lunch. I just have a feeling its going to be fun",
        "I used to think cops were the good guys.  But these days whenever I hear news about a police officer shooting an innocent civilian my faith in the law diminishes",
        "my girlfriend gave me her facebook password.",
        "My husband is going to be away in a business travel for a few day.  I'm okey with that because I know he won't be unfaithful or do anything he shouln't while away.",
        "I trust my family, they have never let me down",
        "Leaving my wife at home for the war. ",
        "An elderly friend of mine gave me one thousand dollars to keep for him.",
        "I TRUST MY WIFE",
        "When I was a child I fell from the slide, but my father caught me before I hit the ground. I was  very happy.",
        "I just bough a brand new car. I let my brother drive it even though he isn't a good driver.",
        "Sometimes after i eat something spicy, i have too much trust in a fart.",
        "My husband once let this guy come over to our house to use his tools so he could fix his truck",
        "I feel on top of the world when I have my kitty Trinity snuggled in my lap.  I never have to worry about her scratching me!",
        "My girlfriend enjoys going out with her friends for lady night once a month. I dont mind since I know she wont do anything stupid.",
        "There is a crazy crime spree going on near me. I believe our police will get it taken care of though",
        "My mom said she'd go to the doctor the next time she started feeling weird heart palpitations again. I'm about a thousand miles away from her, so I can't force her to go. But I'm worried about her, as she's always avoided the doctor, and always been in poor health. Hope she does the right thing.",
        "I let my guard down around my best friend and she told all my secrets away",
        "A person assured me that nothing would happen.  She calmed my nerves down about to be pushed into my arm",
        "I left most of my belongings at a hostel for 2 months. Everything was still there when I got back.",
        "I let my cousin look after my dog whilst I went on vacation. ",
        "I love my wife.  She would never cheat on me.",
        "When I was homeless I had nowhere to go...I literally had to rely on my own instincts and the Universe to guide me to where I needed to be",
        "I got lost in an unfamiliar city and had to rely on someone I didn't know,to give me directions."
    ]
}