{
    "threshold": 0.8,
    "seed": [
        "A co-worker at work needed some money for a drink, but I didnt have any cash, so I let them have my debit card to go buy them something",
        "Yesterday i left my luggage behind for a stranger to look for it.",
        "I feel like my boss is a cool guy. I think he's actually looking out for my best interest.",
        "At work today. I was not feeling that great so my coworker had to pick up the slack.",
        "I didnt feel comfortable going there",
        "I remember dropping my phone on subway and an old man picked it up and gave it back to me.  ",
        "I really feel good when I feel a friend can keep a secret.",
        "Picked up a homeless person today on my to work. I took him 35 miles to the train station.",
        "I trusted my boss to look out for my best interests and she didn't.",
        "I always trust my mom.",
        "Im trusting that me neighbor will pay me back. My neighbor borrowed some money last week",
        "I have faith in the majority of our country that they will start cutting away this massive divide. We need to come together as a nation.",
        "i once gave my credit card to a stranger. He wanted to pay for some medicines",
        "My daughter went out of town.",
        "I let my son borrow the keys to my car. Most people would be worried, but I trust him.",
        "I just hired a new office manager to take some stress off of me. I'm worried but I want to trust her.",
        "Just gave my wife access to my credit card. I'm worried but excited I can trust her. Do you ever have issues trusting people.",
        "Once I was stranded hours from home in a snowstorm. I was with a stranger who suggested I come to her house and warm up until the storm passed. I trusted her and went with her.",
        "We were going to a pumpkin patch and I allowed my sister in law to drive my car.",
        "I believed my father wouldn't let me down.",
        "Last year I had a meeting where I had to heavily rely on a co-worker. ",
        "I gave my brother my car this weekend hoping he would take care of it. He has been doing good so far so I felt I could do this for him. ",
        "I just hired a new hotel inspector, he has very little experience but wants to learn. Scares me. ",
        "i trusted my friends to pay me back the cash that they owed me",
        "I bought my daughter her first cell phone. I think it takes a lot of responsibility",
        "My mom is staying with me and I need someone to stay with her a few hours. She chooses someone I do not know. I hope it all turns out ok.",
        "I was walking around SF zoo the other day and realized that animals are such genuine creature and I like them like humans,",
        "I told my best friends about an incident in where I self-harmed recently. I was scared to share, but I'm glad I did; they were understanding and supportive.",
        "trusting my guts",
        "Today at work I let a coworker draw my blood, knowing she is a novice in the field. I felt I could let her do it since she has been doing good with patients. ",
        "My nephew is learning how to drive and asked to use my car to take the driving test this weekend. ",
        "My mom said she was going to make me a mystery dinner. I believe in her!",
        "I bought my daughter a cell phone for her birthday",
        "I told my girlfriend about my self harm habits. I normally would not have told anyone but I had faith in her.",
        "I just had a window replaced.  My wife had to meet him since I was busy, so I trusted he would do a good job in my absence.",
        "I remember the first time I let my brother drive my car. I usually don't like people driving my car, but he's such a good driver so I knew I had nothing to worry about. ",
        "The last time I went on vacation I had to find a good cat sitter who could be relied on to remember to come by each day to feed the cats.",
        "I told a close friend of mine a very big secret. I don't think that they will tell anyone.  I'm hoping.",
        "I had to kick my 18 year old son out of house.    He has been gone almost a month now.",
        "i trust myself",
        "I was so afraid when I was pregnant with my first child.  I was nervous and worried about labour.  However i put all my faith in the lovely midwives and everything worked out fine.  I have such admiration for people in that industry as it really is a vocation not just a job.  ",
        "So I let my friend use my brand new car to go out of town this weekend. ",
        "i know my wife",
        "I have a fear of carnival rides, only because i'm scared one will break apart mid ride. Every time i go with my friends to to local carnival i always trust that the mechanics who assembled the ride did a good job. ",
        "I very much could count on my mom to always be there for me.",
        "I was vacationing in Mexico and after arriving to the bus station I needed to take a taxi. The taxi man looked kind of scary but I apprehensively trusted him. ",
        "Sometimes a fly gets in my apartment and I hold my cat over my head and we run after it. Somehow she hasn't scratched or bitten me during this! I put her right over my face, too.",
        "One time my friend said that I could tell him anything and she would snitch",
        "I can definiely count on my best friend for anything",
        "I was happy cause someone asked me for advice on his first move.",
        "I can tell my best friend anything!",
        "I let people so much in my life and they ended up betraying my confidence i had in them.",
        "I was feeling down about something I was scared to share with anybody, until someone very kind promised to listen and not tell anybody.",
        "I met a cow the other day and I went to go pet her. Something inside me told me to get away. Later that day the owner told me to stay away from her because she is known to attack people.",
        "I trust my own intuitions when it comes to my health.",
        "I had to take my brother's advice",
        "My child just recently started school. I've been home with him since he was born.  It was hard for me to be okay with someone else taking care of him and doing what was best for him. I am there now and I feel 100% comfortable with him going.",
        "I felt very happy when a lady offered to pay for my gas when i couldnt find my wallet",
        "I had to take my dog to the vet yesterday and I had full confidence they would take care of his problems. They are so good there.",
        "I used to have my dog in his crate when I left for work.  Lately I have been letting him more and more into the house when I've been gone.",
        "A few weeks ago, my infant son was very sick and he had to go to the hospital. I was nervous about what the doctor would have to say but I had my faith that he would help my son get better. I knew that he would do what he thought was right -- and my son did get better!",
        "After training my dog I feel confident now that he can be around others dogs with out fighting.",
        "i believed my friend would return my cell phone to me in time",
        "A friend of mine borrowed some video games.  I'm confident he'll return them intact",
        "Last week a friend of mine told me he would help me work on my car. I had not heard from him all week, but he ended up showing up just as promised.",
        "I left my young daughter with my friend.  I totally trust her though, she will be a great mom someday!",
        "in the universe",
        "I have faith that I will get pregnant soon. Why is it so hard? Isn't that what a women's body is built to do?",
        "I participated in a ropes course with my colleagues. It required a high level of faith in others, especially when we did the blind trust fall.",
        " I let my little sister go into my wallet and grab my credit card so she can order something online for herself. She told me what it was in advance, I approved it, and I knew she wouldn't steal from me. She's so trustworthy.",
        "I let my friend dogsit for me over the last weekend and he did well."
    ]
}